[
    {
        "recipe_id": "WLPzKt9NnLp/xQI6rWWZ83ovDkb09l6",
        "recipe_title": "Fettuccine Alfredo",
        "original_instructions": "Watch how to make this recipe.\nCook the pasta in a large pot of boiling salted water until tender but still firm to the bite, stirring occasionally, about 4 minutes. Drain. Stir 2 cups of the cream and the lemon juice in a heavy large skillet to blend. Add the butter and cook over medium heat just until the butter melts, stirring occasionally, about 3 minutes. Remove from the heat. Add the pasta and toss. Add the remaining 1/2 cup of cream, and Parmesan to the cream sauce in the skillet. Add the lemon zest, nutmeg, salt, and white pepper. Toss the pasta mixture over low heat until the sauce thickens slightly, about 1 minute.;",
        "ingredients": [
            "18 ounces fresh fettuccine",
            "2 1/2 cups heavy cream",
            "1/2 cup fresh lemon juice",
            "12 tablespoons unsalted butter",
            "2 cups grated Parmesan",
            "2 teaspoons grated lemon zest",
            "Pinch freshly grated nutmeg",
            "Salt and freshly ground white pepper"
        ],
        "step_by_step_instructions": [
            "Cook approximately 3 ounces of pasta in a large pot of boiling salted water until tender but still firm to the bite, stirring occasionally, about 4 minutes. Drain.",
            "Stir approximately 1/3 cup of the cream and a bit more than 1 tablespoon of lemon juice in a heavy large skillet to blend.",
            "Add 2 tablespoons of butter and cook over medium heat just until the butter melts, stirring occasionally, about 3 minutes.",
            "Remove from the heat. Add the pasta and toss.",
            "Add approximately 1 tablespoon of cream, and 1/3 cup of Parmesan to the cream sauce in the skillet.",
            "Add a pinch of lemon zest, a small pinch of nutmeg, salt, and white pepper.",
            "Toss the pasta mixture over low heat until the sauce thickens slightly, about 1 minute."
        ],
        "processed_ingredients": [
            "3.00 ounce fresh fettuccine",
            "0.33 cup heavy cream",
            "1.33 tablespoon fresh lemon juice",
            "2.00 tablespoon unsalted butter",
            "0.33 cup grated Parmesan",
            "0.33 teaspoon grated lemon zest",
            "0.01 teaspoon freshly grated nutmeg",
            "0.01 teaspoon salt",
            "0.01 teaspoon freshly ground white pepper"
        ],
        "pure_ingredients": [
            "fettuccine",
            "cream",
            "lemon",
            "butter",
            "Parmesan",
            "nutmeg",
            "salt",
            "pepper"
        ],
        "cooking_time": "8 minutes",
        "required_tools": [
            "large pot",
            "skillet",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "FwWHIjA9iMRL/Zh.ba6SH.SoJ4hn3LC",
        "recipe_title": "Chopped Grilled Summer Salad",
        "original_instructions": "Heat a grill or grill pan on medium-high heat.\nAdd the tomatoes, zucchini, red and yellow bell peppers and onions to a large rimmed baking sheet and drizzle liberally with the olive oil. Sprinkle evenly with salt and pepper, tossing to coat all the veggies in the oil. Place in a grill basket and grill until tender and lightly charred, about 5 minutes per side. If using an indoor grill pan, you will need to grill in two batches to avoid overcrowding the pan and steaming the veggies.\nRemove the charred vegetables to a cutting board and rest until cool enough to handle. Chop into bite-size pieces. Add the chopped vegetables, arugula and basil to a large bowl. Drizzle with the balsamic and a small drizzle of olive oil, season with some salt and pepper and toss it all together.",
        "ingredients": [
            "One 10.5-ounce container grape tomatoes",
            "2 small zucchini, sliced longwise into 1/2-inch pieces",
            "1 red bell pepper, ribs removed, sliced into quarters",
            "1 yellow bell pepper, ribs removed, sliced into quarters",
            "1/2 medium red onion, sliced",
            "1/4 cup olive oil, plus more for drizzling",
            "Kosher salt and freshly ground black pepper",
            "3 handfuls arugula",
            "1/4 cup roughly chopped fresh basil leaves",
            "1 tablespoon balsamic vinegar"
        ],
        "step_by_step_instructions": [
            "Heat a grill or grill pan on medium-high heat.",
            "Add about 2.63 ounces of grape tomatoes, 1.33 ounces of sliced zucchini, 0.5 ounces of red bell pepper, 0.5 ounces of yellow bell pepper, and 0.25 ounces of sliced red onion to a large rimmed baking sheet.",
            "Drizzle the vegetables liberally with approximately 0.63 tablespoons of olive oil.",
            "Sprinkle evenly with salt and pepper to taste, and toss to coat all the veggies in the oil.",
            "Place the vegetables in a grill basket and grill until tender and lightly charred, about 5 minutes per side.",
            "Remove the charred vegetables to a cutting board and let them rest until cool enough to handle.",
            "Chop the vegetables into bite-size pieces.",
            "Add the chopped vegetables, about 0.75 handfuls of arugula, and 0.06 ounces of chopped fresh basil leaves to a large bowl.",
            "Drizzle with approximately 0.25 tablespoons of balsamic vinegar and a small drizzle of olive oil.",
            "Season with some salt and pepper to taste and toss it all together."
        ],
        "processed_ingredients": [
            "2.63 oz grape tomatoes",
            "1.33 oz zucchini",
            "0.50 oz red bell pepper",
            "0.50 oz yellow bell pepper",
            "0.25 oz red onion",
            "0.63 tbsp olive oil",
            "0.75 handfuls arugula",
            "0.06 oz fresh basil leaves",
            "0.25 tbsp balsamic vinegar",
            "0.13 tbsp olive oil",
            "0.03 tsp kosher salt",
            "0.03 tsp black pepper"
        ],
        "pure_ingredients": [
            "grape tomatoes",
            "zucchini",
            "red bell pepper",
            "yellow bell pepper",
            "red onion",
            "olive oil",
            "salt",
            "pepper",
            "arugula",
            "basil",
            "balsamic vinegar"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "grill",
            "grill pan",
            "baking sheet",
            "grill basket",
            "cutting board",
            "knife",
            "large bowl"
        ]
    },
    {
        "recipe_id": "QlL3rpIW97PNC1WbSPHAho1KDflbV0O",
        "recipe_title": "Rice Pilaf",
        "original_instructions": "In a medium saucepan melt butter over moderate heat. Add thin spaghetti bits and rice and brown for 3 to 5 minutes. Add broth or water, salt and pepper, and bring liquid to a full boil. Cover pot and reduce heat to simmer and cook rice 18 minutes. Fluff with a fork and serve.",
        "ingredients": [
            "2 tablespoons butter",
            "1/3 cup thin spaghetti, broken into 1 inch pieces, about 1/6 of a 1 pound box of dried pasta",
            "3/4 cup white enriched rice",
            "1 1/2 cups chicken broth or water",
            "Salt"
        ],
        "step_by_step_instructions": [
            "Melt 0.67 tablespoons of butter in a medium saucepan over moderate heat.",
            "Add 0.11 cups of thin spaghetti, broken into 1 inch pieces, and 0.25 cups of white enriched rice.",
            "Brown the spaghetti bits and rice for 3 to 5 minutes.",
            "Add 0.5 cups of chicken broth or water, along with a pinch of salt and pepper.",
            "Bring the liquid to a full boil.",
            "Cover the pot and reduce heat to simmer, cooking the rice for 18 minutes.",
            "Fluff the rice with a fork and serve."
        ],
        "processed_ingredients": [
            "0.67 tablespoon butter",
            "0.11 cup thin spaghetti",
            "0.25 cup white enriched rice",
            "0.5 cup chicken broth",
            "0.01 teaspoon salt"
        ],
        "pure_ingredients": [
            "butter",
            "spaghetti",
            "rice",
            "chicken broth",
            "salt",
            "pepper"
        ],
        "cooking_time": "26 minutes",
        "required_tools": [
            "medium saucepan",
            "fork"
        ]
    },
    {
        "recipe_id": "XVn9lKfKW4TIL1tvLw5dTypiSbeHe.O",
        "recipe_title": "Curried Butternut Squash Soup",
        "original_instructions": "Watch how to make this recipe.\nHeat oil over medium heat in a 6-quart stockpot. Add onions and garlic and saute until soft but not brown, about 6 to 7 minutes. Add the butternut squash, broth, curry powder and salt and bring to a boil. Reduce heat and simmer until squash is tender, about 12 to 15 minutes. Remove from heat stir in honey and puree with an immersion blender or in batches in a blender until smooth. Season with salt, to taste.\nLadle into serving bowls and add a dollop of yogurt.",
        "ingredients": [
            "1 tablespoon canola oil",
            "1 medium onion, chopped (about 2 cups)",
            "2 cloves garlic, minced",
            "1 (2 1/2-pound) butternut squash, peeled, seeded and cut into 1-inch cubes",
            "6 cups low-sodium chicken broth or vegetable broth",
            "1 tablespoon plus 2 teaspoons curry powder",
            "1/2 teaspoon salt, plus more, to taste",
            "2 tablespoons honey",
            "4 teaspoons plain low-fat yogurt, for garnish"
        ],
        "step_by_step_instructions": [
            "Heat 0.17 tablespoon of canola oil over medium heat in a 6-quart stockpot.",
            "Add 0.33 cup of chopped onions and 0.33 cloves of minced garlic and saute until soft but not brown, about 6 to 7 minutes.",
            "Add 0.42 pound of butternut squash cut into 1-inch cubes, 1 cup of low-sodium chicken broth, 0.5 teaspoon of curry powder, and a pinch of salt.",
            "Bring to a boil, then reduce heat and simmer until squash is tender, about 12 to 15 minutes.",
            "Remove from heat, stir in 0.33 tablespoon of honey.",
            "Puree with an immersion blender or in batches in a blender until smooth.",
            "Season with salt, to taste.",
            "Ladle into serving bowls and add 0.5 teaspoon of plain low-fat yogurt for garnish."
        ],
        "processed_ingredients": [
            "0.17 tablespoon canola oil",
            "0.33 cup onion",
            "0.33 clove garlic",
            "0.42 pound butternut squash",
            "1 cup low-sodium chicken broth",
            "0.5 teaspoon curry powder",
            "0.5 teaspoon salt",
            "0.33 tablespoon honey",
            "0.5 teaspoon plain low-fat yogurt"
        ],
        "pure_ingredients": [
            "canola oil",
            "onion",
            "garlic",
            "butternut squash",
            "chicken broth",
            "curry powder",
            "salt",
            "honey",
            "yogurt"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "6-quart stockpot",
            "immersion blender",
            "blender"
        ]
    },
    {
        "recipe_id": ".i9U91t9KLCG8O4CJyykj/CqS1wHk9W",
        "recipe_title": "Grilled Tofu with Mushroom Sauce",
        "original_instructions": "To a small non reactive bowl or dish combine marinade ingredients. Marinate tofu overnight.\nPlace tofu slices on hot grill and cook 4 to 5 minutes on each side. Place grilled slices in a warm place while making the sauce.\nIn a separate saucepan whisk together olive oil, milk, flour and vegetable broth. Add shiitake mushrooms and cook over medium heat, stirring occasionally, for 7 to 10 minutes or until the mushrooms are tender. Pour the mixture over grilled tofu. Serve immediately.",
        "ingredients": [
            "1 pound firm tofu, sliced into 1-inch thick pieces",
            "1/4 cup soy sauce",
            "1/2 cup orange juice",
            "Dash of pepper",
            "Dash of salt",
            "1/2 teaspoon olive oil",
            "3/4 cup skim milk",
            "1 tablespoon all purpose flour",
            "1/4 cup vegetable broth",
            "1 cup sliced shiitake mushrooms",
            "1 tablespoon Dijon mustard",
            "3 green onions, chopped fine"
        ],
        "step_by_step_instructions": [
            "Combine 0.5 tbsp soy sauce, 1 tbsp orange juice, a dash of pepper, and a dash of salt in a small non-reactive bowl to make the marinade.",
            "Slice 0.25 lb firm tofu into 1-inch thick pieces and marinate overnight in the prepared marinade.",
            "Preheat the grill.",
            "Place the marinated tofu slices on the hot grill and cook for 4 to 5 minutes on each side.",
            "Keep the grilled tofu slices warm.",
            "In a separate saucepan, whisk together 0.08 tsp olive oil, 0.13 cup skim milk, 0.17 tsp all purpose flour, and 0.05 cup vegetable broth.",
            "Add 0.25 cup sliced shiitake mushrooms to the saucepan.",
            "Cook over medium heat, stirring occasionally, for 7 to 10 minutes or until the mushrooms are tender.",
            "Pour the mushroom sauce over the grilled tofu.",
            "Serve immediately, garnished with 1 chopped green onion."
        ],
        "processed_ingredients": [
            "0.25 lb firm tofu",
            "0.5 tbsp soy sauce",
            "1 tbsp orange juice",
            "0.08 tsp olive oil",
            "0.13 cup skim milk",
            "0.17 tsp all purpose flour",
            "0.05 cup vegetable broth",
            "0.25 cup sliced shiitake mushrooms",
            "0.25 tbsp Dijon mustard",
            "1 green onion",
            "1 dash pepper",
            "1 dash salt"
        ],
        "pure_ingredients": [
            "tofu",
            "soy sauce",
            "orange juice",
            "pepper",
            "salt",
            "olive oil",
            "milk",
            "flour",
            "vegetable broth",
            "shiitake mushrooms",
            "mustard",
            "green onions"
        ],
        "cooking_time": "13 hours",
        "required_tools": [
            "small non-reactive bowl",
            "grill",
            "saucepan",
            "whisk"
        ]
    },
    {
        "recipe_id": "t9WtN1tw8E2NKhc6lh80VT0qo89XMpK",
        "recipe_title": "Microwave Brownies",
        "original_instructions": "Put the butter and chocolate into a microwave safe bowl and heat on high for 1 to 2 minutes, stirring every 30 seconds to melt the chocolate. Set aside.\nIn another bowl, whisk together the eggs and sugar.\nIn a large bowl sift the flour with the baking powder and salt. Add the egg and chocolate mixtures along with the vanilla and stir well to combine.\nSpray an 8 by 8 by-2-inch microwave safe glass pan with cooking spray. Pour the batter into the pan, spread it out evenly, and scatter the chocolate chunks on top. Cook on high for 5 minutes. Remove from the oven and let rest for 3 minutes before cutting and eating.",
        "ingredients": [
            "1/2 cup (1 stick) unsalted butter",
            "3 ounces unsweetened chocolate",
            "2 large eggs",
            "1 cup sugar",
            "1/2 cup all-purpose flour",
            "1/2 teaspoon baking powder",
            "1/2 teaspoon salt",
            "1 teaspoon vanilla extract",
            "1/2 cup chocolate chunks or chips",
            "Nonstick cooking spray"
        ],
        "step_by_step_instructions": [
            "Put about 2 tablespoons of unsalted butter and 0.75 ounces of unsweetened chocolate into a microwave safe bowl.",
            "Heat on high for 1 to 2 minutes, stirring every 30 seconds to melt the chocolate. Set aside.",
            "In another bowl, whisk together about 0.5 large eggs and 0.25 cup of sugar.",
            "In a large bowl, sift about 0.12 cup of all-purpose flour with 0.12 teaspoon of baking powder and 0.12 teaspoon of salt.",
            "Add the egg and chocolate mixtures along with about 0.25 teaspoon of vanilla extract to the large bowl and stir well to combine.",
            "Spray a small microwave safe glass pan with cooking spray.",
            "Pour the batter into the pan, spread it out evenly, and scatter about 0.12 cup of chocolate chunks on top.",
            "Cook on high for 5 minutes.",
            "Remove from the microwave and let rest for 3 minutes before cutting and eating."
        ],
        "processed_ingredients": [
            "2.00 tbsp unsalted butter",
            "0.75 oz unsweetened chocolate",
            "0.50 egg",
            "0.25 cup sugar",
            "0.12 cup all-purpose flour",
            "0.12 tsp baking powder",
            "0.12 tsp salt",
            "0.25 tsp vanilla extract",
            "0.12 cup chocolate chunks",
            "1.00 spray cooking spray"
        ],
        "pure_ingredients": [
            "butter",
            "chocolate",
            "eggs",
            "sugar",
            "flour",
            "baking powder",
            "salt",
            "vanilla extract",
            "chocolate chunks",
            "cooking spray"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "microwave safe bowl",
            "whisk",
            "sifter",
            "large bowl",
            "microwave safe glass pan",
            "microwave"
        ]
    },
    {
        "recipe_id": "vRJ8ULXOcOGbIhraYYiiFLve19cgcBq",
        "recipe_title": "Tony's Chicken Tenders with Honey Mustard Sauce",
        "original_instructions": "Watch how to make this recipe.\nPreheat oil to 350 degrees F.\nCut the chicken breasts into long strips and set aside.\nBeat the 3 eggs in a separate bowl and measure the flour into another separate dish.\nMeasure the panko into a pie plate or shallow bowl and season with garlic powder, lemon-pepper, cayenne, salt and pepper.\nDip the chicken strips into the flour, the beaten egg and then dredge them into the seasoned panko.\nFry in the hot peanut oil for 6 to 8 minutes, until golden brown, and remove to a paper towel lined sheet tray. Serve with Honey Mustard sauce.\nMix all the ingredients in a small bowl and season with salt and pepper. The sauce can be held in the refrigerator for 1 week.",
        "ingredients": [
            "Peanut oil, for frying",
            "2 pounds boneless, skinless chicken breasts",
            "3 eggs",
            "1 cup all-purpose flour",
            "2 cups panko bread crumbs",
            "1 teaspoon garlic powder",
            "1 teaspoon lemon-pepper",
            "1/2 teaspoon cayenne",
            "1/2 teaspoon salt",
            "1/2 teaspoon pepper",
            "Honey Mustard, recipe follows",
            "1/2 cup Dijon mustard",
            "1/2 cup honey",
            "2 tablespoons mayonnaise",
            "1 tablespoons lemon juice",
            "Salt and pepper"
        ],
        "step_by_step_instructions": [
            "Preheat oil to 350 degrees F.",
            "Cut approximately 0.33 pounds of chicken breasts into long strips and set aside.",
            "Beat 1 egg in a separate bowl.",
            "Measure about 0.33 cup of all-purpose flour into another separate dish.",
            "Measure about 0.67 cup of panko bread crumbs into a pie plate or shallow bowl and season with approximately 0.17 teaspoon garlic powder, 0.17 teaspoon lemon-pepper, 0.08 teaspoon cayenne, 0.08 teaspoon salt, and 0.08 teaspoon pepper.",
            "Dip the chicken strips into the flour, then the beaten egg, and dredge them into the seasoned panko.",
            "Fry the chicken strips in the hot peanut oil for 6 to 8 minutes, until golden brown, and remove to a paper towel lined sheet tray.",
            "Mix 0.08 cup Dijon mustard, 0.08 cup honey, 0.33 tablespoon mayonnaise, and 0.17 tablespoon lemon juice in a small bowl and season with salt and pepper.",
            "Serve the chicken tenders with the Honey Mustard sauce."
        ],
        "processed_ingredients": [
            "1 cup peanut oil",
            "0.33 lb chicken breasts",
            "1 egg",
            "0.33 cup all-purpose flour",
            "0.67 cup panko bread crumbs",
            "0.17 teaspoon garlic powder",
            "0.17 teaspoon lemon-pepper",
            "0.08 teaspoon cayenne",
            "0.08 teaspoon salt",
            "0.08 teaspoon pepper",
            "0.08 cup Dijon mustard",
            "0.08 cup honey",
            "0.33 tablespoon mayonnaise",
            "0.17 tablespoon lemon juice"
        ],
        "pure_ingredients": [
            "peanut oil",
            "chicken",
            "egg",
            "flour",
            "bread crumbs",
            "garlic",
            "lemon",
            "cayenne",
            "salt",
            "pepper",
            "mustard",
            "honey",
            "mayonnaise"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "fry pan",
            "bowl",
            "pie plate",
            "paper towel",
            "sheet tray"
        ]
    },
    {
        "recipe_id": "o0tzOsJlUZN3fCmuyTkj1/YCaXcpw1a",
        "recipe_title": "Cheese Bread Pudding",
        "original_instructions": "Preheat the oven to 350 degrees.\nSoak the bread in the milk for 15 minutes. Line the bottom of a 2 to 2 1/2 quart shallow casserole with a layer of bread soaked bread. Top with a layer of tomato sauce and mozzarella and some strips of ham. Continue layering, finishing last layer with bread topped with tomato sauce.\nBeat the eggs with Parmesan and pour the mixture over the bread. With a fork, pierce through layers until egg mixture is absorbed by bread. Dot the top with butter and bake for 45 minutes or until top if browned and puffed.\nWhile this is baking make a nice vegetable salad to accompany this dish.",
        "ingredients": [
            "8inch long French or Italian bread cut into 1/2-inch thick slices",
            "1 cup milk",
            "2 cups tomato sauce, fresh or jarred",
            "8 ounces to 1 pound grated or sliced Fontina or Mozzarella cheese",
            "4 ounces smoked black forest ham, torn into strips",
            "4 eggs, lightly beaten",
            "1/4 cup freshly grated Parmesan cheese",
            "2 tablespoons butter cut into pieces",
            "Salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees.",
            "Cut approximately 2 inches of French or Italian bread into 1/2-inch thick slices.",
            "Soak the bread slices in 1/4 cup of milk for 15 minutes.",
            "Line the bottom of a small shallow casserole with a layer of soaked bread.",
            "Top with a layer of approximately 1/2 cup tomato sauce.",
            "Add about 2 ounces of sliced Fontina or Mozzarella cheese.",
            "Layer some strips of smoked black forest ham.",
            "Continue layering with remaining ingredients, finishing with a layer of bread topped with tomato sauce.",
            "Beat 1 egg with 1 tablespoon of grated Parmesan cheese.",
            "Pour the egg mixture over the bread layers.",
            "With a fork, pierce through layers until the egg mixture is absorbed by the bread.",
            "Dot the top with about 1/2 tablespoon of butter.",
            "Bake for 45 minutes or until the top is browned and puffed."
        ],
        "processed_ingredients": [
            "2 inch French or Italian bread",
            "0.25 cup milk",
            "0.5 cup tomato sauce",
            "4 ounce Fontina cheese",
            "1 ounce smoked black forest ham",
            "1 egg",
            "1 tablespoon Parmesan cheese",
            "0.5 tablespoon butter",
            "0.5 teaspoon salt",
            "0.5 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "bread",
            "milk",
            "tomato",
            "cheese",
            "ham",
            "egg",
            "butter",
            "salt",
            "black pepper"
        ],
        "cooking_time": "60 minutes",
        "required_tools": [
            "oven",
            "casserole dish",
            "knife",
            "cutting board",
            "fork",
            "bowl",
            "measuring cup",
            "measuring spoon"
        ]
    },
    {
        "recipe_id": "TZKH3MZod1zLD5ex5LTDdItgIDFMiA2",
        "recipe_title": "Collards, Golden Raisin, and Almond Saute",
        "original_instructions": "Heat an 8-quart saucepan over high heat. When very hot, add the oil, onions, and garlic, sauteing quickly for 1 minute. When the onions just start to turn golden, add the collard greens, raisins, and almonds. Season with salt and pepper, and add a little water if necessary, for a little steam. Saute for about 5 to 6 minutes more, and adjust seasoning, to taste.",
        "ingredients": [
            "1/2 cup olive oil",
            "1 Spanish onion, small diced",
            "3 cloves garlic, chopped",
            "2 bunches collard greens, washed, and cut in 1/2-inch strips",
            "1 cup golden raisins",
            "1/2 cup slivered almonds, toasted",
            "Kosher salt",
            "Freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Heat a saucepan over high heat.",
            "Add approximately 1 tablespoon of olive oil, a portion of diced onion, and some chopped garlic to the hot pan.",
            "Saute quickly for about 1 minute until the onions just start to turn golden.",
            "Add a portion of collard greens, golden raisins, and slivered almonds to the pan.",
            "Season with a pinch of salt and pepper.",
            "Add a small amount of water if necessary to create steam.",
            "Saute for an additional 5 to 6 minutes.",
            "Adjust seasoning to taste before serving."
        ],
        "processed_ingredients": [
            "1 tablespoon olive oil",
            "0.25 cup diced Spanish onion",
            "1 clove chopped garlic",
            "2 cup collard greens",
            "0.25 cup golden raisins",
            "0.125 cup slivered almonds",
            "1 teaspoon kosher salt",
            "0.5 teaspoon freshly ground black pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "onion",
            "garlic",
            "collard greens",
            "raisins",
            "almonds",
            "salt",
            "black pepper"
        ],
        "cooking_time": "7 minutes",
        "required_tools": [
            "saucepan",
            "knife",
            "cutting board",
            "measuring cups",
            "measuring spoons"
        ]
    },
    {
        "recipe_id": "liEWB0roK/yWghg5jIv7nnixfGSJHeq",
        "recipe_title": "Radicchio Slaw",
        "original_instructions": "Prepare the dressing by placing the fennel seeds in a small saute pan over low heat. Toast, tossing occasionally, about 2 to 3 minutes, or until lightly browned. Crush the toasted seeds with the edge or a pan, in a mortar and pestle, or seal in a plastic bag and roll with a rolling pin.\nIn a saucepan, place the honey, cider vinegar, salt and pepper, and toasted fennel seeds. Bring to a boil, stirring well. Remove from heat. Whisk in olive oil and season, to taste.\nPlace the romaine, radicchio, cabbage, and watercress in a large serving bowl. Add warm dressing and toss well. Serve immediately.",
        "ingredients": [
            "2 teaspoons fennel seeds",
            "3 tablespoons honey",
            "3 tablespoons cider vinegar",
            "Gray salt and freshly ground black pepper",
            "1/2 cup extra-virgin olive oil",
            "2 to 3 romaine lettuce hearts, torn",
            "2 to 3 medium heads radicchio, torn",
            "1 large head cabbage, shredded",
            "1 bunch watercress, trimmed of large stems"
        ],
        "step_by_step_instructions": [
            "Place 0.33 teaspoon of fennel seeds in a small sauté pan over low heat.",
            "Toast the seeds, tossing occasionally for about 2 to 3 minutes, until lightly browned.",
            "Crush the toasted seeds using the edge of a pan, in a mortar and pestle, or in a sealed plastic bag with a rolling pin.",
            "In a saucepan, combine 0.5 tablespoon honey, 0.5 tablespoon cider vinegar, a pinch of gray salt, a pinch of freshly ground black pepper, and the toasted fennel seeds.",
            "Bring the mixture to a boil, stirring well.",
            "Remove from heat and whisk in 0.08 cup of extra-virgin olive oil.",
            "Adjust seasoning to taste.",
            "In a large serving bowl, place 1 romaine lettuce heart torn into pieces, 0.5 head of radicchio torn into pieces, 0.16 large head of cabbage shredded, and a small handful of watercress with large stems trimmed.",
            "Pour the warm dressing over the salad mixture and toss well.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "0.33 teaspoon fennel seeds",
            "0.5 tablespoon honey",
            "0.5 tablespoon cider vinegar",
            "0.08 cup extra-virgin olive oil",
            "1 romaine lettuce heart",
            "0.5 head radicchio",
            "0.16 large head cabbage",
            "20 g watercress",
            "0.01 teaspoon gray salt",
            "0.01 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "fennel seed",
            "honey",
            "cider vinegar",
            "salt",
            "black pepper",
            "olive oil",
            "romaine lettuce",
            "radicchio",
            "cabbage",
            "watercress"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "saute pan",
            "mortar and pestle",
            "saucepan",
            "whisk",
            "serving bowl",
            "rolling pin"
        ]
    },
    {
        "recipe_id": "srNBY3CkLFfnYBRRR.kUI1dUPOKRUom",
        "recipe_title": "Braised Red Cabbage",
        "original_instructions": "Melt butter in heavy pot over medium heat. Add onion and cook for 3 minutes. Add apple and cook for 2 minutes. Add in cabbage and stir to coat. Season and add vinegar, water and brown sugar. Bring to a simmer and cover. Reduce heat to medium and cook for 15-20 minutes until cabbage is tender. Add more water if necessary. Serve hot.",
        "ingredients": [
            "3 tablespoons butter",
            "Salt and pepper",
            "1 small onion, thinly sliced",
            "1/2 cup cider vinegar",
            "1 granny smith apple, peeled, cored and chopped",
            "1 cup water",
            "1 small head red cabbage, finely shredded",
            "1 tablespoon brown sugar"
        ],
        "step_by_step_instructions": [
            "Melt 0.75 tablespoon butter in a heavy pot over medium heat.",
            "Add 0.25 of a small onion, thinly sliced, and cook for 3 minutes.",
            "Add 0.25 of a granny smith apple, peeled, cored, and chopped, and cook for 2 minutes.",
            "Add in 0.25 of a small head of red cabbage, finely shredded, and stir to coat.",
            "Season with salt and pepper.",
            "Add 0.13 cup cider vinegar, 0.25 cup water, and 0.25 tablespoon brown sugar.",
            "Bring to a simmer and cover.",
            "Reduce heat to medium and cook for 15-20 minutes until cabbage is tender, adding more water if necessary.",
            "Serve hot."
        ],
        "processed_ingredients": [
            "0.75 tablespoon butter",
            "0.25 small onion",
            "0.13 cup cider vinegar",
            "0.25 granny smith apple",
            "0.25 cup water",
            "0.25 small head red cabbage",
            "0.25 tablespoon brown sugar",
            "1.00 teaspoon salt",
            "0.50 teaspoon pepper"
        ],
        "pure_ingredients": [
            "butter",
            "salt",
            "pepper",
            "onion",
            "vinegar",
            "apple",
            "water",
            "cabbage",
            "sugar"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "pot",
            "knife",
            "cutting board",
            "measuring spoons",
            "measuring cups",
            "stove"
        ]
    },
    {
        "recipe_id": "d5Z8bjKR4qYf10rSnuS0pPlQLe2CfC.",
        "recipe_title": "Steak with Chile Key Lime Sauce ",
        "original_instructions": "Preheat broiler. Pat steak dry and season with 1 teaspoon salt and 1/2 teaspoon pepper. Broil on a broiler pan 4 to 6 inches from heat, turning once, about 6 minutes total for medium-rare. Transfer steak to a cutting board and let rest 5 minutes before slicing. While steak rests, stir together remaining ingredients until sugar has dissolved. Serve sliced steak with sauce.\nPreheat broiler.\nPat steak dry and season with 1 teaspoon salt and 1/2 teaspoon pepper. Broil on a broiler pan 4 to 6 inches from heat, turning once, about 6 minutes total for medium-rare. Transfer steak to a cutting board and let rest 5 minutes before slicing.\nWhile steak rests, stir together remaining ingredients until sugar has dissolved. Serve sliced steak with sauce.",
        "ingredients": [
            "1 pound skirt steak, cut into pieces",
            "1/4 cup fresh Key lime juice",
            "3 tablespoons Asian fish sauce",
            "3 tablespoons water",
            "2 tablespoons sugar",
            "1 large shallot, thinly sliced",
            "1 fresh serrano chile, chopped (about 2 teaspoons; including seeds)",
            "Accompaniment: steamed rice"
        ],
        "step_by_step_instructions": [
            "Preheat the broiler.",
            "Pat dry approximately 4 ounces of steak and season with about 0.25 teaspoon of salt and 0.125 teaspoon of pepper.",
            "Broil the steak on a broiler pan 4 to 6 inches from heat, turning once, for about 6 minutes in total for medium-rare.",
            "Transfer the steak to a cutting board and let it rest for 5 minutes before slicing.",
            "While the steak rests, stir together 1 tablespoon of fresh Key lime juice, 0.75 tablespoon of Asian fish sauce, 0.75 tablespoon of water, 0.5 tablespoon of sugar, 0.25 ounce of thinly sliced shallot, and 0.5 teaspoon of chopped serrano chile until the sugar has dissolved.",
            "Slice the steak and serve with the sauce."
        ],
        "processed_ingredients": [
            "4.00 oz skirt steak",
            "1.00 tbsp fresh Key lime juice",
            "0.75 tbsp Asian fish sauce",
            "0.75 tbsp water",
            "0.50 tbsp sugar",
            "0.25 oz shallot",
            "0.50 tsp serrano chile",
            "0.25 tsp salt",
            "0.125 tsp pepper"
        ],
        "pure_ingredients": [
            "skirt steak",
            "Key lime juice",
            "fish sauce",
            "water",
            "sugar",
            "shallot",
            "serrano chile",
            "salt",
            "pepper",
            "rice"
        ],
        "cooking_time": "11 minutes",
        "required_tools": [
            "broiler",
            "broiler pan",
            "cutting board",
            "knife",
            "bowl"
        ]
    },
    {
        "recipe_id": "95tvx/9Au0FHYg1/I1CVYXTtHb2oi8i",
        "recipe_title": "Sesame-Glazed Snap Peas with Pearl Onions",
        "original_instructions": "Heat oil in a large skillet over medium heat. Add snap peas, soy sauce, pearl onions and 1 tablespoon of water and cook 3 to 5 minutes, until vegetables are tender and golden and water evaporates. Stir in sesame seeds and cook 1 minute, until seeds are golden. Remove from heat and stir in salt and black pepper.",
        "ingredients": [
            "2 tablespoon sesame oil",
            "2 cups snap peas (fresh or frozen)",
            "1 tablespoon soy sauce",
            "1 bag frozen pearl onions",
            "1 tablespoon water",
            "2 teaspoons sesame seeds",
            "Salt and pepper"
        ],
        "step_by_step_instructions": [
            "Heat 0.5 tablespoon of sesame oil in a large skillet over medium heat.",
            "Add 0.5 cup of snap peas, 0.25 tablespoon of soy sauce, 0.5 cup of pearl onions, and 0.25 tablespoon of water to the skillet.",
            "Cook for 3 to 5 minutes until the vegetables are tender and golden and the water evaporates.",
            "Stir in 0.5 teaspoon of sesame seeds and cook for 1 minute until the seeds are golden.",
            "Remove from heat and stir in salt and black pepper to taste."
        ],
        "processed_ingredients": [
            "0.5 tablespoon sesame oil",
            "0.5 cup snap peas",
            "0.25 tablespoon soy sauce",
            "0.5 cup pearl onions",
            "0.25 tablespoon water",
            "0.5 teaspoon sesame seeds",
            "0.1 teaspoon salt",
            "0.1 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "sesame oil",
            "snap peas",
            "soy sauce",
            "pearl onions",
            "water",
            "sesame seeds",
            "salt",
            "black pepper"
        ],
        "cooking_time": "6 minutes",
        "required_tools": [
            "large skillet",
            "stove"
        ]
    },
    {
        "recipe_id": "B73Un9Un.dBNG8NlCnCmi.Y.tILhF56",
        "recipe_title": "Broccoli and Cauliflower Salad",
        "original_instructions": "Watch how to make this recipe.\nShock the onions in an ice water bath for 10 minutes to temper the sharp flavor, and pat dry.\nPlace the bacon, broccoli, cauliflower and onions in a large salad bowl. In a small bowl, whisk the sugar, vinegar and Dijon mustard. Slowly drizzle in the oil, whisking to make an emulsion. Mix in the mayonnaise and seafood seasoning. Season with salt and pepper. Pour the dressing over the vegetables and toss.",
        "ingredients": [
            "1/4 red onion, thinly sliced",
            "2 slices bacon, cut in small pieces, cooked to crisp",
            "1/2 bunch broccoli, cut into small florets (about 1 1/2 cups)",
            "1/2 small head cauliflower, cut into small florets (about 1 1/2 cups)",
            "2 tablespoons sugar",
            "1 tablespoon red wine vinegar",
            "1 teaspoon Dijon mustard",
            "2 tablespoons vegetable oil",
            "1/4 cup mayonnaise",
            "1/2 teaspoon seafood seasoning, such as Old Bay",
            "Kosher salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Shock the onion slices in an ice water bath for 10 minutes to temper the sharp flavor, and then pat dry.",
            "Place approximately 0.5 oz of cooked bacon pieces, 0.67 cup of broccoli florets, 0.67 cup of cauliflower florets, and the prepared onions in a large salad bowl.",
            "In a small bowl, whisk together 0.33 tablespoon of sugar, 0.17 tablespoon of red wine vinegar, and 0.17 teaspoon of Dijon mustard.",
            "Slowly drizzle in 0.33 tablespoon of vegetable oil while whisking to create an emulsion.",
            "Mix in 0.08 cup of mayonnaise and 0.08 teaspoon of seafood seasoning.",
            "Season the dressing with salt and pepper to taste.",
            "Pour the dressing over the vegetables in the salad bowl and toss to combine."
        ],
        "processed_ingredients": [
            "0.13 oz red onion",
            "0.5 oz bacon",
            "0.67 cup broccoli",
            "0.67 cup cauliflower",
            "0.33 tbsp sugar",
            "0.17 tbsp red wine vinegar",
            "0.17 tsp Dijon mustard",
            "0.33 tbsp vegetable oil",
            "0.08 cup mayonnaise",
            "0.08 tsp seafood seasoning",
            "0.02 tsp salt",
            "0.02 tsp black pepper"
        ],
        "pure_ingredients": [
            "red onion",
            "bacon",
            "broccoli",
            "cauliflower",
            "sugar",
            "red wine vinegar",
            "Dijon mustard",
            "vegetable oil",
            "mayonnaise",
            "seafood seasoning",
            "salt",
            "black pepper"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "knife",
            "cutting board",
            "bowl",
            "whisk",
            "salad bowl"
        ]
    },
    {
        "recipe_id": "jbKc3fP2Ng5DFt3igAyG7Irdtbh.A6.",
        "recipe_title": "Steamed Egg Custard",
        "original_instructions": "In a bowl, combine shrimp, ham, salt, white pepper and mix well. Combine eggs and butter in another bowl. Combine dressing ingredients in a small bowl.\nPour shrimp mixture and egg mixture into a heatproof glass pie dish and cover with another heatproof glass pie dish. Prepare a wok for steaming (wok should have 2 inches of simmering water in it) and place the pie dish in the wok, cover and steam over a medium heat for 15 minutes.\nSpoon dressing on top and serve.",
        "ingredients": [
            "1/4 pound medium raw shrimp, shelled, deveined and diced",
            "2 tablespoons chopped Virginia ham",
            "1/2 teaspoon salt",
            "1/4 teaspoon white pepper",
            "4 eggs, lightly beaten",
            "1 1/4 cups water",
            "1 tablespoon chopped green onion",
            "2 teaspoons soy sauce",
            "1 teaspoon sesame oil",
            "1/2 teaspoon hot pepper sauce"
        ],
        "step_by_step_instructions": [
            "In a bowl, combine 28.35 g of diced shrimp, 7.09 g of chopped ham, 0.06 tsp salt, and 0.03 tsp white pepper. Mix well.",
            "In another bowl, combine 1 egg and 0.16 cup of water.",
            "Combine 0.25 tbsp chopped green onion, 0.31 tsp soy sauce, 0.16 tsp sesame oil, and 0.08 tsp hot pepper sauce in a small bowl to make the dressing.",
            "Pour the shrimp mixture and egg mixture into a heatproof glass pie dish.",
            "Cover with another heatproof glass pie dish.",
            "Prepare a wok with 2 inches of simmering water for steaming.",
            "Place the pie dish in the wok, cover, and steam over medium heat for 15 minutes.",
            "Spoon the dressing on top and serve."
        ],
        "processed_ingredients": [
            "28.35 g shrimp",
            "7.09 g ham",
            "0.06 tsp salt",
            "0.03 tsp white pepper",
            "1 egg",
            "0.16 cup water",
            "0.25 tbsp green onion",
            "0.31 tsp soy sauce",
            "0.16 tsp sesame oil",
            "0.08 tsp hot pepper sauce"
        ],
        "pure_ingredients": [
            "shrimp",
            "ham",
            "salt",
            "white pepper",
            "egg",
            "water",
            "green onion",
            "soy sauce",
            "sesame oil",
            "hot pepper sauce"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "bowl",
            "heatproof glass pie dish",
            "wok",
            "spoon"
        ]
    },
    {
        "recipe_id": "cqZwb3vgauyOVZ5BT94sF.Mu5VXg1.2",
        "recipe_title": "Italian Cheese and Wine Pairings",
        "original_instructions": "Gorgonzola - pairs well with Prosecco, served as an appetizer.\nGorgonzola - pairs well with Eliodoro Moscato Passito, served at the end of a meal.\nParmigiano-Reggiano - served with Bastianich Vespa, served as an appetizer.\nParmigiano-Reggiano - served with Lambrusco \"Concerto\" Medici, served at the end of a meal.\nRobiola di Mondovi - served with Calluso Passito Feraudi, served at the end of a meal.",
        "ingredients": [
            "The following wines and cheeses"
        ],
        "step_by_step_instructions": [
            "Serve Gorgonzola with a glass of Prosecco as an appetizer.",
            "Serve Gorgonzola with a glass of Eliodoro Moscato Passito at the end of a meal.",
            "Serve Parmigiano-Reggiano with a glass of Bastianich Vespa as an appetizer.",
            "Serve Parmigiano-Reggiano with a glass of Lambrusco \"Concerto\" Medici at the end of a meal.",
            "Serve Robiola di Mondovi with a glass of Calluso Passito Feraudi at the end of a meal."
        ],
        "processed_ingredients": [
            "1.50 oz Gorgonzola",
            "1.50 oz Parmigiano-Reggiano",
            "1.50 oz Robiola di Mondovi",
            "5.00 oz Prosecco",
            "5.00 oz Eliodoro Moscato Passito",
            "5.00 oz Bastianich Vespa",
            "5.00 oz Lambrusco \"Concerto\" Medici",
            "5.00 oz Calluso Passito Feraudi"
        ],
        "pure_ingredients": [
            "Gorgonzola",
            "Parmigiano-Reggiano",
            "Robiola di Mondovi",
            "Prosecco",
            "Eliodoro Moscato Passito",
            "Bastianich Vespa",
            "Lambrusco \"Concerto\" Medici",
            "Calluso Passito Feraudi"
        ],
        "cooking_time": "0 minutes",
        "required_tools": []
    },
    {
        "recipe_id": "sJaxWujHjzOgt9Hb0A0Y07SQuuZA5oG",
        "recipe_title": "Spicy Rice and Kale ",
        "original_instructions": "Bring broth and Creole seasoning to boil in heavy large saucepan. Stir in rice and kale and bring to boil. Reduce heat to low, cover and cook until rice is tender and liquid is absorbed, about 20 minutes.\nBring broth and Creole seasoning to boil in heavy large saucepan. Stir in rice and kale and bring to boil. Reduce heat to low, cover and cook until rice is tender and liquid is absorbed, about 20 minutes.",
        "ingredients": [
            "2 1/4 cups canned low-salt chicken broth or vegetable broth",
            "1 1/2 teaspoons Creole or Cajun seasoning",
            "1 cup converted white rice",
            "4 ounces kale (about 1/2 large bunch), stems and ribs removed, leaves coarsely chopped (2 cups packed)"
        ],
        "step_by_step_instructions": [
            "Bring 0.56 cups of chicken broth to a boil in a heavy large saucepan.",
            "Add 0.38 teaspoons of Creole seasoning to the boiling broth.",
            "Stir in 0.25 cups of converted white rice and 0.5 cups of chopped kale.",
            "Bring the mixture to a boil again.",
            "Reduce the heat to low, cover the saucepan, and cook until the rice is tender and the liquid is absorbed, about 20 minutes."
        ],
        "processed_ingredients": [
            "0.56 cup chicken broth",
            "0.38 teaspoon Creole seasoning",
            "0.25 cup converted white rice",
            "0.5 cup kale"
        ],
        "pure_ingredients": [
            "chicken broth",
            "Creole seasoning",
            "white rice",
            "kale"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "saucepan",
            "lid",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "DIFuqifr5u7J/nmXHPDoG15ede9KTc2",
        "recipe_title": "Vietnamese Hot Dog",
        "original_instructions": "Mix the ground meat, fish sauce, olive oil, cornstarch, sugar, and chili, if using, together. Mix well and freeze for 1 hour to marinate. Then pour into a mixer. Blend well until smooth.\nUsing a tablespoon, scoop out a spoonful of mixture and place on a small piece of plastic wrap. Roll to cover, shaping into a \"hotdog\" and twisting at the ends to close. Place plastic covered hot dog onto a small piece of foil, rolling again to cover the plastic completely. Tie the ends closed with kitchen string or cooking plastic wrap. Repeat until all the ground meat mixture is rolled.\nSteam for 45 minutes",
        "ingredients": [
            "1 to 1 1/2 pounds ground meat (chicken, turkey, pork or beef)",
            "2 tablespoons fish sauce",
            "2 tablespoons olive oil",
            "2 teaspoons cornstarch",
            "1 teaspoon sugar",
            "1 teaspoon spicy chili powder"
        ],
        "step_by_step_instructions": [
            "Mix approximately 0.25 lb of ground meat with 0.5 tablespoon fish sauce, 0.5 tablespoon olive oil, 0.5 teaspoon cornstarch, 0.25 teaspoon sugar, and 0.25 teaspoon spicy chili powder in a bowl.",
            "Mix well and freeze for 1 hour to marinate the mixture.",
            "After 1 hour, pour the mixture into a mixer and blend until smooth.",
            "Using a tablespoon, scoop out a spoonful of the mixture and place it on a small piece of plastic wrap.",
            "Roll the plastic wrap to cover the mixture, shaping it into a 'hotdog,' and twist the ends to close.",
            "Place the plastic-covered 'hotdog' onto a small piece of foil, rolling again to cover the plastic completely.",
            "Tie the ends closed with kitchen string or cooking plastic wrap.",
            "Repeat the process until all the ground meat mixture is rolled.",
            "Steam the wrapped 'hotdog' for 45 minutes."
        ],
        "processed_ingredients": [
            "0.25 lb ground meat",
            "0.5 tablespoon fish sauce",
            "0.5 tablespoon olive oil",
            "0.5 teaspoon cornstarch",
            "0.25 teaspoon sugar",
            "0.25 teaspoon spicy chili powder"
        ],
        "pure_ingredients": [
            "ground meat",
            "fish sauce",
            "olive oil",
            "cornstarch",
            "sugar",
            "chili powder"
        ],
        "cooking_time": "106 minutes",
        "required_tools": [
            "bowl",
            "freezer",
            "mixer",
            "tablespoon",
            "plastic wrap",
            "foil",
            "kitchen string",
            "steamer"
        ]
    },
    {
        "recipe_id": "RNmfU7I5f6TclwgUBIzau80mZoQMbQy",
        "recipe_title": "Chilled Butternut Squash and Coconut Soup",
        "original_instructions": "On a steady work surface, using a mallet or the back of a sturdy knife, bruise the root end of the lemongrass. In a large pot over high heat, add the lemongrass, vegetable stock, and ginger and bring to a boil. Reduce the heat and simmer for 15 to 20 minutes. Strain the stock and return it to the pot. Add the butternut squash to the stock and simmer until the squash is fully cooked and begins to break down, about 1 hour. Remove from the heat and cool. Add the coconut milk, blending the mixture in batches until smooth. Season with lime juice and salt, and chill. To serve, garnish the soup with cilantro, cashews and coconut.",
        "ingredients": [
            "2 stalks lemongrass",
            "3 quarts vegetable or chicken stock",
            "1 (2-inch) piece ginger, roughly chopped",
            "5 cups butternut squash, peeled, seeded and cubed",
            "1 (14.5-ounce) can coconut milk, light or regular",
            "2 limes, juiced",
            "Salt, as needed",
            "1/2 cup cilantro leaves",
            "1/2 cup cashews, toasted and crumbled",
            "1/2 cup unsweetened, shredded coconut"
        ],
        "step_by_step_instructions": [
            "On a steady work surface, use a mallet or the back of a sturdy knife to bruise the root end of approximately 0.33 stalks of lemongrass.",
            "In a large pot over high heat, add 0.75 quarts of vegetable stock, 0.33 stalks of lemongrass, and approximately 0.67 ounces of ginger.",
            "Bring the mixture to a boil.",
            "Reduce the heat and simmer for 15 to 20 minutes.",
            "Strain the stock and return it to the pot.",
            "Add approximately 0.63 cups of butternut squash to the stock.",
            "Simmer until the squash is fully cooked and begins to break down, about 1 hour.",
            "Remove from the heat and cool the mixture.",
            "Add approximately 1.81 ounces of coconut milk.",
            "Blend the mixture in batches until smooth.",
            "Season the soup with juice from 0.25 limes and salt to taste.",
            "Chill the soup before serving.",
            "To serve, garnish the soup with approximately 0.06 cups of cilantro leaves, 0.06 cups of toasted and crumbled cashews, and 0.06 cups of unsweetened, shredded coconut."
        ],
        "processed_ingredients": [
            "0.33 stalks lemongrass",
            "0.75 quarts vegetable stock",
            "0.67 ounces ginger",
            "0.63 cups butternut squash",
            "1.81 ounces coconut milk",
            "0.25 limes",
            "0.06 cups cilantro leaves",
            "0.06 cups cashews",
            "0.06 cups coconut",
            "to taste salt"
        ],
        "pure_ingredients": [
            "lemongrass",
            "vegetable stock",
            "ginger",
            "butternut squash",
            "coconut milk",
            "lime",
            "salt",
            "cilantro",
            "cashews",
            "coconut"
        ],
        "cooking_time": "95 minutes",
        "required_tools": [
            "mallet or sturdy knife",
            "large pot",
            "strainer",
            "blender"
        ]
    },
    {
        "recipe_id": "hBbz7gu5zMQiVXLSVBaNEnNq3RWbmES",
        "recipe_title": "Herb Roasted Red Skinned Potatoes",
        "original_instructions": "Preheat oven to 375 degrees F.\nMelt the butter with the olive oil in a large roasting pan. Toss all of the ingredients in the butter/oil mixture to coat evenly.\nRoast the potatoes for about 45 minutes until golden brown and tender. Serve the potatoes with the roasted garlic and shallots all together in the same serving dish.",
        "ingredients": [
            "2 pounds small red skinned potatoes, washed and halved (or quartered if they're larger)",
            "6 whole garlic cloves, peeled",
            "4 medium shallots, peeled and halved with the root in tact",
            "3 small sprigs rosemary",
            "3 small sprigs thyme",
            "2 tablespoons olive oil",
            "2 tablespoons butter"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 375 degrees F.",
            "Melt 0.25 tablespoons butter with 0.25 tablespoons olive oil in a roasting pan.",
            "Toss 0.5 pounds of halved red skinned potatoes, 1 garlic clove, 1 shallot half, 1 rosemary sprig, and 1 thyme sprig in the butter/oil mixture to coat evenly.",
            "Roast the potatoes in the oven for about 45 minutes until golden brown and tender.",
            "Serve the roasted potatoes with garlic and shallots all together in the same serving dish."
        ],
        "processed_ingredients": [
            "0.50 lb small red skinned potatoes",
            "1 g garlic cloves",
            "1 g shallots",
            "1 sprig rosemary",
            "1 sprig thyme",
            "0.25 tbsp olive oil",
            "0.25 tbsp butter"
        ],
        "pure_ingredients": [
            "potatoes",
            "garlic",
            "shallots",
            "rosemary",
            "thyme",
            "olive oil",
            "butter"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "oven",
            "roasting pan",
            "serving dish"
        ]
    },
    {
        "recipe_id": "hKw77Egb09MKMiDegv4qIOVE0PopxGu",
        "recipe_title": "Stir-Fried Wild Mushrooms with Snap Peas in Oyster Sauce",
        "original_instructions": "With a sharp knife, cut the mushrooms on the diagonal into quarters, depending on the size. Prepare the seasonings and set by the stove.\nHeat a wok or a heavy skillet until very hot, add 1 teaspoon of oil and heat until hot. Add the snap peas, minced garlic, rice wine or sake, and salt, and toss lightly over high heat for about 1 1/2 minutes until the peas are just tender (snow peas will take slightly less time.) Remove from the pan and arrange around the outside of the serving plate.\nReheat the pan and the remaining oil until very hot. Add the Seasonings and stir-fry about 10 seconds until fragrant. Add the mushrooms and toss lightly with a spatula or shovel over high heat for about 1 minute. Add the sauce and toss lightly to thicken, stirring constantly to prevent lumps. Arrange the mushrooms inside the snow peas on the serving platter. Serve immediately.",
        "ingredients": [
            "1 pound snap peas, ends snapped and veiny strings removed, rinsed and drained",
            "1 tablespoon minced garlic",
            "2 tablespoons rice wine or sake",
            "1/2 teaspoon salt, or to taste",
            "1/2 pound shiitake mushrooms, stems trimmed and lightly rinsed",
            "1/2 pound oyster mushrooms, stems trimmed and lightly rinsed (If unavailable, substitute shiitake mushrooms.)",
            "1/2 pound cremini mushrooms, stems trimmed and lightly rinsed",
            "1 tablespoon minced garlic",
            "1 tablespoon minced fresh ginger",
            "3 1/2 tablespoons good quality oyster sauce",
            "1 1/2 tablespoons rice wine or sake",
            "1 1/4 teaspoons sugar",
            "1/2 teaspoon toasted sesame oil",
            "1/2 cup chicken broth or water",
            "1 teaspoon cornstarch",
            "2 1/2 teaspoons canola or corn oil"
        ],
        "step_by_step_instructions": [
            "Cut approximately 0.11 lb of shiitake mushrooms, 0.11 lb of oyster mushrooms, and 0.11 lb of cremini mushrooms on the diagonal into quarters.",
            "Prepare seasonings and set by the stove.",
            "Heat a wok or a heavy skillet until very hot, add 0.33 teaspoon of oil and heat until hot.",
            "Add approximately 0.22 lb of snap peas, 0.33 tablespoon of minced garlic, 0.67 tablespoon of rice wine or sake, and 0.11 teaspoon of salt.",
            "Toss lightly over high heat for about 1.5 minutes until the peas are just tender.",
            "Remove the snap peas from the pan and arrange around the outside of the serving plate.",
            "Reheat the pan and the remaining 0.17 teaspoon of oil until very hot.",
            "Add 0.33 tablespoon of minced garlic, 0.33 tablespoon of minced fresh ginger, and stir-fry about 10 seconds until fragrant.",
            "Add the mushrooms and toss lightly with a spatula over high heat for about 1 minute.",
            "Add 0.58 tablespoon of oyster sauce, 0.25 tablespoon of rice wine or sake, 0.21 teaspoon of sugar, 0.08 teaspoon of toasted sesame oil, and 0.08 cup of chicken broth or water.",
            "Mix 0.17 teaspoon of cornstarch with a little water and add to the pan.",
            "Toss lightly to thicken, stirring constantly to prevent lumps.",
            "Arrange the mushrooms inside the snap peas on the serving platter.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "0.22 lb snap peas",
            "0.33 tablespoon minced garlic",
            "0.67 tablespoon rice wine",
            "0.11 teaspoon salt",
            "0.11 lb shiitake mushrooms",
            "0.11 lb oyster mushrooms",
            "0.11 lb cremini mushrooms",
            "0.33 tablespoon minced fresh ginger",
            "0.58 tablespoon oyster sauce",
            "0.25 tablespoon rice wine",
            "0.21 teaspoon sugar",
            "0.08 teaspoon toasted sesame oil",
            "0.08 cup chicken broth",
            "0.17 teaspoon cornstarch",
            "0.50 teaspoon canola oil"
        ],
        "pure_ingredients": [
            "snap peas",
            "garlic",
            "rice wine",
            "salt",
            "shiitake mushrooms",
            "oyster mushrooms",
            "cremini mushrooms",
            "ginger",
            "oyster sauce",
            "sugar",
            "sesame oil",
            "chicken broth",
            "cornstarch",
            "canola oil"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "knife",
            "wok",
            "spatula",
            "serving plate"
        ]
    },
    {
        "recipe_id": "ZeY2APjN7S090AMzCbc9xuoBDwAX.Fi",
        "recipe_title": "Favorite Stuffing",
        "original_instructions": "Preheat the oven to 350 degrees F. Coat a 9-by-13-inch baking dish with cooking spray. Spread the challah and cornbread on separate baking sheets and bake until lightly toasted and dry; transfer to a large bowl.\nHeat the butter in a large skillet over medium heat. Add the onions, garlic and celery and cook until the onions are translucent, 10 to 12 minutes. Add the sage, parsley and 2 cups chicken broth and bring to a boil. Add salt to taste and 1 teaspoon pepper.\nPour the broth mixture over the bread in the bowl and mix with a wooden spoon until combined. Whisk the remaining 1/4 cup chicken broth with the egg in a small bowl; add to the stuffing mixture and toss to combine. Spoon the stuffing into the prepared baking dish, pressing it down gently so it is evenly distributed. Bake until dry on top and golden brown, about 1 hour.",
        "ingredients": [
            "Cooking spray, for the baking dish",
            "4 cups cubed challah bread",
            "4 cups cubed cornbread",
            "1 stick unsalted butter",
            "2 onions, diced",
            "6 cloves garlic, sliced",
            "4 stalks celery, diced",
            "1/3 cup fresh sage leaves, chopped",
            "1/2 cup fresh parsley leaves, chopped",
            "2 1/4 cups low-sodium chicken broth",
            "Kosher salt and freshly ground pepper",
            "1 large egg"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Coat a small baking dish (about 4.5-by-6.5-inch) with cooking spray.",
            "Spread approximately 0.5 cup cubed challah and 0.5 cup cubed cornbread on separate baking sheets and bake until lightly toasted and dry.",
            "Transfer the toasted bread to a small mixing bowl.",
            "Heat 1 tablespoon butter in a small skillet over medium heat.",
            "Add approximately 0.25 cup diced onion, 1 sliced garlic clove, and 0.5 stalk diced celery to the skillet. Cook until onions are translucent, about 10 to 12 minutes.",
            "Add about 0.5 tablespoon chopped fresh sage and 1 tablespoon chopped fresh parsley to the skillet.",
            "Pour in 0.25 cup chicken broth, bring to a boil, and season with a pinch of salt and 0.13 teaspoon pepper.",
            "Pour the broth mixture over the toasted bread in the bowl and mix with a wooden spoon until combined.",
            "Whisk 1 tablespoon chicken broth with a quarter of a large egg in a small bowl.",
            "Add the egg mixture to the stuffing and toss to combine.",
            "Spoon the stuffing into the prepared baking dish, pressing it down gently to distribute evenly.",
            "Bake until dry on top and golden brown, about 1 hour."
        ],
        "processed_ingredients": [
            "0.5 cup cubed challah bread",
            "0.5 cup cubed cornbread",
            "1 tablespoon unsalted butter",
            "0.25 cup diced onions",
            "1 clove garlic",
            "0.5 stalk celery",
            "0.5 tablespoon fresh sage leaves",
            "1 tablespoon fresh parsley leaves",
            "0.25 cup low-sodium chicken broth",
            "0.13 teaspoon kosher salt",
            "0.13 teaspoon freshly ground pepper",
            "0.25 large egg"
        ],
        "pure_ingredients": [
            "challah",
            "cornbread",
            "butter",
            "onion",
            "garlic",
            "celery",
            "sage",
            "parsley",
            "chicken broth",
            "salt",
            "pepper",
            "egg"
        ],
        "cooking_time": "80 minutes",
        "required_tools": [
            "oven",
            "baking dish",
            "baking sheets",
            "mixing bowl",
            "skillet",
            "spoon",
            "whisk"
        ]
    },
    {
        "recipe_id": "jW5VSbPE2BLvo5q0PfLTpBM9PwQUCgm",
        "recipe_title": "Soft Herbed Polenta",
        "original_instructions": "Combine the milk, water, salt, and cornmeal in a 2 or 3 quart heavy bottomed saucepan. Stir with a whisk to eliminate any lumps. Heat just to a boil (but without scorching). Reduce the heat to very low and simmer the polenta for 25 minutes, stirring occasionally with a wooden spoon. If, near the end of the cooking, the polenta is becoming too thick and heavy to stir, add one or more tablespoons of cold water to loosen the mixture enough to be able to stir it, and to maintain a creamy consistency.\nRemove from the heat. Immediately add the butter, the Parmesan cheese, the herbs and stir quickly to incorporate. The polenta can now be served soft, similar to a porridge, to accompany meat or game.",
        "ingredients": [
            "1 cup cornmeal",
            "1/2 stick (4 tablespoons) unsalted butter",
            "3 tablespoons freshly grated Parmesan cheese",
            "3 tablespoons chopped fresh herbs, such as thyme, parsley and chives",
            "2 cups whole milk",
            "1 cup cold water",
            "1/2 teaspoon salt"
        ],
        "step_by_step_instructions": [
            "Combine 0.25 cup whole milk, 0.125 cup cold water, 0.125 teaspoon salt, and 0.25 cup cornmeal in a 2 or 3 quart heavy bottomed saucepan. Stir with a whisk to eliminate any lumps.",
            "Heat just to a boil (but without scorching).",
            "Reduce the heat to very low and simmer the polenta for 25 minutes, stirring occasionally with a wooden spoon.",
            "If, near the end of the cooking, the polenta is becoming too thick and heavy to stir, add one or more tablespoons of cold water to loosen the mixture enough to be able to stir it, and to maintain a creamy consistency.",
            "Remove from the heat.",
            "Immediately add 1 tablespoon unsalted butter, 0.75 tablespoon freshly grated Parmesan cheese, and 0.75 tablespoon chopped fresh herbs, and stir quickly to incorporate.",
            "Serve the polenta soft, similar to a porridge, to accompany meat or game."
        ],
        "processed_ingredients": [
            "0.25 cup cornmeal",
            "1 tablespoon unsalted butter",
            "0.75 tablespoon Parmesan cheese",
            "0.75 tablespoon fresh herbs",
            "0.25 cup whole milk",
            "0.125 cup cold water",
            "0.125 teaspoon salt"
        ],
        "pure_ingredients": [
            "cornmeal",
            "butter",
            "Parmesan cheese",
            "herbs",
            "milk",
            "water",
            "salt"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "saucepan",
            "whisk",
            "wooden spoon"
        ]
    },
    {
        "recipe_id": "h9Fa2La4Lb4L1NJiNQFURCLcEill/Hi",
        "recipe_title": "Sunny's Easy Rosemary and Thyme Toasted Nuts",
        "original_instructions": "In a large pan on medium heat, add the rosemary and thyme. Toast until fragrant but not browned. Remove to a small bowl and add the paprika.\nIn the same pan, add the pecans, almonds and walnuts separately in batches and toast, constantly tossing, until fragrant and a taste test proves each batch to be tender. This should take anywhere from 5 to 10 minutes and will vary for each type of nut.\nPour the nuts into a large bowl and season with salt and a few grinds of black pepper. Sprinkle with the rosemary mixture, drizzle with the olive oil and toss.",
        "ingredients": [
            "2 tablespoons gently chopped fresh rosemary",
            "9 to 10 sprigs fresh thyme, leaves stripped and chopped",
            "1/4 teaspoon hot Hungarian paprika",
            "2 cups pecan halves",
            "1 cup almonds",
            "1 cup walnut halves",
            "Kosher salt and freshly ground black pepper",
            "1 tablespoon olive oil"
        ],
        "step_by_step_instructions": [
            "In a large pan on medium heat, add approximately 0.33 tablespoons of gently chopped fresh rosemary and 1 to 1.11 sprigs of fresh thyme, leaves stripped and chopped. Toast until fragrant but not browned.",
            "Remove the toasted herbs to a small bowl and add about 0.04 teaspoons of hot Hungarian paprika.",
            "In the same pan, add approximately 0.33 cups of pecan halves, 0.17 cups of almonds, and 0.17 cups of walnut halves separately in batches.",
            "Toast each type of nut, constantly tossing, until fragrant and tender, which should take about 5 to 10 minutes depending on the nut.",
            "Pour the toasted nuts into a large bowl and season with a pinch of salt and a few grinds of black pepper.",
            "Sprinkle with the rosemary mixture, drizzle with about 0.17 tablespoons of olive oil, and toss everything together."
        ],
        "processed_ingredients": [
            "0.33 tablespoon fresh rosemary",
            "1.11 sprigs fresh thyme",
            "0.04 teaspoon hot Hungarian paprika",
            "0.33 cup pecan halves",
            "0.17 cup almonds",
            "0.17 cup walnut halves",
            "0.17 tablespoon olive oil",
            "pinch salt",
            "few grinds black pepper"
        ],
        "pure_ingredients": [
            "rosemary",
            "thyme",
            "paprika",
            "pecan",
            "almond",
            "walnut",
            "salt",
            "pepper",
            "olive oil"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "large pan",
            "small bowl",
            "large bowl"
        ]
    },
    {
        "recipe_id": "ZfDFXu3orHKLWmq7dXI.DfJCov1EMzW",
        "recipe_title": "Summer-ish Succotash Salad",
        "original_instructions": "Combine veggies and dress with vinegar and oil, salt and pepper.",
        "ingredients": [
            "2 cups frozen corn kernels, defrosted",
            "1 can butter beans, drained",
            "1 small red bell pepper, chopped",
            "1/2 small red onion, chopped",
            "1 tablespoon red wine vinegar",
            "2 tablespoons chopped parsley leaves, a handful",
            "2 tablespoons peanut or vegetable oil",
            "Salt and pepper"
        ],
        "step_by_step_instructions": [
            "Mix 0.50 cup of defrosted corn kernels in a bowl.",
            "Add 4.25 ounces of drained butter beans to the bowl.",
            "Chop 0.25 of a small red bell pepper and add to the bowl.",
            "Chop 0.13 of a small red onion and add to the bowl.",
            "Dress the mixture with 0.25 tablespoon of red wine vinegar.",
            "Add 0.50 tablespoon of chopped parsley leaves.",
            "Pour 0.50 tablespoon of peanut oil over the mixture.",
            "Season with salt and pepper to taste.",
            "Toss the salad to combine all ingredients evenly."
        ],
        "processed_ingredients": [
            "0.50 cup corn kernels",
            "4.25 ounce butter beans",
            "0.25 small red bell pepper",
            "0.13 small red onion",
            "0.25 tablespoon red wine vinegar",
            "0.50 tablespoon parsley leaves",
            "0.50 tablespoon peanut oil",
            "0.25 teaspoon salt",
            "0.13 teaspoon pepper"
        ],
        "pure_ingredients": [
            "corn",
            "butter beans",
            "red bell pepper",
            "red onion",
            "red wine vinegar",
            "parsley",
            "peanut oil",
            "salt",
            "pepper"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "bowl",
            "knife",
            "cutting board",
            "measuring spoons",
            "measuring cups",
            "spoon"
        ]
    },
    {
        "recipe_id": "DidHv4Ly.QYDgD8cofsyo9MHjUe8uqu",
        "recipe_title": "Braised Red Cabbage",
        "original_instructions": "Remove the 2 outer leaves of the cabbage. Cut the cabbage in half. Core it and cut into thin julienne. Saute cabbage and onions in butter for 5 minutes, or until the cabbage starts to wilt. Add the apple, vinegar, cane syrup, red wine, spice sachet. Cover and simmer for 1 hour. Adjust seasoning by adding more salt, syrup and wine to taste.;",
        "ingredients": [
            "2 1/2 pounds red cabbage",
            "1/2 cup red wine vinegar",
            "1 onion, medium dice",
            "3 tablespoon butter",
            "3 medium apple, peeled and diced",
            "1/2 cup Lyles Golden cane syrup (3/4 ounce brown sugar can be substituted)",
            "3/4 cup red wine",
            "Spice sachet: 5 cloves, 5 allspice, 1 bayleaf",
            "Salt and freshly ground pepper"
        ],
        "step_by_step_instructions": [
            "Remove the outer leaves of the cabbage and cut it in half.",
            "Core the cabbage and cut it into thin julienne.",
            "Dice the onion and peel and dice the apples.",
            "In a pan, sauté 0.42 lb of cabbage and 0.17 of diced onion in 0.50 tbsp of butter for 5 minutes, or until the cabbage starts to wilt.",
            "Add 0.50 of a diced apple to the pan.",
            "Pour in 1.00 tbsp of red wine vinegar, 0.08 cup of Lyles Golden cane syrup, and 0.13 cup of red wine.",
            "Add 1 clove, 1 allspice, and 1 bay leaf tied in a sachet.",
            "Cover the pan and simmer for 1 hour.",
            "Adjust seasoning by adding more salt, syrup, and wine to taste."
        ],
        "processed_ingredients": [
            "0.42 lb red cabbage",
            "1.00 tbsp red wine vinegar",
            "0.17 onion",
            "0.50 tbsp butter",
            "0.50 apple",
            "0.08 cup Lyles Golden cane syrup",
            "0.13 cup red wine",
            "1.00 clove",
            "1.00 allspice",
            "1.00 bay leaf",
            "0.50 tsp salt",
            "0.13 tsp freshly ground pepper"
        ],
        "pure_ingredients": [
            "red cabbage",
            "red wine vinegar",
            "onion",
            "butter",
            "apple",
            "cane syrup",
            "red wine",
            "clove",
            "allspice",
            "bay leaf",
            "salt",
            "pepper"
        ],
        "cooking_time": "65 minutes",
        "required_tools": [
            "pan",
            "knife",
            "cutting board",
            "sachet",
            "stove"
        ]
    },
    {
        "recipe_id": "hEKrQoGssOhM9nT5GdA.tI9pcYiMxD2",
        "recipe_title": "Tricolor Potato Salad",
        "original_instructions": "Watch how to make this recipe.\nPut the Yukon gold and sweet potatoes in a large pot and cover with water. Add 2 teaspoons of salt and bring to a light boil over medium heat. Cook until the potatoes are tender but still retain and hold their shape, about 12 to 15 minutes. Drain and let cool until just slightly warm.\nPut the purple potatoes in a medium pot and cover with water. Add 1 teaspoon of salt and bring to a light boil over medium heat. Cook until the potatoes are tender but still retain and hold their shape, about 10 to 12 minutes. Drain and let cool until just slightly warm.\nIn a large serving bowl, combine the remaining ingredients and mix until blended. Add the potatoes and gently toss until they are completely coated.",
        "ingredients": [
            "1/2 pound Yukon gold potatoes, washed and cut into 1 by 1-inch pieces",
            "1/2 pound sweet potatoes, washed and cut into 1 by 1-inch pieces",
            "1/2 pound purple potatoes, washed and cut into 1 by 1-inch pieces",
            "3 scallions, sliced",
            "1 tablespoon salt",
            "1/2 cup mayonnaise",
            "1/2 cup sour cream",
            "2 tablespoons brown mustard",
            "1 tablespoon cider vinegar",
            "1/2 teaspoon grill seasoning"
        ],
        "step_by_step_instructions": [
            "Put 57 g of Yukon gold and 57 g of sweet potatoes in a large pot and cover with water.",
            "Add 1.33 teaspoons of salt and bring to a light boil over medium heat.",
            "Cook until the potatoes are tender but still retain and hold their shape, about 12 to 15 minutes.",
            "Drain and let cool until just slightly warm.",
            "Put 57 g of purple potatoes in a medium pot and cover with water.",
            "Add 0.67 teaspoons of salt and bring to a light boil over medium heat.",
            "Cook until the potatoes are tender but still retain and hold their shape, about 10 to 12 minutes.",
            "Drain and let cool until just slightly warm.",
            "In a large serving bowl, combine 1.33 tablespoons of mayonnaise, 1.33 tablespoons of sour cream, 0.67 tablespoons of brown mustard, 0.33 tablespoons of cider vinegar, 0.08 teaspoons of grill seasoning, and 1 sliced scallion. Mix until blended.",
            "Add the potatoes and gently toss until they are completely coated."
        ],
        "processed_ingredients": [
            "57 g Yukon gold potatoes",
            "57 g sweet potatoes",
            "57 g purple potatoes",
            "1 scallion",
            "2 teaspoons salt",
            "1.33 tablespoons mayonnaise",
            "1.33 tablespoons sour cream",
            "0.67 tablespoons brown mustard",
            "0.33 tablespoons cider vinegar",
            "0.08 teaspoons grill seasoning"
        ],
        "pure_ingredients": [
            "potatoes",
            "scallions",
            "salt",
            "mayonnaise",
            "sour cream",
            "mustard",
            "vinegar",
            "seasoning"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "large pot",
            "medium pot",
            "serving bowl"
        ]
    },
    {
        "recipe_id": "4xtYkJoteY1VEnIhRmT8EY2fWF.mtji",
        "recipe_title": "Rachel's Biscuits",
        "original_instructions": "Heat oven to 450 degrees F. Grease baking sheet with vegetable shortening. Set aside.\nPlace 5 cups of flour into a large mixing bowl, and make a well in the center. Pour buttermilk into the well. Using your fingers, cut the shortening into the buttermilk.\nGradually work the flour on the sides of the well into the buttermilk mixture, gently stirring in one direction until a ball of dough forms adding more flour as necessary. Clean dough from fingers.\nKnead dough by gently turning it over in the bowl. With floured hands, pinch off about 1/3 cup dough to make a ball. Pat ball to slightly flatten. Transfer to a baking sheet, and pat top of biscuit lightly with water. Repeat with remaining dough. Bake until well browned, 14 to 16 minutes.",
        "ingredients": [
            "1/2 cup (1/2 stick) solid vegetable shortening, such as Crisco, plus more for greasing",
            "5 to 7 cups self-rising flour",
            "1 cup buttermilk, preferably whole"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450 degrees F.",
            "Grease a baking sheet with a small amount of vegetable shortening.",
            "Place approximately 0.63 cups of self-rising flour into a large mixing bowl, and make a well in the center.",
            "Pour approximately 0.13 cups of buttermilk into the well.",
            "Using your fingers, cut approximately 0.06 cups of the vegetable shortening into the buttermilk.",
            "Gradually work the flour on the sides of the well into the buttermilk mixture, gently stirring in one direction until a ball of dough forms.",
            "Add more flour if necessary.",
            "Clean dough from fingers.",
            "Knead the dough by gently turning it over in the bowl.",
            "With floured hands, pinch off about 0.04 cups of dough to make a ball.",
            "Pat the ball to slightly flatten it.",
            "Transfer to the baking sheet, and pat the top of the biscuit lightly with water.",
            "Repeat the process with the remaining dough.",
            "Bake in the oven until well browned, approximately 14 to 16 minutes."
        ],
        "processed_ingredients": [
            "0.06 cup solid vegetable shortening",
            "0.63 cup self-rising flour",
            "0.13 cup buttermilk"
        ],
        "pure_ingredients": [
            "vegetable shortening",
            "flour",
            "buttermilk"
        ],
        "cooking_time": "16 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "mixing bowl"
        ]
    },
    {
        "recipe_id": "zOEvukMNmzJLQEzayoCsCurHOz59sF2",
        "recipe_title": "Smoked Fish Chowder",
        "original_instructions": "In a heavy kettle ( at least 5 quarts) cook bacon over moderate heat, stirring, until crisp. Add onions and cook, stirring, until softened. Peel potatoes and cut into 3/4-inch cubes. Add potatoes, celery, broth, and water and simmer, covered, 10 minutes. Add lima beans and corn and simmer, covered, 5 minutes.\nIn a small bowl dissolve cornstarch in half -and-half or milk and stir into simmering soup with Worcestershire sauce. Bring soup to a boil, stirring, and add fish. ( If using smoked trout, no further cooking is necessary; if using finnan haddie or fresh fish, simmer, covered, 5 minutes, or until it just flakes.) Stir in parsley or dill. Soup may be made 2 days ahead (cool uncovered before chilling covered). Reheat gently.",
        "ingredients": [
            "3 slices bacon, chopped",
            "2 medium onions, chopped",
            "1 1/2 pounds russet (baking) potatoes",
            "2 celery ribs, chopped",
            "1 1/2 cups chicken broth",
            "1 1/2 cups water",
            "10 ounce package frozen baby lima beans",
            "10 ounce package frozen corn",
            "2 teaspoons cornstarch",
            "1 1/2 cups half-and-half or milk",
            "1 to 2 teaspoons Worcestershire sauce",
            "1 pound finnan haddie (smoked haddock), cut into 1-inch pieces, or 2 smoked trout, skinned, boned, and flaked into 1-inch pieces, or fresh fillets of cod, haddock, halibut or snapper",
            "3 tablespoons minced fresh parsley leaves or fresh dill"
        ],
        "step_by_step_instructions": [
            "In a heavy kettle, cook 1 slice of chopped bacon over moderate heat, stirring, until crisp.",
            "Add approximately 0.5 medium chopped onion and cook, stirring, until softened.",
            "Peel and cut about 0.19 pounds of russet potatoes into 3/4-inch cubes.",
            "Add the potatoes, 0.33 chopped celery rib, 0.25 cups chicken broth, and 0.25 cups water to the kettle and simmer, covered, for 10 minutes.",
            "Add approximately 1.67 ounces of frozen baby lima beans and 1.67 ounces of frozen corn and simmer, covered, for another 5 minutes.",
            "In a small bowl, dissolve 0.33 teaspoons of cornstarch in 0.25 cups of half-and-half or milk.",
            "Stir the cornstarch mixture into the simmering soup along with 0.25 teaspoons of Worcestershire sauce.",
            "Bring the soup to a boil, stirring, and add about 0.33 pounds of finnan haddie or your choice of fish.",
            "If using finnan haddie or fresh fish, simmer, covered, for 5 minutes, or until the fish just flakes. If using smoked trout, no further cooking is necessary.",
            "Stir in approximately 0.5 tablespoons of minced fresh parsley leaves or fresh dill."
        ],
        "processed_ingredients": [
            "1 slice bacon",
            "0.5 medium onion",
            "0.19 lb russet potato",
            "0.33 celery rib",
            "0.25 cup chicken broth",
            "0.25 cup water",
            "1.67 oz frozen baby lima beans",
            "1.67 oz frozen corn",
            "0.33 tsp cornstarch",
            "0.25 cup half-and-half",
            "0.25 tsp Worcestershire sauce",
            "0.33 lb finnan haddie",
            "0.5 tbsp fresh parsley"
        ],
        "pure_ingredients": [
            "bacon",
            "onion",
            "potato",
            "celery",
            "chicken broth",
            "water",
            "lima beans",
            "corn",
            "cornstarch",
            "half-and-half",
            "Worcestershire sauce",
            "finnan haddie",
            "parsley"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "kettle",
            "knife",
            "cutting board",
            "small bowl",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "miEU1V/No55LZFfxhvB/VZE08MXheOq",
        "recipe_title": "Basic Mashed Potatoes",
        "original_instructions": "Preheat the oven to 400 degrees F.\nPrick the potatoes all over with a fork and roast them in the oven until tender, about 1 hour.\nBeing careful of the hot potatoes, split them and scoop out the flesh into a bowl. Add the butter and season with salt and a few twists of black pepper. Mash until the butter is melted and the potatoes are smooth. Keep warm until ready to serve.",
        "ingredients": [
            "4 large russet potatoes",
            "2 tablespoons unsalted butter",
            "Kosher salt",
            "Freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Prick the potato all over with a fork and roast it in the oven until tender, about 1 hour.",
            "Being careful of the hot potato, split it and scoop out the flesh into a bowl.",
            "Add about 0.5 tablespoon of butter and season with a pinch of salt and a few twists of black pepper.",
            "Mash until the butter is melted and the potato is smooth.",
            "Keep warm until ready to serve."
        ],
        "processed_ingredients": [
            "0.25 lb potato",
            "0.50 tbsp unsalted butter",
            "0.25 tsp salt",
            "0.10 tsp black pepper"
        ],
        "pure_ingredients": [
            "potato",
            "butter",
            "salt",
            "pepper"
        ],
        "cooking_time": "1 hour",
        "required_tools": [
            "oven",
            "fork",
            "bowl",
            "masher"
        ]
    },
    {
        "recipe_id": "U9ZWp9gHo5Dr9bP/eZ3oFx6ScloiCTS",
        "recipe_title": "Greens and Andouille",
        "original_instructions": "Watch how to make this recipe.\nHeat a pan with a few inches water over medium heat. Bring to a boil, season with salt, to taste, and add the bitter greens. Cook for a few minutes, then drain and reserve.\nHeat the extra-virgin olive oil in a large skillet over medium to medium-high heat and add the andouille. Brown the crumbles or the chopped cooked sausage, then add the onions and cook until softened, about 5 minutes. Stir in the stock and add the bitter greens. Heat through for a few minutes, then douse with vinegar, and season with sugar, salt, pepper and nutmeg, to taste. Transfer to a serving bowl and serve.",
        "ingredients": [
            "1 pound spicy, bitter greens such as mustard or dandelion greens",
            "Salt",
            "2 tablespoons extra-virgin olive oil",
            "3/4 to 1 pound andouille sausage, chopped or crumbled, parcooked or fresh",
            "1 medium onion",
            "1/2 cup chicken stock",
            "2 tablespoons cider or wine vinegar",
            "Sprinkle sugar",
            "Salt and freshly ground black pepper",
            "Nutmeg, freshly grated"
        ],
        "step_by_step_instructions": [
            "Heat a pan with a few inches of water over medium heat.",
            "Bring the water to a boil, season with a pinch of salt.",
            "Add about 4 ounces of bitter greens to the boiling water.",
            "Cook the greens for a few minutes, then drain and set aside.",
            "In a large skillet, heat 0.5 tablespoon of extra-virgin olive oil over medium to medium-high heat.",
            "Add approximately 4 ounces of andouille sausage, chopped or crumbled.",
            "Brown the sausage, then add 0.25 of a medium onion, chopped.",
            "Cook until the onion is softened, about 5 minutes.",
            "Stir in 2 tablespoons of chicken stock.",
            "Add the drained bitter greens to the skillet.",
            "Heat through for a few minutes.",
            "Add 0.5 tablespoon of cider or wine vinegar to the skillet.",
            "Season with a sprinkle of sugar, a pinch of salt, pepper, and freshly grated nutmeg to taste.",
            "Transfer the contents to a serving bowl and serve."
        ],
        "processed_ingredients": [
            "4.00 ounce spicy, bitter greens",
            "0.50 tablespoon salt",
            "0.50 tablespoon extra-virgin olive oil",
            "4.00 ounce andouille sausage",
            "0.25 medium onion",
            "2.00 tablespoon chicken stock",
            "0.50 tablespoon cider vinegar",
            "0.08 tablespoon sugar",
            "0.08 tablespoon salt",
            "0.08 tablespoon freshly ground black pepper",
            "0.08 tablespoon freshly grated nutmeg"
        ],
        "pure_ingredients": [
            "greens",
            "salt",
            "olive oil",
            "andouille sausage",
            "onion",
            "chicken stock",
            "vinegar",
            "sugar",
            "pepper",
            "nutmeg"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "pan",
            "large skillet",
            "serving bowl"
        ]
    },
    {
        "recipe_id": "xHWCq.pkS3iPjGHbsRNEWxJ4wj0kST.",
        "recipe_title": "Kale-Turkey Chopped Salad",
        "original_instructions": "Soak the red onion in a small bowl of ice water, 10 minutes. Meanwhile, combine the kale, 1 tablespoon vinegar and a pinch of salt in a large bowl. Toss and rub with your fingers until the kale is dark green and softened, 3 to 5 minutes.\nWhisk the mayonnaise, buttermilk, garlic, dill and the remaining 1 tablespoon vinegar in a small bowl until smooth; season with salt and pepper. Drain the red onion, pat dry and add to the bowl with the kale; add the turkey, apple and half of the sunflower seeds. Drizzle with about three-quarters of the dressing and toss to coat; season with salt and pepper. Top with the remaining dressing, sunflower seeds and the avocado.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "1/2 small red onion, thinly sliced",
            "1/2 large bunch kale, stems removed, leaves chopped",
            "2 tablespoons apple cider vinegar",
            "Kosher salt",
            "1/2 cup mayonnaise",
            "1/3 cup buttermilk",
            "1 small clove garlic, grated",
            "1 tablespoon chopped fresh dill",
            "Freshly ground pepper",
            "1 12-ounce piece smoked deli turkey, chopped",
            "1 apple, chopped",
            "1/4 cup unsalted roasted sunflower seeds",
            "1 avocado, peeled, pitted and thinly sliced"
        ],
        "step_by_step_instructions": [
            "Soak about 10g of thinly sliced red onion in a small bowl of ice water for 10 minutes.",
            "Meanwhile, combine around 50g of chopped kale, 0.5 tablespoon of apple cider vinegar and a pinch of salt in a large bowl.",
            "Toss and rub with your fingers until the kale is dark green and softened, about 3 to 5 minutes.",
            "Whisk 0.5 tablespoon of mayonnaise, 0.33 tablespoon of buttermilk, a small portion of grated garlic, 1 teaspoon of chopped fresh dill and 0.5 tablespoon of apple cider vinegar in a small bowl until smooth.",
            "Season the dressing with salt and freshly ground pepper.",
            "Drain the red onion, pat dry and add to the bowl with the kale.",
            "Add about 85g of chopped smoked deli turkey, a small portion of chopped apple, and 1 tablespoon of unsalted roasted sunflower seeds to the bowl.",
            "Drizzle with about three-quarters of the prepared dressing and toss to coat.",
            "Season with salt and pepper to taste.",
            "Top the salad with the remaining dressing, sunflower seeds, and thinly sliced avocado."
        ],
        "processed_ingredients": [
            "10 g red onion",
            "50 g kale",
            "1 tbsp apple cider vinegar",
            "0.5 tbsp mayonnaise",
            "0.33 tbsp buttermilk",
            "0.25 clove garlic",
            "1 tsp dill",
            "85 g turkey",
            "40 g apple",
            "1 tbsp sunflower seeds",
            "0.25 avocado"
        ],
        "pure_ingredients": [
            "red onion",
            "kale",
            "apple cider vinegar",
            "salt",
            "mayonnaise",
            "buttermilk",
            "garlic",
            "dill",
            "pepper",
            "turkey",
            "apple",
            "sunflower seeds",
            "avocado"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "bowl",
            "whisk",
            "knife"
        ]
    },
    {
        "recipe_id": "4NdnooSpptu7PVktc1yr3SadFoY9Tmq",
        "recipe_title": "Duckfat Potatoes",
        "original_instructions": "Put the potatoes in a pot, cover with water, and liberally add kosher salt. Bring to a boil and then reduce the heat to simmer gently until the potatoes can be easily pierced with a fork. Drain thoroughly and let cool.\nSplit the potatoes with a fork. In a skillet, bring the duck fat to the smoking point and add the potatoes. Do not move the potatoes until a golden crust has formed. Gently turn the potatoes to crisp them on all sides. Transfer to a plate and season with the Maldon salt.\nThis recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
        "ingredients": [
            "4 medium Yukon gold potatoes, peeled",
            "Kosher salt",
            "2 cups duck fat, melted",
            "Maldon salt"
        ],
        "step_by_step_instructions": [
            "Peel 1 medium Yukon gold potato.",
            "Put the potato in a pot, cover with water, and liberally add kosher salt.",
            "Bring to a boil and then reduce the heat to simmer gently until the potato can be easily pierced with a fork.",
            "Drain thoroughly and let cool.",
            "Split the potato with a fork.",
            "In a skillet, bring approximately 0.5 cups of duck fat to the smoking point and add the potato.",
            "Do not move the potato until a golden crust has formed.",
            "Gently turn the potato to crisp it on all sides.",
            "Transfer to a plate and season with Maldon salt."
        ],
        "processed_ingredients": [
            "1 potato Yukon gold potato",
            "1.50 tsp kosher salt",
            "0.50 cup duck fat",
            "0.25 tsp Maldon salt"
        ],
        "pure_ingredients": [
            "potato",
            "salt",
            "duck fat"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "pot",
            "skillet",
            "fork",
            "plate"
        ]
    },
    {
        "recipe_id": "XdLacF6.tAX2WYT1v3YT6UkXjTuETwi",
        "recipe_title": "Fried Green Plantains (Tostones De Platano Verde)",
        "original_instructions": "Preheat oil in a fryer or Dutch oven to 365 degrees F.\nPeel the plantains and cut into 1-inch pieces. Place into preheated oil and fry for 5 minutes or until they begin to brown. Drain them on a paper-towel lines plate. Flatten them using a Tostonera or the bottom of a metal can and fry again at 385 degrees F for approximately 3 minutes. Drain again and sprinkle with salt and Garlic Mojo. For softer fried plantains, soak for a few minutes in salted water after the first fry, drain and fry again.\nChop up the garlic very thinly or crush using a mortar and pestle or food processor with the salt to form a thick paste. In a mixing bowl, combine the garlic paste and juice, and let the mixture sit at room temperature for 30 minutes or longer.",
        "ingredients": [
            "Oil, for frying",
            "4 ripe plantains, peeled",
            "Salt",
            "Garlic Mojo, recipe follows",
            "8 garlic cloves",
            "1 teaspoon salt",
            "1/2 cup sour orange juice or 1/4 cup sweet orange juice",
            "plus 1/8 cup fresh lime or lemon juice"
        ],
        "step_by_step_instructions": [
            "Preheat oil in a fryer or Dutch oven to 365 degrees F.",
            "Peel one plantain and cut into 1-inch pieces.",
            "Place plantain pieces into preheated oil and fry for 5 minutes or until they begin to brown.",
            "Drain them on a paper-towel lined plate.",
            "Flatten the plantain pieces using a Tostonera or the bottom of a metal can.",
            "Fry the flattened plantains again at 385 degrees F for approximately 3 minutes.",
            "Drain them again and sprinkle with salt.",
            "Chop or crush 2 garlic cloves with a mortar and pestle or food processor with salt to form a thick paste.",
            "In a mixing bowl, combine the garlic paste with 2 tablespoons of sour orange juice, and let the mixture sit at room temperature for 30 minutes or longer.",
            "Sprinkle the fried plantains with the prepared Garlic Mojo."
        ],
        "processed_ingredients": [
            "1 tablespoon oil",
            "1 ripe plantain",
            "0.25 teaspoon salt",
            "2 garlic cloves",
            "0.25 teaspoon salt",
            "2 tablespoons sour orange juice"
        ],
        "pure_ingredients": [
            "oil",
            "plantain",
            "salt",
            "garlic",
            "sour orange juice"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "fryer",
            "Dutch oven",
            "knife",
            "paper towel",
            "plate",
            "Tostonera",
            "mortar and pestle",
            "food processor",
            "mixing bowl"
        ]
    },
    {
        "recipe_id": "McLjfG7pYf/q7z6OQXmcPKbfbVisMuO",
        "recipe_title": "Orzo \"Risotto\" ",
        "original_instructions": "Cook orzo in a large pot of boiling salted water until barely al dente, 5 to 6 minutes. Drain in a colander and rinse under cold water to stop cooking. Transfer orzo to a 2-quart heavy saucepan and add stock, zest, and thyme. Simmer over moderate heat, stirring constantly, until stock is absorbed, about 5 minutes. Stir in cheese, butter, salt, and pepper and serve immediately.\nCook orzo in a large pot of boiling salted water until barely al dente, 5 to 6 minutes. Drain in a colander and rinse under cold water to stop cooking.\nTransfer orzo to a 2-quart heavy saucepan and add stock, zest, and thyme. Simmer over moderate heat, stirring constantly, until stock is absorbed, about 5 minutes.\nStir in cheese, butter, salt, and pepper and serve immediately.",
        "ingredients": [
            "1 (1-lb) box orzo (rice-shaped pasta; not Greek)",
            "2 cups chicken stock or low-sodium broth",
            "1 packed teaspoon finely grated fresh orange zest",
            "1/4 teaspoon finely chopped fresh thyme",
            "2 oz finely grated Parmigiano-Reggiano (1 cup)",
            "2 tablespoons unsalted butter",
            "1/2 teaspoon salt",
            "1/2 teaspoon black pepper"
        ],
        "step_by_step_instructions": [
            "Bring 2 cups of water to a boil in a large pot, add 0.08 teaspoon of salt.",
            "Add 2.67 oz orzo to the boiling water and cook until barely al dente, about 5 to 6 minutes.",
            "Drain the orzo in a colander and rinse under cold water to stop cooking.",
            "Transfer the orzo to a 2-quart heavy saucepan.",
            "Add 0.33 cup chicken stock, 0.08 teaspoon fresh orange zest, and 0.01 teaspoon finely chopped fresh thyme to the saucepan with orzo.",
            "Simmer over moderate heat, stirring constantly, until the stock is absorbed, about 5 minutes.",
            "Stir in 0.17 oz Parmigiano-Reggiano cheese, 0.33 tablespoon unsalted butter, 0.08 teaspoon salt, and 0.08 teaspoon black pepper.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "2.67 oz orzo",
            "0.33 cup chicken stock",
            "0.08 teaspoon fresh orange zest",
            "0.01 teaspoon fresh thyme",
            "0.17 oz Parmigiano-Reggiano",
            "0.33 tablespoon unsalted butter",
            "0.08 teaspoon salt",
            "0.08 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "orzo",
            "chicken stock",
            "orange zest",
            "thyme",
            "Parmigiano-Reggiano",
            "butter",
            "salt",
            "black pepper"
        ],
        "cooking_time": "16 minutes",
        "required_tools": [
            "large pot",
            "colander",
            "2-quart heavy saucepan",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "OeUz17f6diEWfI/XPFhDTMGDTRf2M96",
        "recipe_title": "Peel and Eat BBQ Shrimp",
        "original_instructions": "Watch how to make this recipe.\nWhisk together the paprika, ancho powder, brown sugar, cumin, garlic, canola oil, salt and pepper in a small bowl.\nPlace the shrimp in a large bowl, add the spice rub and stir well to coat each shrimp.\nHeat your grill to high.\nSkewer 1/2 the shrimp and place on a grill pan to cook until just cooked through, 3 to 4 minutes. Stir in half of the green onions and transfer to a large platter or turnout onto brown paper bags. Wipe out the pan with paper towels, and repeat with the remaining ingredients.",
        "ingredients": [
            "1/4 cup smoked sweet paprika",
            "2 tablespoons ancho chili powder",
            "2 tablespoons light brown sugar",
            "2 teaspoons ground cumin",
            "3 tablespoons canola oil",
            "2 teaspoons kosher salt",
            "1 teaspoon ground black pepper",
            "2 pounds (21 to 24 count) large shrimp, shell on",
            "6 cloves coarsely chopped fresh garlic",
            "1/2 cup thinly sliced green onion, divided",
            "Special equipment: wooden skewers, soaked in water for about 25 minutes"
        ],
        "step_by_step_instructions": [
            "Whisk together 0.5 tablespoon smoked sweet paprika, 0.25 tablespoon ancho chili powder, 0.25 tablespoon light brown sugar, 0.25 teaspoon ground cumin, 1 clove coarsely chopped fresh garlic, 0.5 tablespoon canola oil, 0.25 teaspoon kosher salt, and 0.13 teaspoon ground black pepper in a small bowl.",
            "Place 4.5 ounces large shrimp in a large bowl, add the spice rub and stir well to coat each shrimp.",
            "Heat your grill to high.",
            "Skewer the shrimp and place on a grill pan to cook until just cooked through, about 3 to 4 minutes.",
            "Stir in 0.5 tablespoon thinly sliced green onion and transfer to a platter."
        ],
        "processed_ingredients": [
            "0.5 tablespoon smoked sweet paprika",
            "0.25 tablespoon ancho chili powder",
            "0.25 tablespoon light brown sugar",
            "0.25 teaspoon ground cumin",
            "0.5 tablespoon canola oil",
            "0.25 teaspoon kosher salt",
            "0.13 teaspoon ground black pepper",
            "4.5 ounce large shrimp",
            "1 clove fresh garlic",
            "0.5 tablespoon green onion"
        ],
        "pure_ingredients": [
            "paprika",
            "chili powder",
            "sugar",
            "cumin",
            "oil",
            "salt",
            "pepper",
            "shrimp",
            "garlic",
            "onion"
        ],
        "cooking_time": "4 minutes",
        "required_tools": [
            "whisk",
            "bowl",
            "grill",
            "skewers",
            "grill pan",
            "platter"
        ]
    },
    {
        "recipe_id": "hWHH3ETGQD8lIPKHKNQK4wITQgBii0C",
        "recipe_title": "Purple Potato Salad",
        "original_instructions": "Steam potatoes until just tender. Cool. Cut into 2 inch pieces. Steam cauliflower until just tender. Cool. Combine potatoes, cauliflower, and onion in large bowl. Whisk vinegar, garlic and cumin in small bowl. Gradually whisk in oil. Pour dressing over salad and toss to coat. Season to taste with salt and pepper. Add parsley and toss gently. Sprinkle with blue cheese.",
        "ingredients": [
            "3 pounds purple potatoes",
            "3 cups small cauliflower florets",
            "1 red onion, thinly sliced",
            "1/4 cup white wine vinegar",
            "1 garlic clove, minced",
            "1/2 teaspoon ground cumin seeds",
            "3/4 cup olive oil",
            "1 cup chopped fresh Italian parsley",
            "1/2 cup blue cheese"
        ],
        "step_by_step_instructions": [
            "Steam 1.5 pounds of purple potatoes until just tender. Let them cool.",
            "Cut the cooled potatoes into 2-inch pieces.",
            "Steam 1.5 cups of small cauliflower florets until just tender. Let them cool.",
            "Combine the cut potatoes, steamed cauliflower, and 1/3 of a red onion (thinly sliced) in a large bowl.",
            "In a small bowl, whisk together 1 tablespoon of white wine vinegar, 1/3 of a minced garlic clove, and a pinch of ground cumin seeds.",
            "Gradually whisk in 2.5 tablespoons of olive oil into the vinegar mixture.",
            "Pour the dressing over the salad and toss to coat.",
            "Season to taste with salt and pepper.",
            "Add 1/4 cup of chopped fresh Italian parsley and toss gently.",
            "Sprinkle 1.5 ounces of blue cheese over the salad."
        ],
        "processed_ingredients": [
            "1.5 lb purple potatoes",
            "1.5 cup cauliflower florets",
            "0.33 red onion",
            "1 tbsp white wine vinegar",
            "0.33 garlic clove",
            "0.13 tsp ground cumin seeds",
            "2.5 tbsp olive oil",
            "0.25 cup Italian parsley",
            "1.5 oz blue cheese"
        ],
        "pure_ingredients": [
            "potato",
            "cauliflower",
            "onion",
            "white wine vinegar",
            "garlic",
            "cumin seeds",
            "olive oil",
            "parsley",
            "blue cheese",
            "salt",
            "pepper"
        ],
        "cooking_time": "60 minutes",
        "required_tools": [
            "steaming basket",
            "knife",
            "cutting board",
            "large bowl",
            "small bowl",
            "whisk"
        ]
    },
    {
        "recipe_id": ".qDIfousrKVO4RlUU9cF.z5IxVi2F3O",
        "recipe_title": "Spiced Carrot Cauliflower Soup ",
        "original_instructions": "Heat the oil in a large saucepan over medium heat and cook the onions for 3 minutes, or until soft. Dissolve the vegetable bouillon in the water and add to the pot. Add the remaining ingredients to the pot and stir to combine. Bring to a boil, cover, and reduce heat to simmer for 15-20 minutes, or until the vegetables are fork tender. Using an immersion blender or standing blender, puree all of the ingredients until smooth.\nHeat the oil in a large saucepan over medium heat and cook the onions for 3 minutes, or until soft.\nDissolve the vegetable bouillon in the water and add to the pot.\nAdd the remaining ingredients to the pot and stir to combine.\nBring to a boil, cover, and reduce heat to simmer for 15-20 minutes, or until the vegetables are fork tender.\nUsing an immersion blender or standing blender, puree all of the ingredients until smooth.",
        "ingredients": [
            "1 tablespoon olive oil",
            "1 small onion, chopped",
            "5 cups warm water",
            "2 tablespoons vegetable bouillon, i like to use organic better than bouillon instead of the cubes",
            "1 head cauliflower, chopped (about 4 cups)",
            "3 cups peeled and chopped carrots (about 8 medium carrots)",
            "1 1/2 teaspoons curry powder",
            "1 teaspoon ground cinnamon",
            "1 teaspoon garam masala",
            "1 teaspoon salt"
        ],
        "step_by_step_instructions": [
            "Heat 0.25 tablespoon of olive oil in a large saucepan over medium heat.",
            "Cook 0.2 of a small onion, chopped, for 3 minutes, or until soft.",
            "Dissolve 0.4 tablespoon of vegetable bouillon in 1.25 cups of warm water and add to the pot.",
            "Add 1 cup of chopped cauliflower, 0.75 cup of peeled and chopped carrots, 0.38 teaspoon of curry powder, 0.25 teaspoon of ground cinnamon, 0.25 teaspoon of garam masala, and 0.25 teaspoon of salt to the pot and stir to combine.",
            "Bring to a boil, cover, and reduce heat to simmer for 15-20 minutes, or until the vegetables are fork tender.",
            "Using an immersion blender or standing blender, puree all of the ingredients until smooth."
        ],
        "processed_ingredients": [
            "0.25 tablespoon olive oil",
            "0.2 small onion",
            "1.25 cups warm water",
            "0.4 tablespoon vegetable bouillon",
            "1 cup cauliflower",
            "0.75 cup carrots",
            "0.38 teaspoon curry powder",
            "0.25 teaspoon ground cinnamon",
            "0.25 teaspoon garam masala",
            "0.25 teaspoon salt"
        ],
        "pure_ingredients": [
            "olive oil",
            "onion",
            "water",
            "vegetable bouillon",
            "cauliflower",
            "carrot",
            "curry powder",
            "cinnamon",
            "garam masala",
            "salt"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "large saucepan",
            "immersion blender or standing blender"
        ]
    },
    {
        "recipe_id": "VbkLlbfuErlSsESSJPkmNz7ssnjq1fi",
        "recipe_title": "Gingered Braised Greens",
        "original_instructions": "Preheat the oven to 350 degrees.\nIn a large oven pot with cover, coat with olive oil and sautee ginger, onions and garlic over medium heat. Add the greens and pack them in the pot. They will shrink big time in the oven. Season well and add the chicken stock and vinegar. Cover and place in oven for 45 minutes. Check after 20 minutes, verify flavor and stir.\nPLATING Slice thick pieces of prime rib and place on top of a pile of mashers. Place a small mound of greens and sauce the plate.\nWine Recommendation: Bacchus, Cabernet Sauvignon, California, 1996",
        "ingredients": [
            "2 tablespoons ginger julienned",
            "1 large onion, minced",
            "1 tablespoon sliced garlic",
            "1 pound kale, prepped into 1 inch pieces",
            "1 pound Swiss chard, prepped into 1 inch pieces",
            "1 pound mustard greens, prepped into 1 inch pieces",
            "1 cup chicken stock",
            "1/4 cup balsamic vinegar",
            "Salt and black pepper to taste",
            "Olive oil to cook"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees.",
            "In a large oven pot with a cover, coat with olive oil and sauté about 0.33 tablespoons of ginger, 0.17 onions, and 0.17 tablespoons of garlic over medium heat.",
            "Add approximately 0.33 pounds of kale, 0.33 pounds of Swiss chard, and 0.33 pounds of mustard greens. Pack them in the pot.",
            "Season with salt and black pepper.",
            "Add about 0.17 cups of chicken stock and 0.04 cups of balsamic vinegar.",
            "Cover the pot and place it in the oven for 45 minutes.",
            "Check after 20 minutes, verify flavor and stir."
        ],
        "processed_ingredients": [
            "0.33 tablespoon ginger",
            "0.17 onion",
            "0.17 tablespoon garlic",
            "0.33 lb kale",
            "0.33 lb Swiss chard",
            "0.33 lb mustard greens",
            "0.17 cup chicken stock",
            "0.04 cup balsamic vinegar",
            "to taste salt",
            "to taste black pepper",
            "to taste olive oil"
        ],
        "pure_ingredients": [
            "ginger",
            "onion",
            "garlic",
            "kale",
            "Swiss chard",
            "mustard greens",
            "chicken stock",
            "balsamic vinegar",
            "salt",
            "black pepper",
            "olive oil"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "oven",
            "large oven pot with cover",
            "stove"
        ]
    },
    {
        "recipe_id": "L8EDm.LgZA5P5mFUrk2LFCyNFnt550i",
        "recipe_title": "Lemon-Asparagus Rice",
        "original_instructions": "Heat the olive oil in a medium saucepan, add the onion, and cook until the onion softens, about 4 minutes. Add the rice and toast the grains, stirring occasionally, until the rice begins to look opaque (bright white), about 4 minutes. Add the water, butter, lemon slice, and lemon zest, reduce the heat to low, cover, and simmer for 25 minutes.\nMeanwhile, slice off the tough ends of the asparagus stalks and discard them. Cut the spears on a diagonal into 1-inch lengths. Fill a large non-reactive pot with a steamer rack with 1/2 inch water, place the pot over medium heat, and bring the water to a simmer. Add the asparagus, cover, and cook until just tender, 4 to 5 minutes.\nTransfer the cooked rice to a serving bowl and toss in the asparagus. Season with salt and pepper and serve.",
        "ingredients": [
            "1 tablespoon olive oil",
            "1/2 cup diced yellow onion (1/2-inch dice)",
            "1 1/2 cups long-grained white rice",
            "3 cups water",
            "2 tablespoons unsalted butter",
            "1 lemon slice (1 inch thick)",
            "1 teaspoon minced lemon zest",
            "1 pound fresh asparagus"
        ],
        "step_by_step_instructions": [
            "Heat 0.33 tablespoon olive oil in a medium saucepan.",
            "Add 0.13 cup diced yellow onion and cook until the onion softens, about 4 minutes.",
            "Add 0.38 cup long-grained white rice and toast the grains, stirring occasionally, until the rice begins to look opaque, about 4 minutes.",
            "Add 0.75 cup water, 0.5 tablespoon unsalted butter, 0.33 inch thick lemon slice, and 0.25 teaspoon minced lemon zest.",
            "Reduce the heat to low, cover, and simmer for 25 minutes.",
            "Meanwhile, slice off the tough ends of 0.25 pound fresh asparagus stalks and discard them.",
            "Cut the asparagus spears on a diagonal into 1-inch lengths.",
            "Fill a large non-reactive pot with a steamer rack with 0.13 inch water, place the pot over medium heat, and bring the water to a simmer.",
            "Add the asparagus, cover, and cook until just tender, 4 to 5 minutes.",
            "Transfer the cooked rice to a serving bowl and toss in the asparagus.",
            "Season with salt and pepper and serve."
        ],
        "processed_ingredients": [
            "0.33 tablespoon olive oil",
            "0.13 cup yellow onion",
            "0.38 cup long-grained white rice",
            "0.75 cup water",
            "0.5 tablespoon unsalted butter",
            "0.33 inch lemon slice",
            "0.25 teaspoon lemon zest",
            "0.25 lb asparagus"
        ],
        "pure_ingredients": [
            "olive oil",
            "yellow onion",
            "white rice",
            "water",
            "butter",
            "lemon",
            "lemon zest",
            "asparagus",
            "salt",
            "pepper"
        ],
        "cooking_time": "38 minutes",
        "required_tools": [
            "medium saucepan",
            "large non-reactive pot",
            "steamer rack",
            "serving bowl"
        ]
    },
    {
        "recipe_id": "KBDigs2tzY.cjlyaNiPYED.8oISwlfu",
        "recipe_title": "Hamburger Sliders",
        "original_instructions": "Prepare a grill or griddle for medium-high heat.\nAdd the beef, salt and pepper to a medium bowl and mix to combine. Divide the beef into 8 equal portions, then form each portion into a patty a little larger in diameter than the buns.\nCook the patties for 3 minutes or so (if using a griddle, do this in batches to avoid crowding). Flip with a spatula, add 2 slices of cheese to each and cook until the cheese melts and the burgers are cooked to medium, 3 to 5 minutes more.\nTransfer the burgers to the buns and serve immediately with tomato slices, lettuce, red onions and pickles.",
        "ingredients": [
            "1 pound ground beef (80 percent lean)",
            "1 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "16 small slices Colby Jack cheese (about 2 inches square)",
            "8 pretzel slider buns, split",
            "For serving: tomato slices, lettuce leaves, red onion slices and dill pickle rounds"
        ],
        "step_by_step_instructions": [
            "Prepare a grill or griddle for medium-high heat.",
            "Add approximately 0.13 lb of ground beef, 0.13 teaspoon of kosher salt, and 0.03 teaspoon of freshly ground black pepper to a medium bowl and mix to combine.",
            "Form the beef mixture into a patty slightly larger than a slider bun.",
            "Cook the patty for about 3 minutes on the grill or griddle. If using a griddle, do this in batches to avoid crowding.",
            "Flip the patty with a spatula, add 2 small slices of Colby Jack cheese, and cook for an additional 3 to 5 minutes or until the cheese melts and the burger is cooked to medium.",
            "Transfer the burger to a pretzel slider bun.",
            "Serve immediately with a slice of tomato, a leaf of lettuce, a slice of red onion, and a round of dill pickle."
        ],
        "processed_ingredients": [
            "0.13 lb ground beef",
            "0.13 teaspoon kosher salt",
            "0.03 teaspoon freshly ground black pepper",
            "2 slice Colby Jack cheese",
            "1 pretzel slider bun",
            "1 slice tomato",
            "1 leaf lettuce",
            "1 slice red onion",
            "1 round dill pickle"
        ],
        "pure_ingredients": [
            "ground beef",
            "salt",
            "pepper",
            "cheese",
            "buns",
            "tomato",
            "lettuce",
            "onion",
            "pickle"
        ],
        "cooking_time": "8 minutes",
        "required_tools": [
            "grill",
            "griddle",
            "bowl",
            "spatula"
        ]
    },
    {
        "recipe_id": "tp4wMyUApjyk0BxWxjJGsFSBphM7vla",
        "recipe_title": "Chicken Alfredo With Plum Tomatoes",
        "original_instructions": "Heat olive oil in 12-inch nonstick skillet over medium-high heat and brown chicken. Remove chicken and set aside.\nAdd tomatoes to same skillet and cook, stirring occasionally, 6 minutes. Add wine and cook 1 minute. Stir in sauce. Bring to a boil over high heat. Reduce heat to low, then return chicken to skillet. Simmer covered 5 minutes or until chicken is thoroughly cooked. Stir in basil. To serve, arrange chicken on platter and spoon hot sauce over chicken. Serve, if desired, with hot cooked pasta or rice.",
        "ingredients": [
            "1 Tbsp. olive oil",
            "4 boneless, skinless chicken breast halves (about 1-1/4 lbs.)",
            "4 plum tomatoes, chopped",
            "1/3 cup dry white wine or chicken broth",
            "1 jar Bertolli Creamy Alfredo Sauce",
            "1 Tbsp. thinly sliced fresh basil leaves (optional)"
        ],
        "step_by_step_instructions": [
            "Heat 0.25 tablespoon olive oil in a 12-inch nonstick skillet over medium-high heat and brown 1 chicken breast half. Remove the chicken and set aside.",
            "Add 1 chopped plum tomato to the same skillet and cook, stirring occasionally, for 6 minutes.",
            "Add about 0.08 cup white wine or chicken broth and cook for 1 minute.",
            "Stir in approximately 0.25 cup Alfredo sauce and bring to a boil over high heat.",
            "Reduce heat to low, then return the chicken to the skillet.",
            "Simmer covered for 5 minutes or until the chicken is thoroughly cooked.",
            "Stir in about 0.25 tablespoon thinly sliced fresh basil leaves.",
            "To serve, arrange the chicken on a platter and spoon the hot sauce over the chicken."
        ],
        "processed_ingredients": [
            "0.25 tbsp olive oil",
            "0.31 lb chicken breast halves",
            "1 plum tomato",
            "0.08 cup white wine",
            "0.25 cup Alfredo sauce",
            "0.25 tbsp fresh basil leaves"
        ],
        "pure_ingredients": [
            "olive oil",
            "chicken breast",
            "plum tomato",
            "white wine",
            "chicken broth",
            "Alfredo sauce",
            "basil"
        ],
        "cooking_time": "18 minutes",
        "required_tools": [
            "12-inch nonstick skillet",
            "spoon",
            "platter"
        ]
    },
    {
        "recipe_id": "i.Ps3PJzpUg7PcgswCEkbChcblo3ENe",
        "recipe_title": "White Bean and Chicken Chili",
        "original_instructions": "Watch how to make this recipe.\nIn a large heavy-bottomed saucepan or Dutch oven, heat the oil over medium-high heat. Add the onion and cook until translucent, about 5 minutes. Add the garlic and cook for 30 seconds. Add the ground chicken, 1 teaspoon salt, cumin, fennel seeds, oregano, and chili powder. Cook, stirring frequently, until the chicken is cooked through, about 8 minutes. Stir the flour into the chicken mixture. Add the beans, Swiss chard, corn, and chicken stock. Bring the mixture to a simmer, scraping up the brown bits that cling to the bottom of the pan with a wooden spoon. Simmer for 55-60 minutes until the liquid has reduced by about half and the chili has thickened. Add the red pepper flakes and simmer for another 10 minutes. Season with salt and pepper, to taste.\nLadle the chili into serving bowls. Sprinkle with the Parmesan cheese and chopped parsley.",
        "ingredients": [
            "2 tablespoons olive oil",
            "1 large onion, chopped",
            "4 garlic cloves, minced",
            "2 pounds ground chicken",
            "1 teaspoon salt, plus more for seasoning",
            "2 tablespoons ground cumin",
            "1 tablespoon fennel seeds",
            "1 tablespoon dried oregano",
            "2 teaspoons chili powder",
            "3 tablespoons flour",
            "2 (15-ounce cans) cannellini or other white beans, rinsed and drained",
            "1 bunch (about 1 pound) Swiss chard, stems removed, leaves chopped into 1-inch pieces",
            "11/2 cups frozen corn, thawed",
            "4 cups low-sodium chicken stock",
            "1/4 teaspoon crushed red pepper flakes",
            "Freshly ground black pepper for seasoning",
            "1/2 cup grated Parmesan cheese",
            "1/4 cup chopped fresh flat-leaf parsley"
        ],
        "step_by_step_instructions": [
            "In a large heavy-bottomed saucepan or Dutch oven, heat 0.5 tablespoon of olive oil over medium-high heat.",
            "Add 0.25 of a large onion, chopped, and cook until translucent, about 5 minutes.",
            "Add 1 garlic clove, minced, and cook for 30 seconds.",
            "Add 0.25 pound of ground chicken, 0.25 teaspoon salt, 0.5 tablespoon ground cumin, 0.25 tablespoon fennel seeds, 0.25 tablespoon dried oregano, and 0.5 teaspoon chili powder.",
            "Cook, stirring frequently, until the chicken is cooked through, about 8 minutes.",
            "Stir 0.75 tablespoon of flour into the chicken mixture.",
            "Add 0.5 (15-ounce) can of cannellini beans, rinsed and drained, 0.25 pound of Swiss chard, stems removed, leaves chopped into 1-inch pieces, and 0.375 cup of frozen corn, thawed.",
            "Add 1 cup of low-sodium chicken stock.",
            "Bring the mixture to a simmer, scraping up the brown bits that cling to the bottom of the pan with a wooden spoon.",
            "Simmer for 55-60 minutes until the liquid has reduced by about half and the chili has thickened.",
            "Add 0.06 teaspoon of crushed red pepper flakes and simmer for another 10 minutes.",
            "Season with salt and freshly ground black pepper, to taste.",
            "Ladle the chili into a serving bowl.",
            "Sprinkle with 0.125 cup of grated Parmesan cheese and 0.06 cup chopped fresh flat-leaf parsley."
        ],
        "processed_ingredients": [
            "0.5 tablespoon olive oil",
            "0.25 large onion",
            "1 garlic clove",
            "0.25 pound ground chicken",
            "0.25 teaspoon salt",
            "0.5 tablespoon ground cumin",
            "0.25 tablespoon fennel seeds",
            "0.25 tablespoon dried oregano",
            "0.5 teaspoon chili powder",
            "0.75 tablespoon flour",
            "0.5 can cannellini beans",
            "0.25 pound Swiss chard",
            "0.375 cup frozen corn",
            "1 cup low-sodium chicken stock",
            "0.06 teaspoon crushed red pepper flakes",
            "0.125 cup grated Parmesan cheese",
            "0.06 cup fresh flat-leaf parsley"
        ],
        "pure_ingredients": [
            "olive oil",
            "onion",
            "garlic",
            "chicken",
            "salt",
            "cumin",
            "fennel seeds",
            "oregano",
            "chili powder",
            "flour",
            "cannellini beans",
            "Swiss chard",
            "corn",
            "chicken stock",
            "red pepper flakes",
            "black pepper",
            "Parmesan cheese",
            "parsley"
        ],
        "cooking_time": "83 minutes",
        "required_tools": [
            "saucepan",
            "Dutch oven",
            "wooden spoon"
        ]
    },
    {
        "recipe_id": "pJrUqZoOyfywhQBhBf5LYsMylgId/Iy",
        "recipe_title": "Smoked Salmon and Asian Cucumber Salad Rolls",
        "original_instructions": "In a bowl toss cucumber julienne with remaining ingredients and season with salt and pepper. Chill at least 15 minutes and up to 1 hour.;\nTrim the smoked salmon slices to form about 40 strips approximately 2x4-inches each. Lay a bundle of cucumber strips (shake off excess dressing) at one end and roll up securely. Place seam side down on a tray, cover tightly with plastic wrap and refrigerate until ready to serve. Garnish with sesame seeds.;",
        "ingredients": [
            "1 cucumber (preferably English) peeled, seeded if necessary and cut into 2-inch julienne strips",
            "1/4 cup seasoned rice vinegar",
            "1/2 teaspoon Asian sesame oil",
            "2 teaspoons finely grated, peeled fresh ginger",
            "2 tablespoons sesame seeds, toasted lightly and cooled",
            "1/4 cup finely chopped scallions",
            "Pinch sugar, if desired",
            "Salt and freshly ground white pepper, to taste",
            "Toasted white and black sesame seeds for garnish",
            "12 ounces smoked salmon, sliced paper thin"
        ],
        "step_by_step_instructions": [
            "Peel and cut approximately one-sixth of a cucumber (preferably English) into 2-inch julienne strips.",
            "In a bowl, toss about 30 grams of cucumber julienne with 1 tablespoon seasoned rice vinegar, 0.08 teaspoon Asian sesame oil, and 0.33 teaspoon finely grated, peeled fresh ginger.",
            "Add 0.33 teaspoon sesame seeds and 1 teaspoon finely chopped scallions to the bowl.",
            "Season the mixture with a pinch of sugar, salt, and freshly ground white pepper to taste.",
            "Chill the cucumber mixture in the refrigerator for at least 15 minutes and up to 1 hour.",
            "Trim about 3 ounces of smoked salmon into strips approximately 2x4-inches.",
            "Lay a small bundle of cucumber strips at one end of each salmon strip and roll up securely.",
            "Place the rolls seam side down on a tray, cover tightly with plastic wrap, and refrigerate until ready to serve.",
            "Garnish with toasted white and black sesame seeds before serving."
        ],
        "processed_ingredients": [
            "0.17 cucumber",
            "1 tbsp seasoned rice vinegar",
            "0.08 tsp Asian sesame oil",
            "0.33 tsp fresh ginger",
            "0.33 tsp sesame seeds",
            "1 tsp scallions",
            "1 pinch sugar",
            "1 pinch salt",
            "1 pinch white pepper",
            "3 oz smoked salmon"
        ],
        "pure_ingredients": [
            "cucumber",
            "seasoned rice vinegar",
            "sesame oil",
            "ginger",
            "sesame seeds",
            "scallions",
            "sugar",
            "salt",
            "pepper",
            "smoked salmon"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "bowl",
            "knife",
            "cutting board",
            "plastic wrap",
            "tray"
        ]
    },
    {
        "recipe_id": ".ksBoXoPPk2xM8fh723wxje6D9v2zXe",
        "recipe_title": "Jamaican Rice and Peas",
        "original_instructions": "Place beans and garlic in a medium saucepan and cover with cold water. Bring to a simmer and cook until the beans are tender, about 1 to 1 1/2 hours. When the beans are tender, stir in the coconut milk, green onions, Scotch bonnet, and thyme, and increase the heat to a boil. Stir in the rice, add some salt and pepper, cover the pot, and cook until the rice is tender and has absorbed most of the liquid. Transfer to a large serving bowl, taste for seasoning, adding more salt and pepper if needed, and garnish with sliced green onions.",
        "ingredients": [
            "1 1/2 cups dried red kidney beans, soaked overnight and drained",
            "2 cloves garlic, smashed",
            "1/2 cup unsweetened coconut milk",
            "3 green onions, thinly sliced, plus more for garnish",
            "1 Scotch bonnet pepper, chopped",
            "3 sprigs fresh thyme",
            "1 1/2 cups long grain rice",
            "Salt and freshly ground pepper"
        ],
        "step_by_step_instructions": [
            "Place 0.38 cups of dried red kidney beans and 0.5 cloves of smashed garlic in a medium saucepan and cover with cold water.",
            "Bring to a simmer and cook until the beans are tender, about 1 to 1.5 hours.",
            "When the beans are tender, stir in 0.13 cups of unsweetened coconut milk, 0.75 tablespoons of thinly sliced green onions, 0.25 tablespoons of chopped Scotch bonnet, and 0.75 sprigs of fresh thyme, and increase the heat to a boil.",
            "Stir in 0.38 cups of long grain rice, add some salt and pepper, cover the pot, and cook until the rice is tender and has absorbed most of the liquid.",
            "Transfer to a large serving bowl, taste for seasoning, adding more salt and pepper if needed, and garnish with sliced green onions."
        ],
        "processed_ingredients": [
            "0.38 cups dried red kidney beans",
            "0.5 cloves garlic",
            "0.13 cups unsweetened coconut milk",
            "0.75 tablespoons green onions",
            "0.25 tablespoons Scotch bonnet pepper",
            "0.75 sprigs fresh thyme",
            "0.38 cups long grain rice",
            "1 teaspoons salt",
            "0.5 teaspoons freshly ground pepper"
        ],
        "pure_ingredients": [
            "red kidney beans",
            "garlic",
            "coconut milk",
            "green onions",
            "Scotch bonnet pepper",
            "thyme",
            "rice",
            "salt",
            "pepper"
        ],
        "cooking_time": "1.5 hours",
        "required_tools": [
            "medium saucepan",
            "large serving bowl",
            "knife",
            "cutting board",
            "stove"
        ]
    },
    {
        "recipe_id": "2ClfR2RpVhLHVcV3714mh1k6pfjrxQa",
        "recipe_title": "Poached Ginger Chicken",
        "original_instructions": "Put the chicken in a medium pot with just enough water to cover; add 1 tablespoon salt. Bring to a gentle simmer over medium heat and cook until the chicken is firm to the touch, about 15 minutes. Meanwhile, prepare a bowl of salted ice water. Drain the chicken and plunge into the ice water for about 30 seconds to stop the cooking. Drain again. Grate the ginger and shallot into a small bowl. Stir in 3 tablespoons peanut oil, the sesame oil and 1/4 teaspoon each sugar and salt. Toss the cucumber and radishes with the chili sauce, 3/4 teaspoon salt, the remaining 1 tablespoon peanut oil and the remaining 1/4 teaspoon sugar in a large bowl. Add the watercress and toss. Divide the salad among plates. Slice the chicken and add to the plates, then top with the ginger mixture. Drizzle with the lime juice.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "4 boneless, skinless chicken breasts (1 3/4 to 2 pounds)",
            "Kosher salt",
            "1 2-inch piece ginger, peeled",
            "1 large shallot",
            "4 tablespoons peanut oil",
            "1 tablespoon toasted sesame oil",
            "1/2 teaspoon sugar",
            "1 English cucumber, halved lengthwise, seeded and thinly sliced",
            "1 bunch radishes, thinly sliced, or 1 small daikon radish, peeled and cut into matchsticks",
            "1 teaspoon Asian chili sauce (such as sambal oelek)",
            "1 bunch watercress, trimmed",
            "Juice of 1 lime"
        ],
        "step_by_step_instructions": [
            "Put 1 chicken breast in a medium pot with just enough water to cover; add 0.25 tablespoon salt.",
            "Bring to a gentle simmer over medium heat and cook until the chicken is firm to the touch, about 15 minutes.",
            "Meanwhile, prepare a bowl of salted ice water.",
            "Drain the chicken and plunge into the ice water for about 30 seconds to stop the cooking.",
            "Drain again.",
            "Grate 0.5-inch ginger piece and 0.25 shallot into a small bowl.",
            "Stir in 0.75 tablespoon peanut oil, 0.25 tablespoon sesame oil and 0.06 teaspoon each sugar and salt.",
            "Toss 0.25 English cucumber and 1.5 radishes with 0.25 teaspoon chili sauce, 0.19 teaspoon salt, 0.25 tablespoon peanut oil and 0.06 teaspoon sugar in a large bowl.",
            "Add a handful of watercress and toss.",
            "Divide the salad onto a plate.",
            "Slice the chicken and add to the plate, then top with the ginger mixture.",
            "Drizzle with juice of 0.25 lime."
        ],
        "processed_ingredients": [
            "1 chicken breast",
            "0.25 tablespoon salt",
            "0.5 inch ginger",
            "0.25 shallot",
            "0.75 tablespoon peanut oil",
            "0.25 tablespoon sesame oil",
            "0.06 teaspoon sugar",
            "0.25 English cucumber",
            "1.5 radishes",
            "0.25 teaspoon chili sauce",
            "handful watercress",
            "0.25 lime"
        ],
        "pure_ingredients": [
            "chicken",
            "salt",
            "ginger",
            "shallot",
            "peanut oil",
            "sesame oil",
            "sugar",
            "cucumber",
            "radishes",
            "chili sauce",
            "watercress",
            "lime"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "medium pot",
            "bowl",
            "grater",
            "knife",
            "cutting board",
            "plate"
        ]
    },
    {
        "recipe_id": "iNddiaerEibgqDGFPiEzERdt7/Wmg0C",
        "recipe_title": "Spicy Broccoli Rabe",
        "original_instructions": "Heat the olive oil in a saute pan over medium high heat. Add garlic and cook for 1 minute. Add red pepper and saute until softened. Add broccoli rabe and hot pepper flakes, and coat with oil. Add broth, cover pan and cook until rabe is tender, about 4 more minutes.;",
        "ingredients": [
            "2 tablespoons olive oil",
            "3 garlic cloves, smashed",
            "1 red bell pepper, cut into thin strips",
            "1 1/2 pounds broccoli rabe, hollow stems trimmed, blanched, and drained",
            "1/2 to 3/4 teaspoon dried hot red pepper flakes",
            "1 cup chicken broth"
        ],
        "step_by_step_instructions": [
            "Heat 0.33 tablespoons of olive oil in a saute pan over medium high heat.",
            "Add 0.5 smashed garlic cloves and cook for 1 minute.",
            "Add 1.8 ounces of red bell pepper strips and saute until softened.",
            "Add 4 ounces of broccoli rabe and 0.1 teaspoons of dried hot red pepper flakes, and coat with oil.",
            "Add 0.17 cups of chicken broth, cover pan and cook until rabe is tender, about 4 more minutes."
        ],
        "processed_ingredients": [
            "0.33 tablespoon olive oil",
            "0.5 clove garlic",
            "1.8 ounce red bell pepper",
            "4 ounce broccoli rabe",
            "0.1 teaspoon red pepper flakes",
            "0.17 cup chicken broth"
        ],
        "pure_ingredients": [
            "olive oil",
            "garlic",
            "red bell pepper",
            "broccoli rabe",
            "red pepper flakes",
            "chicken broth"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "saute pan",
            "knife",
            "cutting board",
            "measuring spoons",
            "measuring cups"
        ]
    },
    {
        "recipe_id": "NWRyJ9Ku5WGe3eYH6aSjX3acybzUhda",
        "recipe_title": "Edamame (Cooked Fresh Soybeans)",
        "original_instructions": "Separate the pods from the stalks. Place bean pods in a large bowl. Sprinkle generously with salt, rub vigorously, and let stand 15 minutes. Bring a large pot of well-salted water to a boil, add the beans and boil over high heat for 5 to 6 minutes. (For a firmer bean, decrease the cooking time.) Don't cover the pot or the beans will lose their bright green color. When ready, drain beans and serve hot or at room temperature. To eat as finger food, serve the beans in baskets or bowls. Squeeze the pods with your fingers to press the beans into your mouth and discard the pods.",
        "ingredients": [
            "1/2 pound young green soybeans (about 4 cups of pods), fresh or frozen",
            "2 tablespoons salt"
        ],
        "step_by_step_instructions": [
            "Separate approximately 1 cup of pods from the stalks.",
            "Place the bean pods in a large bowl.",
            "Sprinkle generously with about 0.5 tablespoon salt, rub vigorously, and let stand for 15 minutes.",
            "Bring a large pot of well-salted water to a boil.",
            "Add the beans and boil over high heat for 5 to 6 minutes for a softer bean or less for a firmer bean.",
            "Do not cover the pot to maintain the beans' bright green color.",
            "Drain the beans when ready.",
            "Serve hot or at room temperature."
        ],
        "processed_ingredients": [
            "113.40 g green soybeans",
            "0.50 tbsp salt"
        ],
        "pure_ingredients": [
            "soybeans",
            "salt"
        ],
        "cooking_time": "21 minutes",
        "required_tools": [
            "bowl",
            "large pot",
            "strainer"
        ]
    },
    {
        "recipe_id": "G3YQIOvEscCXNJFP6FkPbBo1DomV6u2",
        "recipe_title": "Onion-Crusted Plantains",
        "original_instructions": "Slice the plantains 3/4 inch thick on the diagonal. Heat 1 1/2 tablespoons each butter and vegetable oil in a nonstick skillet over medium-high heat. Working in batches, cook the plantains until golden, about 5 minutes per side. Drain on paper towels, reserving the skillet.\nPut the flour in a shallow dish. Whisk the milk, egg, allspice and cayenne in another dish. Lightly crush the fried onions into a third dish. Dredge the plantains in the flour, dip in the milk mixture, then press into the fried onions, turning to coat.\nHeat the remaining 1 1/2 tablespoons each butter and vegetable oil in the reserved skillet over medium heat. Working in batches, fry the plantains until golden and crisp, about 1 minute per side. Drain on paper towels. Serve with the hot sauce.\nPhotograph by Andrew Mccaul",
        "ingredients": [
            "2 large extra-ripe plantains, peeled",
            "3 tablespoons unsalted butter",
            "3 tablespoons vegetable oil",
            "3/4 cup all-purpose flour",
            "3/4 cup milk",
            "1 large egg",
            "1/4 teaspoon ground allspice",
            "1/8 teaspoon cayenne pepper",
            "3 1/2 cups fried onions (one 6-ounce can)",
            "Hot sauce, for serving"
        ],
        "step_by_step_instructions": [
            "Slice 0.5 large plantain 3/4 inch thick on the diagonal.",
            "Heat 0.75 tablespoon unsalted butter and 0.75 tablespoon vegetable oil in a nonstick skillet over medium-high heat.",
            "Cook the plantain slices until golden, about 5 minutes per side.",
            "Drain the cooked plantains on paper towels and reserve the skillet.",
            "Put 0.09 cup all-purpose flour in a shallow dish.",
            "Whisk 0.09 cup milk, 0.25 large egg, 0.03 teaspoon ground allspice, and 0.02 teaspoon cayenne pepper in another dish.",
            "Lightly crush 0.44 cup fried onions into a third dish.",
            "Dredge the plantains in the flour, dip in the milk mixture, then press into the fried onions, turning to coat.",
            "Heat remaining 0.75 tablespoon unsalted butter and 0.75 tablespoon vegetable oil in the reserved skillet over medium heat.",
            "Fry the plantain slices until golden and crisp, about 1 minute per side.",
            "Drain on paper towels and serve with hot sauce."
        ],
        "processed_ingredients": [
            "0.50 large plantain",
            "1.50 tablespoon unsalted butter",
            "1.50 tablespoon vegetable oil",
            "0.09 cup all-purpose flour",
            "0.09 cup milk",
            "0.25 large egg",
            "0.03 teaspoon ground allspice",
            "0.02 teaspoon cayenne pepper",
            "0.44 cup fried onions",
            "to taste hot sauce"
        ],
        "pure_ingredients": [
            "plantain",
            "butter",
            "vegetable oil",
            "flour",
            "milk",
            "egg",
            "allspice",
            "cayenne pepper",
            "onions",
            "hot sauce"
        ],
        "cooking_time": "22 minutes",
        "required_tools": [
            "nonstick skillet",
            "paper towels",
            "shallow dish",
            "whisk"
        ]
    },
    {
        "recipe_id": "O7aM/dp3tYlz/tFsp4Du5NvDOEmjWYG",
        "recipe_title": "Chicken Cordon Bleu",
        "original_instructions": "Preheat oven to 375 degrees. Melt butter in glass baking dish. Lightly flatten chicken breasts between plastic wrap with mallet. Lay 1 slice of ham and 1 piece of cheese on flattened breast, fold in half and seal close with toothpicks. Repeat process for remaining chicken breasts. Coat each piece with flour, then eggs and then bread crumbs. Place chicken pieces in glass baking dish. Turn to coat with butter. Bake for 40-45 minutes or until golden brown. Serve with parselyed rice and steamed broccoli.",
        "ingredients": [
            "4 tablespoon butter",
            "1 cup flour",
            "4 boneless, skinless breasts of chicken",
            "2 eggs lightly beaten",
            "4 very thin slices smoked ham",
            "2 cups bread crumbs",
            "6 ounces Lorraine swiss cheese, cut into four chunks"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 375 degrees.",
            "Melt 1 tablespoon of butter in a glass baking dish.",
            "Lightly flatten 1 chicken breast between plastic wrap with a mallet.",
            "Lay 1 slice (0.5 ounce) of ham and 1.5 ounces of Lorraine swiss cheese on the flattened breast, fold the breast in half and seal it closed with toothpicks.",
            "Coat the folded chicken breast with 0.25 cup of flour, then dip it in 0.5 beaten egg, and finally coat it with 0.5 cup of bread crumbs.",
            "Place the chicken piece in the glass baking dish and turn it to coat with the melted butter.",
            "Bake for 40-45 minutes or until golden brown.",
            "Serve with parsleyed rice and steamed broccoli."
        ],
        "processed_ingredients": [
            "1.00 tablespoon butter",
            "0.25 cup flour",
            "1.00 boneless, skinless breast of chicken (approximately 6 ounces)",
            "0.50 egg (lightly beaten)",
            "1.00 slice ham (approximately 0.5 ounce)",
            "0.50 cup bread crumbs",
            "1.50 ounce Lorraine swiss cheese"
        ],
        "pure_ingredients": [
            "butter",
            "flour",
            "chicken",
            "eggs",
            "ham",
            "bread crumbs",
            "cheese"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "oven",
            "glass baking dish",
            "plastic wrap",
            "mallet",
            "toothpicks",
            "measuring cups"
        ]
    }
]