[
    {
        "recipe_id": "VpxhZ.t06X3eY9CNhVqHzXWREWdbiNG",
        "recipe_title": "Roasted Garlic and Rosemary Salt Potatoes",
        "original_instructions": "For the rosemary salt potatoes:\nClean potatoes and place whole in stock pot. Add cold water to cover, add salt, cover and bring to boil. Remove lid and boil 18 to 20 minutes, until tender.\nRemove from heat and drain. Return cooked potatoes to stock pot. Squeeze roasted garlic into pot, add butter, minced rosemary, and cracked pepper to taste, stir to coat potatoes. Serve 3 potatoes per plate.\nPlace garlic in aluminum foil square. Drizzle with olive oil and salt liberally. Wrap with foil and grill for an hour. Remove from heat and remove foil.",
        "ingredients": [
            "1 (10-pound) bag salt potatoes, 18 potatoes",
            "1 cup salt",
            "Roasted Garlic, recipe below",
            "1/4 cup butter, cubed",
            "1 bunch rosemary, chopped",
            "Salt and freshly ground black pepper",
            "1 head garlic",
            "Olive oil, to coat",
            "2 teaspoons sea salt"
        ],
        "step_by_step_instructions": [
            "Clean 1 potato and place it whole in a small pot.",
            "Add enough cold water to cover the potato, and add approximately 0.56 tablespoons of salt.",
            "Cover the pot and bring to a boil.",
            "Remove the lid and boil for 18 to 20 minutes, until the potato is tender.",
            "Remove from heat and drain the water.",
            "Return the cooked potato to the pot.",
            "Squeeze a portion of roasted garlic (about 0.06 of a head) into the pot.",
            "Add approximately 0.22 tablespoons of butter, a small amount of minced rosemary, and cracked black pepper to taste.",
            "Stir to coat the potato with the mixture.",
            "Serve the potato on a plate."
        ],
        "processed_ingredients": [
            "0.56 tbsp salt",
            "0.06 head garlic",
            "0.22 tbsp butter",
            "0.06 bunch rosemary",
            "1 potato",
            "0.11 tbsp olive oil",
            "0.11 tsp salt",
            "0.11 tsp black pepper"
        ],
        "pure_ingredients": [
            "potato",
            "salt",
            "garlic",
            "butter",
            "rosemary",
            "black pepper",
            "olive oil"
        ],
        "cooking_time": "80 minutes",
        "required_tools": [
            "pot",
            "foil",
            "grill",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "3.XMJbbtLcxLE4fiCoub9qwgYnMknWC",
        "recipe_title": "Roast Beef and Horseradish Tea Sandwiches",
        "original_instructions": "Stir the sour cream, horseradish and salt together in a small bowl.\nUsing a butter knife or offset spatula, spread the horseradish cream on 1 side of each rye slice. Put 1 slice of roast beef on 12 of the pumpernickel slices. Finish each sandwich with a grind or two of pepper and the remaining bread. Arrange the sandwiches on a serving platter and serve immediately.",
        "ingredients": [
            "1 cup sour cream",
            "3 tablespoons prepared horseradish, well drained",
            "2 teaspoons salt",
            "24 mini slices rye bread",
            "Freshly ground black pepper",
            "6 thin slices (about 6 ounces) roast beef, halved"
        ],
        "step_by_step_instructions": [
            "Stir 0.04 cups sour cream, 0.13 tablespoons prepared horseradish, and 0.08 teaspoons salt together in a small bowl.",
            "Using a butter knife or offset spatula, spread the horseradish cream on one side of 1 slice of rye bread.",
            "Put 0.25 slices of roast beef on the prepared bread slice.",
            "Finish the sandwich with a grind or two of black pepper and cover with another rye bread slice.",
            "Arrange the sandwich on a plate and serve immediately."
        ],
        "processed_ingredients": [
            "0.04 cup sour cream",
            "0.13 tablespoon horseradish",
            "0.08 teaspoon salt",
            "2 slice rye bread",
            "0.25 slice roast beef",
            "0.02 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "sour cream",
            "horseradish",
            "salt",
            "rye bread",
            "black pepper",
            "roast beef"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "bowl",
            "butter knife",
            "offset spatula",
            "plate"
        ]
    },
    {
        "recipe_id": "a8bvHI06T8MSAjaU4l/Jweq8Ah64Y26",
        "recipe_title": "Spicy Citrus Popcorn",
        "original_instructions": "In a large saucepan or Dutch oven, heat the oil over medium-high heat until nearly smoking. Add the popcorn kernels and immediately cover with a lid. Give the pan a shake and wait until you hear the kernels starting to pop. Shake the pan again, then lower the heat to medium and continue cooking until the popping slows and the kernels are popped, about 2 minutes more. Transfer the popcorn to a large bowl.\nMelt the butter over medium heat in a small saute pan. Add the lemon zest, cayenne and 1/2 teaspoon salt. Swirl to mingle the flavors. Pour the butter mixture over the popcorn and toss gently to coat. Season with salt and serve.",
        "ingredients": [
            "2 tablespoons vegetable oil",
            "1/2 cup popcorn kernels",
            "2 tablespoons unsalted butter",
            "Grated zest of 1 lemon",
            "1/8 teaspoon cayenne",
            "Salt"
        ],
        "step_by_step_instructions": [
            "Heat 0.5 tablespoon vegetable oil in a large saucepan or Dutch oven over medium-high heat until nearly smoking.",
            "Add 2 tablespoons of popcorn kernels and immediately cover with a lid.",
            "Shake the pan and wait until you hear the kernels starting to pop.",
            "Shake the pan again, lower the heat to medium, and continue cooking until the popping slows and the kernels are popped, about 2 minutes more.",
            "Transfer the popcorn to a large bowl.",
            "Melt 0.5 tablespoon unsalted butter over medium heat in a small saute pan.",
            "Add the grated zest of 0.25 lemon, 0.03 teaspoon cayenne, and 0.13 teaspoon salt to the melted butter.",
            "Swirl the pan to mingle the flavors.",
            "Pour the butter mixture over the popcorn and toss gently to coat.",
            "Season with additional salt to taste and serve."
        ],
        "processed_ingredients": [
            "0.5 tablespoon vegetable oil",
            "2 tablespoon popcorn kernels",
            "0.5 tablespoon unsalted butter",
            "0.25 lemon",
            "0.03 teaspoon cayenne",
            "0.13 teaspoon salt"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "popcorn kernels",
            "butter",
            "lemon",
            "cayenne",
            "salt"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "large saucepan",
            "lid",
            "large bowl",
            "small saute pan"
        ]
    },
    {
        "recipe_id": "MGH8ZaY04ppa0xuyY2sRiJDLnvPRCze",
        "recipe_title": "Turkey Pot Pie in a Shell",
        "original_instructions": "1. Prepare the pastry shells according to the package directions.\n2. Heat the oil in a 10-inch skillet over medium-high heat. Add the onion and cook until tender.\n3. Stir the soup, milk and peas and carrots in the skillet and heat to a boil. Reduce the heat to low. Cover and cook for 5 minutes or until the vegetables are tender. Add the turkey and cook until the mixture is hot and bubbling. Spoon the turkey mixture into the pastry shells.",
        "ingredients": [
            "1 package (10 ounces) Pepperidge Farm Puff Pastry Shells",
            "1 tablespoon vegetable oil",
            "1 medium onion, chopped (about 1/2 cup)",
            "1 can (10 3/4 ounces) Campbell's Condensed Cream of Chicken Soup (Regular, 98% Fat Free or Healthy Request)",
            "1/2 cup milk",
            "1 package (10 ounces) frozen peas and carrots",
            "2 cups cubed cooked turkey"
        ],
        "step_by_step_instructions": [
            "Prepare 1 pastry shell according to the package directions.",
            "Heat 0.17 tablespoon vegetable oil in a 10-inch skillet over medium-high heat.",
            "Add 0.08 cup chopped onion and cook until tender.",
            "Stir 0.19 cup condensed cream of chicken soup, 0.08 cup milk, and 1.67 ounces frozen peas and carrots in the skillet and heat to a boil.",
            "Reduce the heat to low, cover, and cook for 5 minutes or until the vegetables are tender.",
            "Add 0.33 cup cubed cooked turkey and cook until the mixture is hot and bubbling.",
            "Spoon the turkey mixture into the prepared pastry shell."
        ],
        "processed_ingredients": [
            "1 pastry shell",
            "0.17 tablespoon vegetable oil",
            "0.08 cup onion",
            "0.19 cup condensed cream of chicken soup",
            "0.08 cup milk",
            "1.67 ounces peas and carrots",
            "0.33 cup turkey"
        ],
        "pure_ingredients": [
            "pastry shell",
            "vegetable oil",
            "onion",
            "cream of chicken soup",
            "milk",
            "peas",
            "carrots",
            "turkey"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "skillet",
            "spoon"
        ]
    },
    {
        "recipe_id": "HXGfHquLt1veBrI60kPhIVtXVFLyUPu",
        "recipe_title": "Roasted Easter Lamb",
        "original_instructions": "Marinate lamb in white wine vinegar, oregano, oil and salt and pepper. Refrigerate, covered, for 24 hours. Preheat oven at 350 degrees. Roast lamb, potatoes and onions, uncovered for approximately 1 1/2 to 2 hours.",
        "ingredients": [
            "1/2 lamb, about 10 to 15 pounds",
            "1/2 cup white wine vinegar",
            "1/2 teaspoon dried oregano",
            "1/2 cup olive oil",
            "1 tablespoon salt",
            "1/2 tablespoon pepper",
            "Chopped parsley, for garnish"
        ],
        "step_by_step_instructions": [
            "Mix 0.36 tbsp white wine vinegar, 0.03 tsp dried oregano, 0.36 tbsp olive oil, 0.07 tbsp salt, and 0.04 tbsp pepper to create a marinade.",
            "Rub the marinade over 0.83 lb lamb, ensuring even coverage.",
            "Cover and refrigerate the marinated lamb for 24 hours.",
            "Preheat the oven to 350 degrees Fahrenheit.",
            "Place the marinated lamb in a roasting pan.",
            "Roast the lamb in the oven, uncovered, for approximately 90 to 120 minutes or until cooked to your preference.",
            "Garnish the roasted lamb with chopped parsley before serving."
        ],
        "processed_ingredients": [
            "0.36 cup white wine vinegar",
            "0.03 teaspoon dried oregano",
            "0.36 cup olive oil",
            "0.07 tablespoon salt",
            "0.04 tablespoon pepper",
            "0.83 lb lamb",
            "0.1 cup chopped parsley"
        ],
        "pure_ingredients": [
            "lamb",
            "white wine vinegar",
            "oregano",
            "olive oil",
            "salt",
            "pepper",
            "parsley"
        ],
        "cooking_time": "26 hours",
        "required_tools": [
            "refrigerator",
            "oven",
            "roasting pan",
            "knife",
            "cutting board",
            "measuring cups",
            "measuring spoons"
        ]
    },
    {
        "recipe_id": "qStzb9MR8lkZB0/OwTwpK0YQMB0HfC.",
        "recipe_title": "Grilled Red Pearl Onions ",
        "original_instructions": "Prepare barbecue grill (medium heat). Place onions on the grill and cover. Grill until onions are very tender when pierced with a skewer, about 15 minutes. Serve with salt. To pop the onion out of its papery skin, pick it up by the root end and squeeze.\nPrepare barbecue grill (medium heat). Place onions on the grill and cover. Grill until onions are very tender when pierced with a skewer, about 15 minutes. Serve with salt. To pop the onion out of its papery skin, pick it up by the root end and squeeze.",
        "ingredients": [
            "1 pound red pearl onions, unpeeled",
            "Salt, to taste"
        ],
        "step_by_step_instructions": [
            "Prepare a barbecue grill to medium heat.",
            "Place approximately 4 ounces of red pearl onions on the grill and cover.",
            "Grill until the onions are very tender when pierced with a skewer, about 15 minutes.",
            "Serve with salt.",
            "To pop the onion out of its papery skin, pick it up by the root end and squeeze."
        ],
        "processed_ingredients": [
            "4.00 oz red pearl onions",
            "0.50 tsp salt"
        ],
        "pure_ingredients": [
            "red pearl onions",
            "salt"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "barbecue grill",
            "skewer"
        ]
    },
    {
        "recipe_id": "q0Ae1qi54z5T5/ucwCYah91qEET3ua2",
        "recipe_title": "Quick Cucumber Pickles with Rye Bread and Cheese ",
        "original_instructions": "Cut cucumbers crosswise into 1/8-inch-thick slices, then toss with kosher salt in a bowl and let stand 15 minutes. Rinse and drain cucumbers and pat dry with paper towels. Whisk together vinegar, sugar, mustard, horseradish, and dill until sugar is dissolved. Stir in cucumber and let stand at least 5 minutes. Slice bread and serve with pickles and cheese.\nCut cucumbers crosswise into 1/8-inch-thick slices, then toss with kosher salt in a bowl and let stand 15 minutes. Rinse and drain cucumbers and pat dry with paper towels.\nWhisk together vinegar, sugar, mustard, horseradish, and dill until sugar is dissolved. Stir in cucumber and let stand at least 5 minutes.\nSlice bread and serve with pickles and cheese.",
        "ingredients": [
            "2 English cucumbers",
            "2 teaspoons kosher salt",
            "1/2 cup cider vinegar",
            "1/4 cup sugar",
            "1 tablespoon dry mustard",
            "2 teaspoons drained bottled horseradish",
            "1 tablespoon chopped fresh dill",
            "1 loaf rye bread (1 pound)",
            "2 (6- to 8-ounce) pieces semisoft cheese (preferably German, such as Cambozola or Mirabo)"
        ],
        "step_by_step_instructions": [
            "Cut 0.25 English cucumber crosswise into 1/8-inch-thick slices.",
            "Toss with 0.25 teaspoon kosher salt in a bowl and let stand for 15 minutes.",
            "Rinse and drain cucumbers and pat dry with paper towels.",
            "Whisk together 2 tablespoons cider vinegar, 1 tablespoon sugar, 0.25 tablespoon dry mustard, 0.5 teaspoon drained bottled horseradish, and 0.25 tablespoon chopped fresh dill until sugar is dissolved.",
            "Stir in cucumber slices and let stand at least 5 minutes.",
            "Slice 2 ounces of rye bread.",
            "Serve with pickles and 2 ounces of semisoft cheese."
        ],
        "processed_ingredients": [
            "0.25 English cucumber",
            "0.25 teaspoon kosher salt",
            "2 tablespoon cider vinegar",
            "1 tablespoon sugar",
            "0.25 tablespoon dry mustard",
            "0.5 teaspoon drained bottled horseradish",
            "0.25 tablespoon fresh dill",
            "2 ounce rye bread",
            "2 ounce semisoft cheese"
        ],
        "pure_ingredients": [
            "cucumber",
            "salt",
            "vinegar",
            "sugar",
            "mustard",
            "horseradish",
            "dill",
            "rye bread",
            "cheese"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "bowl",
            "whisk",
            "knife",
            "cutting board",
            "paper towels"
        ]
    },
    {
        "recipe_id": "maIsahfQF88dNY8KaCpT48Sl7vjJpem",
        "recipe_title": "Spice Rubbed Grilled Duck Breast",
        "original_instructions": "Combine the smoked paprika, garlic powder, cumin, chili powder, five spice powder, dry mustard and some salt and pepper in a bowl. Using a sharp knife, score the skin of the duck so it has a 1/4-inch diamond pattern. Rub the spice mixture all over the duck.\nHeat a grill to medium (make sure it's not too hot since the key is to cook duck slowly to render the fat) and wipe down the grates with an oiled towel. Place the duck skin-side down on the grate and cook until the skin is seared and the fat is rendered, 4 to 5 minutes. (If there are occasional flare-ups from the fat, move the duck around on the grill to a new spot away from the flame each time.) Flip the duck over and place on a cooler part of the grill. Cook for an additional 5 minutes for medium-rare. Let rest for 5 to 7 minutes before cutting against the grain into thick slices.",
        "ingredients": [
            "1 tablespoon smoked paprika",
            "1 teaspoon garlic powder",
            "1 teaspoon ground cumin",
            "1 teaspoon chili powder",
            "1/2 teaspoon five spice powder",
            "1/2 teaspoon dry mustard",
            "Kosher salt and freshly ground black pepper",
            "4 duck breast halves",
            "Oil, for the grill"
        ],
        "step_by_step_instructions": [
            "Combine 0.25 tablespoon smoked paprika, 0.06 teaspoon garlic powder, 0.06 teaspoon ground cumin, 0.06 teaspoon chili powder, 0.03 teaspoon five spice powder, 0.03 teaspoon dry mustard and a pinch of salt and pepper in a bowl.",
            "Using a sharp knife, score the skin of 1 duck breast half so it has a 1/4-inch diamond pattern.",
            "Rub the spice mixture all over the duck breast.",
            "Heat a grill to medium and wipe down the grates with an oiled towel.",
            "Place the duck skin-side down on the grate and cook until the skin is seared and the fat is rendered, about 4 to 5 minutes.",
            "Flip the duck breast over and place on a cooler part of the grill.",
            "Cook for an additional 5 minutes for medium-rare.",
            "Let rest for 5 to 7 minutes before cutting against the grain into thick slices."
        ],
        "processed_ingredients": [
            "0.25 tablespoon smoked paprika",
            "0.06 teaspoon garlic powder",
            "0.06 teaspoon ground cumin",
            "0.06 teaspoon chili powder",
            "0.03 teaspoon five spice powder",
            "0.03 teaspoon dry mustard",
            "1 duck breast half",
            "1 teaspoon oil"
        ],
        "pure_ingredients": [
            "smoked paprika",
            "garlic powder",
            "cumin",
            "chili powder",
            "five spice powder",
            "dry mustard",
            "salt",
            "pepper",
            "duck",
            "oil"
        ],
        "cooking_time": "27 minutes",
        "required_tools": [
            "grill",
            "bowl",
            "sharp knife",
            "towel"
        ]
    },
    {
        "recipe_id": "TiJyBKL3WoebZHQBSNXTBlWwecGfZCy",
        "recipe_title": "Quinoa Pilaf",
        "original_instructions": "Watch how to make this recipe.\nIn a medium saucepan, heat the oil over medium heat. Add the shallot, tomatoes, peppers and red pepper flakes and cook, stirring often, until slightly softened and aromatic, about 4 minutes. Season with the salt and add the quinoa. Using a wooden spoon, stir to coat the quinoa in the oil. Add the chicken broth, stir and bring to a simmer. Reduce the heat to low, cover the pan and cook until the quinoa is tender and the liquid is absorbed, about 20 minutes. Stir in the spinach to wilt and serve drizzled with olive oil.",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil, plus extra for drizzling",
            "1 shallot, chopped",
            "1/2 cup sun-dried tomatoes in oil, cut into 1/2-inch dice",
            "1 yellow bell pepper, cut into 1/2-inch dice",
            "1/8 teaspoon red pepper flakes",
            "1/4 teaspoon kosher salt",
            "1 cup tricolor quinoa",
            "1 1/4 cups reduced-sodium chicken broth",
            "2 cups baby spinach, chopped"
        ],
        "step_by_step_instructions": [
            "In a medium saucepan, heat 0.67 tablespoon of olive oil over medium heat.",
            "Add 0.17 shallot, chopped, 0.17 cup sun-dried tomatoes in oil, cut into 1/2-inch dice, 0.17 yellow bell pepper, cut into 1/2-inch dice, and a pinch of red pepper flakes to the saucepan.",
            "Cook, stirring often, until slightly softened and aromatic, about 4 minutes.",
            "Season with a pinch of kosher salt and add 0.33 cup tricolor quinoa.",
            "Using a wooden spoon, stir to coat the quinoa in the oil.",
            "Add 0.42 cup reduced-sodium chicken broth, stir and bring to a simmer.",
            "Reduce the heat to low, cover the pan and cook until the quinoa is tender and the liquid is absorbed, about 20 minutes.",
            "Stir in 0.67 cup baby spinach to wilt.",
            "Serve drizzled with a small amount of olive oil."
        ],
        "processed_ingredients": [
            "0.67 tablespoon olive oil",
            "0.17 shallot",
            "0.17 cup sun-dried tomatoes",
            "0.17 yellow bell pepper",
            "0.01 teaspoon red pepper flakes",
            "0.08 teaspoon kosher salt",
            "0.33 cup tricolor quinoa",
            "0.42 cup reduced-sodium chicken broth",
            "0.67 cup baby spinach"
        ],
        "pure_ingredients": [
            "olive oil",
            "shallot",
            "tomatoes",
            "bell pepper",
            "red pepper flakes",
            "salt",
            "quinoa",
            "chicken broth",
            "spinach"
        ],
        "cooking_time": "24 minutes",
        "required_tools": [
            "medium saucepan",
            "wooden spoon"
        ]
    },
    {
        "recipe_id": "rGaDvLV0RAII4dL6ECz508NgmPk3Pie",
        "recipe_title": "Quick Cooking Cheesy Polenta",
        "original_instructions": "In medium saucepan, bring the chicken stock and milk to a boil. Whisk in the polenta, stirring until the polenta just pulls from the side of the pot. Stir in the Manchego cheese and serve warm.",
        "ingredients": [
            "2 cups chicken stock",
            "1 cup milk",
            "1 cup quick-cooking polenta",
            "1 cup shredded Manchego cheese"
        ],
        "step_by_step_instructions": [
            "In a medium saucepan, bring 0.50 cups chicken stock and 0.25 cups milk to a boil.",
            "Whisk in 0.25 cups quick-cooking polenta, stirring until the polenta just pulls from the side of the pot.",
            "Stir in 0.25 cups shredded Manchego cheese and serve warm."
        ],
        "processed_ingredients": [
            "0.50 cups chicken stock",
            "0.25 cups milk",
            "0.25 cups quick-cooking polenta",
            "0.25 cups Manchego cheese"
        ],
        "pure_ingredients": [
            "chicken stock",
            "milk",
            "polenta",
            "Manchego cheese"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "medium saucepan",
            "whisk"
        ]
    },
    {
        "recipe_id": "n04lgwTmg8PdXDbnf7ZRshrN38fLVOK",
        "recipe_title": "Four-Pasta Beef Bake",
        "original_instructions": "Cook pasta according to package directions. Meanwhile, in a large skillet, cook the beef, green peppers, onions, and mushrooms over medium heat until meat is no longer pink; drain.\nPreheat oven to 350 degrees F.\nDrain pasta and place in a large bowl; stir in the beef mixture, 2 jars of spaghetti sauce and eggs. Transfer to 2 greased 13 by 9 by 2-inch baking dishes. Top with remaining sauce; sprinkle with cheese. Bake, uncovered, for 25 to 30 minutes or until heated through.",
        "ingredients": [
            "8 cups uncooked pasta (4 different shapes)",
            "2 pounds ground beef",
            "2 medium green peppers, chopped",
            "2 medium onions, chopped",
            "2 cups sliced fresh mushrooms",
            "Four 26-ounce jars meatless spaghetti sauce",
            "2 eggs, lightly beaten",
            "4 cups shredded mozzarella"
        ],
        "step_by_step_instructions": [
            "Cook 1 cup of pasta according to package directions.",
            "While the pasta is cooking, in a skillet, cook 0.25 lb of ground beef, 0.25 of a green pepper chopped, 0.25 of an onion chopped, and 0.25 cup of sliced fresh mushrooms over medium heat until the meat is no longer pink. Drain any excess fat.",
            "Preheat the oven to 350 degrees F.",
            "Drain the cooked pasta and place it in a large bowl.",
            "Stir in the beef mixture, 0.5 cup of spaghetti sauce, and 0.25 of a lightly beaten egg with the pasta.",
            "Transfer the mixture to a greased baking dish.",
            "Top with an additional 0.5 cup of spaghetti sauce and sprinkle with 0.5 cup of shredded mozzarella cheese.",
            "Bake, uncovered, for 25 minutes or until heated through."
        ],
        "processed_ingredients": [
            "1.00 cup pasta",
            "0.25 lb ground beef",
            "0.25 green pepper",
            "0.25 onion",
            "0.25 cup sliced mushrooms",
            "1.00 cup spaghetti sauce",
            "0.25 egg",
            "0.50 cup shredded mozzarella"
        ],
        "pure_ingredients": [
            "pasta",
            "beef",
            "green pepper",
            "onion",
            "mushrooms",
            "egg",
            "mozzarella"
        ],
        "cooking_time": "60 minutes",
        "required_tools": [
            "skillet",
            "bowl",
            "baking dish",
            "oven"
        ]
    },
    {
        "recipe_id": "gubwfcAt5nl3NDXlsVnMv6csja7R.xG",
        "recipe_title": "Stuffed Baked Potatoes",
        "original_instructions": "Preheat oven to 425 degrees. Wash potatoes and poke 2 or 3 vent holes in each with a fork. Bake potatoes in oven until done, about 1 hour. (Poke with a fork and if fork goes in easily they are done). Remove potatoes from oven and allow to cool for 10 minutes. Slice potatoes in 1/2 lengthwise and scoop pulp into mixing bowl being careful not to break skin. Mash potatoes with butter, cheese, milk, and chives. Taste-test and adjust seasoning if necessary with salt and pepper. Spoon mashed potatoes back into skins and place in a 9 by 13-inch dish. Return to oven and heat thoroughly.",
        "ingredients": [
            "4 large baking potatoes",
            "1 stick butter",
            "1 cup grated Cheddar cheese",
            "3/4 cup milk, plus more if needed",
            "2 tablespoons chopped chives, optional",
            "Salt and pepper, to taste"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 425 degrees.",
            "Wash 1 large baking potato and poke 2 or 3 vent holes in it with a fork.",
            "Bake the potato in the oven until done, about 1 hour. (Poke with a fork and if fork goes in easily it is done).",
            "Remove the potato from the oven and allow to cool for 10 minutes.",
            "Slice the potato in 1/2 lengthwise and scoop pulp into a mixing bowl being careful not to break the skin.",
            "Mash the potato with 2 tablespoons of butter, 1/4 cup of grated Cheddar cheese, 3 tablespoons of milk, and 1/2 tablespoon of chopped chives.",
            "Taste-test and adjust seasoning if necessary with salt and pepper.",
            "Spoon mashed potatoes back into the skins and place in a 9 by 13-inch dish.",
            "Return to the oven and heat thoroughly."
        ],
        "processed_ingredients": [
            "1.00 large baking potato",
            "2.00 tbsp butter",
            "0.25 cup grated Cheddar cheese",
            "3.00 tbsp milk",
            "0.50 tbsp chopped chives",
            "0.25 tsp salt",
            "0.25 tsp pepper"
        ],
        "pure_ingredients": [
            "potato",
            "butter",
            "Cheddar cheese",
            "milk",
            "chives",
            "salt",
            "pepper"
        ],
        "cooking_time": "80 minutes",
        "required_tools": [
            "oven",
            "fork",
            "mixing bowl",
            "9 by 13-inch dish"
        ]
    },
    {
        "recipe_id": "C1RJ.UOfUGg.ldynCUkgEOKJLuhnaYO",
        "recipe_title": "Shaved Asparagus Salad",
        "original_instructions": "Remove and chop the zest from the orange and add it to a large nonreactive bowl. Add the asparagus and cheese and toss together. Peel the orange and cut segments from the membrane. Add the segments to the bowl with the asparagus.\nSqueeze the juice from the orange membrane into a small bowl and add the chives and white wine vinegar. Whisk in the olive oil and season with salt and pepper. Add the dressing to the asparagus and let sit until the asparagus is slightly wilted, about 5 minutes. Toss in the hazelnuts and serve.",
        "ingredients": [
            "1 orange",
            "1 bunch thick green asparagus (1 pound), trimmed and thinly sliced on the bias",
            "4 ounces Pecorino Romano cheese, diced",
            "2 tablespoons chopped chives",
            "2 teaspoons white wine vinegar",
            "1/4 cup extra-virgin olive oil",
            "Kosher salt and freshly ground black pepper",
            "2 tablespoons toasted hazelnuts, whole or coarsely chopped"
        ],
        "step_by_step_instructions": [
            "Remove and chop the zest from one-quarter of an orange and add it to a large nonreactive bowl.",
            "Add approximately 113 g of thinly sliced asparagus and 1 ounce of diced Pecorino Romano cheese to the bowl and toss together.",
            "Peel one-quarter of the orange and cut segments from the membrane. Add these segments to the bowl with the asparagus.",
            "Squeeze the juice from the remaining orange membrane into a small bowl and add 0.5 teaspoon of chopped chives and 0.25 teaspoon of white wine vinegar.",
            "Whisk in 1 tablespoon of extra-virgin olive oil into the mixture and season with a pinch of salt and pepper.",
            "Add the dressing to the asparagus mixture and let sit until the asparagus is slightly wilted, about 5 minutes.",
            "Toss in approximately 0.5 tablespoon of toasted hazelnuts and serve."
        ],
        "processed_ingredients": [
            "0.25 unit orange",
            "113 g asparagus",
            "28.35 g Pecorino Romano cheese",
            "0.5 tsp chives",
            "0.25 tsp white wine vinegar",
            "1 tbsp extra-virgin olive oil",
            "1 pinch salt",
            "1 pinch black pepper",
            "7.1 g hazelnuts"
        ],
        "pure_ingredients": [
            "orange",
            "asparagus",
            "cheese",
            "chives",
            "vinegar",
            "olive oil",
            "salt",
            "black pepper",
            "hazelnuts"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "knife",
            "large nonreactive bowl",
            "small bowl",
            "whisk"
        ]
    },
    {
        "recipe_id": "FM.0qeifN1LLV/c9DB7xhcSUbkFj6lu",
        "recipe_title": "Crab Cake Mixture",
        "original_instructions": "In saute pan, add olive oil. Sweat onions and celery in oil. Set aside. In a separate bowl, mix crab meat, mayonnaise, parsley, bread crumbs and onion-celery mixture. Chill.",
        "ingredients": [
            "1-ounce olive oil",
            "1/2 Medium yellow onion, small dice",
            "1 stalk celery, small dice",
            "2 pounds crab meat",
            "1/2 cup mayonnaise (recipe to follow)",
            "2 tablespoons parsley, chopped",
            "1 1/2 ounces Japanese bread crumbs"
        ],
        "step_by_step_instructions": [
            "Heat 0.05 ounce olive oil in a saute pan over medium heat.",
            "Add 0.025 of a medium yellow onion (small dice) and 0.05 stalk celery (small dice) to the pan.",
            "Sweat the onions and celery in the oil until they are soft and translucent, then set aside to cool.",
            "In a separate bowl, combine 4 ounces crab meat, 0.02 cup mayonnaise, 0.2 tablespoon parsley (chopped), 0.075 ounce Japanese bread crumbs, and the cooled onion-celery mixture.",
            "Mix all ingredients well and chill in the refrigerator for at least 30 minutes before serving."
        ],
        "processed_ingredients": [
            "0.05 ounce olive oil",
            "0.025 medium yellow onion",
            "0.05 stalk celery",
            "4 ounce crab meat",
            "0.02 cup mayonnaise",
            "0.2 tablespoon parsley",
            "0.075 ounce Japanese bread crumbs"
        ],
        "pure_ingredients": [
            "olive oil",
            "onion",
            "celery",
            "crab meat",
            "mayonnaise",
            "parsley",
            "bread crumbs"
        ],
        "cooking_time": "35 minutes",
        "required_tools": [
            "saute pan",
            "bowl",
            "spoon"
        ]
    },
    {
        "recipe_id": "mBxA/EJ3zdOroz/H9rp/JMlBzQkRKpa",
        "recipe_title": "Steam/Sauteed Green Beans with Butter and Tarragon",
        "original_instructions": "Bring the water, butter, salt and green beans to a boil in a Dutch oven or large deep skillet. Cover and steam over medium-high heat until the vegetable is brightly colored and just tender, 5 to 10 minutes.\nRemove the lid and continue to cook until the liquid evaporates, 1 to 2 minutes longer, adding the tarragon at this point. Saute to intensify flavors, 1 to 2 minutes longer. Adjust seasonings, including pepper to taste, and serve.",
        "ingredients": [
            "1 pound green beans, stemmed",
            "1/3 cup water",
            "1/2 teaspoon salt",
            "1 tablespoon butter",
            "1 1/2 teaspoons minced fresh tarragon"
        ],
        "step_by_step_instructions": [
            "Bring 40 ml water, 1.25 g salt, 4.25 g butter, and 113.40 g green beans to a boil in a Dutch oven or large deep skillet.",
            "Cover and steam over medium-high heat until the vegetable is brightly colored and just tender, about 5 to 10 minutes.",
            "Remove the lid and continue to cook until the liquid evaporates, about 1 to 2 minutes longer.",
            "Add 2 g minced fresh tarragon and saute to intensify flavors, about 1 to 2 minutes longer.",
            "Adjust seasonings, including pepper to taste, and serve."
        ],
        "processed_ingredients": [
            "113.40 g green beans",
            "40 ml water",
            "1.25 g salt",
            "4.25 g butter",
            "2 g tarragon"
        ],
        "pure_ingredients": [
            "green beans",
            "water",
            "salt",
            "butter",
            "tarragon",
            "pepper"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "Dutch oven",
            "large deep skillet"
        ]
    },
    {
        "recipe_id": "wjp5QXJ8f6xwJxYv.XH.fFTpYTLUkGu",
        "recipe_title": "Lime Marinated Chicken Wings with Avocado Dip",
        "original_instructions": "In a blender, puree until smooth the jalapeno pepper, garlic, vegetable oil, tomato paste, salt, honey and lime juice. Pour marinade over the chicken. Add the lime zest and toss to coat. Cover with plastic wrap and refrigerate overnight.\nPreheat boiler to medium heat.\nArrange chicken on a baking sheet lined with parchment paper. Broil chicken at least 6 inches from the heat for 4 to 5 minutes per side; or until chicken is crispy on the outside and cooked through. Serve with Avocado Dip.\nPit and peel avocado. Place avocado in a medium bowl; mash. Fold in 3 tablespoons chopped fresh cilantro leaves; lime juice, garlic and salt; and freshly ground black pepper, to taste.",
        "ingredients": [
            "1 jalapeno pepper, seeded and sliced",
            "4 cloves garlic, chopped",
            "1/4 cup vegetables oil",
            "1 tablespoon tomato paste",
            "Pinch salt",
            "2 tablespoons honey",
            "1 1/2 limes, juiced",
            "3 pounds chicken wings, rinsed and patted dry",
            "1/2 lime, zested",
            "Avocado Dip, recipe follows",
            "1 avocado",
            "3 tablespoons chopped fresh cilantro leaves",
            "1 1/2 teaspoons lime juice",
            "1 clove garlic, minced",
            "1/4 teaspoon salt",
            "Freshly ground pepper"
        ],
        "step_by_step_instructions": [
            "In a blender, puree until smooth 0.08 jalapeno pepper, 0.33 cloves garlic, 0.01 cup vegetable oil, 0.05 tablespoon tomato paste, a pinch of salt, 0.33 tablespoons honey, and 0.25 limes' juice.",
            "Pour the marinade over 0.25 pounds of chicken wings.",
            "Add 0.02 lime zested and toss to coat.",
            "Cover with plastic wrap and refrigerate overnight.",
            "Preheat the broiler to medium heat.",
            "Arrange the chicken on a baking sheet lined with parchment paper.",
            "Broil the chicken at least 6 inches from the heat for 4 to 5 minutes per side, or until crispy on the outside and cooked through.",
            "Pit and peel 0.25 avocado, and place it in a medium bowl; mash.",
            "Fold in 0.75 tablespoons chopped fresh cilantro leaves, 0.38 teaspoons lime juice, 0.25 clove garlic minced, 0.06 teaspoon salt, and freshly ground black pepper, to taste.",
            "Serve the chicken wings with avocado dip."
        ],
        "processed_ingredients": [
            "0.08 jalapeno pepper",
            "0.33 cloves garlic",
            "0.01 cup vegetable oil",
            "0.05 tablespoon tomato paste",
            "0.33 tablespoons honey",
            "0.25 limes juiced",
            "0.25 pounds chicken wings",
            "0.02 lime zested",
            "0.25 avocado",
            "0.75 tablespoons cilantro leaves",
            "0.38 teaspoons lime juice",
            "0.25 clove garlic",
            "0.06 teaspoon salt",
            "0.25 pinch salt",
            "pepper"
        ],
        "pure_ingredients": [
            "jalapeno pepper",
            "garlic",
            "vegetable oil",
            "tomato paste",
            "salt",
            "honey",
            "lime",
            "chicken wings",
            "lime",
            "avocado",
            "cilantro",
            "lime",
            "garlic",
            "salt",
            "pepper"
        ],
        "cooking_time": "12 hours",
        "required_tools": [
            "blender",
            "plastic wrap",
            "refrigerator",
            "baking sheet",
            "parchment paper",
            "broiler",
            "medium bowl"
        ]
    },
    {
        "recipe_id": "cvnBdG9WYwCwZzxgwmAp4N2Olouh86W",
        "recipe_title": "Corned Beef Breakfast Hash",
        "original_instructions": "Heat the olive oil in a large skillet over medium-high heat. Add the potatoes, sprinkle with salt and pepper and saute until golden brown, 10 to 12 minutes.\nAdd the onions and peppers and continue cooking an additional 5 minutes. Add the cabbage and Worcestershire sauce and saute until the vegetables are tender, about 3 minutes longer. Stir in the corned beef and cream and reduce the heat to medium-low.\nCrack the eggs over the hash. Cover with a lid and cook until the eggs are set, 8 to 10 minutes. Serve the hash divided among 4 plates.",
        "ingredients": [
            "3 tablespoons olive oil",
            "1 pound baby red potatoes, quartered",
            "Kosher salt and cracked black pepper",
            "1 Spanish onion, roughly chopped",
            "1 red bell pepper, chopped",
            "1 cup shredded cabbage",
            "2 tablespoons Worcestershire sauce",
            "8 ounces corned beef, thinly sliced crosswise into strips",
            "1/4 cup heavy cream",
            "4 large eggs"
        ],
        "step_by_step_instructions": [
            "Heat 0.75 tablespoon olive oil in a large skillet over medium-high heat.",
            "Add 4 ounces baby red potatoes, sprinkle with salt and pepper, and saute until golden brown, about 10 to 12 minutes.",
            "Add 0.25 of a Spanish onion and 0.25 of a red bell pepper, and continue cooking for an additional 5 minutes.",
            "Add 0.25 cup shredded cabbage and 0.5 tablespoon Worcestershire sauce, and saute until the vegetables are tender, about 3 minutes longer.",
            "Stir in 2 ounces corned beef and 1 tablespoon heavy cream, and reduce the heat to medium-low.",
            "Crack 1 egg over the hash.",
            "Cover with a lid and cook until the egg is set, about 8 to 10 minutes.",
            "Serve the hash on a plate."
        ],
        "processed_ingredients": [
            "0.75 tablespoon olive oil",
            "4 ounce baby red potatoes",
            "0.25 Spanish onion",
            "0.25 red bell pepper",
            "0.25 cup shredded cabbage",
            "0.5 tablespoon Worcestershire sauce",
            "2 ounce corned beef",
            "1 tablespoon heavy cream",
            "1 large egg",
            "1 pinch salt",
            "1 pinch pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "potato",
            "salt",
            "pepper",
            "onion",
            "bell pepper",
            "cabbage",
            "Worcestershire sauce",
            "corned beef",
            "heavy cream",
            "egg"
        ],
        "cooking_time": "38 minutes",
        "required_tools": [
            "large skillet",
            "lid",
            "spatula"
        ]
    },
    {
        "recipe_id": "F2Te5KLgUVmvu5cnF4ipu5lDtDUx5iq",
        "recipe_title": "Coconut Rice",
        "original_instructions": "In a saucepan, heat oil over medium high heat. Stir in rice and cook for 1 minute. Pour in coconut milk and chicken stock and bring to a boil. Cover and reduce heat to low and simmer for 15 minutes. Remove pan from heat and allow to rest for 5 minutes. Serve hot.",
        "ingredients": [
            "2 tablespoons vegetable oil",
            "1 cup long grain white rice",
            "1 cup coconut milk",
            "1 cup chicken stock",
            "Salt and pepper"
        ],
        "step_by_step_instructions": [
            "In a saucepan, heat 0.67 tablespoon vegetable oil over medium high heat.",
            "Stir in 0.33 cup long grain white rice and cook for 1 minute.",
            "Pour in 0.33 cup coconut milk and 0.33 cup chicken stock and bring to a boil.",
            "Cover and reduce heat to low and simmer for 15 minutes.",
            "Remove pan from heat and allow to rest for 5 minutes.",
            "Serve hot."
        ],
        "processed_ingredients": [
            "0.67 tablespoon vegetable oil",
            "0.33 cup long grain white rice",
            "0.33 cup coconut milk",
            "0.33 cup chicken stock",
            "0.08 teaspoon salt",
            "0.08 teaspoon pepper"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "rice",
            "coconut milk",
            "chicken stock",
            "salt",
            "pepper"
        ],
        "cooking_time": "21 minutes",
        "required_tools": [
            "saucepan",
            "stirring utensil",
            "lid"
        ]
    },
    {
        "recipe_id": "KsL4Y8zdt1XhYutQujumWUoPqZYsy/e",
        "recipe_title": "Garbanzo Minestrone",
        "original_instructions": "Put beans in a stock pot. Add extra virgin olive oil and flour. Stir mixture and cover. Add pork rind. Cover mixture with water. Cook for 1 1/2 hours over medium-low heat. Skim off impurities if necessary.\nSaute onions, garlic, sage, rosemary and celery leaves in 1 tablespoon olive oil over low flame, about 10 minutes. Add them to pot of garbanzo beans after beans have cooked for 1 1/2 hours. Chop celery stalks and add to pot. Add potato, carrots, broccoli rabe, leeks and cabbage to pot. Simmer for 1 1/2 hours. Skim to remove impurities if necessary. Add additional water if soup is too thick. Soup is done when beans are tender and potatoes are no longer solid. Season with salt and pepper. Soup can be served with olive oil, toasted bread and Parmesan cheese if desired.",
        "ingredients": [
            "4 cups dried garbanzo beans, soaked in water with 1 teaspoon baking soda for 24 hours and drained",
            "1/4 cup extra virgin olive oil, plus 1 tablespoon",
            "2 tablespoons flour",
            "1/2 pound pork rind, boiled for 20 minutes and cut into thin strips",
            "Approximately 10 cups water",
            "1/4 cup olive oil",
            "1 onion, finely chopped",
            "2 cloves garlic, minced",
            "3 fresh sage leaves, chopped",
            "1 branch rosemary, chopped",
            "Leaves from 2 stalks of celery, hold ribs aside",
            "1 baking potato, peeled and cut in half",
            "2 carrots, peeled and sliced",
            "1/2 cup broccoli rabe, chopped",
            "2 leeks, white part only, sliced",
            "5 cabbage leaves, chiffonade",
            "Salt and pepper, to taste"
        ],
        "step_by_step_instructions": [
            "Soak 0.5 cup of dried garbanzo beans in water with a pinch of baking soda for 24 hours, then drain.",
            "In a stock pot, add the soaked garbanzo beans, 0.5 tbsp of extra virgin olive oil, and 0.25 tbsp of flour.",
            "Stir the mixture and cover the pot.",
            "Add 0.06 lb of pork rind to the pot.",
            "Cover the mixture with approximately 1.25 cups of water.",
            "Cook over medium-low heat for 1.5 hours, skimming off impurities if necessary.",
            "In a separate pan, sauté 0.06 cup of finely chopped onion, 0.25 clove of minced garlic, a small amount of chopped fresh sage, a small amount of chopped rosemary, and a few leaves from celery stalks in 0.12 tbsp of olive oil over low heat for about 10 minutes.",
            "Add the sautéed mixture to the pot of garbanzo beans after they have cooked for 1.5 hours.",
            "Chop a few stalks of celery and add to the pot.",
            "Add 0.12 of a peeled and halved baking potato, 0.25 carrot sliced, 0.06 cup of chopped broccoli rabe, 0.25 of a sliced leek (white part only), and a small amount of chiffonade cabbage leaves to the pot.",
            "Simmer for another 1.5 hours, skimming to remove impurities if necessary.",
            "Add additional water if the soup is too thick.",
            "Check if the soup is done by ensuring the beans are tender and the potatoes are no longer solid.",
            "Season with salt and pepper to taste.",
            "Serve the soup with a drizzle of olive oil, a piece of toasted bread, and a sprinkle of Parmesan cheese if desired."
        ],
        "processed_ingredients": [
            "0.5 cup dried garbanzo beans",
            "0.5 tbsp extra virgin olive oil",
            "0.25 tbsp flour",
            "0.06 lb pork rind",
            "1.25 cups water",
            "0.12 tbsp olive oil",
            "0.06 cup onion",
            "0.25 clove garlic",
            "0.12 tsp fresh sage",
            "0.12 tsp rosemary",
            "0.12 tbsp celery leaves",
            "0.12 piece baking potato",
            "0.25 piece carrot",
            "0.06 cup broccoli rabe",
            "0.25 piece leek",
            "0.12 cup cabbage",
            "0.12 tsp salt",
            "0.12 tsp pepper"
        ],
        "pure_ingredients": [
            "garbanzo beans",
            "olive oil",
            "flour",
            "pork rind",
            "water",
            "onion",
            "garlic",
            "sage",
            "rosemary",
            "celery",
            "potato",
            "carrot",
            "broccoli rabe",
            "leek",
            "cabbage",
            "salt",
            "pepper",
            "bread",
            "parmesan cheese"
        ],
        "cooking_time": "3 hours",
        "required_tools": [
            "stock pot",
            "pan",
            "knife",
            "cutting board",
            "spoon"
        ]
    },
    {
        "recipe_id": "jdCSwnK3gMm.Ud6M/90Ez7pHkdp948.",
        "recipe_title": "Tuna Croquette",
        "original_instructions": "Watch how to make this recipe.\nPlace the tuna, onions, mustard, eggs, lemon juice, salt, pepper and 1/4 cup of the bread crumbs into a medium mixing bowl and stir to combine. Divide the mixture into 8 rounds and set aside on a parchment lined half sheet pan. Allow to rest for 15 minutes. Place the remaining bread crumbs into a pie plate. One at a time, coat each round in the panko on all sides.\nHeat enough olive oil to cover the bottom of a 12-inch saute pan over medium heat until shimmering. Add the croquettes and cook 2 to 3 minutes on each side or until golden brown. Remove to a cooling rack set over a half sheet pan lined with paper towels. Allow to cool for 2 to 3 minutes before serving.",
        "ingredients": [
            "1 (7-ounce) pouch albacore tuna, drained well and shredded by hand",
            "2 green onions, chopped fine",
            "2 teaspoons Dijon mustard",
            "2 large eggs, beaten",
            "1 teaspoon freshly squeezed lemon juice",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "3/4 cup panko bread crumbs, divided",
            "Olive oil, for sauteing"
        ],
        "step_by_step_instructions": [
            "Place 0.88 ounces of albacore tuna, 0.25 tablespoons of chopped green onions, 0.25 teaspoons of Dijon mustard, 0.25 large beaten eggs, 0.13 teaspoons of freshly squeezed lemon juice, 0.06 teaspoons of kosher salt, 0.03 teaspoons of freshly ground black pepper, and 0.09 cups of panko bread crumbs into a medium mixing bowl and stir to combine.",
            "Divide the mixture into 1 round and set aside on a parchment-lined half sheet pan.",
            "Allow the mixture to rest for 15 minutes.",
            "Place 0.19 cups of remaining bread crumbs into a pie plate.",
            "Coat the round in the panko on all sides.",
            "Heat enough olive oil to cover the bottom of a 12-inch sauté pan over medium heat until shimmering.",
            "Add the croquette and cook 2 to 3 minutes on each side or until golden brown.",
            "Remove to a cooling rack set over a half sheet pan lined with paper towels.",
            "Allow to cool for 2 to 3 minutes before serving."
        ],
        "processed_ingredients": [
            "0.88 ounces albacore tuna",
            "0.25 tablespoons green onions",
            "0.25 teaspoons Dijon mustard",
            "0.25 large eggs",
            "0.13 teaspoons lemon juice",
            "0.06 teaspoons kosher salt",
            "0.03 teaspoons black pepper",
            "0.09 cups panko bread crumbs",
            "0.19 cups panko bread crumbs",
            "olive oil"
        ],
        "pure_ingredients": [
            "tuna",
            "green onions",
            "mustard",
            "eggs",
            "lemon",
            "salt",
            "black pepper",
            "bread crumbs",
            "olive oil"
        ],
        "cooking_time": "26 minutes",
        "required_tools": [
            "mixing bowl",
            "parchment-lined half sheet pan",
            "pie plate",
            "saute pan",
            "cooling rack",
            "paper towels"
        ]
    },
    {
        "recipe_id": "BZjpKoRBJm0KZKCJu1HygkR6KsjHMjq",
        "recipe_title": "Creamy Loaded Mashed Potatoes",
        "original_instructions": "Preheat oven to 375 degrees. Spray 2-quart shallow baking dish with nonstick cooking spray; set aside.\nCover potatoes with water in 4-quart saucepot; bring to a boil over high heat. Reduce heat to low and cook 10 minutes or until potatoes are tender; drain and mash.\nStir in 1 cup cheese, Hellmann's or Best Foods Real Mayonnaise, sour cream, green onions and 4 strips crumbled bacon. Turn into prepared baking dish and bake 30 minutes or until bubbling.\nTop with remaining 1/2 cup cheese and bacon. Bake an additional 5 minutes or until cheese is melted. Garnish, if desired, with additional chopped green onions.",
        "ingredients": [
            "3 lbs. all-purpose potatoes, peeled and cubed",
            "1-1/2 cups shredded cheddar cheese (about 6 oz.), divided",
            "1 cup Hellmann's or Best Foods Real Mayonnaise",
            "1 cup sour cream",
            "3 green onions, finely chopped (optional)",
            "6 slices bacon, crisp-cooked and crumbled"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 375 degrees.",
            "Spray a small portion of a 2-quart shallow baking dish with nonstick cooking spray; set aside.",
            "Cover a small portion of potatoes with water in a small saucepot; bring to a boil over high heat.",
            "Reduce heat to low and cook for about 10 minutes or until potatoes are tender; drain and mash.",
            "Stir in about 0.17 cup cheese, 0.17 cup mayonnaise, 0.17 cup sour cream, a small portion of green onions, and 0.67 slice crumbled bacon.",
            "Turn into prepared baking dish and bake for 30 minutes or until bubbling.",
            "Top with remaining cheese and bacon. Bake an additional 5 minutes or until cheese is melted.",
            "Garnish, if desired, with additional chopped green onions."
        ],
        "processed_ingredients": [
            "0.50 lb potatoes",
            "0.25 cup shredded cheddar cheese",
            "0.17 cup mayonnaise",
            "0.17 cup sour cream",
            "0.50 tbsp green onions",
            "0.67 slice bacon"
        ],
        "pure_ingredients": [
            "potatoes",
            "cheddar cheese",
            "mayonnaise",
            "sour cream",
            "green onions",
            "bacon"
        ],
        "cooking_time": "50 minutes",
        "required_tools": [
            "oven",
            "2-quart shallow baking dish",
            "nonstick cooking spray",
            "saucepot",
            "mashing tool"
        ]
    },
    {
        "recipe_id": "9Vd6BVDNQBZWw5X.5W60z.Sq9oQJSYe",
        "recipe_title": "Pickled Mushrooms ",
        "original_instructions": "Boil wine, spices, salt, bay leaf, and garlic in a deep 10-inch heavy skillet 5 minutes. Add mushrooms and oil, then reduce heat and gently simmer, uncovered, until mushrooms are barely tender, about 15 minutes. Transfer to a bowl and cool mushrooms in liquid, uncovered. Chill, covered, at least 8 hours for flavors to meld. Discard bay leaf and whole spices. Serve at room temperature.\nBoil wine, spices, salt, bay leaf, and garlic in a deep 10-inch heavy skillet 5 minutes. Add mushrooms and oil, then reduce heat and gently simmer, uncovered, until mushrooms are barely tender, about 15 minutes. Transfer to a bowl and cool mushrooms in liquid, uncovered. Chill, covered, at least 8 hours for flavors to meld. Discard bay leaf and whole spices. Serve at room temperature.",
        "ingredients": [
            "2 cups dry white wine",
            "1 teaspoon whole coriander seeds",
            "1/2 teaspoon whole black peppercorns",
            "3/4 teaspoon salt",
            "1 Turkish or 1/2 California bay leaf",
            "3 garlic cloves, peeled and smashed",
            "1 lb small (1-inch) white or cremini mushrooms, trimmed",
            "1/4 cup extra-virgin olive oil"
        ],
        "step_by_step_instructions": [
            "Boil 0.25 cup dry white wine, 0.125 teaspoon whole coriander seeds, 0.0625 teaspoon whole black peppercorns, 0.1875 teaspoon salt, 0.125 bay leaf, and 0.75 garlic cloves, peeled and smashed, in a deep skillet for 5 minutes.",
            "Add 0.25 lb small white or cremini mushrooms and 1 tablespoon extra-virgin olive oil.",
            "Reduce heat and gently simmer, uncovered, until mushrooms are barely tender, about 15 minutes.",
            "Transfer to a bowl and cool mushrooms in liquid, uncovered.",
            "Chill, covered, at least 8 hours for flavors to meld.",
            "Discard bay leaf and whole spices.",
            "Serve at room temperature."
        ],
        "processed_ingredients": [
            "0.25 cup dry white wine",
            "0.125 teaspoon whole coriander seeds",
            "0.0625 teaspoon whole black peppercorns",
            "0.1875 teaspoon salt",
            "0.125 bay leaf",
            "0.75 garlic cloves",
            "0.25 lb mushrooms",
            "1 tablespoon extra-virgin olive oil"
        ],
        "pure_ingredients": [
            "wine",
            "coriander seeds",
            "black peppercorns",
            "salt",
            "bay leaf",
            "garlic",
            "mushrooms",
            "olive oil"
        ],
        "cooking_time": "8 hours 20 minutes",
        "required_tools": [
            "deep skillet",
            "bowl"
        ]
    },
    {
        "recipe_id": "c67yy0e3r6GCClEqiSYx4.9DY7i8vpG",
        "recipe_title": "Grammy Carl's Popcorn Balls",
        "original_instructions": "Special equipment: a candy thermometer\nLine a baking sheet with wax paper; set aside. Place the popcorn in a large bowl; set aside.\nIn a heavy medium pot, stir to combine the molasses, sugar, butter and vinegar. Bring to a boil over medium-high heat, then reduce to a simmer and cook until the mixture reaches 260 degrees F (hard ball stage) on a candy thermometer, 5 to 8 minutes. Let cool for about 5 minutes, then pour over the popcorn; fold and mix to coat using a rubber spatula. Let the popcorn cool slightly.\nCoat your hands well with butter and form the popcorn mixture into 1/2-cup balls, squeezing to keep the popcorn together. Place on the prepared baking sheet and let sit until completely cooled and hardened, about 20 minutes.",
        "ingredients": [
            "10 cups (4.4 ounces) popped popcorn",
            "1 cup molasses",
            "1 cup sugar",
            "2 tablespoons unsalted butter, plus more for coating hands",
            "1 teaspoon apple cider vinegar"
        ],
        "step_by_step_instructions": [
            "Line a baking sheet with wax paper and set aside.",
            "Place 1.25 cups (0.55 ounces) of popped popcorn in a large bowl and set aside.",
            "In a heavy medium pot, stir to combine 0.13 cups molasses, 0.13 cups sugar, 0.25 tablespoons unsalted butter, and 0.13 teaspoons apple cider vinegar.",
            "Bring the mixture to a boil over medium-high heat, then reduce to a simmer and cook until the mixture reaches 260 degrees F on a candy thermometer, about 5 to 8 minutes.",
            "Let the mixture cool for about 5 minutes.",
            "Pour the mixture over the popcorn and fold and mix to coat using a rubber spatula.",
            "Let the popcorn cool slightly.",
            "Coat your hands well with butter and form the popcorn mixture into 1/2-cup balls, squeezing to keep the popcorn together.",
            "Place the popcorn balls on the prepared baking sheet and let sit until completely cooled and hardened, about 20 minutes."
        ],
        "processed_ingredients": [
            "1.25 cups popped popcorn",
            "0.13 cups molasses",
            "0.13 cups sugar",
            "0.25 tablespoons unsalted butter",
            "0.13 teaspoons apple cider vinegar"
        ],
        "pure_ingredients": [
            "popcorn",
            "molasses",
            "sugar",
            "butter",
            "apple cider vinegar"
        ],
        "cooking_time": "33 minutes",
        "required_tools": [
            "baking sheet",
            "wax paper",
            "large bowl",
            "heavy medium pot",
            "candy thermometer",
            "rubber spatula"
        ]
    },
    {
        "recipe_id": "vab33dKxKr.zVAC.Sig.CQ8mAhsFXfW",
        "recipe_title": "Dublin Lawyer Recipe",
        "original_instructions": "In a small mixing bowl thoroughly combine softened butter, cayenne pepper, and paprika. In a large deep-sided skillet over medium-high heat, melt the cayenne butter and add the mushrooms, scallions and lobster meat. Saute until mushroom are golden, about 5 minutes, and season with salt and pepper, to taste. Carefully add the whiskey off the heat and cook until almost completely evaporated. Add the cream and reduce until thickened. Serve in large bowls over hot rice.",
        "ingredients": [
            "1/2 cup (1 stick) unsalted butter, softened",
            "1 teaspoon cayenne",
            "2 teaspoons paprika",
            "1 1/2 cups sliced button mushrooms",
            "1/2 cup sliced scallions",
            "1 pound cooked lobster meat",
            "Salt and freshly ground black pepper",
            "1/4 cup Irish whiskey (recommended: Jameson)",
            "4 cups heavy cream",
            "2 cups hot cooked rice"
        ],
        "step_by_step_instructions": [
            "In a small mixing bowl, thoroughly combine 1 tablespoon of softened butter, 0.13 teaspoon of cayenne pepper, and 0.25 teaspoon of paprika.",
            "In a large deep-sided skillet over medium-high heat, melt the cayenne butter.",
            "Add 0.19 cup of sliced mushrooms, 0.06 cup of sliced scallions, and 0.25 pound of cooked lobster meat. Saute until mushroom are golden, about 5 minutes, and season with salt and pepper to taste.",
            "Carefully add 0.06 cup of whiskey off the heat and cook until almost completely evaporated.",
            "Add 1 cup of cream and reduce until thickened.",
            "Serve in a large bowl over 0.5 cup of hot rice."
        ],
        "processed_ingredients": [
            "1 tablespoon butter",
            "0.13 teaspoon cayenne pepper",
            "0.25 teaspoon paprika",
            "0.19 cup mushrooms",
            "0.06 cup scallions",
            "0.25 lb lobster meat",
            "0.06 cup whiskey",
            "1 cup cream",
            "0.5 cup rice"
        ],
        "pure_ingredients": [
            "butter",
            "cayenne pepper",
            "paprika",
            "mushrooms",
            "scallions",
            "lobster",
            "salt",
            "black pepper",
            "whiskey",
            "cream",
            "rice"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "mixing bowl",
            "skillet",
            "stove"
        ]
    },
    {
        "recipe_id": "DcDFyBnsqA4IYQ50B4oN6LDmXMyW4iu",
        "recipe_title": "Spinach Soup",
        "original_instructions": "In a large skillet, heat the olive oil over medium heat. Add the spinach and garlic and cook, stirring constantly, until the spinach is wilted, 2 to 3 minutes. Add the mixture to a blender or food processor, pour in 1/4 cup hot water and pulse until pureed. Set aside.\nIn a large soup pot, cook the onions in the butter over medium heat until the onions begin to soften. Sprinkle the flour over the top and stir to combine. Cook for about 2 minutes, then pour in the milk, stirring occasionally. Add the salt, cayenne and some black pepper and stir to combine. Cook over medium heat for 5 minutes, stirring constantly. Pour in the pureed spinach, then cook until thickened, another 3 to 5 minutes.\nCheck the seasonings, adding more salt, black pepper or cayenne as needed. Serve warm.",
        "ingredients": [
            "2 tablespoons olive oil",
            "10 ounces fresh spinach",
            "2 cloves garlic, finely minced",
            "1/2 medium onion, chopped",
            "4 tablespoons (1/2 stick) butter",
            "1/4 cup all-purpose flour",
            "3 cups whole milk",
            "2 teaspoons kosher salt, or more to taste",
            "1/2 teaspoon cayenne pepper, or more to taste",
            "Freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Heat 1 tablespoon of olive oil in a large skillet over medium heat.",
            "Add approximately 2.5 ounces of fresh spinach and 0.5 clove of finely minced garlic to the skillet.",
            "Cook, stirring constantly, until the spinach is wilted, about 2 to 3 minutes.",
            "Transfer the spinach mixture to a blender or food processor.",
            "Add 1 tablespoon of hot water and pulse until pureed.",
            "Set the spinach puree aside.",
            "In a large soup pot, melt 1 tablespoon of butter over medium heat.",
            "Add 1/8 of a medium onion, chopped, to the pot.",
            "Cook the onion until it begins to soften.",
            "Sprinkle 1 tablespoon of all-purpose flour over the onions and stir to combine.",
            "Cook for about 2 minutes, then pour in 3/4 cup of whole milk, stirring occasionally.",
            "Add 0.5 teaspoon of kosher salt, 0.125 teaspoon of cayenne pepper, and some freshly ground black pepper to taste.",
            "Stir to combine and cook over medium heat for 5 minutes, stirring constantly.",
            "Pour in the pureed spinach and cook until thickened, another 3 to 5 minutes.",
            "Check the seasonings, adding more salt, black pepper, or cayenne as needed.",
            "Serve the soup warm."
        ],
        "processed_ingredients": [
            "1 tbsp olive oil",
            "2.5 oz fresh spinach",
            "0.5 clove garlic",
            "0.125 medium onion",
            "1 tbsp butter",
            "1 tbsp all-purpose flour",
            "0.75 cup whole milk",
            "0.5 tsp kosher salt",
            "0.125 tsp cayenne pepper",
            "0.125 tsp black pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "spinach",
            "garlic",
            "onion",
            "butter",
            "flour",
            "milk",
            "salt",
            "cayenne pepper",
            "black pepper"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "large skillet",
            "blender or food processor",
            "large soup pot"
        ]
    },
    {
        "recipe_id": "rfWyJh62fpiHkvj1BDkp0nV9LQPuW8u",
        "recipe_title": "Corn, Tomato, and Scallion Salad",
        "original_instructions": "Cut corn kernels from ears, discarding cobs. Heat oil in a large heavy skillet over moderately high heat until hot but not smoking, then saute corn, seasoning with salt and pepper, to taste, stirring, until tender, about 4 minutes.\nAdd garlic and saute, stirring, 1 minute. Add vinegar and cook, stirring, until most is evaporated, about 1 minute. Add tomatoes and cook, gently stirring, 1 minute.\nRemove skillet from heat and stir in scallions.\nTransfer vegetables to a large plate to cool and season with salt and pepper.\nSalad can be made 1 day ahead and chilled, covered.",
        "ingredients": [
            "4 ears fresh corn, shucked",
            "2 tablespoons extra-virgin olive oil",
            "Salt and freshly ground black pepper",
            "2 garlic cloves, minced",
            "1 1/2 tablespoons balsamic vinegar",
            "1 pound cherry tomatoes, halved",
            "2 bunches scallion greens, coarsely chopped to yield 1/2 cup"
        ],
        "step_by_step_instructions": [
            "Cut kernels from 1 ear of fresh corn, discarding the cob.",
            "Heat 0.5 tbsp of extra-virgin olive oil in a large heavy skillet over moderately high heat until hot but not smoking.",
            "Saute the corn, seasoning with salt and pepper to taste, stirring, until tender, about 4 minutes.",
            "Add 0.5 clove of minced garlic and saute, stirring, for 1 minute.",
            "Add 0.25 tbsp of balsamic vinegar and cook, stirring, until most is evaporated, about 1 minute.",
            "Add 4 ounces of halved cherry tomatoes and cook, gently stirring, for 1 minute.",
            "Remove skillet from heat and stir in 2 tbsp of coarsely chopped scallion greens.",
            "Transfer vegetables to a large plate to cool and season with salt and pepper to taste."
        ],
        "processed_ingredients": [
            "1 ear fresh corn",
            "0.5 tbsp extra-virgin olive oil",
            "0.5 clove garlic",
            "0.25 tbsp balsamic vinegar",
            "4 oz cherry tomatoes",
            "2 tbsp scallion greens",
            "Salt",
            "Black pepper"
        ],
        "pure_ingredients": [
            "corn",
            "olive oil",
            "salt",
            "black pepper",
            "garlic",
            "balsamic vinegar",
            "cherry tomatoes",
            "scallion"
        ],
        "cooking_time": "7 minutes",
        "required_tools": [
            "cutting board",
            "knife",
            "large heavy skillet",
            "stirring spoon",
            "large plate"
        ]
    },
    {
        "recipe_id": "Q8WgqTvUUrWuIidcQe23ZoLPzTyL7Ey",
        "recipe_title": "Roasted Root Vegetable Pasta Salad",
        "original_instructions": "Watch how to make this recipe.\nIn a small bowl whisk together the oil, vinegar, mustard, and salt and pepper, to taste.\nAdd the pasta and the leftover root vegetables to a large serving bowl. Stir in the parsley and the sliced red onion. Toss with the vinaigrette and refrigerate to let the flavors develop, about 1 hour.",
        "ingredients": [
            "2 tablespoons canola oil",
            "1 tablespoon cider vinegar",
            "1 tablespoon spicy brown mustard",
            "Salt and freshly ground black pepper",
            "8 ounces penne pasta, cooked and cooled",
            "2 to 3 cups leftover Roasted Root Vegetable Salad recipe, roughly chopped",
            "1 tablespoon chopped fresh parsley leaves",
            "1 medium onion, sliced"
        ],
        "step_by_step_instructions": [
            "In a small bowl, whisk together approximately 0.50 tablespoons of canola oil, 0.25 tablespoons of cider vinegar, 0.25 tablespoons of spicy brown mustard, and salt and pepper to taste.",
            "Add about 2 ounces of cooked and cooled penne pasta and roughly 0.50 cups of leftover roasted root vegetables to a large serving bowl.",
            "Stir in approximately 0.25 tablespoons of chopped fresh parsley leaves and 0.25 of a medium onion, sliced.",
            "Toss everything with the prepared vinaigrette.",
            "Refrigerate the salad to let the flavors develop for about 1 hour."
        ],
        "processed_ingredients": [
            "0.50 tablespoon canola oil",
            "0.25 tablespoon cider vinegar",
            "0.25 tablespoon spicy brown mustard",
            "2.00 ounce penne pasta",
            "0.50 cup roasted root vegetables",
            "0.25 tablespoon parsley leaves",
            "0.25 medium onion"
        ],
        "pure_ingredients": [
            "canola oil",
            "cider vinegar",
            "mustard",
            "salt",
            "black pepper",
            "penne pasta",
            "root vegetables",
            "parsley",
            "onion"
        ],
        "cooking_time": "1 hour",
        "required_tools": [
            "small bowl",
            "whisk",
            "large serving bowl",
            "refrigerator"
        ]
    },
    {
        "recipe_id": "kvmWbE3QSJn8zeHwRrDXNTqGXuVXM/e",
        "recipe_title": "Breakfast Tacos with Chorizo, Egg and Potato",
        "original_instructions": "For the pico de gallo: Mix together the tomatoes, lime juice, cilantro, garlic, avocados and onions in a medium bowl. Sprinkle with salt and black pepper. Cover and chill.\nFor the tacos: Heat the oil in a large skillet over medium-high heat. Saute the chorizo until cooked through, breaking up with back of wooden spoon, about 5 minutes. Transfer the chorizo to a paper-towel-lined-plate. Add the potatoes and cook, covered, stirring occasionally until soft, 6 to 8 minutes. Sprinkle with salt and pepper. Transfer to a paper-towel-lined-plate. Whisk the eggs and sprinkle with salt and pepper in a medium bowl. Add the eggs to the same skillet and cook over medium heat, stirring until the eggs are softly set, 1 to 2 minutes. Return the chorizo and potatoes to the skillet and toss with the eggs to warm through and finish cooking the eggs. Toast the tortillas in a small skillet over medium-high heat, topping each tortilla evenly with the cheese, until the cheese melts and the tortillas begin to crisp on the bottom, about 1 minute. Transfer to a platter. Put 1/2 cup of the egg and chorizo mixture in each tortilla and top with 1 tablespoon of the pico de gallo. Reserve any leftover pico de gallo for another use. Fold each tortilla in half and serve with the sour cream and hot sauce.",
        "ingredients": [
            "8 ounces plum tomatoes, seeded and chopped (about 3 tomatoes)",
            "3 tablespoons lime juice (2 to 3 limes)",
            "2 tablespoons fresh cilantro leaves, chopped",
            "1 clove garlic, minced",
            "1/2 ripe avocado, halved, pitted and chopped",
            "Kosher salt and cracked black pepper",
            "1/4 medium red onion, chopped",
            "Kosher salt and freshly cracked pepper",
            "1 tablespoon vegetable oil",
            "8 ounces fresh Mexican-style chorizo sausage, casing removed (about 6 links)",
            "4 ounces new potatoes, peeled and diced into 1/2-inch cubes (about 2 medium)",
            "6 large eggs",
            "Four 6-inch flour tortillas",
            "1 cup white Cheddar, grated",
            "1/4 cup sour cream or crema",
            "Hot sauce, for serving"
        ],
        "step_by_step_instructions": [
            "Mix together approximately 1.33 ounces of chopped plum tomatoes, 0.5 tablespoons of lime juice, 0.33 tablespoons of chopped fresh cilantro leaves, 0.17 cloves of minced garlic, 0.08 ripe avocado, and 0.04 medium red onion in a bowl. Sprinkle with salt and black pepper. Cover and chill.",
            "Heat 0.17 tablespoons of vegetable oil in a skillet over medium-high heat. Saute about 1.33 ounces of chorizo until cooked through, breaking up with a spoon, for about 5 minutes. Transfer to a paper-towel-lined plate.",
            "Add approximately 0.67 ounces of diced potatoes to the skillet and cook, covered, stirring occasionally until soft, 6 to 8 minutes. Sprinkle with salt and pepper. Transfer to a paper-towel-lined plate.",
            "Whisk 1 egg and sprinkle with salt and pepper in a bowl.",
            "Add the egg to the same skillet and cook over medium heat, stirring until the egg is softly set, 1 to 2 minutes.",
            "Return the chorizo and potatoes to the skillet and toss with the egg to warm through and finish cooking.",
            "Toast 1 tortilla in a small skillet over medium-high heat, topping with 0.25 cups of grated cheese, until the cheese melts and the tortilla begins to crisp on the bottom, about 1 minute. Transfer to a platter.",
            "Put approximately 0.5 cups of the egg and chorizo mixture in the tortilla and top with 0.25 tablespoons of the pico de gallo. Fold the tortilla in half and serve with 1 tablespoon of sour cream and hot sauce."
        ],
        "processed_ingredients": [
            "1.33 oz plum tomatoes",
            "0.5 tbsp lime juice",
            "0.33 tbsp fresh cilantro leaves",
            "0.17 clove garlic",
            "0.08 ripe avocado",
            "0.04 medium red onion",
            "0.17 tbsp vegetable oil",
            "1.33 oz fresh Mexican-style chorizo sausage",
            "0.67 oz new potatoes",
            "1 large egg",
            "1 6-inch flour tortilla",
            "0.25 cup white Cheddar",
            "1 tbsp sour cream",
            "varied amount hot sauce",
            "varied amount salt",
            "varied amount black pepper"
        ],
        "pure_ingredients": [
            "tomatoes",
            "lime",
            "cilantro",
            "garlic",
            "avocado",
            "salt",
            "pepper",
            "onion",
            "vegetable oil",
            "chorizo sausage",
            "potatoes",
            "egg",
            "tortilla",
            "cheddar",
            "sour cream",
            "hot sauce"
        ],
        "cooking_time": "17 minutes",
        "required_tools": [
            "skillet",
            "wooden spoon",
            "bowl",
            "paper-towel-lined plate",
            "platter"
        ]
    },
    {
        "recipe_id": "W2Qc1u1vpX.VxMI1bpo7FuM4E82P/66",
        "recipe_title": "Duck and Sausage Gumbo with Brown and White Rice ",
        "original_instructions": "To prepare the gumbo: Prick duck skin all over with tip of a knife. In a heavy skillet brown kielbasa and duck in batches over moderately high heat, transferring as browned to paper towels to drain. Combine kielbasa and duck with broth and water in a 6-gallon kettle and bring to a simmer.\nPrick duck skin all over with tip of a knife. In a heavy skillet brown kielbasa and duck in batches over moderately high heat, transferring as browned to paper towels to drain. Combine kielbasa and duck with broth and water in a 6-gallon kettle and bring to a simmer.\nPour off all but 1/4 cup fat from skillet. Add flour and cook roux over moderately low heat, stirring constantly, until a shade darker than peanut butter, about 30 minutes. Add onions, celery, and bell peppers and cook, stirring occasionally, until vegetables are crisp-tender. Add vegetable mixture to kettle and stir until roux is dissolved. Simmer gumbo, uncovered, 2 hours and let cool completely. Bone duck, discarding skin and bones. Chill gumbo overnight. Gumbo may be made 2 days in advance and kept covered and chilled. Discard fat on surface and reheat gumbo with cayenne, scallions, and salt to taste over moderate heat.\nPour off all but 1/4 cup fat from skillet. Add flour and cook roux over moderately low heat, stirring constantly, until a shade darker than peanut butter, about 30 minutes. Add onions, celery, and bell peppers and cook, stirring occasionally, until vegetables are crisp-tender. Add vegetable mixture to kettle and stir until roux is dissolved.\nSimmer gumbo, uncovered, 2 hours and let cool completely. Bone duck, discarding skin and bones. Chill gumbo overnight. Gumbo may be made 2 days in advance and kept covered and chilled. Discard fat on surface and reheat gumbo with cayenne, scallions, and salt to taste over moderate heat.\nTo prepare the rice: To a kettle of boiling salted water add brown rice, stirring, and boil 15 minutes. Drain rice in a large colander and rinse. Put colander over a kettle of boiling water and steam brown rice, covered with a kitchen towel and a lid, until fluffy and dry, about 25 minutes. Cook white rice in same manner, boiling 10 minutes and steaming 15 minutes. In a bowl toss brown and white rice together. Rice may be made 3 days in advance and kept chilled in resealable plastic bags. Steam rice to reheat.\nTo a kettle of boiling salted water add brown rice, stirring, and boil 15 minutes. Drain rice in a large colander and rinse. Put colander over a kettle of boiling water and steam brown rice, covered with a kitchen towel and a lid, until fluffy and dry, about 25 minutes. Cook white rice in same manner, boiling 10 minutes and steaming 15 minutes. In a bowl toss brown and white rice together. Rice may be made 3 days in advance and kept chilled in resealable plastic bags. Steam rice to reheat.\nServe gumbo over rice.\nServe gumbo over rice.",
        "ingredients": [
            "two 5 1/2-pound ducks, excess fat discarded and ducks cut into serving pieces",
            "2 pounds kielbasa (Polish smoked sausage), cut into 1/4-inch-thick rounds)",
            "12 cups chicken broth",
            "6 cups water",
            "1/3 cup all-purpose flour",
            "2 onions, chopped",
            "2 celery ribs, chopped",
            "1 red bell pepper, chopped",
            "1 green bell pepper, chopped",
            "1 teaspoon cayenne, or to taste",
            "2 cups thinly sliced scallion greens",
            "1 1/2 cups long-grain brown rice",
            "1 1/2 cups long-grain white rice"
        ],
        "step_by_step_instructions": [
            "Prick about 1/8 of a duck skin all over with the tip of a knife.",
            "In a heavy skillet, brown approximately 3.2 ounces of kielbasa and 1/8 of the duck in batches over moderately high heat, transferring as browned to paper towels to drain.",
            "Combine the browned kielbasa and duck with about 1.5 cups of broth and 0.75 cups of water in a kettle and bring to a simmer.",
            "Pour off all but 1/4 cup fat from the skillet.",
            "Add 0.5 tablespoons of flour and cook the roux over moderately low heat, stirring constantly, until a shade darker than peanut butter, about 30 minutes.",
            "Add approximately 0.25 of an onion, 0.25 of a celery rib, and 1/16 of a red bell pepper and green bell pepper each, and cook, stirring occasionally, until vegetables are crisp-tender.",
            "Add the vegetable mixture to the kettle and stir until the roux is dissolved.",
            "Simmer the gumbo, uncovered, for 2 hours and let it cool completely.",
            "Bone the portion of duck, discarding skin and bones.",
            "Chill the gumbo overnight.",
            "Discard fat on the surface and reheat gumbo with 0.125 teaspoon of cayenne, 0.25 cup of scallions, and salt to taste over moderate heat.",
            "To prepare the rice, add approximately 0.1875 cups of brown rice to a kettle of boiling salted water, stirring, and boil for 15 minutes.",
            "Drain the brown rice in a large colander and rinse.",
            "Put the colander over a kettle of boiling water and steam brown rice, covered with a kitchen towel and a lid, until fluffy and dry, about 25 minutes.",
            "Cook the same portion of white rice in the same manner, boiling for 10 minutes and steaming for 15 minutes.",
            "In a bowl, toss the steamed brown and white rice together.",
            "Serve the gumbo over the rice."
        ],
        "processed_ingredients": [
            "0.69 lb duck",
            "3.20 oz kielbasa",
            "1.50 cup chicken broth",
            "0.75 cup water",
            "0.50 tbsp all-purpose flour",
            "0.25 onion",
            "0.25 celery rib",
            "0.06 red bell pepper",
            "0.06 green bell pepper",
            "0.13 tsp cayenne",
            "0.25 cup scallion greens",
            "0.19 cup long-grain brown rice",
            "0.19 cup long-grain white rice"
        ],
        "pure_ingredients": [
            "duck",
            "kielbasa",
            "chicken broth",
            "water",
            "flour",
            "onion",
            "celery",
            "red bell pepper",
            "green bell pepper",
            "cayenne",
            "scallion",
            "brown rice",
            "white rice",
            "salt"
        ],
        "cooking_time": "3 hours",
        "required_tools": [
            "knife",
            "heavy skillet",
            "paper towels",
            "kettle",
            "colander",
            "kitchen towel",
            "lid",
            "bowl"
        ]
    },
    {
        "recipe_id": "yju.QZa.TIB.AYiUhMXFy4m3xCqHG/u",
        "recipe_title": "Deep-Fried Cheese Squares",
        "original_instructions": "In a heavy 3 to 4-quart saucepan melt the butter over moderate heat. When the foam begins to subside, stir in 3/4 cup of the flour and mix well. Add the milk in a stream whisking constantly. Cook over high heat until the sauce comes to a boil and thickens. Simmer for another 10 minutes on low heat, whisking often.\nTake the pan off the heat and beat in the egg yolks, one at a time, using a wooden spoon. Season with the salt and pepper. Add the grated cheese and mix well. Pour into a greased baking dish (8 by 6-inches) and spread into a 1/2-inch thick layer. Use a spatula to smooth the top. Allow to cool to room temperature, cover with plastic wrap, and refrigerate for 8 hours, or overnight, until firm.\nUsing a pastry wheel or a sharp knife, cut the mixture into 2-inch squares and transfer them to a sheet of waxed paper. Dredge each square into the remaining flour and coat completely. Shake off excess flour and dip into the egg wash, followed by the bread crumbs. Pat the square gently with a spatula to help the crumbs adhere. Repeat with all the squares and place them on a baking sheet. Refrigerate for at least 1 hour, until the coating is firm.\nIn a deep fryer or heavy saucepan, heat 2 to 3-inches of oil until it reaches 375 degrees. Preheat the oven to its lowest temperature. Line a baking dish with paper towels and set in the middle of the oven.\nDeep-fry the squares 3 or 4 at a time, turning them with a slotted spoon for about 5 minutes, until golden brown on both sides. As they brown, transfer them to a baking dish in the oven to keep them warm while you deep-fry the rest. Serve at once as a first course or an accompaniment to the drinks.",
        "ingredients": [
            "4 tablespoons unsalted butter",
            "1 1/4 cups all-purpose flour",
            "1 1/2 cups milk",
            "3 egg yolks",
            "1 teaspoon salt",
            "1/8 teaspoon white pepper",
            "1 cup freshly grated imported Swiss Gruyere cheese (about 1/4 pound)",
            "1 cup freshly grated imported Swiss Emmentaler cheese (about 1/4 pound)",
            "2 eggs beaten together with 1/3 cup milk",
            "1 cup dried bread crumbs",
            "Vegetable oil for deep frying"
        ],
        "step_by_step_instructions": [
            "Melt 0.67 tablespoons of butter in a heavy saucepan over moderate heat.",
            "Stir in 0.21 cups of all-purpose flour and mix well.",
            "Add 0.25 cups of milk in a stream, whisking constantly.",
            "Cook over high heat until the sauce comes to a boil and thickens.",
            "Simmer for another 10 minutes on low heat, whisking often.",
            "Take the pan off the heat and beat in 1 egg yolk, using a wooden spoon.",
            "Season with 0.17 teaspoons of salt and 0.02 teaspoons of white pepper.",
            "Add 0.13 cups of freshly grated Gruyere cheese and 0.13 cups of freshly grated Emmentaler cheese, then mix well.",
            "Pour the mixture into a greased baking dish, spreading into a 0.5-inch thick layer.",
            "Allow to cool to room temperature, cover with plastic wrap, and refrigerate for 8 hours or overnight until firm.",
            "Cut the mixture into 2-inch squares using a pastry wheel or sharp knife.",
            "Dredge each square into 0.04 cups of flour, then shake off excess.",
            "Dip into an egg wash made from 0.33 eggs beaten together with 0.06 cups of milk.",
            "Coat with 0.17 cups of dried bread crumbs, patting gently with a spatula to help the crumbs adhere.",
            "Refrigerate the coated squares for at least 1 hour until the coating is firm.",
            "Heat 2 to 3 inches of vegetable oil in a deep fryer or heavy saucepan until it reaches 375 degrees.",
            "Preheat the oven to its lowest temperature and line a baking dish with paper towels.",
            "Deep-fry the squares, 3 or 4 at a time, turning them with a slotted spoon for about 5 minutes until golden brown on both sides.",
            "Transfer browned squares to the baking dish in the oven to keep warm while frying the rest.",
            "Serve immediately as a first course or an accompaniment to drinks."
        ],
        "processed_ingredients": [
            "0.67 tablespoon unsalted butter",
            "0.25 cup all-purpose flour",
            "0.25 cup milk",
            "1 egg yolk",
            "0.17 teaspoon salt",
            "0.02 teaspoon white pepper",
            "0.13 cup freshly grated Gruyere cheese",
            "0.13 cup freshly grated Emmentaler cheese",
            "0.33 egg",
            "0.06 cup milk",
            "0.17 cup dried bread crumbs",
            "2 to 3 inches vegetable oil"
        ],
        "pure_ingredients": [
            "butter",
            "flour",
            "milk",
            "egg yolk",
            "salt",
            "pepper",
            "grated cheese",
            "egg",
            "bread crumbs",
            "oil"
        ],
        "cooking_time": "9 hours",
        "required_tools": [
            "saucepan",
            "whisk",
            "wooden spoon",
            "baking dish",
            "plastic wrap",
            "pastry wheel",
            "knife",
            "spatula",
            "deep fryer",
            "slotted spoon",
            "oven",
            "paper towels"
        ]
    },
    {
        "recipe_id": "Ok.FW3yxRBGWvOrcEpcAkd5CBxn3fGi",
        "recipe_title": "Shrimp and Dumpling Stir-Fry",
        "original_instructions": "Heat 1 tablespoon vegetable oil in a large nonstick skillet over medium-high heat. Add the dumplings in a single layer. Cook until browned, 2 to 3 minutes per side. Add 1/4 cup water to the skillet. Cook, stirring occasionally, until evaporated, about 1 minute; transfer the dumplings to a bowl.\nHeat 1 tablespoon vegetable oil in the skillet. Add the vegetables and cook, stirring occasionally, until crisp-tender and lightly browned, 8 to 10 minutes; transfer to the bowl with the dumplings.\nHeat the remaining 1 tablespoon vegetable oil in the skillet. Add the shrimp, ginger and garlic. Cook, stirring occasionally, until the shrimp are just cooked through, about 2 minutes. Return the dumplings and vegetables to the skillet and stir to combine. Add the chili sauce and soy sauce; cook, stirring gently, until glazed, about 1 minute. Remove from the heat and stir in the rice vinegar and half of the scallions. Top with the remaining scallions.",
        "ingredients": [
            "3 tablespoons vegetable oil",
            "1 13-ounce package frozen vegetable dumplings",
            "1 18-ounce bag mixed fresh stir-fry vegetables, large pieces halved (about 6 cups)",
            "1 pound medium shrimp, peeled and deveined",
            "1 tablespoon finely chopped peeled ginger",
            "2 cloves garlic, thinly sliced",
            "1/3 cup sweet Thai chili sauce",
            "2 tablespoons low-sodium soy sauce",
            "1 tablespoon rice vinegar",
            "2 scallions, sliced"
        ],
        "step_by_step_instructions": [
            "Heat 0.33 tablespoon vegetable oil in a large nonstick skillet over medium-high heat.",
            "Add approximately 3.25 ounces of dumplings in a single layer. Cook until browned, about 2 to 3 minutes per side.",
            "Add 1 tablespoon of water to the skillet. Cook, stirring occasionally, until evaporated, about 1 minute; transfer the dumplings to a bowl.",
            "Heat 0.33 tablespoon vegetable oil in the skillet. Add approximately 1.5 cups of mixed vegetables and cook, stirring occasionally, until crisp-tender and lightly browned, about 8 to 10 minutes; transfer to the bowl with the dumplings.",
            "Heat the remaining 0.33 tablespoon vegetable oil in the skillet. Add about 0.25 pound of shrimp, 0.17 tablespoon finely chopped ginger, and 0.33 clove garlic. Cook, stirring occasionally, until the shrimp are just cooked through, about 2 minutes.",
            "Return the dumplings and vegetables to the skillet and stir to combine.",
            "Add 1.33 tablespoons of sweet Thai chili sauce and 0.67 tablespoon of soy sauce; cook, stirring gently, until glazed, about 1 minute.",
            "Remove from the heat and stir in 0.33 tablespoon of rice vinegar and half of 0.33 scallion. Top with the remaining scallion."
        ],
        "processed_ingredients": [
            "1 tablespoon vegetable oil",
            "3.25 ounce vegetable dumplings",
            "1.5 cup mixed vegetables",
            "0.25 lb shrimp",
            "0.17 tablespoon ginger",
            "0.33 clove garlic",
            "1.33 tablespoon sweet Thai chili sauce",
            "0.67 tablespoon soy sauce",
            "0.33 tablespoon rice vinegar",
            "0.33 scallion"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "dumplings",
            "vegetables",
            "shrimp",
            "ginger",
            "garlic",
            "chili sauce",
            "soy sauce",
            "vinegar",
            "scallions"
        ],
        "cooking_time": "26 minutes",
        "required_tools": [
            "large nonstick skillet",
            "bowl",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "3bEerEEZAd3iaBwq4/gIsoAX2QpvW.q",
        "recipe_title": "Swordfish Milanese",
        "original_instructions": "Watch how to make this recipe.\nPlace the panko in a pie dish. In another pie dish, beat the eggs to blend. Line a large cutting board with plastic wrap. Place 2 swordfish steaks on plastic wrap, about 2 inches apart. Place another sheet of plastic wrap over the steaks. Using the flat side of a meat mallet or a heavy rolling pin, gently flatten the swordfish steaks to 1/4-inch thick. Remove top plastic wrap and sprinkle the swordfish with salt and pepper on both sides. Set aside the swordfish steaks and flatten and season remaining 2 steaks, using the plastic wrap to help again. Dip each steak into the egg, then the panko, coating completely and patting to adhere.\nWorking in batches, melt 2 tablespoons of butter with 2 tablespoon of light olive oil in a heavy large frying pan over medium-high heat. Place 2 coated swordfish steaks in pan and cook until brown and crisp and just cooked through in the middle, about 1 1/2 minutes per side. Transfer to a cooling rack set on a baking sheet and lightly tent with foil to keep warm (do not seal with foil or the breading will become soggy). Repeat with the remaining butter, olive oil, and 2 swordfish steaks.\nWhisk the lemon juice and extra-virgin olive oil in a large bowl to blend. Add the arugula and watercress, and toss lightly to coat. Season the salad, to taste, with salt and pepper. Transfer the swordfish steaks to plates. Top with the salad and serve.",
        "ingredients": [
            "1 1/2 cups panko (Japanese bread crumbs)",
            "3 large eggs",
            "4 (5-ounce) swordfish steaks, each about 1/2-inch-thick",
            "Salt and freshly ground black pepper",
            "4 tablespoons unsalted butter",
            "4 tablespoons light olive oil",
            "1 lemon, juiced",
            "2 tablespoons extra-virgin olive oil",
            "3 cups lightly packed arugula",
            "1 bunch watercress, stemmed"
        ],
        "step_by_step_instructions": [
            "Place approximately 0.38 cups of panko in a pie dish.",
            "In another pie dish, beat 0.75 large eggs to blend.",
            "Line a large cutting board with plastic wrap. Place 1 swordfish steak on plastic wrap, about 2 inches apart. Place another sheet of plastic wrap over the steak.",
            "Using the flat side of a meat mallet or a heavy rolling pin, gently flatten the swordfish steak to 1/4-inch thick.",
            "Remove top plastic wrap and sprinkle the swordfish with salt and pepper on both sides.",
            "Dip the steak into the egg, then the panko, coating completely and patting to adhere.",
            "Melt 0.5 tablespoons of butter with 0.5 tablespoons of light olive oil in a heavy large frying pan over medium-high heat.",
            "Place the coated swordfish steak in the pan and cook until brown and crisp and just cooked through in the middle, about 1.5 minutes per side.",
            "Transfer to a cooling rack set on a baking sheet and lightly tent with foil to keep warm (do not seal with foil or the breading will become soggy).",
            "Whisk approximately 0.25 of a lemon's juice and 0.5 tablespoons of extra-virgin olive oil in a large bowl to blend.",
            "Add approximately 0.75 cups of arugula and 0.25 bunch of watercress, and toss lightly to coat.",
            "Season the salad, to taste, with salt and pepper.",
            "Transfer the swordfish steak to a plate. Top with the salad and serve."
        ],
        "processed_ingredients": [
            "0.38 cups panko",
            "0.75 large eggs",
            "1 steak swordfish",
            "0.5 tablespoons unsalted butter",
            "0.5 tablespoons light olive oil",
            "0.25 lemon",
            "0.5 tablespoons extra-virgin olive oil",
            "0.75 cups arugula",
            "0.25 bunch watercress",
            "Salt",
            "Pepper"
        ],
        "pure_ingredients": [
            "panko",
            "eggs",
            "swordfish",
            "salt",
            "pepper",
            "butter",
            "olive oil",
            "lemon",
            "arugula",
            "watercress"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "pie dish",
            "cutting board",
            "plastic wrap",
            "meat mallet",
            "rolling pin",
            "frying pan",
            "cooling rack",
            "baking sheet",
            "whisk",
            "large bowl"
        ]
    },
    {
        "recipe_id": "d.YNXuTubwX/w76pUqDlRlmxN5Dy9Ya",
        "recipe_title": "Potatoes Rösti ",
        "original_instructions": "Preheat the oven to 400°F/200°C/gas 6. Cut the potatoes into thin matchsticks using a julienne attachment on a mandoline or food processor. Or, cut into thin rounds and use a sharp knife to cut the rounds into strips {more time consuming, but it works!} Heat the butter and olive oil in an 8-in/20-cm ovenproof cast-iron or non-stick frying pan, over medium heat. Add the rosemary to the potatoes, and season with salt and pepper. Increase the heat to medium-high and cook, stirring occasionally, until the potatoes are soft and a few pieces are brown. At this point, the potatoes should have settled into a round flat pancake. Transfer the potatoes in the skillet to the hot oven to bake until the top and bottom are golden and crispy and the center is soft but cooked through, about 30 minutes. Remove from the oven and slide out of the pan onto paper towels/absorbent papers. Slide onto a baking sheet/tray and continue until the top and bottom are cooked to a deep golden brown, about 10 minutes more. Serve in wedges or whole on a plate in the middle of the table for breaking and nibbling.\nPreheat the oven to 400°F/200°C/gas 6.\nCut the potatoes into thin matchsticks using a julienne attachment on a mandoline or food processor. Or, cut into thin rounds and use a sharp knife to cut the rounds into strips {more time consuming, but it works!}\nHeat the butter and olive oil in an 8-in/20-cm ovenproof cast-iron or non-stick frying pan, over medium heat. Add the rosemary to the potatoes, and season with salt and pepper. Increase the heat to medium-high and cook, stirring occasionally, until the potatoes are soft and a few pieces are brown. At this point, the potatoes should have settled into a round flat pancake.\nTransfer the potatoes in the skillet to the hot oven to bake until the top and bottom are golden and crispy and the center is soft but cooked through, about 30 minutes. Remove from the oven and slide out of the pan onto paper towels/absorbent papers. Slide onto a baking sheet/tray and continue until the top and bottom are cooked to a deep golden brown, about 10 minutes more. Serve in wedges or whole on a plate in the middle of the table for breaking and nibbling.",
        "ingredients": [
            "2 medium baking potatoes {Idaho or russet}, peeled {1 1/4 lb/570 g}",
            "2 tbsp unsalted butter",
            "Extra-virgin olive oil",
            "Sea salt",
            "Freshly ground black pepper",
            "2 tbsp rosemary leaves {optional}"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400°F/200°C/gas 6.",
            "Cut 1 medium potato into thin matchsticks using a julienne attachment on a mandoline or food processor.",
            "Heat 1 tablespoon unsalted butter and a small amount of olive oil in an 8-inch ovenproof frying pan over medium heat.",
            "Add 1 tablespoon rosemary leaves to the potatoes if using, and season with a pinch of salt and pepper.",
            "Increase the heat to medium-high and cook, stirring occasionally, until the potatoes are soft and a few pieces are brown.",
            "Allow the potatoes to settle into a round flat pancake.",
            "Transfer the potatoes in the skillet to the hot oven to bake until the top and bottom are golden and crispy and the center is soft but cooked through, about 30 minutes.",
            "Remove from the oven and slide out of the pan onto paper towels to absorb excess oil.",
            "Slide onto a baking sheet and continue cooking until the top and bottom are cooked to a deep golden brown, about 10 minutes more.",
            "Serve in wedges or whole on a plate."
        ],
        "processed_ingredients": [
            "0.62 lb potato",
            "1 tablespoon unsalted butter",
            "5 ml olive oil",
            "1 pinch salt",
            "1 pinch black pepper",
            "1 tablespoon rosemary leaves"
        ],
        "pure_ingredients": [
            "potato",
            "butter",
            "olive oil",
            "salt",
            "black pepper",
            "rosemary"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "oven",
            "mandoline",
            "frying pan",
            "paper towels",
            "baking sheet"
        ]
    },
    {
        "recipe_id": "QE/UyBDA9wvybOCQv4a/ueewtF1wMN6",
        "recipe_title": "Velvety Lemon Chicken Soup ",
        "original_instructions": "With a vegetable peeler remove two 2-inch-long strips zest from lemon and squeeze 1 teaspoon juice into a small cup. In a small saucepan simmer chicken and zest in broth, covered, 20 minutes, or until chicken is just cooked through. Transfer chicken to a bowl and pour broth through a sieve into a 4-cup measuring cup. Chill chicken until it is cool. While chicken is cooling, trim snow peas and cut diagonally into thin slivers. In a 2-quart saucepan heat butter over moderately low heat until foam subsides and stir in flour. Cook roux, stirring constantly, 2 minutes. Add broth and cream in a stream, whisking, and simmer, whisking, 2 minutes, or until soup thickens slightly. Remove pan from heat. When chicken is cool enough to handle, discard skin and bones and cut chicken into thin strips. Add chicken and snow peas to soup and simmer, stirring occasionally, 1 minute, or until peas are crisp-tender. Stir in lemon juice, parsley, and salt and pepper to taste.\nWith a vegetable peeler remove two 2-inch-long strips zest from lemon and squeeze 1 teaspoon juice into a small cup. In a small saucepan simmer chicken and zest in broth, covered, 20 minutes, or until chicken is just cooked through. Transfer chicken to a bowl and pour broth through a sieve into a 4-cup measuring cup. Chill chicken until it is cool.\nWhile chicken is cooling, trim snow peas and cut diagonally into thin slivers. In a 2-quart saucepan heat butter over moderately low heat until foam subsides and stir in flour. Cook roux, stirring constantly, 2 minutes. Add broth and cream in a stream, whisking, and simmer, whisking, 2 minutes, or until soup thickens slightly. Remove pan from heat.\nWhen chicken is cool enough to handle, discard skin and bones and cut chicken into thin strips. Add chicken and snow peas to soup and simmer, stirring occasionally, 1 minute, or until peas are crisp-tender. Stir in lemon juice, parsley, and salt and pepper to taste.",
        "ingredients": [
            "1 lemon",
            "2 chicken breast halves with skin and bones (about 3/4 pound)",
            "2 3/4 cups chicken broth",
            "10 snow pea pods",
            "2 tablespoons unsalted butter",
            "2 tablespoons all-purpose flour",
            "1/4 cup heavy cream",
            "2 tablespoons minced fresh flat-leafed parsley leaves"
        ],
        "step_by_step_instructions": [
            "With a vegetable peeler, remove two 1-inch-long strips of zest from the lemon and squeeze about 1/3 teaspoon of juice into a small cup.",
            "In a small saucepan, simmer 1/2 chicken breast half with zest in about 1 cup of chicken broth, covered, for 20 minutes, or until chicken is just cooked through.",
            "Transfer chicken to a bowl and pour broth through a sieve into a measuring cup. Chill chicken until it is cool.",
            "While chicken is cooling, trim 3 snow pea pods and cut diagonally into thin slivers.",
            "In a 2-quart saucepan, heat 2/3 tablespoon butter over moderately low heat until foam subsides and stir in 2/3 tablespoon flour.",
            "Cook roux, stirring constantly, for 2 minutes.",
            "Add broth and 1 tablespoon of cream in a stream, whisking, and simmer, whisking, for 2 minutes, or until soup thickens slightly. Remove pan from heat.",
            "When chicken is cool enough to handle, discard skin and bones and cut chicken into thin strips.",
            "Add chicken and snow peas to soup and simmer, stirring occasionally, for 1 minute, or until peas are crisp-tender.",
            "Stir in the lemon juice, 2/3 tablespoon of minced parsley, and salt and pepper to taste."
        ],
        "processed_ingredients": [
            "0.33 teaspoon lemon juice",
            "1.5 strips lemon zest",
            "0.38 lb chicken breast",
            "1 cup chicken broth",
            "3 pods snow peas",
            "0.67 tablespoon unsalted butter",
            "0.67 tablespoon all-purpose flour",
            "1 tablespoon heavy cream",
            "0.67 tablespoon fresh parsley leaves"
        ],
        "pure_ingredients": [
            "lemon",
            "chicken",
            "chicken broth",
            "snow peas",
            "butter",
            "flour",
            "cream",
            "parsley",
            "salt",
            "pepper"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "vegetable peeler",
            "small saucepan",
            "bowl",
            "sieve",
            "measuring cup",
            "2-quart saucepan",
            "whisk"
        ]
    },
    {
        "recipe_id": "stJCk2qPFAfkIgbejUhtyRAiaX0mLum",
        "recipe_title": "Creamy Potato Salad",
        "original_instructions": "Place eggs in a medium pan and cover with cold water. Turn heat to medium and cook until the water comes to a rolling boil. Reduce heat and continue cooking for 10 minutes. Remove the eggs and transfer in a bowl of cold water to stop the cooking. When the eggs have cooled, peel them, quarter, and set aside.\nPlace potatoes in a saucepan and cover with cold water. Bring the water to a simmer over medium heat, season with salt, and cook until the potatoes are just tender and easily pierced with a fork. Remove the potatoes from the water and rinse briefly under cool water. Add the carrots to the pot of water and cook until just tender, about 2 minutes. Rinse under cold water to stop the cooking. Slice the potatoes into 1/4-inch thick rounds and place in a large bowl along with the carrots. Add the celery, radishes, and red onion and stir to combine.\nCombine the buttermilk, sour cream, and mustard in a small bowl. Add to the bowl with the potato mixture and toss until potatoes and vegetables are coated. Refrigerate for at least 2 hours so that flavors blend. Before serving, season with salt and pepper, to taste. Fold in the watercress and dill and top with quartered eggs. Serve chilled or bring to room temperature before serving.",
        "ingredients": [
            "2 large eggs",
            "1 pound small red potatoes",
            "Salt and black pepper",
            "1 medium carrot, quartered lengthwise and thinly sliced",
            "2 stalks celery, diced",
            "1 bunch radishes, thinly sliced",
            "1/2 medium red onion, diced",
            "1/4 cup buttermilk",
            "1 cup light sour cream",
            "1 tablespoon whole-grain Dijon mustard",
            "1/2 cup watercress leaves",
            "1 tablespoon coarsely chopped fresh dill"
        ],
        "step_by_step_instructions": [
            "Place 0.33 eggs in a medium pan and cover with cold water.",
            "Turn heat to medium and cook until the water comes to a rolling boil.",
            "Reduce heat and continue cooking for 10 minutes.",
            "Remove the eggs and transfer in a bowl of cold water to stop the cooking.",
            "When the eggs have cooled, peel them, quarter, and set aside.",
            "Place 0.17 pounds of potatoes in a saucepan and cover with cold water.",
            "Bring the water to a simmer over medium heat, season with salt, and cook until the potatoes are just tender and easily pierced with a fork.",
            "Remove the potatoes from the water and rinse briefly under cool water.",
            "Add 0.08 carrots to the pot of water and cook until just tender, about 2 minutes.",
            "Rinse under cold water to stop the cooking.",
            "Slice the potatoes into 1/4-inch thick rounds and place in a large bowl along with the carrots.",
            "Add 0.33 stalks of celery, 0.17 bunches of radishes, and 0.08 red onions and stir to combine.",
            "Combine 0.08 cups of buttermilk, 0.33 cups of sour cream, and 0.08 tablespoons of mustard in a small bowl.",
            "Add to the bowl with the potato mixture and toss until potatoes and vegetables are coated.",
            "Refrigerate for at least 2 hours so that flavors blend.",
            "Before serving, season with salt and pepper, to taste.",
            "Fold in 0.17 cups of watercress and 0.08 tablespoons of dill and top with quartered eggs.",
            "Serve chilled or bring to room temperature before serving."
        ],
        "processed_ingredients": [
            "0.33 eggs",
            "0.17 lb potatoes",
            "salt",
            "black pepper",
            "0.08 carrots",
            "0.33 stalks celery",
            "0.17 bunches radishes",
            "0.08 red onions",
            "0.08 cup buttermilk",
            "0.33 cup sour cream",
            "0.08 tbsp mustard",
            "0.17 cup watercress",
            "0.08 tbsp dill"
        ],
        "pure_ingredients": [
            "eggs",
            "potatoes",
            "salt",
            "black pepper",
            "carrot",
            "celery",
            "radishes",
            "red onion",
            "buttermilk",
            "sour cream",
            "mustard",
            "watercress",
            "dill"
        ],
        "cooking_time": "132 minutes",
        "required_tools": [
            "medium pan",
            "saucepan",
            "bowl",
            "fork",
            "knife"
        ]
    },
    {
        "recipe_id": "Dq0LbYcUZuZv9/EbIsMOMvbdL1uGdTO",
        "recipe_title": "Buckwheat Bacon Pancakes ",
        "original_instructions": "Preheat oven to 200°F. Stir together flours, sugar, baking powder, baking soda, and salt. Add egg, buttermilk, and 2 tablespoons oil and stir just until blended. Stir in bacon. Heat a griddle or large heavy skillet over moderate heat until hot, then lightly brush with remaining 1/2 tablespoon oil. Working in batches and using a scant 1/4 cup per pancake, pour batter onto griddle and cook, turning over once, until golden, about 4 minutes total per batch. Keep warm, covered, in oven.\nPreheat oven to 200°F.\nStir together flours, sugar, baking powder, baking soda, and salt. Add egg, buttermilk, and 2 tablespoons oil and stir just until blended. Stir in bacon.\nHeat a griddle or large heavy skillet over moderate heat until hot, then lightly brush with remaining 1/2 tablespoon oil. Working in batches and using a scant 1/4 cup per pancake, pour batter onto griddle and cook, turning over once, until golden, about 4 minutes total per batch. Keep warm, covered, in oven.",
        "ingredients": [
            "1/2 cup buckwheat flour",
            "1/2 cup all-purpose flour",
            "1 teaspoon sugar",
            "1 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/4 teaspoon salt",
            "1 large egg, lightly beaten",
            "1 1/4 cups well-shaken buttermilk",
            "2 1/2 tablespoons vegetable oil",
            "1/4 lb sliced Canadian bacon, cut into 1/8-inch pieces"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 200°F.",
            "In a bowl, stir together 0.06 cup buckwheat flour, 0.06 cup all-purpose flour, 0.12 teaspoon sugar, 0.12 teaspoon baking powder, 0.06 teaspoon baking soda, and a pinch of salt.",
            "Add 0.12 lightly beaten large egg, 0.16 cup buttermilk, and 0.31 tablespoon vegetable oil to the dry ingredients, and stir just until blended.",
            "Stir in about 0.06 lb sliced Canadian bacon, cut into small pieces.",
            "Heat a griddle or large heavy skillet over moderate heat until hot, then lightly brush with 0.06 tablespoon vegetable oil.",
            "Working in batches, use a scant 0.06 cup per pancake, pour batter onto the griddle and cook, turning over once, until golden, about 4 minutes total per batch.",
            "Keep the pancakes warm, covered, in the oven."
        ],
        "processed_ingredients": [
            "0.06 cup buckwheat flour",
            "0.06 cup all-purpose flour",
            "0.12 teaspoon sugar",
            "0.12 teaspoon baking powder",
            "0.06 teaspoon baking soda",
            "0.01 teaspoon salt",
            "0.12 large egg",
            "0.16 cup buttermilk",
            "0.37 tablespoon vegetable oil",
            "0.06 lb Canadian bacon"
        ],
        "pure_ingredients": [
            "buckwheat flour",
            "all-purpose flour",
            "sugar",
            "baking powder",
            "baking soda",
            "salt",
            "egg",
            "buttermilk",
            "vegetable oil",
            "Canadian bacon"
        ],
        "cooking_time": "16 minutes",
        "required_tools": [
            "oven",
            "bowl",
            "griddle",
            "skillet"
        ]
    },
    {
        "recipe_id": "kVmniyBvRX4ovNo/a5BORMCwfBaWX0q",
        "recipe_title": "Make-Ahead Dinner Rolls",
        "original_instructions": "Special equipment: Two 12-cup muffin tins\nWarm 1/4 cup of the milk in a small saucepan over medium-low heat to anywhere between 100 and 115 degrees F. Pour the milk into the bowl of a stand mixer fitted with a hook attachment. Add the sugar and yeast, and let stand until foamy, about 5 minutes. Add the softened butter, half the flour, half the remaining milk and fine salt. Mix on medium-high speed just to incorporate. Add the egg, mix until fully incorporated, then add the remaining flour and milk. Knead with the hook on medium-high speed until the dough is smooth and pulls away from the sides, about 5 minutes (the dough will still be sticky).\nLightly butter a large bowl with some of the melted butter, and turn the dough out into it. Cover with plastic wrap, and let stand in a slightly warm place until doubled in size, about 2 hours.\nLightly butter two 12-cup muffin tins with some of the melted butter. Punch the dough down. Divide it into 24 even pieces, and roll them into rough balls. Roll each ball in the melted butter to coat, letting the excess drip off, and plop it into a muffin cup. Cover lightly with plastic wrap, and let rise in the refrigerator at least 8 hours and up to 1 day.\nPosition oven racks in the lower and upper thirds of the oven, and preheat to 375 degrees F. Remove the tins from the refrigerator, and let stand at room temperature 1 hour (the dough won't puff up significantly). Sprinkle evenly with sea salt, and bake, rotating the tins halfway through, until just lightly golden but still rather pale and almost cooked through, 10 to 15 minutes.\nLet the parbaked rolls cool slightly in the tins, then transfer to cooling racks to cool completely. Pack them in resealable plastic bags, label and date, and freeze for up to 2 weeks.\nTo serve, preheat the oven to 350 degrees F. Bake the frozen rolls on a parchment-lined baking sheet until warmed through and golden brown on top, about 20 minutes. Brush the warm rolls with melted butter.",
        "ingredients": [
            "1 cup whole milk, at room temperature",
            "3 tablespoons sugar",
            "One 1/4-ounce package active dry yeast (about 2 1/4 teaspoons)",
            "6 tablespoons softened unsalted butter, plus 6 tablespoons melted, plus more melted for brushing",
            "3 1/2 cups all-purpose flour",
            "1 teaspoon fine salt",
            "1 large egg, lightly beaten",
            "Flaky sea salt, for sprinkling"
        ],
        "step_by_step_instructions": [
            "Warm 0.06 cup of the milk in a small saucepan over medium-low heat to 100-115 degrees F.",
            "Pour the milk into the bowl of a stand mixer fitted with a hook attachment.",
            "Add 0.38 tablespoon of sugar and 0.28 teaspoon of yeast; let stand until foamy, about 5 minutes.",
            "Add 0.38 tablespoon of softened butter, 0.44 cup of flour, 0.19 cup of remaining milk, and 0.06 teaspoon of fine salt. Mix on medium-high speed to incorporate.",
            "Add 0.04 of a beaten egg and mix until fully incorporated.",
            "Add the remaining 0.44 cup of flour and 0.19 cup of milk.",
            "Knead with the hook on medium-high speed until the dough is smooth and pulls away from the sides, about 5 minutes.",
            "Lightly butter a large bowl with some melted butter and turn the dough out into it.",
            "Cover with plastic wrap and let stand in a slightly warm place until doubled in size, about 2 hours.",
            "Lightly butter two 12-cup muffin tins with some melted butter.",
            "Punch the dough down and divide it into 1 even piece; roll it into a rough ball.",
            "Roll the ball in melted butter to coat, letting the excess drip off, and plop it into a muffin cup.",
            "Cover lightly with plastic wrap and let rise in the refrigerator for at least 8 hours and up to 1 day.",
            "Position oven racks in the lower and upper thirds of the oven and preheat to 375 degrees F.",
            "Remove the tin from the refrigerator and let stand at room temperature for 1 hour.",
            "Sprinkle evenly with sea salt and bake, rotating the tin halfway through, until just lightly golden, about 10 to 15 minutes.",
            "Let the parbaked roll cool slightly in the tin, then transfer to a cooling rack to cool completely.",
            "Pack in a resealable plastic bag, label and date, and freeze for up to 2 weeks.",
            "To serve, preheat the oven to 350 degrees F and bake the frozen roll on a parchment-lined baking sheet until warmed through and golden brown on top, about 20 minutes.",
            "Brush the warm roll with melted butter."
        ],
        "processed_ingredients": [
            "0.06 cup whole milk",
            "0.38 tablespoon sugar",
            "0.28 teaspoon active dry yeast",
            "0.38 tablespoon unsalted butter",
            "0.38 tablespoon melted butter",
            "0.88 cup all-purpose flour",
            "0.06 teaspoon fine salt",
            "0.04 large egg",
            "0.06 teaspoon sea salt"
        ],
        "pure_ingredients": [
            "milk",
            "sugar",
            "yeast",
            "butter",
            "flour",
            "salt",
            "egg"
        ],
        "cooking_time": "1 day",
        "required_tools": [
            "small saucepan",
            "stand mixer",
            "large bowl",
            "plastic wrap",
            "muffin tins",
            "oven",
            "cooling racks",
            "resealable plastic bags",
            "parchment-lined baking sheet"
        ]
    },
    {
        "recipe_id": "u11RPl433eGDP6wTcs9yPxs8U.T/JHO",
        "recipe_title": "Chinatown Char Siu Barbeque Ribs or Pork ",
        "original_instructions": "Combine the marinade ingredients in a bowl and whisk thoroughly. Place the meat in a resealable plastic bag (you may need more than one), add the marinade, seal tightly, and toss to coat. Refrigerate for at least 3 hours or overnight. Heat your cooker to 300°F. (You can also use an indoor oven. Just place the ribs on a wire grate over a pan or on a broiler pan.) If you are using a gas grill, turn off one or two burners and place the meat over the cool burners. If you are using a charcoal grill, set it up by banking the coals against one side for indirect cooking. Remove the ribs from the marinade and cook for about 1 hour; then paint the bone side of the ribs with a coat of the honey or char siu sauce. Cook for 10 minutes, underside up; then turn meat side up, paint with more honey or char siu sauce, and cook for another 10 minutes. Remove the ribs, let them sit for 5 minutes, cut them into individual ribs, and serve hot, garnished with chopped fresh chives.\nCombine the marinade ingredients in a bowl and whisk thoroughly. Place the meat in a resealable plastic bag (you may need more than one), add the marinade, seal tightly, and toss to coat. Refrigerate for at least 3 hours or overnight.\nHeat your cooker to 300°F. (You can also use an indoor oven. Just place the ribs on a wire grate over a pan or on a broiler pan.) If you are using a gas grill, turn off one or two burners and place the meat over the cool burners. If you are using a charcoal grill, set it up by banking the coals against one side for indirect cooking. Remove the ribs from the marinade and cook for about 1 hour; then paint the bone side of the ribs with a coat of the honey or char siu sauce. Cook for 10 minutes, underside up; then turn meat side up, paint with more honey or char siu sauce, and cook for another 10 minutes. Remove the ribs, let them sit for 5 minutes, cut them into individual ribs, and serve hot, garnished with chopped fresh chives.",
        "ingredients": [
            "1/2 cup hoisin sauce",
            "1/2 cup brandy, rum, or bourbon",
            "1/4 cup honey",
            "1/4 cup soy sauce",
            "2 tablespoons dark sesame oil",
            "2 tablespoons hot sauce, such as Asian chile sauce or Tabasco",
            "2 tablespoons ground ginger or minced fresh ginger",
            "2 teaspoons garlic powder or minced fresh garlic",
            "2 teaspoons Chinese five-spice powder",
            "2 tablespoons onion powder",
            "2 teaspoons red food coloring",
            "2 slabs baby back ribs, cut in half lengthwise through all the bones",
            "1/4 cup honey or char siu sauce",
            "Chopped fresh chives, for garnish"
        ],
        "step_by_step_instructions": [
            "Combine 0.06 cup hoisin sauce, 0.06 cup brandy, 0.03 cup honey, 0.03 cup soy sauce, 0.38 tablespoon dark sesame oil, 0.38 tablespoon hot sauce, 0.38 tablespoon ground ginger, 0.25 teaspoon garlic powder, 0.25 teaspoon Chinese five-spice powder, 0.38 tablespoon onion powder, and 0.25 teaspoon red food coloring in a bowl and whisk thoroughly.",
            "Place approximately 0.25 slab of baby back ribs in a resealable plastic bag, add the marinade, seal tightly, and toss to coat.",
            "Refrigerate for at least 3 hours.",
            "Heat your cooker to 300°F.",
            "Remove the ribs from the marinade and cook for about 1 hour.",
            "Paint the bone side of the ribs with 0.03 cup of honey.",
            "Cook for 10 minutes, underside up.",
            "Turn meat side up, paint with more honey, and cook for another 10 minutes.",
            "Remove the ribs, let them sit for 5 minutes.",
            "Cut them into individual ribs and serve hot, garnished with 0.25 tablespoon chopped fresh chives."
        ],
        "processed_ingredients": [
            "0.06 cup hoisin sauce",
            "0.06 cup brandy",
            "0.03 cup honey",
            "0.03 cup soy sauce",
            "0.38 tablespoon dark sesame oil",
            "0.38 tablespoon hot sauce",
            "0.38 tablespoon ground ginger",
            "0.25 teaspoon garlic powder",
            "0.25 teaspoon Chinese five-spice powder",
            "0.38 tablespoon onion powder",
            "0.25 teaspoon red food coloring",
            "0.25 slab baby back ribs",
            "0.03 cup honey",
            "0.25 tablespoon chopped fresh chives"
        ],
        "pure_ingredients": [
            "hoisin sauce",
            "brandy",
            "honey",
            "soy sauce",
            "sesame oil",
            "hot sauce",
            "ginger",
            "garlic",
            "five-spice powder",
            "onion powder",
            "food coloring",
            "baby back ribs",
            "chives"
        ],
        "cooking_time": "4 hours",
        "required_tools": [
            "bowl",
            "whisk",
            "resealable plastic bag",
            "refrigerator",
            "cooker",
            "brush",
            "knife"
        ]
    },
    {
        "recipe_id": "IS6fhTh1oG40ZBCLRKKJya/fSGCxbVm",
        "recipe_title": "Sunny's Cheesesteak",
        "original_instructions": "Watch how to make this recipe.\nPlace flank steak, red wine vinegar, zest lime juice, cilantro, hot sauce, Worcestershire, salt and ground black pepper in a large plastic bag. Marinate for 1 hour in the refrigerator. Remove flank steak and pat dry. Place in freezer for 1 hour.\nMeanwhile, prepare the sauce: Melt butter over medium heat-high heat in a sauce pot. Add flour, chipotle and adobo sauce, stir to combine. Add heavy cream slowly, stirring well with each addition to incorporate. Add cheese and stir until melted. Keep over low heat while finishing sandwich.\nRemove flank steak from freezer and slice on the bias against the grain into 1/4-inch thick pieces. Heat 1 tablespoon of oil in a cast iron griddle or skillet, and saute the red peppers until they blacken around the edges, and soften, about 8 minutes. Remove from griddle and turn heat to medium-high, add more oil if necessary and sear steak in batches, about 2 minutes.\nTo assemble the sandwiches: Cut bread loaves in half, leaving 1 side attached. Layer on avocado slices, top with flank steak, red pepper, and cilantro. Drizzle with chipotle cheese sauce and serve immediately.",
        "ingredients": [
            "1 pound flank steak",
            "1/2 cup red wine vinegar",
            "1 lime, zested and juiced",
            "1/4 cup chopped cilantro leaves",
            "1 tablespoon hot sauce",
            "1 teaspoon Worcestershire sauce",
            "1 teaspoon salt",
            "1/2 teaspoon fresh ground black pepper",
            "2 tablespoons unsalted butter",
            "3 tablespoons all-purpose flour",
            "2 chipotle chiles in adobo (canned), chopped",
            "1 tablespoon adobo sauce (from chipotle can)",
            "1 1/2 cups heavy cream",
            "1 cup processed grated Cheddar",
            "1 tablespoon vegetable oil, plus more if needed for steak",
            "1 red bell pepper, cut into strips",
            "4 hoagie rolls",
            "1 avocado, pitted and flesh sliced 1/4-inch thick",
            "1 cup cilantro leaves"
        ],
        "step_by_step_instructions": [
            "Marinate 4 ounces of flank steak with 2 tablespoons of red wine vinegar, juice and zest of 0.25 lime, 1 tablespoon of chopped cilantro, 0.25 teaspoon of hot sauce, 0.25 teaspoon of Worcestershire sauce, 0.25 teaspoon of salt, and 0.125 teaspoon of black pepper in a large plastic bag. Place in the refrigerator for 1 hour.",
            "Remove the flank steak from the refrigerator and pat dry. Place in the freezer for 1 hour.",
            "While the steak is in the freezer, melt 0.5 tablespoon of unsalted butter in a sauce pot over medium-high heat.",
            "Add 0.75 tablespoon of all-purpose flour, 0.5 chopped chipotle chile in adobo, and 0.25 tablespoon of adobo sauce to the pot, stirring to combine.",
            "Slowly add 0.375 cup of heavy cream, stirring well with each addition to incorporate.",
            "Add 0.25 cup of processed grated Cheddar cheese and stir until melted. Keep the sauce over low heat.",
            "Remove the flank steak from the freezer and slice on the bias against the grain into 0.25-inch thick pieces.",
            "Heat 0.25 tablespoon of vegetable oil in a cast iron griddle or skillet over medium-high heat.",
            "Sauté 0.25 red bell pepper, cut into strips, until blackened around the edges and softened, about 8 minutes. Remove from the griddle.",
            "Add more oil if necessary and sear the steak slices in batches, about 2 minutes per batch.",
            "Cut 1 hoagie roll in half, leaving 1 side attached.",
            "Layer 0.25 avocado, sliced 0.25-inch thick, onto the hoagie roll.",
            "Top with the seared flank steak slices, sautéed red pepper strips, and 0.25 cup of cilantro leaves.",
            "Drizzle with the prepared chipotle cheese sauce and serve immediately."
        ],
        "processed_ingredients": [
            "4.00 oz flank steak",
            "2.00 tbsp red wine vinegar",
            "0.25 lime",
            "1.00 tbsp cilantro leaves",
            "0.25 tsp hot sauce",
            "0.25 tsp Worcestershire sauce",
            "0.25 tsp salt",
            "0.13 tsp black pepper",
            "0.50 tbsp unsalted butter",
            "0.75 tbsp all-purpose flour",
            "0.50 chipotle chile in adobo",
            "0.25 tbsp adobo sauce",
            "0.38 cup heavy cream",
            "0.25 cup processed grated Cheddar",
            "0.25 tbsp vegetable oil",
            "0.25 red bell pepper",
            "1.00 hoagie roll",
            "0.25 avocado",
            "0.25 cup cilantro leaves"
        ],
        "pure_ingredients": [
            "flank steak",
            "red wine vinegar",
            "lime",
            "cilantro",
            "hot sauce",
            "Worcestershire sauce",
            "salt",
            "black pepper",
            "butter",
            "flour",
            "chipotle chile",
            "adobo sauce",
            "heavy cream",
            "Cheddar",
            "vegetable oil",
            "red bell pepper",
            "hoagie roll",
            "avocado"
        ],
        "cooking_time": "3 hours",
        "required_tools": [
            "large plastic bag",
            "refrigerator",
            "freezer",
            "sauce pot",
            "cast iron griddle or skillet"
        ]
    },
    {
        "recipe_id": "Dl4tE.sNdv0G4dY4NiS9pfCuTzgKIoG",
        "recipe_title": "Funnel Cakes",
        "original_instructions": "Special equipment: A deep-fry thermometer and plastic piping bags\nAdd the oil to a deep pot and heat it over medium-high heat until it registers 375 degrees F on a deep-fry thermometer. Set up a work surface with 4 or 5 plastic piping bags, scissors, tongs, parchment paper, and a wire rack with parchment paper underneath.\nIn a big bowl, whisk the flour, baking powder, salt, cinnamon, and granulated sugar. Add the eggs and milk and whisk well. Get all the lumps out!\nFill all the piping bags with batter. Cut the tip off one bag and drizzle the batter straight into the hot oil in a swirly, crazy pattern. Toss the piping bag. When one side is golden brown, about 75 seconds, carefully flip the funnel cake with tongs and fry the other side, another 75 seconds. Fry the rest of the batter.\nDrain the funnel cakes on the wire rack. While they're still warm and shiny, dust them with powdered sugar using a wire-mesh strainer. Serve immediately!",
        "ingredients": [
            "1 quart vegetable oil",
            "3 cups all-purpose flour",
            "2 teaspoons baking powder",
            "1 teaspoon kosher salt",
            "1 teaspoon ground cinnamon",
            "1/2 cup granulated sugar",
            "3 extra-large eggs",
            "2 cups milk or cream",
            "2 cups powdered sugar"
        ],
        "step_by_step_instructions": [
            "Add about 3.75 oz (or approximately 111 ml) of vegetable oil to a deep pot and heat it over medium-high heat until it registers 375 degrees F on a deep-fry thermometer.",
            "Set up a work surface with 1 plastic piping bag, scissors, tongs, parchment paper, and a wire rack with parchment paper underneath.",
            "In a bowl, whisk together 0.38 cup of all-purpose flour, 0.25 teaspoon of baking powder, 0.13 teaspoon of salt, 0.13 teaspoon of ground cinnamon, and 0.06 cup of granulated sugar.",
            "Add 0.38 of an extra-large egg (approximately 20 g) and 0.25 cup of milk to the mixture and whisk well to remove all lumps.",
            "Fill the piping bag with batter. Cut the tip off the bag and drizzle the batter straight into the hot oil in a swirly, crazy pattern.",
            "Toss the piping bag. When one side of the funnel cake is golden brown, about 75 seconds, carefully flip it with tongs and fry the other side for another 75 seconds.",
            "Drain the funnel cake on the wire rack. While it's still warm and shiny, dust it with approximately 0.25 cup of powdered sugar using a wire-mesh strainer.",
            "Serve immediately!"
        ],
        "processed_ingredients": [
            "3.75 oz vegetable oil",
            "0.38 cup all-purpose flour",
            "0.25 teaspoon baking powder",
            "0.13 teaspoon salt",
            "0.13 teaspoon ground cinnamon",
            "0.06 cup granulated sugar",
            "0.38 egg",
            "0.25 cup milk",
            "0.25 cup powdered sugar"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "flour",
            "baking powder",
            "salt",
            "cinnamon",
            "sugar",
            "egg",
            "milk",
            "powdered sugar"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "deep-fry thermometer",
            "plastic piping bag",
            "scissors",
            "tongs",
            "parchment paper",
            "wire rack",
            "wire-mesh strainer"
        ]
    },
    {
        "recipe_id": "gW7MgJdUvs.vfvyfXMNGmvDWm7kEsFm",
        "recipe_title": "Robiolo Pizza",
        "original_instructions": "Whisk together the yeast and 1/4 cup of the water in a small bowl and let sit for 5 minutes to proof. Place 1 3/4 cups of the flour in a large bowl with 1 1/2 teaspoons salt. Add the yeast mixture, the remaining water and oil and stir until combined. Transfer the dough to a floured surface and knead until smooth. Grease a large bowl with the remaining oil, add the dough and turn to coat. Cover and place in a warm place until doubled in volume, about 1 to 1 1/2 hours.\nPreheat the grill to high. Once the dough has risen, divide it in half, and then divide each half into 2 balls. Roll each ball into an 8-inch circle. Brush with oil and grill on both sides until golden brown. Remove from grill and slice each in half horizontally.\nSpread bottom halves of pizza with 3 ounces of the robiolo cheese and 2 ounces of the mozzarella. Season with salt and pepper. Place the tops on and heat on the grill for 30 seconds. Remove from the grill and drizzle each pizza top with a few teaspoons of white truffle oil. Slice into wedges and serve immediately.",
        "ingredients": [
            "1 (1/4-ounce) package active dry yeast (2 1/4 teaspoons)",
            "3/4 cup warm water (105 to 115 degrees F)",
            "1 3/4 to 2 cups unbleached all-purpose flour plus additional for kneading and dredging",
            "Salt and pepper",
            "2 teaspoons olive oil, plus 1 teaspoon for greasing the bowl",
            "12 ounces robiolo cheese, at room temperature",
            "8 ounces buffalo mozzarella, thinly sliced",
            "White truffle oil"
        ],
        "step_by_step_instructions": [
            "Whisk together 0.56 teaspoons of active dry yeast and 0.06 cups of warm water in a small bowl and let sit for 5 minutes to proof.",
            "Place 0.44 cups of unbleached all-purpose flour in a large bowl with 0.38 teaspoons of salt.",
            "Add the yeast mixture, 0.19 cups of remaining water, and 0.5 teaspoons of olive oil and stir until combined.",
            "Transfer the dough to a floured surface and knead until smooth.",
            "Grease a large bowl with 0.25 teaspoons of olive oil, add the dough and turn to coat.",
            "Cover and place in a warm place until doubled in volume, about 1 to 1.5 hours.",
            "Preheat the grill to high.",
            "Once the dough has risen, divide it in half, and then divide each half into 2 balls.",
            "Roll one ball into an 8-inch circle.",
            "Brush with oil and grill on both sides until golden brown.",
            "Remove from grill and slice in half horizontally.",
            "Spread the bottom half with 0.75 ounces of robiolo cheese and 0.5 ounces of buffalo mozzarella.",
            "Season with salt and pepper.",
            "Place the top on and heat on the grill for 30 seconds.",
            "Remove from the grill and drizzle with a few teaspoons of white truffle oil.",
            "Slice into wedges and serve immediately."
        ],
        "processed_ingredients": [
            "0.56 tsp active dry yeast",
            "0.06 cup warm water",
            "0.44 cup unbleached all-purpose flour",
            "0.38 tsp salt",
            "0.50 tsp olive oil",
            "0.25 tsp olive oil",
            "0.75 oz robiolo cheese",
            "0.50 oz buffalo mozzarella",
            "0.13 tsp white truffle oil"
        ],
        "pure_ingredients": [
            "yeast",
            "water",
            "flour",
            "salt",
            "pepper",
            "olive oil",
            "robiolo cheese",
            "mozzarella",
            "truffle oil"
        ],
        "cooking_time": "2 hours",
        "required_tools": [
            "whisk",
            "small bowl",
            "large bowl",
            "grill",
            "knife",
            "brush"
        ]
    },
    {
        "recipe_id": "MC84pl1YB.AFycZsfspRJmmhrMMYpf2",
        "recipe_title": "Spicy Honey-Mustard Chicken",
        "original_instructions": "To make the honey mustard: Whisk the mustard, honey, mayonnaise, and hot sauce together in a medium bowl. To make the chicken: Preheat the oven to 400 degrees F. Rinse the chicken and pat dry. If using 2 large breasts, then place the chicken breasts on a cutting board and halve them horizontally so you end up with 4 pieces of even thickness (if using chicken cutlets, skip this step). If the chicken pieces are thicker than 1/2 inch, place a large sheet of plastic wrap on a cutting board and set 1 piece of chicken on top. Cover with another sheet of plastic wrap and then pound the chicken to a 1/2-inch thickness using a meat mallet or a heavy-bottomed pot. Season the chicken with 1/2 teaspoon of the salt and 1/4 teaspoon of the pepper. Add the chicken to the bowl with the mustard mixture and turn to coat. In a second medium bowl, stir together the bread crumbs, thyme, remaining 1/4 teaspoon salt, and remaining 1/4 teaspoon pepper. Dredge each piece of chicken through the bread crumbs, gently pressing the crumbs into each side. Place a metal cooling rack on top of a baking sheet, and mist the rack with spray. Spray each piece of chicken on both sides and set it on the rack. Bake the chicken until golden brown and cooked through, 25 to 30 minutes. Serve hot. Per serving: Calories 213; Total Fat 6g; Protein 24g; Dietary Fiber 2g; Sugars 3g",
        "ingredients": [
            "1 pound boneless, skinless chicken breasts (about 2 large chicken breasts) or 4 4-ounce chicken cutlets",
            "3/4 teaspoon kosher salt",
            "1/2 teaspoon ground black pepper",
            "1 cup whole wheat bread crumbs",
            "1/2 teaspoon dried thyme",
            "Olive oil mister or nonstick pan spray",
            "1/4 cup Dijon mustard",
            "2 teaspoons honey",
            "1 tablespoon light mayonnaise",
            "1/4 to 1/2 teaspoon hot sauce (such as Frank's or Tabasco)"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Rinse 1 piece of chicken cutlet (4 ounces) and pat dry.",
            "Place the chicken on a cutting board; if thicker than 1/2 inch, cover with plastic wrap and pound to 1/2 inch thickness.",
            "Season the chicken with 0.13 teaspoon of salt and 0.06 teaspoon of pepper.",
            "In a medium bowl, whisk together 1 tablespoon of Dijon mustard, 0.50 teaspoon of honey, 0.25 tablespoon of light mayonnaise, and 0.06 teaspoon of hot sauce.",
            "Add the chicken to the mustard mixture and turn to coat.",
            "In another bowl, mix 0.25 cup of whole wheat bread crumbs, 0.13 teaspoon of dried thyme, 0.06 teaspoon of salt, and 0.06 teaspoon of pepper.",
            "Dredge the chicken in the bread crumbs, pressing gently to ensure coverage.",
            "Place a metal cooling rack on a baking sheet, mist with nonstick spray.",
            "Spray the chicken on both sides with nonstick spray and place on the rack.",
            "Bake in the oven for 25 to 30 minutes until golden brown and cooked through."
        ],
        "processed_ingredients": [
            "4.00 oz chicken breast",
            "0.13 tsp salt",
            "0.06 tsp black pepper",
            "0.25 cup whole wheat bread crumbs",
            "0.13 tsp dried thyme",
            "1.00 tbsp Dijon mustard",
            "0.50 tsp honey",
            "0.25 tbsp light mayonnaise",
            "0.06 tsp hot sauce"
        ],
        "pure_ingredients": [
            "chicken",
            "salt",
            "black pepper",
            "whole wheat bread crumbs",
            "thyme",
            "olive oil",
            "mustard",
            "honey",
            "mayonnaise",
            "hot sauce"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "oven",
            "cutting board",
            "plastic wrap",
            "meat mallet",
            "bowl",
            "whisk",
            "baking sheet",
            "metal cooling rack",
            "nonstick spray"
        ]
    },
    {
        "recipe_id": "4K/tSo/XmDnV3QM/.QouBUTCxdYx.06",
        "recipe_title": "Roast Beef and Avocado Finger Sandwiches ",
        "original_instructions": "In small bowl, mash avocado with fork. Stir in lemon juice, chives, salt, and pepper. Spread avocado mash over 6 slices bread, dividing evenly. Spread other 6 slices bread with about 1 teaspoon each mayonnaise. Top with roast beef, dividing evenly. Gently press avocado-topped bread slices, avocado sides down, onto each sandwich. Using long serrated knife, trim off crusts and cut each sandwich lengthwise into thirds.\nIn small bowl, mash avocado with fork. Stir in lemon juice, chives, salt, and pepper. Spread avocado mash over 6 slices bread, dividing evenly.\nSpread other 6 slices bread with about 1 teaspoon each mayonnaise. Top with roast beef, dividing evenly. Gently press avocado-topped bread slices, avocado sides down, onto each sandwich.\nUsing long serrated knife, trim off crusts and cut each sandwich lengthwise into thirds.\nTransportation tips: Transfer the sandwiches to a covered plastic container to transport them to the picnic, and then simply pass around the container to serve. To keep the bread from drying out, when stacking the sandwiches in the container, lay a sturdy, barely moistened paper towel between each layer and another one over the top.\nTransfer the sandwiches to a covered plastic container to transport them to the picnic, and then simply pass around the container to serve. To keep the bread from drying out, when stacking the sandwiches in the container, lay a sturdy, barely moistened paper towel between each layer and another one over the top.",
        "ingredients": [
            "1 medium ripe California avocado (preferably Hass)",
            "1 tablespoon fresh lemon juice",
            "1 tablespoon fresh chives, minced",
            "1/2 teaspoon kosher salt",
            "1/8 teaspoon freshly ground black pepper",
            "12 very thin slices white sandwich bread",
            "2 tablespoons mayonnaise",
            "1/2 pound purchased or premade thinly sliced rare roast beef"
        ],
        "step_by_step_instructions": [
            "In a small bowl, mash about 0.08 cup of avocado with a fork.",
            "Stir in 0.5 teaspoon lemon juice, 0.5 teaspoon minced chives, 0.08 teaspoon kosher salt, and a pinch of black pepper.",
            "Spread the avocado mixture over 1 slice of bread.",
            "Spread 1 teaspoon of mayonnaise on another slice of bread.",
            "Top the mayonnaise-spread bread with approximately 1.33 ounces of roast beef.",
            "Gently press the avocado-topped bread, avocado side down, onto the roast beef.",
            "Using a long serrated knife, trim off the crusts and cut the sandwich lengthwise into thirds."
        ],
        "processed_ingredients": [
            "0.08 cup avocado",
            "0.5 teaspoon lemon juice",
            "0.5 teaspoon chives",
            "0.08 teaspoon kosher salt",
            "0.03 teaspoon black pepper",
            "2 slices bread",
            "1 teaspoon mayonnaise",
            "1.33 ounce roast beef"
        ],
        "pure_ingredients": [
            "avocado",
            "lemon juice",
            "chives",
            "salt",
            "black pepper",
            "bread",
            "mayonnaise",
            "roast beef"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "bowl",
            "fork",
            "knife"
        ]
    },
    {
        "recipe_id": "qiYfPBQfOBcBXvOAXcFDeRcPlJ6ejx6",
        "recipe_title": "Kale Sandwiches with Avocado ",
        "original_instructions": "In a small jar, combine 2 tablespoons oil, vinegar, mustard, thyme and 1/4 cup water; season with salt and pepper. Cover and shake until well combined. Stack kale leaves and roll into a cigar shape. Slice into thin strips; turn 90 degrees and slice again crosswise until you have what looks like kale confetti. Toss in a bowl with vinaigrette. In a food processor, blend beans, garlic and salt to taste for less than a minute. Add remaining 2 tablespoons oil slowly through the feed tube, blending, until mixture is smooth. Stir in Parmesan. Spread 1 slice whole-grain bread with 1/4 bean spread; top with 1/4 kale, 1/4 avocado and another bread slice. Repeat with remaining bread, spread, kale and avocado.\nIn a small jar, combine 2 tablespoons oil, vinegar, mustard, thyme and 1/4 cup water; season with salt and pepper. Cover and shake until well combined.\nStack kale leaves and roll into a cigar shape. Slice into thin strips; turn 90 degrees and slice again crosswise until you have what looks like kale confetti. Toss in a bowl with vinaigrette.\nIn a food processor, blend beans, garlic and salt to taste for less than a minute. Add remaining 2 tablespoons oil slowly through the feed tube, blending, until mixture is smooth. Stir in Parmesan.\nSpread 1 slice whole-grain bread with 1/4 bean spread; top with 1/4 kale, 1/4 avocado and another bread slice. Repeat with remaining bread, spread, kale and avocado.",
        "ingredients": [
            "4 tablespoons olive oil, divided",
            "1/4 cup balsamic vinegar",
            "2 tablespoons Dijon mustard",
            "1/2 teaspoons dried thyme or tarragon",
            "1 pound kale, stems and center ribs discarded",
            "1 cup canned fava, garbanzo or cannellini beans, drained and rinsed",
            "1 garlic clove",
            "1/4 cup grated Parmesan",
            "8 slices whole-grain bread",
            "1 ripe avocado, sliced"
        ],
        "step_by_step_instructions": [
            "Combine 0.5 tablespoon oil, 0.5 tablespoon balsamic vinegar, 0.25 tablespoon Dijon mustard, and 0.06 teaspoon dried thyme in a small jar.",
            "Add 0.06 cup water, season with salt and pepper, cover, and shake until well combined.",
            "Stack 0.25 pound kale leaves, roll into a cigar shape, and slice into thin strips.",
            "Turn 90 degrees and slice again crosswise until you have kale confetti.",
            "Toss the kale in a bowl with the vinaigrette.",
            "In a food processor, blend 0.25 cup canned beans and 0.25 small garlic clove with salt to taste for less than a minute.",
            "Add 0.5 tablespoon oil slowly through the feed tube, blending until the mixture is smooth.",
            "Stir in 0.06 cup grated Parmesan.",
            "Spread 1/8 of the bean spread on 1 slice of whole-grain bread.",
            "Top with 1/8 of the kale mixture and 1/8 of the sliced avocado.",
            "Cover with another slice of whole-grain bread."
        ],
        "processed_ingredients": [
            "1.00 tablespoon olive oil",
            "0.50 tablespoon balsamic vinegar",
            "0.25 tablespoon Dijon mustard",
            "0.06 teaspoon dried thyme",
            "0.25 pound kale",
            "0.25 cup canned beans",
            "0.25 small garlic clove",
            "0.06 cup grated Parmesan",
            "2.00 slices whole-grain bread",
            "0.13 ripe avocado"
        ],
        "pure_ingredients": [
            "olive oil",
            "balsamic vinegar",
            "mustard",
            "thyme",
            "kale",
            "beans",
            "garlic",
            "Parmesan",
            "bread",
            "avocado",
            "salt",
            "pepper",
            "water"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "small jar",
            "knife",
            "bowl",
            "food processor"
        ]
    },
    {
        "recipe_id": "c5.qM/TVrLRqYaUVQ5lppTWs0nw3Uu.",
        "recipe_title": "Black Bean and Butternut Squash Tacos",
        "original_instructions": "Warm the refried beans gently over low heat. Cut the butternut squash in half crosswise at the narrowest point. Cut each half in half again lengthwise. Peel each section with a vegetable peeler or a flexible sharp knife. Use a teaspoon to scrape out the seeds and strings. Cut into 1/2- inch dice. Heat large nonstick skillet over high heat. Add olive oil. When it smokes, add squash cubes and toss well. Sprinkle with 1 teaspoon salt, cinnamon, cumin and black pepper. Saute over high heat, tossing frequently, until browned outside and tender but not mushy inside, about 10 minutes.\nTo serve, heat tortillas quickly one by one in a very hot dry skillet, about 10 seconds per side. Assemble tacos by spooning in black beans, topping with Sauteed squash, sliced pickled shallots, cilantro sprigs, diced Serranos, and cream. Roll up and serve 2 per person.\nCombine the vinegar, wine, brown sugar, peppercorns, mustard, chile flakes, and salt in a medium saucepan. Stir over low heat until the sugar is dissolved. Add the shallots and bring to a boil. Reduce to a simmer and cook 5 minutes. Set aside to cool completely in the liquid.\nTransfer the shallots and all their liquid to a jar or plastic container. Cover tightly and store in the refrigerator up to two weeks.",
        "ingredients": [
            "1 1/2 cups refried black beans",
            "1 small butternut squash",
            "2 tablespoons olive oil",
            "1 teaspoon salt",
            "1/2 teaspoon ground cinnamon",
            "1 teaspoon ground cumin",
            "1/2 teaspoon freshly ground black pepper",
            "8 soft corn tortillas",
            "Pickled shallots (see recipe below)",
            "Cilantro sprigs for serving",
            "3 Serrano chiles, seeds removed if desired, diced",
            "Crema, creme fraiche or sour cream for serving",
            "1 cup red wine vinegar",
            "1 cup dry red wine",
            "1/2 cup packed brown sugar",
            "2 tablespoons black peppercorns",
            "1 tablespoons mustard seeds",
            "2 teaspoons red pepper flakes",
            "2 teaspoons coarse salt",
            "20 medium shallots, peeled"
        ],
        "step_by_step_instructions": [
            "Warm 0.19 cups of refried black beans gently over low heat.",
            "Cut the small butternut squash in half crosswise at the narrowest point. Cut each half in half again lengthwise.",
            "Peel each section with a vegetable peeler or a flexible sharp knife.",
            "Use a teaspoon to scrape out the seeds and strings.",
            "Cut into 0.5-inch dice.",
            "Heat a large nonstick skillet over high heat.",
            "Add 0.25 tablespoons of olive oil.",
            "When it smokes, add the squash cubes and toss well.",
            "Sprinkle with 0.13 teaspoons salt, 0.06 teaspoons ground cinnamon, 0.13 teaspoons ground cumin, and 0.06 teaspoons freshly ground black pepper.",
            "Saute over high heat, tossing frequently, until browned outside and tender but not mushy inside, about 10 minutes.",
            "To serve, heat 1 soft corn tortilla quickly in a very hot dry skillet, about 10 seconds per side.",
            "Assemble the taco by spooning in the black beans, topping with sauteed squash, and adding pickled shallots, cilantro sprigs, diced Serranos, and a dollop of crema.",
            "Roll up and serve."
        ],
        "processed_ingredients": [
            "0.19 cup refried black beans",
            "0.13 small butternut squash",
            "0.25 tablespoon olive oil",
            "0.13 teaspoon salt",
            "0.06 teaspoon ground cinnamon",
            "0.13 teaspoon ground cumin",
            "0.06 teaspoon freshly ground black pepper",
            "1 soft corn tortilla",
            "0.05 cup pickled shallots",
            "0.25 sprig cilantro",
            "0.38 Serrano chile",
            "0.13 tablespoon crema",
            "0.13 cup red wine vinegar",
            "0.13 cup dry red wine",
            "0.06 cup packed brown sugar",
            "0.25 tablespoon black peppercorns",
            "0.13 tablespoon mustard seeds",
            "0.13 teaspoon red pepper flakes",
            "0.25 teaspoon coarse salt",
            "2 medium shallots"
        ],
        "pure_ingredients": [
            "black beans",
            "butternut squash",
            "olive oil",
            "salt",
            "cinnamon",
            "cumin",
            "black pepper",
            "corn tortillas",
            "shallots",
            "cilantro",
            "Serrano chiles",
            "crema",
            "red wine vinegar",
            "red wine",
            "brown sugar",
            "peppercorns",
            "mustard seeds",
            "red pepper flakes"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "vegetable peeler",
            "sharp knife",
            "teaspoon",
            "large nonstick skillet",
            "measuring spoons",
            "measuring cups",
            "medium saucepan",
            "jar or plastic container"
        ]
    },
    {
        "recipe_id": "/WbkODuxtaeWhIpWtHE2MxF0vg3ZaXC",
        "recipe_title": "Classic Mashed Potatoes ",
        "original_instructions": "Peel the potatoes and rinse under cold water. Cut each into quarters and place in a 3-to 4-quart saucepan. Cover with cold water, partially cover the pot, and bring the water to a boil. Uncover, add the 1 teaspoon of salt, and reduce the heat so the water boils gently. Cook until the potatoes are tender when pierced with a fork, about 10 to 12 minutes. Meanwhile, in a small saucepan, heat the milk and butter together until the butter has melted and the mixture is hot but not boiling. Drain the potatoes and return them to the warm pan over low heat for 1 minute to evaporate any excess water. Use a potato masher, ricer, or food mill to mash the potatoes. Stir the milk and butter mixture into the potatoes, a little at a time, until the potatoes are as soft and moist as you like. Add salt and pepper to taste. Serve immediately, or keep warm in the top of a double boiler, or cover and rewarm in a microwave oven.\nPeel the potatoes and rinse under cold water. Cut each into quarters and place in a 3-to 4-quart saucepan. Cover with cold water, partially cover the pot, and bring the water to a boil. Uncover, add the 1 teaspoon of salt, and reduce the heat so the water boils gently. Cook until the potatoes are tender when pierced with a fork, about 10 to 12 minutes. Meanwhile, in a small saucepan, heat the milk and butter together until the butter has melted and the mixture is hot but not boiling.\nDrain the potatoes and return them to the warm pan over low heat for 1 minute to evaporate any excess water. Use a potato masher, ricer, or food mill to mash the potatoes. Stir the milk and butter mixture into the potatoes, a little at a time, until the potatoes are as soft and moist as you like. Add salt and pepper to taste. Serve immediately, or keep warm in the top of a double boiler, or cover and rewarm in a microwave oven.",
        "ingredients": [
            "4 large russet potatoes (about 2 pounds total)",
            "1 teaspoon salt",
            "3/4 cups milk",
            "6 tablespoons unsalted butter",
            "Freshly ground pepper"
        ],
        "step_by_step_instructions": [
            "Peel 1 large russet potato and rinse under cold water.",
            "Cut it into quarters and place in a 3- to 4-quart saucepan.",
            "Cover with cold water, partially cover the pot, and bring the water to a boil.",
            "Uncover, add 0.25 teaspoon of salt, and reduce the heat so the water boils gently.",
            "Cook until the potato is tender when pierced with a fork, about 10 to 12 minutes.",
            "Meanwhile, in a small saucepan, heat 60 ml of milk and 1.5 tablespoons of butter together until the butter has melted and the mixture is hot but not boiling.",
            "Drain the potato and return it to the warm pan over low heat for 1 minute to evaporate any excess water.",
            "Use a potato masher, ricer, or food mill to mash the potato.",
            "Stir the milk and butter mixture into the potato, a little at a time, until the potato is as soft and moist as you like.",
            "Add salt and pepper to taste.",
            "Serve immediately, or keep warm in the top of a double boiler, or cover and rewarm in a microwave oven."
        ],
        "processed_ingredients": [
            "1 large russet potato",
            "0.25 teaspoon salt",
            "60 ml milk",
            "1.5 tablespoons unsalted butter",
            "0.25 teaspoon freshly ground pepper"
        ],
        "pure_ingredients": [
            "potato",
            "salt",
            "milk",
            "butter",
            "pepper"
        ],
        "cooking_time": "22 minutes",
        "required_tools": [
            "saucepan",
            "small saucepan",
            "potato masher",
            "fork",
            "double boiler",
            "microwave oven"
        ]
    },
    {
        "recipe_id": "So8YMGk/6BGHzFROvJgovp.G6vzmQJO",
        "recipe_title": "Rosa's Biscuits ",
        "original_instructions": "Preheat oven to 350°. Whisk flour, sugar, baking powder, and 1 1/2 teaspoons salt in a large bowl. Add chilled butter and toss to coat. Work butter into flour mixture with your fingers until mixture resembles coarse meal with several pea-size pieces of butter remaining. Using a fork, gently mix in buttermilk, then gently knead just until dough comes together (do not overmix). Pinch off pieces of dough and gently roll into 1\" balls; place on 2 parchment-lined baking sheets, spacing 2\" apart (you should have about 24). If butter softens too much while you are working, chill dough until firm before baking, 15–20 minutes. Bake biscuits until golden brown, 25–30 minutes. Brush with melted butter and sprinkle with more salt. Serve warm.\nPreheat oven to 350°. Whisk flour, sugar, baking powder, and 1 1/2 teaspoons salt in a large bowl. Add chilled butter and toss to coat. Work butter into flour mixture with your fingers until mixture resembles coarse meal with several pea-size pieces of butter remaining.\nUsing a fork, gently mix in buttermilk, then gently knead just until dough comes together (do not overmix).\nPinch off pieces of dough and gently roll into 1\" balls; place on 2 parchment-lined baking sheets, spacing 2\" apart (you should have about 24). If butter softens too much while you are working, chill dough until firm before baking, 15–20 minutes.\nBake biscuits until golden brown, 25–30 minutes. Brush with melted butter and sprinkle with more salt. Serve warm.",
        "ingredients": [
            "2 1/2 cups all-purpose flour",
            "3/4 cup sugar",
            "2 1/2 teaspoons baking powder",
            "1 1/2 teaspoons kosher salt, plus more",
            "1 cup (2 sticks) chilled unsalted butter, cut into pieces; plus 6 tablespoons (3/4 stick), melted",
            "3/4 cup chilled buttermilk"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350°.",
            "Whisk 0.10 cups of flour, 0.03 cups of sugar, 0.10 teaspoons of baking powder, and a pinch of salt in a large bowl.",
            "Add 0.04 cups of chilled butter and toss to coat.",
            "Work butter into flour mixture with your fingers until mixture resembles coarse meal with several pea-size pieces of butter remaining.",
            "Using a fork, gently mix in 0.03 cups of buttermilk, then gently knead just until dough comes together (do not overmix).",
            "Pinch off pieces of dough and gently roll into 1\" balls; place on a parchment-lined baking sheet, spacing 2\" apart (you should have about 1).",
            "If butter softens too much while you are working, chill dough until firm before baking, 15–20 minutes.",
            "Bake biscuit until golden brown, 25–30 minutes.",
            "Brush with 0.25 tablespoons of melted butter and sprinkle with more salt.",
            "Serve warm."
        ],
        "processed_ingredients": [
            "0.10 cup all-purpose flour",
            "0.03 cup sugar",
            "0.10 teaspoon baking powder",
            "0.01 teaspoon kosher salt",
            "0.04 cup unsalted butter",
            "0.25 tablespoon unsalted butter",
            "0.03 cup buttermilk"
        ],
        "pure_ingredients": [
            "flour",
            "sugar",
            "baking powder",
            "salt",
            "butter",
            "buttermilk"
        ],
        "cooking_time": "65 minutes",
        "required_tools": [
            "oven",
            "whisk",
            "large bowl",
            "fork",
            "baking sheet",
            "parchment paper",
            "brush"
        ]
    },
    {
        "recipe_id": "NabuFXmaZ9BHnf0MdfI6UDb6gJBaWyW",
        "recipe_title": "Lemon and Herb Chicken with Asparagus and Roasted Red Potatoes for Two",
        "original_instructions": "Preheat the oven to 400 degrees F. Place the potatoes on a baking sheet and drizzle 1 tablespoon olive oil all over the potatoes. Sprinkle the garlic powder and some salt and pepper on top. Toss with your hands to coat all sides of the potatoes with the oil and seasoning. Bake, rotating the pan and flipping the potatoes halfway through, until fork-tender, 20 to 25 minutes.\nMeanwhile, add the remaining teaspoon olive oil to a large skillet over medium-high heat. Sprinkle the Italian seasoning, 1/2 teaspoon salt and 1/4 teaspoon pepper onto the chicken breasts and gently pat it down with your fingers. Add the chicken breasts to the hot skillet and brown on both sides, 3 to 4 minutes per side. Remove from the skillet and reduce the heat to low.\nMelt the butter in the skillet then sprinkle flour on top of the butter. Whisk to cook off the raw flour taste, 1 minute, then carefully add the chicken stock, vigorously whisking. Add the lemon zest and juice. Let cook, whisking occasionally, until thickened, 5 to 7 minutes. Add the asparagus to the pot and cook until the asparagus has softened but is still bright green, about 7 minutes.\nAdd the chicken back into the skillet and cook to ensure it's cooked thoroughly, another 3 minutes. Coat the chicken with sauce from the pan.\nPlace 1 piece of chicken on each of 2 plates, then divide the roasted potatoes between the plates next to the chicken. Place half of the asparagus on each plate and drizzle some sauce on top. Use the juice of the remaining lemon half on top of the dish if you desire more lemon flavor.",
        "ingredients": [
            "5 small red potatoes, rinsed and cut into quarters",
            "1 tablespoon plus 1 teaspoon olive oil",
            "1/2 teaspoon garlic powder",
            "Salt and ground black pepper",
            "1 teaspoon Italian seasoning",
            "1 large chicken breast, sliced in half horizontally to make 2 cutlets",
            "2 tablespoons unsalted butter",
            "2 tablespoons all-purpose flour",
            "1 cup chicken stock",
            "Zest of 1 lemon plus juice of 1/2 a lemon, plus more juice if desired",
            "1/2 pound asparagus, rinsed and cut into thirds"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Place 2.5 small red potatoes on a baking sheet and drizzle 0.5 tablespoon olive oil all over them.",
            "Sprinkle 0.25 teaspoon garlic powder, some salt, and pepper on top of the potatoes.",
            "Toss with your hands to coat all sides of the potatoes with the oil and seasoning.",
            "Bake, rotating the pan and flipping the potatoes halfway through, until fork-tender, approximately 20 to 25 minutes.",
            "Meanwhile, add 0.5 teaspoon olive oil to a large skillet over medium-high heat.",
            "Sprinkle 0.5 teaspoon Italian seasoning, 0.25 teaspoon salt, and 0.125 teaspoon pepper onto half of a large chicken breast and gently pat it down.",
            "Add the chicken breast to the hot skillet and brown on both sides, about 3 to 4 minutes per side.",
            "Remove the chicken from the skillet and reduce the heat to low.",
            "Melt 1 tablespoon unsalted butter in the skillet, then sprinkle 1 tablespoon all-purpose flour on top of the butter.",
            "Whisk to cook off the raw flour taste for 1 minute.",
            "Carefully add 0.5 cup chicken stock, whisking vigorously.",
            "Add the zest of 0.5 lemon and juice of 0.25 a lemon.",
            "Let cook, whisking occasionally, until thickened, about 5 to 7 minutes.",
            "Add 0.25 pound asparagus to the pot and cook until the asparagus has softened but is still bright green, about 7 minutes.",
            "Add the chicken back into the skillet and cook to ensure it's cooked thoroughly, another 3 minutes.",
            "Coat the chicken with sauce from the pan.",
            "Place 1 piece of chicken on a plate, then divide the roasted potatoes onto the plate next to the chicken.",
            "Place half of the asparagus on the plate and drizzle some sauce on top.",
            "Use the juice of the remaining lemon half on top of the dish if desired."
        ],
        "processed_ingredients": [
            "2.5 small red potatoes",
            "0.5 tablespoon olive oil",
            "0.25 teaspoon garlic powder",
            "salt",
            "ground black pepper",
            "0.5 teaspoon Italian seasoning",
            "0.5 large chicken breast",
            "1 tablespoon unsalted butter",
            "1 tablespoon all-purpose flour",
            "0.5 cup chicken stock",
            "zest of 0.5 lemon",
            "juice of 0.25 lemon",
            "0.25 pound asparagus"
        ],
        "pure_ingredients": [
            "red potato",
            "olive oil",
            "garlic powder",
            "salt",
            "black pepper",
            "Italian seasoning",
            "chicken breast",
            "butter",
            "flour",
            "chicken stock",
            "lemon",
            "asparagus"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "large skillet",
            "whisk",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "tZt9iiJAmM172sTvbmRVB.IfcG1.Kt6",
        "recipe_title": "Scallion-Ginger Fried Rice ",
        "original_instructions": "Finely chop enough scallions to measure about 3 cups. Rinse bean sprouts and trim stringy root ends if desired.\nFinely chop enough scallions to measure about 3 cups. Rinse bean sprouts and trim stringy root ends if desired.\nMake seasoning liquid: In a small bowl stir together seasoning liquid ingredients. Spread rice in a shallow baking pan and separate grains with a fork. In a deep 12-inch heavy non-stick skillet heat corn or safflower oil over moderately high heat until hot but not smoking and stir-fry scallions and gingerroot until fragrant, about 20 seconds. Add bean sprouts and rice wine or sake and stir-fry until sprouts begin to soften, about 1 minute. Add rice and cook, stirring frequently, 2 to 3 minutes, or until heated through. Stir seasoning liquid and add to fried rice, tossing to coat evenly.\nIn a small bowl stir together seasoning liquid ingredients.\nSpread rice in a shallow baking pan and separate grains with a fork.\nIn a deep 12-inch heavy non-stick skillet heat corn or safflower oil over moderately high heat until hot but not smoking and stir-fry scallions and gingerroot until fragrant, about 20 seconds. Add bean sprouts and rice wine or sake and stir-fry until sprouts begin to soften, about 1 minute. Add rice and cook, stirring frequently, 2 to 3 minutes, or until heated through. Stir seasoning liquid and add to fried rice, tossing to coat evenly.",
        "ingredients": [
            "3 bunches scallions",
            "2 1/2 cups fresh bean sprouts",
            "3 tablespoons chicken broth",
            "1 tablespoon soy sauce",
            "1 1/2 teaspoons Asian sesame oil",
            "1 1/4 teaspoons salt, or to taste",
            "1/4 teaspoon freshly ground black pepper",
            "5 cups chilledChinese-style white rice",
            "2 tablespoons corn or safflower oil",
            "3 tablespoons minced peeled fresh gingerroot",
            "1/3 cup Chinese rice wine or sake"
        ],
        "step_by_step_instructions": [
            "Finely chop enough scallions to measure about 0.43 cups.",
            "Rinse approximately 0.42 cups of bean sprouts and trim stringy root ends if desired.",
            "In a small bowl, stir together 0.5 tablespoons of chicken broth, 0.17 tablespoons of soy sauce, 0.25 teaspoons of Asian sesame oil, 0.21 teaspoons of salt, and 0.04 teaspoons of freshly ground black pepper to make the seasoning liquid.",
            "Spread about 0.83 cups of chilled Chinese-style white rice in a shallow baking pan and separate grains with a fork.",
            "In a deep 12-inch heavy non-stick skillet, heat 0.33 tablespoons of corn or safflower oil over moderately high heat until hot but not smoking.",
            "Stir-fry the chopped scallions and 0.5 tablespoons of minced peeled fresh gingerroot until fragrant, about 20 seconds.",
            "Add the rinsed bean sprouts and 0.05 cups of Chinese rice wine or sake and stir-fry until sprouts begin to soften, about 1 minute.",
            "Add the separated rice to the skillet and cook, stirring frequently, for 2 to 3 minutes, or until heated through.",
            "Stir the seasoning liquid and add it to the fried rice, tossing to coat evenly."
        ],
        "processed_ingredients": [
            "0.43 cup scallions",
            "0.42 cup bean sprouts",
            "0.5 tbsp chicken broth",
            "0.17 tbsp soy sauce",
            "0.25 tsp Asian sesame oil",
            "0.21 tsp salt",
            "0.04 tsp black pepper",
            "0.83 cup chilled Chinese-style white rice",
            "0.33 tbsp corn oil",
            "0.5 tbsp fresh gingerroot",
            "0.05 cup Chinese rice wine"
        ],
        "pure_ingredients": [
            "scallions",
            "bean sprouts",
            "chicken broth",
            "soy sauce",
            "sesame oil",
            "salt",
            "black pepper",
            "rice",
            "corn oil",
            "gingerroot",
            "rice wine"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "knife",
            "small bowl",
            "shallow baking pan",
            "fork",
            "non-stick skillet"
        ]
    },
    {
        "recipe_id": "FdZKx7vSGTgVa0.jBCJpd4XDJRhed22",
        "recipe_title": "Shrimp with Arugula Pesto Risotto",
        "original_instructions": "To make the pesto combine all of the ingredients into a food processor and blend until a paste is formed and set aside.\nUsing a saucepot, combine the rice and the butter and mix well over medium heat. Cook it stirring until a roasted aroma develops. Add the liquid in several additions, stirring the rice frequently. Cook the risotto until the rice is al dente, and most of the liquid is absorbed, it should take about 20 minutes. The texture should be creamy.\nAdd the pesto to the risotto and mix well. Cook another minute.\nSaute the shrimp in olive oil until pink and tails are curled, about 3 to 5 minutes. To serve, plate the risotto in the center of the plate and top with the shrimp.\nThis recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The FN chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
        "ingredients": [
            "2 cups fresh arugula",
            "1/2 cup parsley leaves",
            "1/4 cup chopped onions",
            "1 tablespoon lemon zest",
            "1/2 cup white wine",
            "1/2 cup olive oil",
            "1 cup Arborio rice",
            "1/2 ounce butter",
            "2 1/2 cups chicken stock, hot",
            "Salt and pepper",
            "1 pound shrimp, peeled and deveined",
            "2 tablespoons olive oil"
        ],
        "step_by_step_instructions": [
            "Combine 0.33 cups of fresh arugula, 0.08 cups of parsley leaves, 0.04 cups of chopped onions, 0.01 tablespoons of lemon zest, 0.08 cups of white wine, and 0.08 cups of olive oil in a food processor and blend until a paste forms. Set aside.",
            "In a saucepot over medium heat, combine 0.17 cups of Arborio rice and 0.02 ounces of butter. Stir until a roasted aroma develops.",
            "Add 0.42 cups of hot chicken stock in several additions, stirring frequently. Cook until the rice is al dente and most liquid is absorbed, about 20 minutes. The texture should be creamy.",
            "Add the pesto to the risotto and mix well. Cook for another minute.",
            "In a pan, sauté 0.17 pounds of shrimp in 0.33 tablespoons of olive oil until pink and tails are curled, about 3 to 5 minutes.",
            "Plate the risotto in the center of the plate and top with the shrimp."
        ],
        "processed_ingredients": [
            "0.33 cup fresh arugula",
            "0.08 cup parsley leaves",
            "0.04 cup chopped onions",
            "0.01 tablespoon lemon zest",
            "0.08 cup white wine",
            "0.08 cup olive oil",
            "0.17 cup Arborio rice",
            "0.02 ounce butter",
            "0.42 cup chicken stock",
            "0.17 pound shrimp",
            "0.33 tablespoon olive oil",
            "Salt",
            "Pepper"
        ],
        "pure_ingredients": [
            "arugula",
            "parsley",
            "onions",
            "lemon",
            "wine",
            "olive oil",
            "Arborio rice",
            "butter",
            "chicken stock",
            "salt",
            "pepper",
            "shrimp"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "food processor",
            "saucepot",
            "pan"
        ]
    }
]