[
    {
        "recipe_id": "IRSuyaeQUXHYoLP0TzoF8FCyC0r/.OC",
        "recipe_title": "Red Wine Roast Chicken (Poulet Roti Au Vin Rouge)",
        "original_instructions": "Mix together the wine, tomato paste, thyme, marjoram, and vinegar. Season the chicken with plenty of salt and pepper, then place in a resealable bag with the wine mixture. Shake the bag to make sure each piece is well coated. Refrigerate for at least 30 minutes, or overnight.\nPlace the potatoes in a saucepan of cold water, cover, and bring to a boil. Boil for 1 to 2 minutes, then drain in a colander.\nPreheat the oven to 400 degrees F. Arrange the onions, carrots, and cooked potatoes in a large baking dish or tray and pour in the water.\nArrange the chicken pieces, skin-side up, in a layer on top of the vegetables in the dish. Pour the marinade over the chicken. Cover with a sheet of parchment or foil and roast for 30 minutes. Remove the parchment and baste the chicken with the cooking liquid. Roast, uncovered, for another 15 minutes, or until the skin is crisp. Serve immediately.",
        "ingredients": [
            "2/3 cup red wine",
            "6 tablespoons tomato paste",
            "3 sprigs thyme, leaves picked",
            "3 sprigs marjoram, leaves picked, or 1/2 teaspoon dried",
            "1/2 cup red wine vinegar",
            "1 whole chicken, cut into 8 pieces (about 3 1/2 pounds)",
            "Salt and freshly ground black pepper",
            "18 ounces baby potatoes, washed",
            "3 onions, quartered",
            "6 carrots, peeled and quartered lengthwise",
            "1/2 cup water"
        ],
        "step_by_step_instructions": [
            "Mix together 2 tablespoons red wine, 1.5 tablespoons tomato paste, a few thyme leaves, a few marjoram leaves, and 1.5 tablespoons red wine vinegar.",
            "Season a single chicken piece with salt and pepper, then place it in a resealable bag with the wine mixture. Shake the bag to coat the chicken piece well. Refrigerate for at least 30 minutes, or overnight.",
            "Place about 2.25 ounces of baby potatoes in a saucepan of cold water, cover, and bring to a boil. Boil for 1 to 2 minutes, then drain in a colander.",
            "Preheat the oven to 400 degrees F.",
            "Arrange about a quarter of an onion, a quarter of a carrot, and the cooked potatoes in a small baking dish or tray and pour in 1 tablespoon of water.",
            "Place the chicken piece, skin-side up, on top of the vegetables in the dish.",
            "Pour the marinade over the chicken.",
            "Cover with a sheet of parchment or foil and roast for 30 minutes.",
            "Remove the parchment and baste the chicken with the cooking liquid.",
            "Roast, uncovered, for another 15 minutes, or until the skin is crisp.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "2.67 tbsp red wine",
            "1.5 tbsp tomato paste",
            "0.17 tsp thyme leaves",
            "0.17 tsp marjoram leaves",
            "1.5 tbsp red wine vinegar",
            "0.44 lb chicken",
            "0.75 g salt",
            "0.25 g black pepper",
            "2.25 oz baby potatoes",
            "0.25 onion",
            "0.25 carrot",
            "1 tbsp water"
        ],
        "pure_ingredients": [
            "red wine",
            "tomato paste",
            "thyme",
            "marjoram",
            "red wine vinegar",
            "chicken",
            "salt",
            "black pepper",
            "potato",
            "onion",
            "carrot",
            "water"
        ],
        "cooking_time": "75 minutes",
        "required_tools": [
            "refrigerator",
            "reusable plastic bag",
            "saucepan",
            "colander",
            "oven",
            "baking dish",
            "parchment",
            "foil"
        ]
    },
    {
        "recipe_id": "jUgDjRhwDcI9L3I7l5o6UA8PwpTtedu",
        "recipe_title": "Bone Marrow Mash",
        "original_instructions": "Preheat the oven to 350 degrees F.\nPlace the bones, cut-side up, onto a baking sheet and cook the marrow until soft and slightly separating from the bone, about 15 minutes.\nMeanwhile, boil salted water for potatoes and let them cook until soft, about 25 minutes.\nRemove the marrow bones and keep aside. Drain the potatoes and add the melted butter and cream. Mash until smooth. Using a spoon, scoop out the marrow with the juices and add to the mash. Add the parsley and season with salt and pepper.",
        "ingredients": [
            "6 center-cut beef marrow bones, about 3-inches long",
            "Salt",
            "6 Yukon gold potatoes, skin on",
            "1/2 cup melted butter",
            "1/2 cup heavy cream",
            "1/2 cup fresh flat-leaf parsley leaves, chopped",
            "Freshly ground pepper"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Place 1 center-cut beef marrow bone, cut-side up, onto a baking sheet and cook the marrow until soft and slightly separating from the bone, about 15 minutes.",
            "Meanwhile, boil salted water for 1 Yukon gold potato and let it cook until soft, about 25 minutes.",
            "Remove the marrow bone and keep aside.",
            "Drain the potato and add 1 tablespoon melted butter and 1 tablespoon heavy cream.",
            "Mash until smooth.",
            "Using a spoon, scoop out the marrow with the juices and add to the mash.",
            "Add 1 tablespoon fresh flat-leaf parsley leaves and season with salt and freshly ground pepper."
        ],
        "processed_ingredients": [
            "1 center-cut beef marrow bone",
            "1 Yukon gold potato",
            "1 tablespoon melted butter",
            "1 tablespoon heavy cream",
            "1 tablespoon fresh flat-leaf parsley leaves",
            "Salt",
            "Freshly ground pepper"
        ],
        "pure_ingredients": [
            "beef marrow bone",
            "salt",
            "potato",
            "butter",
            "cream",
            "parsley",
            "pepper"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "pot",
            "masher",
            "spoon"
        ]
    },
    {
        "recipe_id": "oCy3dcvA5Fu3E58Of3El8gjLnLj89t6",
        "recipe_title": "Shrimp with Tomatoes, Basil, and Garlic",
        "original_instructions": "In a medium bowl, combine the tomatoes and basil. Season with salt and pepper to taste and set aside while you saute the shrimp.\nPut the shrimp in a pie pan and pat them completely dry with a paper towel. Arrange the shrimp so they lay flat and are evenly spaced in the pan.\nHeat a medium skillet over medium heat. Season one side of the shrimp with salt and pepper; add the oil to the pan and turn the heat to high. Invert the pie pan over the skillet so the shrimp fall into the pan all at once.\nSaute the shrimp, undisturbed, until they turn golden brown on the bottom, about 2 minutes. Add the garlic to the pan. Turn the shrimp over with tongs. Turn the heat off and cook the shrimp for 1 minute in the residual heat of the pan. Shake the pan to combine the shrimp with the garlic and then transfer them to the bowl with the tomato mixture. Toss to combine. Serve hot or at room temperature.",
        "ingredients": [
            "1/2 cup quartered vine-ripened grape or cherry tomatoes",
            "2 teaspoons finely chopped fresh basil leaves",
            "Kosher salt and freshly ground black pepper",
            "6 ounces medium-large shrimp, shelled and deveined",
            "2 teaspoons extra-virgin olive oil",
            "1/2 small clove garlic, minced"
        ],
        "step_by_step_instructions": [
            "In a medium bowl, combine 0.25 cup of quartered tomatoes and 1 teaspoon of finely chopped basil. Season with salt and pepper to taste and set aside while you saute the shrimp.",
            "Put 3 ounces of shrimp in a pie pan and pat them completely dry with a paper towel. Arrange the shrimp so they lay flat and are evenly spaced in the pan.",
            "Heat a medium skillet over medium heat. Season one side of the shrimp with salt and pepper; add 1 teaspoon of oil to the pan and turn the heat to high.",
            "Invert the pie pan over the skillet so the shrimp fall into the pan all at once.",
            "Saute the shrimp, undisturbed, until they turn golden brown on the bottom, about 2 minutes.",
            "Add 0.25 small clove of minced garlic to the pan.",
            "Turn the shrimp over with tongs.",
            "Turn the heat off and cook the shrimp for 1 minute in the residual heat of the pan.",
            "Shake the pan to combine the shrimp with the garlic and then transfer them to the bowl with the tomato mixture.",
            "Toss to combine. Serve hot or at room temperature."
        ],
        "processed_ingredients": [
            "0.25 cup tomatoes",
            "1 teaspoon basil leaves",
            "3 ounces shrimp",
            "1 teaspoon olive oil",
            "0.25 clove garlic"
        ],
        "pure_ingredients": [
            "tomatoes",
            "basil",
            "salt",
            "pepper",
            "shrimp",
            "olive oil",
            "garlic"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "medium bowl",
            "pie pan",
            "paper towel",
            "medium skillet",
            "tongs"
        ]
    },
    {
        "recipe_id": "VEDdz7DWJvgRf9IEbnaN1jMB5OTNZvK",
        "recipe_title": "Smoked Fish Chowder",
        "original_instructions": "In a heavy kettle ( at least 5 quarts) cook bacon over moderate heat, stirring, until crisp. Add onions and cook, stirring, until softened. Peel potatoes and cut into 3/4-inch cubes. Add potatoes, celery, broth, and water and simmer, covered, 10 minutes. Add lima beans and corn and simmer, covered, 5 minutes.\nIn a small bowl dissolve cornstarch in half -and-half or milk and stir into simmering soup with Worcestershire sauce. Bring soup to a boil, stirring, and add fish. ( If using smoked trout, no further cooking is necessary; if using finnan haddie or fresh fish, simmer, covered, 5 minutes, or until it just flakes.) Stir in parsley or dill. Soup may be made 2 days ahead (cool uncovered before chilling covered). Reheat gently.",
        "ingredients": [
            "3 slices bacon, chopped",
            "2 medium onions, chopped",
            "1 1/2 pounds russet (baking) potatoes",
            "2 celery ribs, chopped",
            "1 1/2 cups chicken broth",
            "1 1/2 cups water",
            "10 ounce package frozen baby lima beans",
            "10 ounce package frozen corn",
            "2 teaspoons cornstarch",
            "1 1/2 cups half-and-half or milk",
            "1 to 2 teaspoons Worcestershire sauce",
            "1 pound finnan haddie (smoked haddock), cut into 1-inch pieces, or 2 smoked trout, skinned, boned, and flaked into 1-inch pieces, or fresh fillets of cod, haddock, halibut or snapper",
            "3 tablespoons minced fresh parsley leaves or fresh dill"
        ],
        "step_by_step_instructions": [
            "Cook 0.5 sliced bacon (approximately 0.2 oz) in a heavy kettle over moderate heat, stirring, until crisp.",
            "Add 0.25 medium chopped onion (approximately 1 oz) and cook, stirring, until softened.",
            "Peel 0.4 pounds of russet potato and cut into 3/4-inch cubes.",
            "Add 0.4 pounds of potato, 0.2 chopped celery rib (approximately 0.5 oz), 0.38 cups chicken broth, and 0.38 cups water to the kettle and simmer, covered, for 10 minutes.",
            "Add 2 oz frozen baby lima beans and 2 oz frozen corn to the kettle and simmer, covered, for another 5 minutes.",
            "In a small bowl, dissolve 0.25 teaspoon cornstarch in 0.38 cups half-and-half or milk.",
            "Stir the cornstarch mixture into the simmering soup with 0.25 teaspoons Worcestershire sauce.",
            "Bring soup to a boil, stirring continuously.",
            "Add 0.25 pounds smoked haddock cut into 1-inch pieces and simmer, covered, for 5 minutes, or until the fish just flakes.",
            "Stir in 0.5 tablespoons minced fresh parsley leaves.",
            "Serve immediately or cool and store for up to 2 days. Reheat gently before serving."
        ],
        "processed_ingredients": [
            "0.2 oz bacon",
            "1 oz onion",
            "0.4 lb potato",
            "0.5 oz celery",
            "0.38 cup chicken broth",
            "0.38 cup water",
            "2 oz lima beans",
            "2 oz corn",
            "0.25 tsp cornstarch",
            "0.38 cup milk",
            "0.25 tsp Worcestershire sauce",
            "0.25 lb smoked haddock",
            "0.5 tbsp parsley"
        ],
        "pure_ingredients": [
            "bacon",
            "onion",
            "potato",
            "celery",
            "chicken broth",
            "water",
            "lima beans",
            "corn",
            "cornstarch",
            "milk",
            "Worcestershire sauce",
            "haddock",
            "parsley"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "kettle",
            "knife",
            "cutting board",
            "bowl",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "yXn77u7YqMeSDv9h5K7ehEpHc5DdYKa",
        "recipe_title": "Tuna Steak au Poivre ",
        "original_instructions": "Stir together soy sauce, water, lime juice, ginger, sugar, and scallion. Coarsely crush peppercorns and coriander with a mortar and pestle or heavy skillet. Sprinkle tuna with 3/4 tsp salt, then press spice mixture evenly all over fish. Heat oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then sear tuna, turning once, about 6 minutes for medium-rare. Serve with dipping sauce.\nStir together soy sauce, water, lime juice, ginger, sugar, and scallion.\nCoarsely crush peppercorns and coriander with a mortar and pestle or heavy skillet. Sprinkle tuna with 3/4 tsp salt, then press spice mixture evenly all over fish.\nHeat oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then sear tuna, turning once, about 6 minutes for medium-rare.\nServe with dipping sauce.",
        "ingredients": [
            "3 tablespoons soy sauce",
            "2 tablespoons water",
            "1 tablespoon fresh lime juice",
            "1/2 teaspoon grated peeled ginger",
            "1/2 teaspoon sugar",
            "1 scallion green, thinly sliced",
            "2 1/2 teaspoons black peppercorns",
            "1/2 teaspoon white peppercorns",
            "1 teaspoon coriander seeds",
            "2 pounds tuna steaks (1 inch thick)",
            "2 tablespoons vegetable oil"
        ],
        "step_by_step_instructions": [
            "Stir together 0.75 tablespoons soy sauce, 0.5 tablespoons water, 0.25 tablespoons fresh lime juice, 0.125 teaspoons grated peeled ginger, 0.125 teaspoons sugar, and 0.25 tablespoons scallion.",
            "Coarsely crush 0.42 teaspoons black peppercorns, 0.08 teaspoons white peppercorns, and 0.17 teaspoons coriander seeds with a mortar and pestle or a heavy skillet.",
            "Sprinkle 0.13 teaspoons salt evenly over 0.5 pounds tuna steak, then press the spice mixture evenly all over the fish.",
            "Heat 0.33 tablespoons vegetable oil in a 12-inch heavy skillet over medium-high heat until it shimmers.",
            "Sear the tuna, turning once, about 3 minutes per side for medium-rare.",
            "Serve the tuna steak with the prepared dipping sauce."
        ],
        "processed_ingredients": [
            "0.75 tablespoon soy sauce",
            "0.5 tablespoon water",
            "0.25 tablespoon lime juice",
            "0.125 teaspoon ginger",
            "0.125 teaspoon sugar",
            "0.25 tablespoon scallion",
            "0.42 teaspoon black peppercorns",
            "0.08 teaspoon white peppercorns",
            "0.17 teaspoon coriander seeds",
            "0.5 lb tuna steak",
            "0.33 tablespoon vegetable oil",
            "0.13 teaspoon salt"
        ],
        "pure_ingredients": [
            "soy sauce",
            "water",
            "lime",
            "ginger",
            "sugar",
            "scallion",
            "black peppercorns",
            "white peppercorns",
            "coriander",
            "tuna",
            "vegetable oil",
            "salt"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "mortar and pestle",
            "heavy skillet",
            "stove"
        ]
    },
    {
        "recipe_id": "fICYFYqgMKRJIDvJFGzq0w0dHx1v4w6",
        "recipe_title": "Caramelized Onion Penne",
        "original_instructions": "Bring a large pot of water to a boil over high heat. Salt the water and add the pasta. Cook to al dente and drain.\nHeat the extra-virgin olive oil in a large skillet over medium heat. Stir in the anchovy paste and let it melt into the oil. Add the onions and bay leaf and season with salt and pepper, to taste. Cook the onions until very soft and light caramel in color, about 20 minutes. Stir in the cream, and cook until heated through. Remove the bay leaf, then add the pasta and cheese and toss to coat. Transfer to a serving bowl, sprinkle with parsley and serve.",
        "ingredients": [
            "1/2 pound whole-wheat penne pasta",
            "Kosher salt",
            "2 tablespoons extra-virgin olive oil",
            "1 teaspoon anchovy paste or 4 flat fillets",
            "2 large onions, thinly sliced",
            "1 bay leaf",
            "Freshly ground black pepper",
            "1/2 cup cream",
            "1/2 cup grated Parmigiano-Reggiano, a couple of handfuls",
            "1/4 cup finely chopped fresh flat-leaf parsley"
        ],
        "step_by_step_instructions": [
            "Bring a large pot of water to a boil over high heat.",
            "Salt the water and add approximately 2.67 ounces of whole-wheat penne pasta.",
            "Cook the pasta until al dente, then drain.",
            "Heat 1 tablespoon of extra-virgin olive oil in a large skillet over medium heat.",
            "Stir in 0.17 teaspoon of anchovy paste and let it melt into the oil.",
            "Add 5.33 ounces of thinly sliced onions and one small bay leaf to the skillet.",
            "Season the onions with salt and freshly ground black pepper to taste.",
            "Cook the onions until they are very soft and a light caramel color, about 20 minutes.",
            "Stir in 0.17 cup of cream and cook until heated through.",
            "Remove the bay leaf from the mixture.",
            "Add the drained pasta and 0.17 cup of grated Parmigiano-Reggiano to the skillet.",
            "Toss everything to coat the pasta.",
            "Transfer the pasta to a serving bowl and sprinkle with 0.67 tablespoon of finely chopped fresh flat-leaf parsley.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "2.67 oz whole-wheat penne pasta",
            "0.17 tsp salt",
            "1 tbsp extra-virgin olive oil",
            "0.17 tsp anchovy paste",
            "5.33 oz onions",
            "1 leaf bay leaf",
            "0.17 tsp black pepper",
            "0.17 cup cream",
            "0.17 cup grated Parmigiano-Reggiano",
            "0.67 tbsp finely chopped fresh flat-leaf parsley"
        ],
        "pure_ingredients": [
            "wheat",
            "salt",
            "olive oil",
            "anchovy",
            "onion",
            "bay leaf",
            "black pepper",
            "cream",
            "cheese",
            "parsley"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "large pot",
            "large skillet",
            "serving bowl"
        ]
    },
    {
        "recipe_id": "JHXAbRjHt010hCGLRLvd1gxr1j9vShK",
        "recipe_title": "Cucumber and Celery Salad with Yogurt ",
        "original_instructions": "In a cheesecloth-lined sieve or colander set over a bowl drain yogurt, covered and chilled, 20 minutes. Discard liquid. Diagonally cut celery into thin slices. Seed cucumber and diagonally cut into thin slices. In bowl toss together celery, cucumber, yogurt, parsley or cilantro, lemon juice, oil, and salt and pepper to taste.\nIn a cheesecloth-lined sieve or colander set over a bowl drain yogurt, covered and chilled, 20 minutes. Discard liquid.\nDiagonally cut celery into thin slices. Seed cucumber and diagonally cut into thin slices. In bowl toss together celery, cucumber, yogurt, parsley or cilantro, lemon juice, oil, and salt and pepper to taste.",
        "ingredients": [
            "1/4 cup plain yogurt",
            "2 medium celery ribs",
            "1/2 English cucumber",
            "2 tablespoons chopped fresh flat-leafed parsley or cilantro leaves",
            "2 tablespoons fresh lemon juice",
            "1 teaspoon extra-virgin olive oil"
        ],
        "step_by_step_instructions": [
            "Line a sieve or colander with cheesecloth and set it over a bowl.",
            "Place 0.06 cup yogurt in the lined sieve, cover and chill for 20 minutes.",
            "After chilling, discard the liquid from the yogurt.",
            "Diagonally cut 0.5 celery rib into thin slices.",
            "Seed 0.25 English cucumber and diagonally cut into thin slices.",
            "In a bowl, combine the celery slices, cucumber slices, drained yogurt, 0.5 tablespoon chopped fresh parsley, 0.5 tablespoon fresh lemon juice, 0.25 teaspoon extra-virgin olive oil, and salt and pepper to taste.",
            "Toss all the ingredients together to mix well."
        ],
        "processed_ingredients": [
            "0.06 cup plain yogurt",
            "0.5 celery rib",
            "0.25 English cucumber",
            "0.5 tablespoon chopped fresh parsley",
            "0.5 tablespoon fresh lemon juice",
            "0.25 teaspoon extra-virgin olive oil"
        ],
        "pure_ingredients": [
            "yogurt",
            "celery",
            "cucumber",
            "parsley",
            "lemon",
            "olive oil",
            "salt",
            "pepper"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "sieve",
            "colander",
            "bowl",
            "cheesecloth",
            "knife"
        ]
    },
    {
        "recipe_id": "cBG5znG1rIAvdW3CV5K/sTzkAJvuNgq",
        "recipe_title": "Fettuccine Chicken Salad",
        "original_instructions": "Preheat oven to 350 degrees F.\nSlice chicken breasts lengthwise into 1-inch wide strips. Place on a rimmed baking sheet and drizzle with olive oil. Sprinkle with thyme and salt and pepper. Bake 15 to 20 minutes or until cooked through but still juicy; do not overcook.\nWhile chicken is cooking; cook pasta according to package directions. Drain pasta, rinse in cold water and drain again. Pat excess moisture off pasta with a paper towel, if necessary.\nCombine mayonnaise, green onions, parsley, basil, House Seasoning, lemon juice and seasoned salt. Pour dressing over pasta and toss gently.\nPlace chicken strips on top of pasta.\nMix ingredients together and store in an airtight container for up to 6 months.",
        "ingredients": [
            "4 large boneless skinless chicken breast halves",
            "3 tablespoons olive oil",
            "2 tablespoons chopped fresh thyme leaves",
            "Salt and freshly ground black pepper",
            "3 (9-ounce) packages fresh fettuccine",
            "2 cups mayonnaise",
            "1/2 cup freshly chopped green onions",
            "1/4 cup freshly chopped parsley leaves",
            "1/4 cup freshly chopped basil leaves",
            "1 teaspoon The Lady's House Seasoning, divided, recipe follows",
            "1 teaspoon lemon juice",
            "1 teaspoon seasoned salt (recommended: The Lady's Seasoned Salt)",
            "1 cup salt",
            "1/4 cup black pepper",
            "1/4 cup garlic powder"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350 degrees F.",
            "Slice 1 chicken breast lengthwise into 1-inch wide strips.",
            "Place chicken strips on a rimmed baking sheet and drizzle with 0.75 tablespoon olive oil.",
            "Sprinkle with 0.5 teaspoon chopped fresh thyme leaves, salt, and freshly ground black pepper.",
            "Bake for 15 to 20 minutes or until cooked through but still juicy; do not overcook.",
            "While chicken is cooking, cook 4.5 ounces of fresh fettuccine according to package directions.",
            "Drain pasta, rinse in cold water and drain again.",
            "Pat excess moisture off pasta with a paper towel, if necessary.",
            "Combine 0.5 cup mayonnaise, 1 tablespoon freshly chopped green onions, 0.5 tablespoon freshly chopped parsley leaves, 0.5 tablespoon freshly chopped basil leaves, 0.25 teaspoon The Lady's House Seasoning, 0.25 teaspoon lemon juice, and 0.25 teaspoon seasoned salt.",
            "Pour dressing over pasta and toss gently.",
            "Place chicken strips on top of pasta."
        ],
        "processed_ingredients": [
            "1 piece chicken breast",
            "0.75 tablespoon olive oil",
            "0.5 teaspoon thyme leaves",
            "0.5 teaspoon salt",
            "0.5 teaspoon black pepper",
            "4.5 ounces fresh fettuccine",
            "0.5 cup mayonnaise",
            "1 tablespoon green onions",
            "0.5 tablespoon parsley leaves",
            "0.5 tablespoon basil leaves",
            "0.25 teaspoon House Seasoning",
            "0.25 teaspoon lemon juice",
            "0.25 teaspoon seasoned salt"
        ],
        "pure_ingredients": [
            "chicken",
            "olive oil",
            "thyme",
            "salt",
            "black pepper",
            "fettuccine",
            "mayonnaise",
            "green onions",
            "parsley",
            "basil",
            "House Seasoning",
            "lemon juice",
            "seasoned salt",
            "garlic powder"
        ],
        "cooking_time": "35 minutes",
        "required_tools": [
            "oven",
            "rimmed baking sheet",
            "knife",
            "paper towel",
            "mixing bowl"
        ]
    },
    {
        "recipe_id": "yreHOvwifekLnAkY0gvyd/iTvIGcT42",
        "recipe_title": "Quick-Pickled Zucchini",
        "original_instructions": "In a medium saucepan over medium-high heat, bring the vinegar, salt, mustard seeds, chile flakes and 3 cups water to a simmer. Cook until the salt has dissolved, about 5 minutes.\nDivide the dill, garlic, zucchini and onions evenly between 2 quart-size mason jars.\nPour the hot liquid into the mason jars to cover the ingredients and let cool to room temperature, about 1 hour. Serve immediately or cover with lids and store in the refrigerator for up to a week.",
        "ingredients": [
            "2 cups distilled white vinegar",
            "3 tablespoons kosher salt",
            "2 tablespoons yellow mustard seeds",
            "2 teaspoons red chile flakes",
            "6 sprigs fresh dill",
            "4 cloves garlic, thinly sliced",
            "3 medium zucchini (about 2 pounds), sliced into 1/2-inch-thick rounds",
            "1 small red onion, halved and sliced into thin half-moons"
        ],
        "step_by_step_instructions": [
            "In a small saucepan over medium-high heat, bring 0.25 cups distilled white vinegar, 0.37 tsp kosher salt, 0.25 tbsp yellow mustard seeds, 0.17 tsp red chile flakes and 0.37 cups water to a simmer.",
            "Cook until the salt has dissolved, about 5 minutes.",
            "Divide 1 sprig fresh dill, 0.67 cloves garlic, thinly sliced, 0.5 medium zucchini, sliced into 1/2-inch-thick rounds, and 0.17 small red onion, halved and sliced into thin half-moons between two small containers.",
            "Pour the hot liquid into the containers to cover the ingredients and let cool to room temperature, about 1 hour.",
            "Serve immediately or cover with lids and store in the refrigerator for up to a week."
        ],
        "processed_ingredients": [
            "0.25 cup distilled white vinegar",
            "0.37 teaspoon kosher salt",
            "0.25 tablespoon yellow mustard seeds",
            "0.17 teaspoon red chile flakes",
            "1 sprig fresh dill",
            "0.67 cloves garlic",
            "0.5 medium zucchini",
            "0.17 small red onion"
        ],
        "pure_ingredients": [
            "vinegar",
            "salt",
            "mustard seeds",
            "chile flakes",
            "dill",
            "garlic",
            "zucchini",
            "onion",
            "water"
        ],
        "cooking_time": "65 minutes",
        "required_tools": [
            "saucepan",
            "mason jars"
        ]
    },
    {
        "recipe_id": "0Egm4ku0KYD2j9X4GIMf.LBdL/WnuL6",
        "recipe_title": "Sauteed Mini Vegetable Medley",
        "original_instructions": "Halve the squash. Heat the extra-virgin olive oil in large skillet over medium-high heat. Saute the squash 5 minutes then add the onions and tomatoes, season the vegetables with salt and pepper and cook 5 to 7 minutes more until the tomatoes begin to burst and the onions are warmed through. Toss the herbs with the vegetables and transfer to a serving dish.;",
        "ingredients": [
            "1 pound assorted mini squash - patty pans and/or baby zucchini",
            "3 tablespoons extra-virgin olive oil",
            "1 cup frozen pearl onions",
            "1 pint cherry tomatoes",
            "Salt and freshly ground black pepper",
            "3 to 4 tablespoons chopped fresh dill",
            "Handful flat-leaf parsley, chopped"
        ],
        "step_by_step_instructions": [
            "Halve approximately 0.25 pounds of mini squash.",
            "Heat 0.75 tablespoons of extra-virgin olive oil in a large skillet over medium-high heat.",
            "Saute the squash for 5 minutes.",
            "Add 0.25 cups of frozen pearl onions and 0.25 pints of cherry tomatoes to the skillet.",
            "Season the vegetables with a pinch of salt and pepper.",
            "Cook for 5 to 7 minutes more until the tomatoes begin to burst and the onions are warmed through.",
            "Toss 0.75 tablespoons of chopped fresh dill and a small handful (approximately 0.25 ounces) of chopped flat-leaf parsley with the vegetables.",
            "Transfer the vegetables to a serving dish."
        ],
        "processed_ingredients": [
            "0.25 lb mini squash",
            "0.75 tbsp extra-virgin olive oil",
            "0.25 cup frozen pearl onions",
            "0.25 pint cherry tomatoes",
            "0.01 tsp salt",
            "0.01 tsp black pepper",
            "0.75 tbsp fresh dill",
            "0.25 oz flat-leaf parsley"
        ],
        "pure_ingredients": [
            "mini squash",
            "olive oil",
            "onions",
            "tomatoes",
            "salt",
            "black pepper",
            "dill",
            "parsley"
        ],
        "cooking_time": "12 minutes",
        "required_tools": [
            "skillet",
            "knife",
            "serving dish"
        ]
    },
    {
        "recipe_id": "SYSxc.rsJZdkvyzgg0/3xASIsJw/cfu",
        "recipe_title": "Glazed Maroon Carrots",
        "original_instructions": "In a large skillet combine carrots, butter sugar and water. Simmer carrots, covered until just tender, 6 to 8 minutes. Uncover and continue to cook until the water has evaporated and the butter and sugar have formed a glaze.;",
        "ingredients": [
            "2 pounds carrots sliced on the diagonal",
            "1 1/2 tablespoons unsalted butter",
            "1/2 teaspoon sugar",
            "1/2 cup water"
        ],
        "step_by_step_instructions": [
            "In a large skillet, combine approximately 0.25 pounds of sliced carrots, 0.19 tablespoons of unsalted butter, 0.06 teaspoons of sugar, and 0.06 cups of water.",
            "Simmer the carrots, covered, until just tender, about 6 to 8 minutes.",
            "Uncover and continue to cook until the water has evaporated and the butter and sugar have formed a glaze."
        ],
        "processed_ingredients": [
            "0.25 lb carrots",
            "0.19 tbsp unsalted butter",
            "0.06 tsp sugar",
            "0.06 cup water"
        ],
        "pure_ingredients": [
            "carrots",
            "butter",
            "sugar",
            "water"
        ],
        "cooking_time": "8 minutes",
        "required_tools": [
            "large skillet",
            "cover"
        ]
    },
    {
        "recipe_id": "X3x2R0r1lBHYb50.DQ/Fsg.LrJKTGba",
        "recipe_title": "My Not Kosher Matzoh",
        "original_instructions": "Place the flours, salt, eggs, and half of the olive oil in the bowl of a food processor fitted with a steel blade or an electric mixer fitted with a dough hook. Mix or process until the dough forms a ball. Turn the dough out into a clean bowl and cover with a damp towel, Let it rest at room temperature for at least 2 hours.\nPreheat the oven to 400 degrees F.\nUsing a pasta machine or a rolling pin, roll out the dough until it is very thin, like lasagna (number 1 on the pasta machine or as thin as possible without tearing). You should have approximately 6 sheets, about 6 by 10-inches each.\nPlace the dough on baking sheets and brush very lightly with the remaining olive oil. Sprinkle lightly with the salt, thyme, and onion. Bake the matzoh for about 10 minutes, or until golden brown and crispy.",
        "ingredients": [
            "1 1/2 cups semolina flour, finest grind",
            "1 1/2 cups all-purpose flour",
            "2 teaspoons salt",
            "4 eggs",
            "1/2 cup extra-virgin olive oil",
            "2 tablespoons kosher salt",
            "2 tablespoons fresh thyme leaves",
            "1/2 cup finely chopped onion"
        ],
        "step_by_step_instructions": [
            "Place 0.19 cups semolina flour, 0.19 cups all-purpose flour, 0.25 teaspoons salt, 1 egg, and 0.06 cups extra-virgin olive oil in the bowl of a food processor fitted with a steel blade or an electric mixer fitted with a dough hook.",
            "Mix or process until the dough forms a ball.",
            "Turn the dough out into a clean bowl and cover with a damp towel.",
            "Let it rest at room temperature for at least 2 hours.",
            "Preheat the oven to 400 degrees F.",
            "Using a pasta machine or a rolling pin, roll out the dough until it is very thin, like lasagna.",
            "You should have approximately 1 sheet, about 6 by 10-inches.",
            "Place the dough on a baking sheet and brush very lightly with 0.06 cups of the remaining olive oil.",
            "Sprinkle lightly with 0.25 teaspoons kosher salt, 0.25 teaspoons thyme, and 0.06 cups finely chopped onion.",
            "Bake the matzoh for about 10 minutes, or until golden brown and crispy."
        ],
        "processed_ingredients": [
            "0.19 cups semolina flour",
            "0.19 cups all-purpose flour",
            "0.25 teaspoons salt",
            "1 egg",
            "0.06 cups extra-virgin olive oil",
            "0.25 teaspoons kosher salt",
            "0.25 teaspoons thyme",
            "0.06 cups onion"
        ],
        "pure_ingredients": [
            "semolina flour",
            "all-purpose flour",
            "salt",
            "egg",
            "olive oil",
            "thyme",
            "onion"
        ],
        "cooking_time": "2 hours 10 minutes",
        "required_tools": [
            "food processor",
            "electric mixer",
            "damp towel",
            "pasta machine",
            "rolling pin",
            "baking sheet",
            "oven"
        ]
    },
    {
        "recipe_id": "e6CwLtUnVyio/6REz4UVMtZvlNDn6Uu",
        "recipe_title": "The Lux Quesadilla",
        "original_instructions": "Set a frying pan over medium-high heat. Sprinkle the chicken with salt and pepper and cook until cooked through, about 6 minutes. Set aside.\nIn the same pan, saute the asparagus in 1 tablespoon of the butter over medium heat for about 4 minutes. Set aside.\nIn another pan, saute the shallots in the remaining 1 tablespoon butter for 1 minute, then add the garlic and saute for another minute. Add the mushrooms and saute anther three minutes. Add the wine and cook until the mixture is reduced to a paste-like consistency, about five minutes. Season with salt and pepper.\nSprinkle half of the cheese over half of the tortilla. Spread the mushroom mixture evenly over cheese. Top with the asparagus, chicken and bacon and sprinkle with the remaining cheese. Fold up the tortilla and heat it in a pan until cheese has melted and the tortilla is golden. Serve.",
        "ingredients": [
            "3 ounces boneless, skinless chicken breast, cut into small cubes",
            "Salt and pepper",
            "3 asparagus spears, cut into 1-inch pieces",
            "2 tablespoons butter",
            "1 shallot, minced",
            "1 clove garlic, minced",
            "3 button mushrooms, minced",
            "1 tablespoon dry white wine",
            "4 ounces grated Colby cheese",
            "One 10-inch flour tortilla",
            "2 slices bacon, cooked and crumbled"
        ],
        "step_by_step_instructions": [
            "Set a frying pan over medium-high heat.",
            "Sprinkle the chicken with salt and pepper and cook until cooked through, about 6 minutes.",
            "Set the chicken aside.",
            "In the same pan, saute the asparagus in 0.67 tablespoon of butter over medium heat for about 4 minutes.",
            "Set the asparagus aside.",
            "In another pan, saute the shallots in 0.67 tablespoon of butter for 1 minute.",
            "Add the garlic and saute for another minute.",
            "Add the mushrooms and saute another 3 minutes.",
            "Add the wine and cook until the mixture is reduced to a paste-like consistency, about 5 minutes.",
            "Season with salt and pepper.",
            "Sprinkle 2 ounces of cheese over half of the tortilla.",
            "Spread the mushroom mixture evenly over the cheese.",
            "Top with the asparagus, chicken, and bacon, and sprinkle with the remaining 2 ounces of cheese.",
            "Fold up the tortilla and heat it in a pan until the cheese has melted and the tortilla is golden.",
            "Serve."
        ],
        "processed_ingredients": [
            "3 ounces chicken breast",
            "0.08 teaspoon salt",
            "0.08 teaspoon pepper",
            "1.5 ounces asparagus",
            "1.33 tablespoon butter",
            "0.5 ounce shallot",
            "1 clove garlic",
            "1 ounce mushrooms",
            "0.33 tablespoon white wine",
            "4 ounces Colby cheese",
            "1 10-inch flour tortilla",
            "1.5 slices bacon"
        ],
        "pure_ingredients": [
            "chicken",
            "salt",
            "pepper",
            "asparagus",
            "butter",
            "shallot",
            "garlic",
            "mushrooms",
            "wine",
            "cheese",
            "flour",
            "bacon"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "frying pan",
            "pan",
            "spatula"
        ]
    },
    {
        "recipe_id": "j/p42BE.i4EjrhKxLUCHsFK7c7GLRpm",
        "recipe_title": "Tex-Mex Chicken Quinoa",
        "original_instructions": "In a large mug or small bowl, combine the oil and red onion. Microwave until softened, 1 to 2 minutes. Add the chicken, quinoa, beans, salsa, cumin, chili powder and salt and pepper to taste then stir and microwave for another minute or two. Serve with toppings of your choice.",
        "ingredients": [
            "2 tablespoons salsa",
            "1/2 teaspoon ground cumin",
            "1/4 teaspoon chili powder",
            "Salt and freshly ground black pepper",
            "Salt and freshly ground black pepper",
            "1 teaspoon olive oil",
            "1/4 cup diced red onion",
            "1/2 cup cooked chicken, roughly chopped",
            "1/2 cup cooked quinoa",
            "1/4 cup black beans",
            "Suggested toppings: diced avocado, shredded cheese, chopped fresh cilantro, freshly squeezed lime juice"
        ],
        "step_by_step_instructions": [
            "Combine 0.33 teaspoon olive oil and 1 tablespoon diced red onion in a large mug or small bowl.",
            "Microwave until the onion is softened, about 1 to 2 minutes.",
            "Add 0.25 cup cooked chicken, 0.25 cup cooked quinoa, 2 tablespoons black beans, 0.67 tablespoon salsa, 0.17 teaspoon ground cumin, 0.08 teaspoon chili powder, and salt and pepper to taste. Stir the mixture.",
            "Microwave for another 1 to 2 minutes.",
            "Serve with toppings of your choice."
        ],
        "processed_ingredients": [
            "0.67 tbsp salsa",
            "0.17 tsp ground cumin",
            "0.08 tsp chili powder",
            "0.33 tsp olive oil",
            "1 tbsp diced red onion",
            "0.25 cup cooked chicken",
            "0.25 cup cooked quinoa",
            "2 tbsp black beans",
            "0.08 tsp salt",
            "0.08 tsp black pepper"
        ],
        "pure_ingredients": [
            "salsa",
            "cumin",
            "chili powder",
            "salt",
            "black pepper",
            "olive oil",
            "red onion",
            "chicken",
            "quinoa",
            "black beans",
            "avocado",
            "cheese",
            "cilantro",
            "lime"
        ],
        "cooking_time": "4 minutes",
        "required_tools": [
            "microwave",
            "mug",
            "bowl",
            "spoon"
        ]
    },
    {
        "recipe_id": "POWhuWW7XX4ciiiIrjRS9QsD85PTQgi",
        "recipe_title": "Popovers",
        "original_instructions": "Preheat the oven to 425 degrees F.\nIn a medium bowl, whisk together the flour and salt. In another bowl, whisk together the milk, butter, and eggs. Make a well in the flour, pour in the milk mixture, and whisk to make a smooth batter. Set batter aside for 10 minutes.\nHeat a non-stick or well-seasoned 6-cup popover pan in the oven for 5 minutes. Carefully remove the pan from the oven and brush the inside of the cups with the shortening. Ladle the batter into the cups and bake for 20 minutes, without opening the oven. (Do not open the oven during baking.)\nLower the heat to 350 degrees F. and continue to bake the popovers for 20 minutes, at this point they will be golden brown. Right after removing the popovers from the oven, poke each one with a paring knife to release steam. Turn popovers from the pan and serve immediately with butter and jam.",
        "ingredients": [
            "1 cup bread flour",
            "1/2 teaspoon fine salt",
            "1 cup whole or non-fat milk, warmed",
            "2 tablespoons unsalted butter or oil, melted",
            "3 large eggs",
            "2 to 3 teaspoons vegetable shortening",
            "Serving suggestions: Butter and jam"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 425 degrees F.",
            "In a medium bowl, whisk together 0.17 cup of flour and a pinch of salt.",
            "In another bowl, whisk together 0.17 cup of milk, 0.33 tablespoon of butter, and 0.5 egg.",
            "Make a well in the flour, pour in the milk mixture, and whisk to make a smooth batter.",
            "Set batter aside for 10 minutes.",
            "Heat a non-stick or well-seasoned popover cup in the oven for 5 minutes.",
            "Carefully remove the pan from the oven and brush the inside of the cup with 0.5 teaspoon of shortening.",
            "Ladle the batter into the cup and bake for 20 minutes, without opening the oven.",
            "Lower the heat to 350 degrees F and continue to bake the popover for 20 minutes until golden brown.",
            "Right after removing the popover from the oven, poke it with a paring knife to release steam.",
            "Turn the popover from the pan and serve immediately with butter and jam."
        ],
        "processed_ingredients": [
            "0.17 cup bread flour",
            "0.08 teaspoon salt",
            "0.17 cup whole milk",
            "0.33 tablespoon unsalted butter",
            "0.5 egg",
            "0.5 teaspoon vegetable shortening"
        ],
        "pure_ingredients": [
            "flour",
            "salt",
            "milk",
            "butter",
            "egg",
            "shortening"
        ],
        "cooking_time": "55 minutes",
        "required_tools": [
            "oven",
            "medium bowl",
            "whisk",
            "non-stick pan",
            "brush",
            "paring knife"
        ]
    },
    {
        "recipe_id": "L3FCFw7.UZ5L5TOXsDh8yFmm6h/OuCq",
        "recipe_title": "Onion Burgers",
        "original_instructions": "Brown ground beef and drain. Sprinkle in the flour. Add onion soup, stir and cook until meat mixture is thickened and most of the liquid is absorbed.\nSpread mustard and mayonnaise, to taste, on bread. Spoon the ground beef mixture onto bread and top with onion.",
        "ingredients": [
            "1 pound lean ground beef",
            "2 to 3 tablespoons all-purpose flour",
            "1 can French onion soup",
            "Yellow mustard",
            "Mayonnaise",
            "White or whole-wheat bread or buns",
            "1 medium onion, cut into rings"
        ],
        "step_by_step_instructions": [
            "Brown 4 ounces of lean ground beef in a pan and drain the excess fat.",
            "Sprinkle approximately 0.75 tablespoons of all-purpose flour over the beef.",
            "Add 4 ounces of French onion soup to the pan.",
            "Stir the mixture and cook until it thickens and most of the liquid is absorbed.",
            "Spread yellow mustard and mayonnaise to taste on a slice of bread or bun.",
            "Spoon the beef mixture onto the bread.",
            "Top with a few onion rings from the medium onion."
        ],
        "processed_ingredients": [
            "4.00 oz lean ground beef",
            "0.75 tbsp all-purpose flour",
            "4.00 oz French onion soup",
            "0.50 tbsp yellow mustard",
            "0.50 tbsp mayonnaise",
            "1.00 slice bread or bun",
            "0.25 medium onion"
        ],
        "pure_ingredients": [
            "beef",
            "flour",
            "onion",
            "mustard",
            "mayonnaise",
            "bread"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "pan",
            "spatula",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "rU0v9RtwHNO0Y9FLbzH33xLsiGLze0O",
        "recipe_title": "Seared Dayboat Scallops with Napa Cabbage and Chipotle Broth",
        "original_instructions": "Remove side muscle from scallops and discard. Drizzle a tablespoon or two of olive oil over scallops and season with salt and pepper. To serve: Heat tablespoons of oil, preferably in a non-stick skillet, over moderately high heat. Quickly sear scallops on both sides until golden brown but still slightly translucent in the center. Be careful not to overcook -- the whole process should take 2-3 minutes. Wipe out saute pan and heat another tablespoon of oil. Saute cabbage briefly until crisp tender (1-2 minutes) with 2-3 drops of sesame oil, if desired. Divide cabbage among 6 large, shallow soup plates and mound in center. Sprinkle a heaping tablespoon or two of rice beans around cabbage and ladle an ounce or two of stock on beans. Place scallops on top of cabbage and garnish with chopped chives and drops of tangerine oil. Serve immediately.",
        "ingredients": [
            "1 1/2 pounds jumbo dayboat scallops",
            "Olive oil",
            "Salt and freshly ground pepper",
            "5 cups very finely shredded Napa cabbage",
            "Toasted sesame oil (optional)",
            "3/4 cup cooked rice beans",
            "Shellfish-chipotle stock (recipe follows)",
            "Chopped fresh chives and tangerine olive oil"
        ],
        "step_by_step_instructions": [
            "Remove the side muscle from approximately 4 ounces of scallops and discard.",
            "Drizzle about 0.5 tablespoon of olive oil over the scallops and season with a pinch of salt and pepper.",
            "Heat 0.5 tablespoon of olive oil in a non-stick skillet over moderately high heat.",
            "Quickly sear scallops on both sides until golden brown but still slightly translucent in the center. This should take about 2-3 minutes.",
            "Wipe out the sauté pan and heat another 0.5 tablespoon of olive oil.",
            "Sauté about 0.75 cup of Napa cabbage for 1-2 minutes until crisp-tender, adding 1 drop of sesame oil if desired.",
            "Place the sautéed cabbage on a large shallow soup plate.",
            "Sprinkle about 2 tablespoons of rice beans around the cabbage.",
            "Ladle approximately 1 ounce of shellfish-chipotle stock over the beans.",
            "Place the seared scallops on top of the cabbage.",
            "Garnish with chopped chives and a few drops of tangerine olive oil.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "4.00 oz scallops",
            "0.50 tbsp olive oil",
            "0.01 tsp salt",
            "0.01 tsp pepper",
            "0.75 cup Napa cabbage",
            "0.01 tsp sesame oil",
            "2.00 tbsp rice beans",
            "1.00 oz shellfish-chipotle stock",
            "0.01 tbsp chives",
            "0.01 tbsp tangerine olive oil"
        ],
        "pure_ingredients": [
            "scallops",
            "olive oil",
            "salt",
            "pepper",
            "Napa cabbage",
            "sesame oil",
            "rice beans",
            "shellfish-chipotle stock",
            "chives",
            "tangerine olive oil"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "non-stick skillet",
            "saute pan",
            "soup plate"
        ]
    },
    {
        "recipe_id": "bXql5Naf5tkIj8tHrp.V4NM49zHMs6C",
        "recipe_title": "BBQ Beef Chili",
        "original_instructions": "In a stockpot or Dutch oven over medium-high heat, add the oil, garlic and onion. Sprinkle with salt and pepper and saute until the onion gets tender and aromatic, 3 to 5 minutes. Add the tomato paste and stir well. Add the ground beef and cook until browned, stirring frequently and breaking it apart, about 5 minutes. Add the chili powder and cumin and stir until evenly distributed. Stir in the tomato sauce and broth and lower the heat to a simmer. Cook, stirring occasionally, 30 minutes. Stir in the barbecue sauce and cook for an additional 10 minutes. Serve hot.",
        "ingredients": [
            "2 teaspoons olive oil",
            "3 garlic cloves, minced",
            "1 medium onion, diced",
            "Salt and freshly ground black pepper",
            "1 tablespoon tomato paste",
            "1 pound lean ground beef (at least 90 percent lean)",
            "2 tablespoons chili powder",
            "1 teaspoon ground cumin",
            "One 15-ounce can no-salt-added tomato sauce",
            "1 cup low-sodium chicken broth",
            "3 tablespoons barbecue sauce"
        ],
        "step_by_step_instructions": [
            "In a stockpot or Dutch oven over medium-high heat, add 0.33 teaspoon of olive oil, 1 minced garlic clove, and 0.33 medium onion diced. Sprinkle with salt and pepper and saute until the onion gets tender and aromatic, about 3 to 5 minutes.",
            "Add 0.33 tablespoon of tomato paste and stir well.",
            "Add approximately 5.33 ounces of lean ground beef and cook until browned, stirring frequently and breaking it apart, about 5 minutes.",
            "Add 0.67 tablespoon of chili powder and 0.33 teaspoon of ground cumin and stir until evenly distributed.",
            "Stir in 5 ounces of tomato sauce and 0.33 cup of chicken broth. Lower the heat to a simmer and cook, stirring occasionally, for 30 minutes.",
            "Stir in 1 tablespoon of barbecue sauce and cook for an additional 10 minutes.",
            "Serve hot."
        ],
        "processed_ingredients": [
            "0.33 teaspoon olive oil",
            "1 clove garlic",
            "0.33 medium onion",
            "1 pinch salt",
            "1 pinch black pepper",
            "0.33 tablespoon tomato paste",
            "5.33 ounces ground beef",
            "0.67 tablespoon chili powder",
            "0.33 teaspoon ground cumin",
            "5 ounces tomato sauce",
            "0.33 cup chicken broth",
            "1 tablespoon barbecue sauce"
        ],
        "pure_ingredients": [
            "olive oil",
            "garlic",
            "onion",
            "salt",
            "black pepper",
            "tomato paste",
            "beef",
            "chili powder",
            "cumin",
            "tomato",
            "chicken",
            "barbecue sauce"
        ],
        "cooking_time": "48 minutes",
        "required_tools": [
            "stockpot",
            "Dutch oven"
        ]
    },
    {
        "recipe_id": "bEiv7Tp/c4tgOCysKQp/DGAX1fZocAW",
        "recipe_title": "Caesar Salad",
        "original_instructions": "Dry out bread cubes in a low oven (325 degreesF) for 20 minutes; they should be dry but not browned. Meanwhile, mash garlic with 1/4 teaspoon salt in 2 tablespoons oil and set aside for 20 minutes. Strain oil through a sieve into a saute pan and heat over low heat. Add croutons, toss to coat and saute until they are lightly colored.\nIn a large salad bowl toss romaine leaves with remaining tablespoon olive oil, until well-coated. Add lemon juice and Worcestershire sauce, break egg over salad, sprinkle with Parmesan cheese, and season with salt and pepper to taste. Toss salad, scooping leaves from the bottom and turning gently, taking care not to break them. Add croutons and serve immediately on chilled plates.",
        "ingredients": [
            "1 cup cubed homemade-style white or Italian bread (1/2-inch croutons)",
            "1 garlic clove",
            "Salt and pepper",
            "3 tablespoons olive oil",
            "1 medium head romaine lettuce, leaves separated, washed, dried and chilled",
            "Juice of 1/2 lemon",
            "3 drops Worcestershire sauce",
            "1 egg, boiled for 1 minute",
            "2 tablespoons freshly-grated Parmesan cheese"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 325 degrees F (165 degrees C).",
            "Cube 0.25 cup of homemade-style white or Italian bread into 1/2-inch croutons.",
            "Place bread cubes on a baking sheet and dry in the oven for about 20 minutes or until they are dry but not browned.",
            "While the bread is drying, mash 0.25 of a garlic clove with about 0.06 teaspoon of salt in 0.5 tablespoon of olive oil and let it sit for 20 minutes.",
            "Strain the garlic oil through a sieve into a small saute pan and heat over low heat.",
            "Add the dried croutons to the pan, toss to coat them with the oil, and saute until they are lightly colored.",
            "In a large salad bowl, toss about 0.25 of a medium head of romaine lettuce with 0.25 tablespoon of olive oil until well-coated.",
            "Add the juice of 0.125 lemon and about 0.75 drop of Worcestershire sauce to the lettuce.",
            "Break 0.25 of an egg, boiled for 1 minute, over the salad.",
            "Sprinkle about 0.5 tablespoon of freshly-grated Parmesan cheese over the salad.",
            "Season the salad with salt and pepper to taste.",
            "Gently toss the salad, scooping leaves from the bottom and turning gently to avoid breaking them.",
            "Add the croutons to the salad and serve immediately on a chilled plate."
        ],
        "processed_ingredients": [
            "0.25 cup homemade-style white bread",
            "0.25 clove garlic",
            "0.06 teaspoon salt",
            "0.06 teaspoon pepper",
            "0.75 tablespoon olive oil",
            "0.25 medium head romaine lettuce",
            "0.125 lemon",
            "0.75 drop Worcestershire sauce",
            "0.25 egg",
            "0.5 tablespoon Parmesan cheese"
        ],
        "pure_ingredients": [
            "bread",
            "garlic",
            "salt",
            "pepper",
            "olive oil",
            "romaine lettuce",
            "lemon",
            "Worcestershire sauce",
            "egg",
            "Parmesan cheese"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "sieve",
            "saute pan",
            "salad bowl"
        ]
    },
    {
        "recipe_id": "7M/ShkwgFjNuKDe6PE7ma7FH.veADK.",
        "recipe_title": "Sole Meuniere with Balsamic Brown Butter Sauce",
        "original_instructions": "Soak fillets in milk for 20 minutes. Remove from milk and pat dry.\nSeason fillets with salt and pepper.\nHeat 1 tablespoon oil over moderate heat in each of 2 large saute pans until hot.\nPut flour into a shallow dish and season with salt and pepper. Dredge fillets in flour, shaking off any excess flour. Dip the fillets back into the milk and then again into the flour. Place fillets in saute pans and cook over medium heat for 2 to 3 minutes per side, until golden brown and crispy. Transfer fillets from pans to a platter, sprinkle with parsley.\nWipe the skillet clean and add the butter. Heat until the butter begins to brown. Remove from heat and stir in balsamic vinegar. Pour sauce over fish and serve. Garnish with lemon slices.",
        "ingredients": [
            "4 (6-ounce) sole fillets, skin removed",
            "2 cups milk",
            "Salt and freshly ground black pepper",
            "2 tablespoons olive oil",
            "1 cup flour",
            "Salt, pepper",
            "4 tablespoons finely chopped parsley",
            "6 tablespoons butter",
            "1 to 2 tablespoons balsamic vinegar, or to taste",
            "Lemon slices, for garnish"
        ],
        "step_by_step_instructions": [
            "Soak 1 sole fillet in 0.5 cup milk for 20 minutes.",
            "Remove the fillet from milk and pat dry.",
            "Season the fillet with salt and pepper.",
            "Heat 0.5 tablespoon olive oil over moderate heat in a large saute pan until hot.",
            "Put 0.25 cup flour into a shallow dish and season with salt and pepper.",
            "Dredge the fillet in flour, shaking off any excess flour.",
            "Dip the fillet back into the milk and then again into the flour.",
            "Place the fillet in the saute pan and cook over medium heat for 2 to 3 minutes per side, until golden brown and crispy.",
            "Transfer the fillet from the pan to a platter and sprinkle with 1 tablespoon finely chopped parsley.",
            "Wipe the skillet clean and add 1.5 tablespoons butter.",
            "Heat until the butter begins to brown.",
            "Remove from heat and stir in 0.5 tablespoon balsamic vinegar.",
            "Pour the sauce over the fish and serve.",
            "Garnish with a lemon slice."
        ],
        "processed_ingredients": [
            "1 sole fillet",
            "0.5 cup milk",
            "0.5 tbsp olive oil",
            "0.25 cup flour",
            "1 tbsp parsley",
            "1.5 tbsp butter",
            "0.5 tbsp balsamic vinegar",
            "1 lemon slice",
            "0.25 tsp salt",
            "0.25 tsp pepper"
        ],
        "pure_ingredients": [
            "sole",
            "milk",
            "salt",
            "pepper",
            "olive oil",
            "flour",
            "parsley",
            "butter",
            "balsamic vinegar",
            "lemon"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "saute pan",
            "platter",
            "skillet",
            "shallow dish"
        ]
    },
    {
        "recipe_id": "nTZlxcgekWoNokHXJbyuNcWVWYj86VG",
        "recipe_title": "Smashed Carrots ",
        "original_instructions": "1. Melt the butter in a heavy pan over medium heat. 2. Add the shallots and saut until soft, about 3 minutes. 3. Add the coriander and cook, stirring, for 30 seconds. 4. Add the carrots, juice, honey, salt, pepper, and 1/2 cup water. Bring to a simmer. 5. Cover and cook until the carrots are tender, about 20 minutes. 6. Remove from heat, mash with a fork or potato masher, and serve.\n1. Melt the butter in a heavy pan over medium heat.\n2. Add the shallots and saut until soft, about 3 minutes.\n3. Add the coriander and cook, stirring, for 30 seconds.\n4. Add the carrots, juice, honey, salt, pepper, and 1/2 cup water. Bring to a simmer.\n5. Cover and cook until the carrots are tender, about 20 minutes.\n6. Remove from heat, mash with a fork or potato masher, and serve.",
        "ingredients": [
            "2 tablespoons unsalted butter",
            "2 tablespoons chopped shallots",
            "1/2 teaspoon ground coriander",
            "1 pound carrots, peeled and cut into 1-inch rounds",
            "1/2 cup orange juice",
            "2 teaspoons honey",
            "Kosher salt and freshly ground black pepper to taste"
        ],
        "step_by_step_instructions": [
            "Melt about 0.5 tablespoon of unsalted butter in a heavy pan over medium heat.",
            "Add approximately 0.5 tablespoon of chopped shallots and sauté until soft, about 3 minutes.",
            "Add 0.08 teaspoon of ground coriander and cook, stirring, for 30 seconds.",
            "Add about 0.25 pound of carrots, 0.13 cup of orange juice, 0.33 teaspoon of honey, a pinch of kosher salt and freshly ground black pepper, and 0.13 cup of water. Bring to a simmer.",
            "Cover and cook until the carrots are tender, about 20 minutes.",
            "Remove from heat, mash with a fork or potato masher, and serve."
        ],
        "processed_ingredients": [
            "0.5 tablespoon unsalted butter",
            "0.5 tablespoon chopped shallots",
            "0.08 teaspoon ground coriander",
            "0.25 pound carrots",
            "0.13 cup orange juice",
            "0.33 teaspoon honey",
            "0.13 cup water",
            "pinch kosher salt",
            "pinch freshly ground black pepper"
        ],
        "pure_ingredients": [
            "butter",
            "shallots",
            "coriander",
            "carrots",
            "orange juice",
            "honey",
            "salt",
            "black pepper",
            "water"
        ],
        "cooking_time": "23 minutes",
        "required_tools": [
            "heavy pan",
            "fork or potato masher"
        ]
    },
    {
        "recipe_id": "dkT4.wk.EtI1uL8xtMOTLcdC8Kjl0OC",
        "recipe_title": "Cumin-Roasted Shrimp with Green Chile Cocktail Sauce",
        "original_instructions": "Preheat the oven to 425 degrees F. Toss the shrimp with 2 tablespoons of the oil, the cumin, 1 teaspoon salt and 1/2 teaspoon pepper on a rimmed baking sheet. Roast, tossing once, until opaque throughout, 4 to 6 minutes.\nMeanwhile, pulse the peppers, cilantro, the remaining 2 tablespoons of oil, lime juice, 1/2 teaspoon salt and 1/2 teaspoon pepper in a food processor until smooth.\nServe the shrimp hot, cold or at room temperature with the sauce. (The sauce can be made ahead and refrigerated for up to 3 days.)",
        "ingredients": [
            "1 1/2 pounds peeled and deveined large shrimp, tails on",
            "4 tablespoons olive oil",
            "1 teaspoon ground cumin",
            "Kosher salt and freshly ground black pepper",
            "Two 4.5-ounce cans chopped green chile peppers",
            "1/2 cup loosely packed fresh cilantro leaves",
            "2 tablespoons fresh lime juice (from 1 lime)"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 425 degrees F.",
            "Toss approximately 6.75 ounces of shrimp with 0.9 tablespoons olive oil, 0.11 teaspoon ground cumin, 0.45 teaspoon kosher salt, and 0.23 teaspoon freshly ground black pepper on a rimmed baking sheet.",
            "Roast the shrimp, tossing once, until opaque throughout, around 4 to 6 minutes.",
            "Meanwhile, pulse 1.8 ounces chopped green chile peppers, 0.06 cup fresh cilantro leaves, 0.9 tablespoons olive oil, 0.45 tablespoon fresh lime juice, 0.23 teaspoon kosher salt, and 0.23 teaspoon freshly ground black pepper in a food processor until smooth.",
            "Serve the shrimp hot, cold, or at room temperature with the sauce."
        ],
        "processed_ingredients": [
            "6.75 oz shrimp",
            "1.8 tbsp olive oil",
            "0.11 tsp ground cumin",
            "0.68 tsp kosher salt",
            "0.45 tsp black pepper",
            "1.8 oz green chile peppers",
            "0.06 cup cilantro leaves",
            "0.45 tbsp lime juice"
        ],
        "pure_ingredients": [
            "shrimp",
            "olive oil",
            "cumin",
            "salt",
            "pepper",
            "chile peppers",
            "cilantro",
            "lime"
        ],
        "cooking_time": "6 minutes",
        "required_tools": [
            "oven",
            "rimmed baking sheet",
            "food processor"
        ]
    },
    {
        "recipe_id": "H7haF8TO/zQ5JmcNfc/9UTXkx7cGQbG",
        "recipe_title": "Iron-Skillet Fried Chicken",
        "original_instructions": "Wash the chicken parts thoroughly and dry them on paper towels. Heat the fat to 380 degrees in a heavy cast-iron skillet. Place the flour, cornmeal, and seasonings in a brown paper bag. Add the chicken pieces, a few at a time, and shake well to ensure that each piece is coated with the seasoned flour.\nPut the chicken pieces in the frying pan and fry uncovered for 20 to 25 minutes, turning occasionally to make sure that each side is golden brown. Remove the chicken pieces and drain them on pieces of brown paper bag. Serve hot.",
        "ingredients": [
            "1 (2 1/2 to 3 pound) chicken, cut into pieces",
            "Bacon fat and lard for frying",
            "1/2 cup flour",
            "1/2 cup yellow cornmeal",
            "1 tablespoon Bell's poultry seasoning",
            "Salt and pepper"
        ],
        "step_by_step_instructions": [
            "Wash about 1/4 of the chicken parts thoroughly and dry them on paper towels.",
            "Heat approximately 2 tablespoons of bacon fat and lard in a heavy cast-iron skillet to 380 degrees Fahrenheit.",
            "Place 1/8 cup flour, 1/8 cup yellow cornmeal, and a pinch of Bell's poultry seasoning, salt, and pepper in a brown paper bag.",
            "Add a portion of the chicken pieces to the bag, a few at a time, and shake well to coat each piece with the seasoned flour.",
            "Put the coated chicken pieces in the frying pan.",
            "Fry uncovered for 20 to 25 minutes, turning occasionally to ensure each side is golden brown.",
            "Remove the chicken pieces and drain them on pieces of brown paper bag.",
            "Serve hot."
        ],
        "processed_ingredients": [
            "0.75 lb chicken",
            "2 tbsp bacon fat",
            "2 tbsp lard",
            "0.13 cup flour",
            "0.13 cup yellow cornmeal",
            "0.25 tbsp Bell's poultry seasoning",
            "0.25 tsp salt",
            "0.25 tsp pepper"
        ],
        "pure_ingredients": [
            "chicken",
            "bacon fat",
            "lard",
            "flour",
            "cornmeal",
            "Bell's poultry seasoning",
            "salt",
            "pepper"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "cast-iron skillet",
            "paper towels",
            "brown paper bag"
        ]
    },
    {
        "recipe_id": "Xv./UBR2Ds2Ib8yj74IE95k2PZcYT9W",
        "recipe_title": "Lemon Poppyseed Cake",
        "original_instructions": "Preheat oven to 350 degrees F and grease and flour an 8 by 12 inch cake pan, knocking out excess flour.\nIn a bowl whisk together flour, sugar, cornstarch, poppyseeds, baking powder, and salt and with fingers blend in butter until incorporated. In a large measuring cup, lightly beat together milk, zest, vanilla and egg.\nStir milk mixture into flour mixture until just blended and pour batter into pan. Bake cake for 35 minutes or until tester comes out clean. Remove cake from pan and cool on rack.",
        "ingredients": [
            "1 1/4 cup all purpose flour",
            "2/3 cup sugar",
            "1/2 cup cornstarch",
            "1 tablespoon poppyseeds",
            "2 1/4 teaspoons baking powder",
            "1 teaspoon salt",
            "2 tablespoons butter",
            "1 cup skim milk",
            "2 teaspoons freshly grated lemon zest",
            "1 1/2 teaspoons vanilla",
            "1 large egg"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350 degrees F.",
            "Grease and flour a small portion of an 8 by 12 inch cake pan, knocking out excess flour.",
            "In a bowl, whisk together approximately 0.16 cup flour, 0.08 cup sugar, 0.06 cup cornstarch, 0.01 tablespoon poppyseeds, 0.28 teaspoon baking powder, and 0.12 teaspoon salt.",
            "With fingers, blend in about 0.27 tablespoon butter until incorporated.",
            "In a large measuring cup, lightly beat together about 0.13 cup milk, 0.27 teaspoon lemon zest, 0.2 teaspoon vanilla, and about 0.2 of an egg.",
            "Stir milk mixture into flour mixture until just blended.",
            "Pour a portion of the batter into the prepared section of the pan.",
            "Bake cake for approximately 35 minutes or until a tester comes out clean.",
            "Remove cake from pan and cool on rack."
        ],
        "processed_ingredients": [
            "0.16 cup all purpose flour",
            "0.08 cup sugar",
            "0.06 cup cornstarch",
            "0.01 tablespoon poppyseeds",
            "0.28 teaspoon baking powder",
            "0.12 teaspoon salt",
            "0.27 tablespoon butter",
            "0.13 cup skim milk",
            "0.27 teaspoon lemon zest",
            "0.2 teaspoon vanilla",
            "0.2 large egg"
        ],
        "pure_ingredients": [
            "flour",
            "sugar",
            "cornstarch",
            "poppyseeds",
            "baking powder",
            "salt",
            "butter",
            "milk",
            "lemon zest",
            "vanilla",
            "egg"
        ],
        "cooking_time": "35 minutes",
        "required_tools": [
            "oven",
            "bowl",
            "whisk",
            "measuring cup",
            "cake pan",
            "rack"
        ]
    },
    {
        "recipe_id": "PhaWypDNVGPXO/ylUyAsMPdBWLduAgq",
        "recipe_title": "Cumin Tortillas",
        "original_instructions": "Heat oil in a large saucepan or fryer to 365 degrees F or until a piece of tortilla sizzles when immersed. Fry the tortillas in batches and fry until crisp, about 2 minutes, remove and drain on paper towels. Repeat with remaining tortillas. Mix together the cumin and salt in a small bowl. Season the chips with the cumin-salt mixture while still warm.",
        "ingredients": [
            "6 cups peanut oil",
            "10 (8-inch) flour tortillas, cut into eighths",
            "3 tablespoons cumin powder",
            "2 tablespoons kosher salt"
        ],
        "step_by_step_instructions": [
            "Heat approximately 1.2 cups of peanut oil in a large saucepan or fryer to 365 degrees F or until a piece of tortilla sizzles when immersed.",
            "Cut 1 (8-inch) flour tortilla into eighths.",
            "Fry the tortilla pieces in the hot oil until crisp, about 2 minutes.",
            "Remove the chips and drain on paper towels.",
            "Mix together 0.3 tablespoons of cumin powder and 0.2 tablespoons of kosher salt in a small bowl.",
            "Season the chips with the cumin-salt mixture while still warm."
        ],
        "processed_ingredients": [
            "1.20 cup peanut oil",
            "1 piece (8-inch) flour tortilla",
            "0.30 tablespoon cumin powder",
            "0.20 tablespoon kosher salt"
        ],
        "pure_ingredients": [
            "peanut oil",
            "flour tortilla",
            "cumin",
            "salt"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "saucepan or fryer",
            "paper towels",
            "small bowl"
        ]
    },
    {
        "recipe_id": "L.ZbChmPNNzKZigUpynrrMax1y1fnCC",
        "recipe_title": "Snow Pea and Napa Cabbage Slaw",
        "original_instructions": "In a large saucepan of boiling water blanch snow peas 15 seconds and transfer with a slotted spoon to a bowl of ice and cold water to stop cooking. Drain snow peas well and slice thin diagonally. In large bowl toss snow peas with remaining ingredients and salt and pepper to taste.;",
        "ingredients": [
            "1/2 pound snow peas, trimmed and strings discarded",
            "1 1/2 pounds Napa cabbage, cut into thin shreds (about 9 cups)",
            "2 medium carrots, shredded",
            "1 tablespoon ginger juice",
            "1 tablespoon rice vinegar",
            "3 tablespoons vegetable oil"
        ],
        "step_by_step_instructions": [
            "In a large saucepan, bring water to a boil.",
            "Blanch approximately 1.33 ounces of snow peas in the boiling water for 15 seconds.",
            "Transfer the blanched snow peas with a slotted spoon to a bowl of ice and cold water to stop the cooking process.",
            "Drain the snow peas well and slice them thinly on the diagonal.",
            "In a large bowl, combine the sliced snow peas with about 1.5 cups of shredded Napa cabbage, 0.33 shredded carrot, 0.17 tablespoon of ginger juice, 0.17 tablespoon of rice vinegar, 0.5 tablespoon of vegetable oil, and salt and pepper to taste.",
            "Toss all the ingredients together until they are well mixed."
        ],
        "processed_ingredients": [
            "1.33 oz snow peas",
            "1.5 cup Napa cabbage",
            "0.33 medium carrot",
            "0.17 tbsp ginger juice",
            "0.17 tbsp rice vinegar",
            "0.5 tbsp vegetable oil"
        ],
        "pure_ingredients": [
            "snow peas",
            "Napa cabbage",
            "carrot",
            "ginger",
            "rice vinegar",
            "vegetable oil",
            "salt",
            "pepper"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "large saucepan",
            "slotted spoon",
            "bowl",
            "knife",
            "large bowl"
        ]
    },
    {
        "recipe_id": "Gz5syruQW6etwLzJuMJ3ZvIyZbgojuC",
        "recipe_title": "Grilled Ham, Cheese and Mushroom Sandwiches",
        "original_instructions": "Heat a large nonstick skillet over medium-high heat. When very hot, add 1/2 tablespoon butter and half of the mushrooms; cook, stirring, until tender, about 5 minutes. Transfer to a bowl and repeat with 1/2 tablespoon more butter and the remaining mushrooms; transfer to the bowl. Add the herbs to the bowl and toss; season with salt and pepper. Wipe out the skillet.\nBuild the sandwiches: Spread each slice of bread with mustard and sandwich with the cheddar, ham, mushroom mixture and muenster.\nMelt 1 tablespoon butter in the skillet over low heat. Add the sandwiches and cook, turning once and adding more butter if needed, until the bread is golden and the cheese melts, about 12 minutes.\nPhotograph by Christopher Testani",
        "ingredients": [
            "2 to 3 tablespoons unsalted butter",
            "1 10-ounce package white mushrooms, thinly sliced",
            "3 tablespoons chopped fresh parsley and/or chives",
            "Kosher salt and freshly ground pepper",
            "8 slices crusty bread",
            "Dijon or whole-grain mustard, for spreading",
            "1/3 pound white cheddar cheese (about 8 slices)",
            "1/2 pound deli-sliced ham (8 to 12 slices)",
            "1/3 pound muenster cheese (about 8 slices)"
        ],
        "step_by_step_instructions": [
            "Heat a large nonstick skillet over medium-high heat.",
            "When very hot, add 0.08 tablespoon butter and 0.75 ounce mushrooms; cook, stirring, until tender, about 5 minutes.",
            "Transfer to a bowl and repeat with 0.08 tablespoon more butter and the remaining mushrooms; transfer to the bowl.",
            "Add 0.38 tablespoon herbs to the bowl and toss; season with salt and pepper.",
            "Wipe out the skillet.",
            "Spread each slice of bread with mustard.",
            "Build the sandwich by layering 1 slice cheddar, 2 slices ham, some mushroom mixture, and 1 slice muenster between 2 slices of bread.",
            "Melt 0.13 tablespoon butter in the skillet over low heat.",
            "Add the sandwich and cook, turning once and adding more butter if needed, until the bread is golden and the cheese melts, about 12 minutes."
        ],
        "processed_ingredients": [
            "0.29 tbsp unsalted butter",
            "2.50 oz white mushrooms",
            "0.38 tbsp fresh parsley",
            "0.38 tbsp fresh chives",
            "0.25 oz kosher salt",
            "0.25 oz freshly ground pepper",
            "2 slices crusty bread",
            "0.13 oz dijon mustard",
            "1.33 oz white cheddar cheese",
            "2 oz deli-sliced ham",
            "1.33 oz muenster cheese"
        ],
        "pure_ingredients": [
            "butter",
            "mushrooms",
            "parsley",
            "chives",
            "salt",
            "pepper",
            "bread",
            "mustard",
            "cheese",
            "ham"
        ],
        "cooking_time": "17 minutes",
        "required_tools": [
            "nonstick skillet",
            "bowl"
        ]
    },
    {
        "recipe_id": "mcRCKSTVgbj.o02pX8P6P8sg6sX2OPC",
        "recipe_title": "Hot-Stuff Chili ",
        "original_instructions": "Heat the oil in a large pot over low heat. Add the onion; cook 10 minutes. Crumble in the sausage; brown over medium-high heat about 10 minutes. Stir in remaining ingredients. Simmer, uncovered, for 45 minutes, stirring occasionally.\nHeat the oil in a large pot over low heat. Add the onion; cook 10 minutes. Crumble in the sausage; brown over medium-high heat about 10 minutes. Stir in remaining ingredients. Simmer, uncovered, for 45 minutes, stirring occasionally.",
        "ingredients": [
            "2 tablespoons olive oil",
            "1 large onion, cut into 1/2-inch dice",
            "1 pound sweet Italian sausage, removed from casing",
            "2 teaspoons chili powder",
            "2 teaspoons ground cumin",
            "1 teaspoon dried oregano",
            "1/2 teaspoon crushed red-pepper flakes",
            "2 pounds leftover roast beef , cut into 1 1/2-inch cubes",
            "2 cups drained canned Italian plum tomatoes, crushed",
            "2 cups beef broth",
            "6 tablespoons tomato paste",
            "1 tablespoon chopped chipotle peppers in adobo sauce",
            "1 tablespoon brown sugar",
            "1 red bell pepper, diced (1/2 inch)",
            "Salt and pepper, to taste"
        ],
        "step_by_step_instructions": [
            "Heat 0.5 tbsp olive oil in a large pot over low heat.",
            "Add 0.25 of a large onion, diced into 1/2-inch pieces; cook for 10 minutes.",
            "Crumble in 0.25 lb sweet Italian sausage; brown over medium-high heat for about 10 minutes.",
            "Stir in 0.25 tsp chili powder, 0.25 tsp ground cumin, 0.125 tsp dried oregano, and 0.0625 tsp crushed red-pepper flakes.",
            "Add 0.5 cup diced leftover roast beef, 0.5 cup crushed canned Italian plum tomatoes, 0.5 cup beef broth, 1.5 tbsp tomato paste, 0.25 tbsp chopped chipotle peppers in adobo sauce, 0.25 tbsp brown sugar, and 0.25 of a red bell pepper diced into 1/2-inch pieces.",
            "Season with salt and pepper to taste.",
            "Simmer, uncovered, for 45 minutes, stirring occasionally."
        ],
        "processed_ingredients": [
            "0.5 tbsp olive oil",
            "0.25 large onion",
            "0.25 lb sweet Italian sausage",
            "0.25 tsp chili powder",
            "0.25 tsp ground cumin",
            "0.125 tsp dried oregano",
            "0.0625 tsp crushed red-pepper flakes",
            "0.5 cup roast beef",
            "0.5 cup Italian plum tomatoes",
            "0.5 cup beef broth",
            "1.5 tbsp tomato paste",
            "0.25 tbsp chipotle peppers",
            "0.25 tbsp brown sugar",
            "0.25 red bell pepper",
            "0.125 tsp salt",
            "0.125 tsp pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "onion",
            "sweet Italian sausage",
            "chili powder",
            "ground cumin",
            "dried oregano",
            "crushed red-pepper flakes",
            "roast beef",
            "Italian plum tomatoes",
            "beef broth",
            "tomato paste",
            "chipotle peppers",
            "brown sugar",
            "red bell pepper",
            "salt",
            "pepper"
        ],
        "cooking_time": "65 minutes",
        "required_tools": [
            "large pot",
            "stirring spoon",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "/X5UG2i03iIXPaSOBrWufsX7iA9Owcm",
        "recipe_title": "Oven Fried Chicken",
        "original_instructions": "Watch how to make this recipe.\nPreheat oven to 375 degrees F. Lightly spray a baking sheet with olive oil.\nCombine the crackers and corn cereal crumbs, sesame seeds, cayenne, and garlic powder in a shallow bowl. Reserve.\nIn a large bowl, combine egg whites, yogurt, Dijon mustard, and salt. Add the chicken pieces and coat thoroughly with the yogurt mixture.\nOne at a time, dip the chicken pieces in the cracker mixture, packing crumbs onto chicken. Arrange the chicken on a baking sheet and spray lightly with olive oil cooking spray.\nBake for 45 to 50 minutes, or until juices run clear when chicken is pierced with a knife.",
        "ingredients": [
            "1/2 sleeve (about 20) whole-grain salted crackers, pulsed in a food processor until fine (about 1/2 cup)",
            "2 1/2 cups corn cereal flakes, pulsed in a food processor to fine crumbs (about 1/2 cup)",
            "2 tablespoons sesame seeds",
            "3/4 teaspoon cayenne pepper",
            "1/2 teaspoon garlic powder",
            "2 egg whites",
            "1 cup lowfat, plain yogurt",
            "1 tablespoon Dijon mustard",
            "1/2 teaspoon salt",
            "Olive oil cooking spray",
            "4 medium sized skinless chicken breasts and 4 skinless chicken thighs, rinsed and patted dry (about 3 1/2 pounds chicken)"
        ],
        "step_by_step_instructions": [
            "Preheat your oven to 375 degrees F.",
            "Lightly spray a baking sheet with olive oil.",
            "Combine approximately 0.06 cups of whole-grain salted cracker crumbs, 0.06 cups of corn cereal crumbs, 0.25 teaspoons of sesame seeds, 0.09 teaspoons of cayenne pepper, and 0.06 teaspoons of garlic powder in a shallow bowl. Reserve this mixture.",
            "In a large bowl, combine 0.25 egg whites, 0.13 cups of lowfat plain yogurt, 0.06 tablespoons of Dijon mustard, and 0.06 teaspoons of salt.",
            "Add one portion of chicken breast or thigh (about 0.44 pounds) to the yogurt mixture and coat thoroughly.",
            "Dip the coated chicken piece into the cracker mixture one at a time, packing crumbs onto the chicken.",
            "Arrange the chicken on the prepared baking sheet and spray lightly with olive oil cooking spray.",
            "Bake in the oven for 45 to 50 minutes, or until juices run clear when the chicken is pierced with a knife."
        ],
        "processed_ingredients": [
            "0.06 cup whole-grain salted crackers",
            "0.06 cup corn cereal flakes",
            "0.25 teaspoon sesame seeds",
            "0.09 teaspoon cayenne pepper",
            "0.06 teaspoon garlic powder",
            "0.25 egg whites",
            "0.13 cup lowfat plain yogurt",
            "0.06 tablespoon Dijon mustard",
            "0.06 teaspoon salt",
            "0.44 lb skinless chicken"
        ],
        "pure_ingredients": [
            "crackers",
            "cereal flakes",
            "sesame seeds",
            "cayenne pepper",
            "garlic powder",
            "egg whites",
            "yogurt",
            "mustard",
            "salt",
            "olive oil",
            "chicken"
        ],
        "cooking_time": "50 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "food processor",
            "shallow bowl",
            "large bowl",
            "spray bottle"
        ]
    },
    {
        "recipe_id": "SdJwpvub3GHuB6UWOdXed5JXbKgKH7m",
        "recipe_title": "Quick Corn Bread",
        "original_instructions": "Heat oven to 400 degrees F. Spray a 9-inch square baking pan with non-stick cooking spray.\nCombine flour, cornmeal, sugar, baking powder, and salt in a large bowl. Set aside.\nIn a separate smaller bowl, whisk together milk, oil and egg or egg whites. Pour the wet ingredients over the dry and, using a fork, stir until just combined. Do not overmix. Spread batter evenly in pan and bake 20 to 25 minutes, or until a toothpick inserted in the center comes out clean. Cut into squares or triangles and serve immediately.",
        "ingredients": [
            "1 cup flour",
            "1 cup yellow cornmeal",
            "3 tablespoons sugar",
            "1 1/2 teaspoons baking powder",
            "1/2 teaspoon coarse grained salt",
            "1 cup skim milk",
            "1/4 cup canola or vegetable oil",
            "1 large egg or 2 large egg whites, lightly beaten"
        ],
        "step_by_step_instructions": [
            "Heat oven to 400 degrees F.",
            "Spray a 9-inch square baking pan with non-stick cooking spray.",
            "Combine 0.25 cup flour, 0.25 cup yellow cornmeal, 0.75 tablespoon sugar, 0.38 teaspoon baking powder, and 0.13 teaspoon coarse grained salt in a large bowl. Set aside.",
            "In a separate smaller bowl, whisk together 0.25 cup skim milk, 1 tablespoon canola oil, and 0.5 large egg, lightly beaten.",
            "Pour the wet ingredients over the dry ingredients and, using a fork, stir until just combined. Do not overmix.",
            "Spread batter evenly in pan.",
            "Bake for 20 to 25 minutes, or until a toothpick inserted in the center comes out clean.",
            "Cut into squares or triangles and serve immediately."
        ],
        "processed_ingredients": [
            "0.25 cup flour",
            "0.25 cup yellow cornmeal",
            "0.75 tablespoon sugar",
            "0.38 teaspoon baking powder",
            "0.13 teaspoon salt",
            "0.25 cup skim milk",
            "1 tablespoon canola oil",
            "0.5 large egg"
        ],
        "pure_ingredients": [
            "flour",
            "cornmeal",
            "sugar",
            "baking powder",
            "salt",
            "milk",
            "canola oil",
            "egg"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "oven",
            "9-inch square baking pan",
            "non-stick cooking spray",
            "large bowl",
            "smaller bowl",
            "fork",
            "toothpick"
        ]
    },
    {
        "recipe_id": "wNkSOFcUC.7TdWCQ7ks3yz18.nDuYY2",
        "recipe_title": "Route 66 Burgers",
        "original_instructions": "Heat canola oil in a saute pan and cook onions over medium heat until they caramelize.\nHeat grill. Form ground beef into 8 (2-inch) patties. Season with garlic powder, salt, and pepper, and grill burgers until medium rare, remove to a platter and top with cheddar cheese slices to allow melting.\nUse a 2-inch circle cutter (or biscuit cutter) to cut the potato rolls into circles. Place burgers in rolls and top burgers with caramelized onion.",
        "ingredients": [
            "1 tablespoon canola oil",
            "1 large red onion, thinly sliced",
            "1 pound ground beef (80/20 leanness)",
            "2 teaspoons garlic powder",
            "Salt and pepper",
            "2 slices Cheddar, cut into 8 squares",
            "8 dinner-size potato rolls"
        ],
        "step_by_step_instructions": [
            "Heat 0.38 tablespoon canola oil in a saute pan and cook 0.13 large red onion over medium heat until they caramelize.",
            "Heat grill.",
            "Form ground beef into 1 (2-inch) patty.",
            "Season with 0.25 teaspoon garlic powder, salt, and pepper.",
            "Grill burger until medium rare, remove to a plate and top with 0.25 ounce Cheddar cheese slices to allow melting.",
            "Use a 2-inch circle cutter to cut 1 potato roll into a circle.",
            "Place burger in roll and top with caramelized onion."
        ],
        "processed_ingredients": [
            "0.38 tablespoon canola oil",
            "0.13 large red onion",
            "0.13 lb ground beef",
            "0.25 teaspoon garlic powder",
            "1 pinch salt",
            "1 pinch pepper",
            "0.25 ounce Cheddar cheese",
            "1 potato roll"
        ],
        "pure_ingredients": [
            "canola oil",
            "onion",
            "beef",
            "garlic powder",
            "salt",
            "pepper",
            "cheese",
            "potato"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "saute pan",
            "grill",
            "circle cutter"
        ]
    },
    {
        "recipe_id": "IBKKDFeeiA7R7hz13tFv25RdF6j20iy",
        "recipe_title": "Barbecued Pork Ribs",
        "original_instructions": "Rub the salt, pepper and pepper flakes into the ribs and place into a glass baking dish. Pour the vinegar over the ribs and cover with plastic wrap. Refrigerate overnight, rotating the ribs in the vinegar twice.\nPreheat oven to 375 degrees. Drain the vinegar from the baking dish and roast the ribs for 1 1/2 hours. Increase oven temperature to 400 degrees. Remove ribs from oven and brush with some barbecue sauce. Return ribs to oven and roast for another 30 minutes or until tender. Serve ribs with extra barbecue sauce.",
        "ingredients": [
            "Salt and pepper",
            "1 tablespoon red pepper flakes",
            "1 slab pork ribs, 3 pounds",
            "1 1/2 cups white vinegar"
        ],
        "step_by_step_instructions": [
            "Rub approximately 0.33 teaspoon salt, 0.33 teaspoon pepper, and 0.33 teaspoon red pepper flakes into a single serving of ribs (about 0.5 lb).",
            "Place the ribs into a glass baking dish.",
            "Pour approximately 0.25 cup of white vinegar over the ribs.",
            "Cover the dish with plastic wrap and refrigerate overnight, rotating the ribs in the vinegar twice during this time.",
            "Preheat the oven to 375 degrees Fahrenheit.",
            "Drain the vinegar from the baking dish.",
            "Roast the ribs for 1.5 hours in the preheated oven.",
            "Increase the oven temperature to 400 degrees Fahrenheit.",
            "Remove ribs from the oven and brush with some barbecue sauce.",
            "Return the ribs to the oven and roast for another 30 minutes or until tender.",
            "Serve the ribs with extra barbecue sauce."
        ],
        "processed_ingredients": [
            "0.33 tsp salt",
            "0.33 tsp pepper",
            "0.33 tsp red pepper flakes",
            "0.5 lb pork ribs",
            "0.25 cup white vinegar"
        ],
        "pure_ingredients": [
            "salt",
            "pepper",
            "red pepper flakes",
            "pork ribs",
            "vinegar",
            "barbecue sauce"
        ],
        "cooking_time": "14 hours",
        "required_tools": [
            "glass baking dish",
            "plastic wrap",
            "oven",
            "basting brush"
        ]
    },
    {
        "recipe_id": "a1bnAKqQ4599Jmdq0dxSV9u5O2X4AQu",
        "recipe_title": "Meatball Parmesan Sub",
        "original_instructions": "Preheat the oven to 450 degrees F. Cut the meatballs in half and place in the oven. Bake until the meatballs are warmed, 3 to 4 minutes. Cut the roll horizontally (careful not to cut all the way through.) Place the warmed meatballs on one side of the roll. Spread the sauce evenly over the meatballs and the other side of the roll. Spread the mozzarella over the meatballs. Spread the Parmesan over the other side of the roll. Sprinkle the oregano over the entire roll. Place the sub in the oven and bake until the cheeses are melted and the edges of the roll are browned, 2 to 3 minutes.",
        "ingredients": [
            "Three 3-ounce meatballs, homemade or store bought",
            "One 12-inch sub roll",
            "3 ounces red sauce",
            "2 ounces whole milk mozzarella, shredded",
            "1 ounce grated Parmesan",
            "1/4 ounce dried oregano"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450 degrees F.",
            "Cut one 3-ounce meatball in half and place in the oven.",
            "Bake until the meatball is warmed, about 3 to 4 minutes.",
            "Cut a 4-inch section of the sub roll horizontally, being careful not to cut all the way through.",
            "Place the warmed meatball halves on one side of the roll.",
            "Spread 1 ounce of red sauce evenly over the meatball halves and the other side of the roll.",
            "Spread 0.67 ounces of shredded whole milk mozzarella over the meatball halves.",
            "Spread 0.33 ounces of grated Parmesan over the other side of the roll.",
            "Sprinkle 0.08 ounces of dried oregano over the entire roll.",
            "Place the sub in the oven and bake until the cheeses are melted and the edges of the roll are browned, about 2 to 3 minutes."
        ],
        "processed_ingredients": [
            "3 oz meatball",
            "4 oz sub roll",
            "1 oz red sauce",
            "0.67 oz mozzarella",
            "0.33 oz Parmesan",
            "0.08 oz oregano"
        ],
        "pure_ingredients": [
            "meatball",
            "sub roll",
            "red sauce",
            "mozzarella",
            "Parmesan",
            "oregano"
        ],
        "cooking_time": "7 minutes",
        "required_tools": [
            "oven",
            "knife",
            "baking tray"
        ]
    },
    {
        "recipe_id": "f/6Mlj35KUTPSMq2GKJkZpBdzyK2UcK",
        "recipe_title": "Baked Beans",
        "original_instructions": "Heat oven to 350 degrees F.\nCombine ingredients in a large shallow baking dish or a bean pot; stir to combine. Bake uncovered for 45 minutes. Stir, and cook for an additional 30 minutes. Serve warm.",
        "ingredients": [
            "3 cans (28-ounces) baked beans, recommended: Bush's",
            "1 medium green bell pepper, seeded, deveined and cut into 1/4-inch dice",
            "1 small onion, cut into 1/4-inch dice",
            "1/2 cup Worcestershire sauce",
            "1/2 cup Big Bob Gibson Championship Red Sauce",
            "1/2 cup light brown sugar, packed",
            "2 tablespoons yellow mustard"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Combine 14.00 oz baked beans, 0.83 oz green bell pepper, 0.42 oz onion, 0.08 cup Worcestershire sauce, 0.08 cup Big Bob Gibson Championship Red Sauce, 0.08 cup light brown sugar, and 0.33 tbsp yellow mustard in a large shallow baking dish or a bean pot; stir to combine.",
            "Bake uncovered for 45 minutes.",
            "Stir the mixture, and cook for an additional 30 minutes.",
            "Serve warm."
        ],
        "processed_ingredients": [
            "14.00 oz baked beans",
            "0.83 oz green bell pepper",
            "0.42 oz onion",
            "0.08 cup Worcestershire sauce",
            "0.08 cup Big Bob Gibson Championship Red Sauce",
            "0.08 cup light brown sugar",
            "0.33 tbsp yellow mustard"
        ],
        "pure_ingredients": [
            "beans",
            "bell pepper",
            "onion",
            "Worcestershire sauce",
            "sauce",
            "sugar",
            "mustard"
        ],
        "cooking_time": "75 minutes",
        "required_tools": [
            "oven",
            "baking dish",
            "spoon"
        ]
    },
    {
        "recipe_id": "Tl1AyV4vYBbs3ZJbZr2Pd0Ek0AZIbpa",
        "recipe_title": "Egg Drop Soup",
        "original_instructions": "In a pot bring the stock to a boil. Then remove the pot from the flame and add beaten egg whites steadily, beating them into the soup as you pour. Add the sliced scallions, stir in. Remove to a heated tureen and serve.",
        "ingredients": [
            "4 cups chicken stock",
            "3 large egg whites, beaten",
            "3 scallion greens, trimmed, finely sliced"
        ],
        "step_by_step_instructions": [
            "In a pot, bring 1 cup of chicken stock to a boil.",
            "Remove the pot from the flame.",
            "Add 1 beaten egg white steadily while beating it into the soup as you pour.",
            "Add approximately 1 tablespoon of finely sliced scallion greens and stir in.",
            "Remove to a heated tureen and serve."
        ],
        "processed_ingredients": [
            "1 cup chicken stock",
            "1 egg white",
            "1 tbsp scallion greens"
        ],
        "pure_ingredients": [
            "chicken stock",
            "egg",
            "scallion"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "pot",
            "tureen",
            "knife",
            "cutting board",
            "whisk"
        ]
    },
    {
        "recipe_id": "xFl/hr4721oefN/B85bFNsvpDvANMs6",
        "recipe_title": "Lemon Marinated Carne Asada",
        "original_instructions": "Combine all ingredients and marinate overnight in the refrigerator. Grill over medium heat and enjoy with your choice of salsa and tortilla.",
        "ingredients": [
            "1 1/2 pounds meat, any cut desired (beef or pork)",
            "1/2 red onion, diced",
            "1 lemon",
            "Seasoning salt, to taste"
        ],
        "step_by_step_instructions": [
            "Combine 6 ounces of meat, 0.17 ounces of diced red onion, juice from 0.17 lemon, and seasoning salt to taste.",
            "Marinate the mixture overnight in the refrigerator.",
            "Grill the marinated meat over medium heat until cooked to your liking.",
            "Enjoy the carne asada with your choice of salsa and tortilla."
        ],
        "processed_ingredients": [
            "6 ounces meat",
            "0.17 ounces red onion",
            "0.17 lemon",
            "1 teaspoon seasoning salt"
        ],
        "pure_ingredients": [
            "meat",
            "onion",
            "lemon",
            "salt"
        ],
        "cooking_time": "12 hours",
        "required_tools": [
            "refrigerator",
            "grill",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "FCVcYjBfTFXkGKBnXWJ60s9Ppm/0hbG",
        "recipe_title": "Tuscan Kale Chips ",
        "original_instructions": "Preheat oven to 250°F. Toss kale with oil in large bowl. Sprinkle with salt and pepper. Arrange leaves in single layer on 2 large baking sheets. Bake until crisp, about 30 minutes for flat leaves and up to 33 minutes for wrinkled leaves. Transfer leaves to rack to cool.\nPreheat oven to 250°F. Toss kale with oil in large bowl. Sprinkle with salt and pepper. Arrange leaves in single layer on 2 large baking sheets. Bake until crisp, about 30 minutes for flat leaves and up to 33 minutes for wrinkled leaves. Transfer leaves to rack to cool.",
        "ingredients": [
            "12 large Tuscan kale leaves, rinsed, dried, cut lengthwise in half, center ribs and stems removed",
            "1 tablespoon olive oil"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 250°F.",
            "Rinse and dry 3 large Tuscan kale leaves. Cut them lengthwise in half, removing the center ribs and stems.",
            "Toss the kale leaves with 0.25 tablespoon of olive oil in a large bowl.",
            "Sprinkle the kale leaves with salt and pepper.",
            "Arrange the leaves in a single layer on a large baking sheet.",
            "Bake until crisp, about 30 minutes for flat leaves and up to 33 minutes for wrinkled leaves.",
            "Transfer the leaves to a rack to cool."
        ],
        "processed_ingredients": [
            "3.00 large Tuscan kale leaves",
            "0.25 tablespoon olive oil"
        ],
        "pure_ingredients": [
            "Tuscan kale leaves",
            "olive oil",
            "salt",
            "pepper"
        ],
        "cooking_time": "33 minutes",
        "required_tools": [
            "oven",
            "large bowl",
            "baking sheet",
            "rack"
        ]
    },
    {
        "recipe_id": "rHiDjkbWQRk6f6AwrFVDjp8L4Afdm.6",
        "recipe_title": "Chicken Francese",
        "original_instructions": "Heat a large saute pan over medium-high heat until warmed. Add the oil. During heating, dip the chicken breasts into the eggs, and then dust each breast with seasoned flour on both sides. Once floured, add to the oiled pan, reduce the heat to medium and cook until light brown in color, 3 to 4 minutes. Flip and repeat cooking for a final 3 to 4 minutes. Once cooked, remove the breasts from the pan and allow to finish with carry-over cooking.\nReturn the same pan to the heat and add the stock. Allow to simmer and reduce by three-quarters of the volume. After reducing, whisk in the butter to create a sauce, removing from the heat during the process. Finally, finish with lemon juice and parsley and serve over the chicken.",
        "ingredients": [
            "2 ounces grapeseed oil",
            "Four 6-ounce chicken breasts",
            "4 large eggs, beaten",
            "1/4 cup all-purpose flour",
            "Salt and ground white pepper",
            "1 cup chicken stock",
            "1/4 pound (1 stick) butter",
            "2 lemons, juiced",
            "1 teaspoon minced fresh parsley"
        ],
        "step_by_step_instructions": [
            "1. Heat a large saute pan over medium-high heat until warmed.",
            "2. Add 0.5 tablespoon of grapeseed oil to the pan.",
            "3. Dip 1 chicken breast into 1 beaten egg.",
            "4. Dust the chicken breast with 1 tablespoon of seasoned flour on both sides.",
            "5. Add the floured chicken breast to the oiled pan.",
            "6. Reduce the heat to medium and cook until light brown in color, about 3 to 4 minutes.",
            "7. Flip the chicken breast and repeat cooking for another 3 to 4 minutes.",
            "8. Once cooked, remove the chicken breast from the pan and allow to rest.",
            "9. Return the same pan to the heat and add 0.25 cup of chicken stock.",
            "10. Allow the stock to simmer and reduce by three-quarters of the volume.",
            "11. After reducing, whisk in 1 tablespoon of butter to create a sauce, removing from the heat during the process.",
            "12. Finish the sauce with 0.5 tablespoon of lemon juice and 0.25 teaspoon of minced fresh parsley.",
            "13. Serve the sauce over the cooked chicken breast."
        ],
        "processed_ingredients": [
            "0.5 tablespoon grapeseed oil",
            "1 chicken breast",
            "1 egg",
            "1 tablespoon all-purpose flour",
            "0.5 teaspoon salt",
            "0.5 teaspoon ground white pepper",
            "0.25 cup chicken stock",
            "1 tablespoon butter",
            "0.5 tablespoon lemon juice",
            "0.25 teaspoon minced fresh parsley"
        ],
        "pure_ingredients": [
            "grapeseed oil",
            "chicken",
            "egg",
            "flour",
            "salt",
            "white pepper",
            "chicken stock",
            "butter",
            "lemon",
            "parsley"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "saute pan",
            "whisk",
            "measuring cup",
            "measuring spoons"
        ]
    },
    {
        "recipe_id": "803BXOSTD7vA3zeoxVIgpBjQyn2OrEK",
        "recipe_title": "Argentinean Beef Skewers with Chimichurri",
        "original_instructions": "Puree all ingredients for chimichurri in a blender until just blended. Grill beef skewers and brush chimichurri on during the last few minutes of cooking. Serve more chimichurri on the side as a condiment.",
        "ingredients": [
            "1 pound filet mignon, cut in 1-inch cubes, coated with olive oil and divided among 4 skewers",
            "1 bunch fresh parsley, chopped",
            "8 cloves garlic, minced",
            "3/4 cup olive oil",
            "1/4 cup sherry wine vinegar",
            "3 tablespoons lemon juice",
            "1 teaspoon salt",
            "1/2 teaspoon ground black pepper",
            "1/2 teaspoon ground cayenne pepper"
        ],
        "step_by_step_instructions": [
            "Puree all ingredients for chimichurri in a blender until just blended.",
            "Grill beef skewer and brush chimichurri on during the last few minutes of cooking.",
            "Serve more chimichurri on the side as a condiment."
        ],
        "processed_ingredients": [
            "113.40 g filet mignon",
            "0.19 cup olive oil",
            "0.25 bunch parsley",
            "2 cloves garlic",
            "3.00 tbsp olive oil",
            "1.00 tbsp sherry wine vinegar",
            "0.75 tbsp lemon juice",
            "0.25 tsp salt",
            "0.13 tsp ground black pepper",
            "0.13 tsp ground cayenne pepper"
        ],
        "pure_ingredients": [
            "filet mignon",
            "olive oil",
            "parsley",
            "garlic",
            "sherry wine vinegar",
            "lemon juice",
            "salt",
            "black pepper",
            "cayenne pepper"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "blender",
            "grill",
            "skewers",
            "brush"
        ]
    },
    {
        "recipe_id": "oImgxUjsnOCk6468lLT24he7ZCYlXE2",
        "recipe_title": "Curried Egg Salad on Whole Wheat Bread",
        "original_instructions": "Watch how to make this recipe.\nIn a medium bowl, combine the Greek yogurt, mayonnaise, curry powder, to taste, and stir well to combine. Add the eggs and green onions and season with salt and pepper. Gently fold the eggs into the yogurt mixture and taste for seasoning.\nLay 3 slices of bread on the work service. Divide the curried egg salad evenly among the bread slices, and top each slice with 1 piece red leaf lettuce. Top with the remaining slices of bread. Cut the sandwiches into quarters and serve immediately.",
        "ingredients": [
            "1/2 cup reduced-fat Greek yogurt",
            "1 tablespoon prepared mayonnaise",
            "1/4 teaspoon curry powder, or as needed",
            "4 hard-boiled eggs, peeled, halved, and finely chopped",
            "1 large green onion, finely chopped",
            "Kosher salt and freshly ground black pepper",
            "6 slices good-quality whole wheat bread*",
            "3 pieces red leaf lettuce"
        ],
        "step_by_step_instructions": [
            "In a medium bowl, combine 0.10 cup Greek yogurt, 0.38 tablespoon mayonnaise, and 0.05 teaspoon curry powder. Stir well.",
            "Add 0.67 finely chopped hard-boiled eggs and 0.17 finely chopped green onion to the bowl.",
            "Season with a pinch of salt and pepper.",
            "Gently fold the eggs into the yogurt mixture. Taste and adjust seasoning if needed.",
            "Lay 1 slice of whole wheat bread on a work surface.",
            "Spread the curried egg salad evenly over the bread slice.",
            "Top with 1 piece of red leaf lettuce.",
            "Place another slice of bread on top.",
            "Cut the sandwich into quarters.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "0.10 cup Greek yogurt",
            "0.38 tablespoon mayonnaise",
            "0.05 teaspoon curry powder",
            "0.67 egg",
            "0.17 cup green onion",
            "0.33 slice whole wheat bread",
            "0.33 piece red leaf lettuce",
            "0.01 tablespoon salt",
            "0.01 tablespoon pepper"
        ],
        "pure_ingredients": [
            "yogurt",
            "mayonnaise",
            "curry powder",
            "eggs",
            "onion",
            "salt",
            "pepper",
            "bread",
            "lettuce"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "bowl",
            "spoon",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "hx9rRHwiERdagscYOJ3m4rpTEQt95wy",
        "recipe_title": "Honey Spiced Roasted Chicken",
        "original_instructions": "Preheat the oven to 350 degrees F and adjust the racks to the center of the oven. Fit a roasting pan with a V-rack.\nMix together the honey, olive oil, cinnamon, smoked paprika and some salt and pepper in a small bowl.\nSprinkle the cavity of the chicken with salt and pepper. Stuff the cavity with the rosemary sprigs and lemon slices. Place the chicken in the V-rack-fitted roasting pan. Sprinkle the outside of the chicken with salt and pepper. Tie the drumsticks together using butcher's twine. Brush the outside of the chicken with about half of the honey glaze.\nTransfer the chicken to the hot oven. Roast about 30 minutes, and then brush the glaze on the chicken once more. Continue to roast the chicken until the skin is golden brown and crisp , and an instant-read thermometer reaches 165 degrees when inserted in the thickest part of the thighs, about 45 minutes longer.",
        "ingredients": [
            "2 tablespoons honey",
            "2 tablespoons olive oil",
            "1/2 teaspoon ground cinnamon",
            "1/2 teaspoon smoked paprika",
            "Kosher salt and freshly ground black pepper",
            "One 4-pound roasting chicken, rinsed, dried and giblets removed",
            "3 sprigs fresh rosemary",
            "1 lemon, sliced"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F and adjust the racks to the center of the oven.",
            "Fit a roasting pan with a V-rack.",
            "Mix together approximately 0.25 tablespoons honey, 0.25 tablespoons olive oil, 0.06 teaspoons ground cinnamon, 0.06 teaspoons smoked paprika, and a pinch of salt and pepper in a small bowl.",
            "Sprinkle the cavity of a portion of chicken with salt and pepper.",
            "Stuff the cavity with a sprig of rosemary and a slice of lemon.",
            "Place the chicken portion in the V-rack-fitted roasting pan.",
            "Sprinkle the outside of the chicken with salt and pepper.",
            "Tie the drumsticks together using butcher's twine.",
            "Brush the outside of the chicken with about half of the honey glaze prepared earlier.",
            "Transfer the chicken to the hot oven and roast about 8 minutes.",
            "Brush the glaze on the chicken once more.",
            "Continue to roast the chicken until the skin is golden brown and crisp, and an instant-read thermometer reaches 165 degrees F when inserted in the thickest part of the thighs, about 12 minutes longer."
        ],
        "processed_ingredients": [
            "0.25 tablespoon honey",
            "0.25 tablespoon olive oil",
            "0.06 teaspoon ground cinnamon",
            "0.06 teaspoon smoked paprika",
            "1.00 pinch salt",
            "1.00 pinch black pepper",
            "0.50 lb roasting chicken",
            "1.00 sprig rosemary",
            "1.00 slice lemon"
        ],
        "pure_ingredients": [
            "honey",
            "olive oil",
            "cinnamon",
            "paprika",
            "salt",
            "black pepper",
            "chicken",
            "rosemary",
            "lemon"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "oven",
            "roasting pan",
            "V-rack",
            "small bowl",
            "instant-read thermometer",
            "butcher's twine",
            "basting brush"
        ]
    },
    {
        "recipe_id": "E1LlR.jhNlsAbGcAfD8Tw3YvFKb04I6",
        "recipe_title": "Gratin Dauphinois",
        "original_instructions": "Place potatoes in a small saucepan covered with cold water and a pinch of salt. Bring to a boil over high heat, and cook for 1 1/2 minutes. Remove from heat and drain.\nHeat heavy cream in a medium saucepan with garlic over medium-low heat until reduced to 2 cups, about 30 minutes. Add drained potatoes, salt, pepper, and nutmeg. Cook over medium heat, stirring occasionally, until potatoes are tender, about 15 minutes.\nRemove garlic and divide cooked potatoes between 2 (6-inch round) gratin dishes or 1 large gratin dish. Sprinkle with cheese, and place under broiler until golden.",
        "ingredients": [
            "2 large Idaho potatoes, peeled and cut into 3/4-inch cubes, unwashed",
            "Coarse salt",
            "4 cups heavy cream",
            "1/2 head garlic, sliced horizontally",
            "Freshly ground white pepper",
            "Freshly grated nutmeg",
            "1 to 2 tablespoons freshly grated Parmigiano-Reggiano"
        ],
        "step_by_step_instructions": [
            "Peel and cut 1/2 large Idaho potato into 3/4-inch cubes.",
            "Place the potato cubes in a small saucepan, cover with cold water, add a pinch of salt, and bring to a boil over high heat. Cook for 1 1/2 minutes.",
            "Remove from heat and drain the potatoes.",
            "Heat 1 cup of heavy cream in a medium saucepan with 1/6 head of garlic, sliced horizontally, over medium-low heat until reduced to 1/2 cup, which should take about 30 minutes.",
            "Add the drained potatoes to the cream, season with salt, freshly ground white pepper, and freshly grated nutmeg.",
            "Cook over medium heat, stirring occasionally, until potatoes are tender, about 15 minutes.",
            "Remove the garlic slices from the mixture.",
            "Divide the cooked potatoes into 1 (6-inch round) gratin dish.",
            "Sprinkle with 1/2 tablespoon of freshly grated Parmigiano-Reggiano cheese.",
            "Place under the broiler until the top is golden."
        ],
        "processed_ingredients": [
            "0.50 large potato",
            "0.25 tsp coarse salt",
            "1 cup heavy cream",
            "0.17 head garlic",
            "0.13 tsp white pepper",
            "0.13 tsp nutmeg",
            "0.50 tbsp Parmigiano-Reggiano"
        ],
        "pure_ingredients": [
            "potato",
            "salt",
            "heavy cream",
            "garlic",
            "white pepper",
            "nutmeg",
            "Parmigiano-Reggiano"
        ],
        "cooking_time": "47 minutes",
        "required_tools": [
            "peeler",
            "knife",
            "small saucepan",
            "medium saucepan",
            "gratin dish",
            "broiler"
        ]
    },
    {
        "recipe_id": "bFSBb95XNoFDoQbDKmNV097x6ki7Jfe",
        "recipe_title": "Turkey Croquettes",
        "original_instructions": "In a medium-size saucepan, melt butter. Blend in flour and add milk and chicken broth. Cook and stir until mixture thickens and bubbles, and continue cooking for 1 minute more.\nAdd lemon juice, snipped parsley, and onion. Stir in celery salt and a dash each of pepper, paprika, and nutmeg. Cool.\nIn a large mixing bowl, combine sauce with the ground turkey. Chill thoroughly. With wet hands, shape mixture into balls. Roll balls one at a time in bread crumbs.\nLightly shape balls into cones. For each croquette, dip it into the mixture of egg and water, then roll in bread crumbs. Again, dip croquette in egg/flour and roll in bread crumbs. Fry croquettes in deep-fat fryer for approximately 3 minutes or until brown. Drain. Serve with turkey gravy.",
        "ingredients": [
            "6 tablespoons butter",
            "1/2 cup flour",
            "1 cup milk",
            "1 cup chicken broth",
            "2 teaspoons lemon juice",
            "2 tablespoons snipped parsley",
            "2 teaspoons grated onion",
            "1/2 teaspoon celery salt",
            "Dash each pepper, paprika, and nutmeg",
            "4 cups ground, cooked turkey",
            "3/4 cup fine bread crumbs",
            "2 eggs mixed with water",
            "Flour, for dredging"
        ],
        "step_by_step_instructions": [
            "Melt 0.75 tablespoons butter in a medium-size saucepan.",
            "Blend in 0.06 cups flour.",
            "Add 0.125 cups milk and 0.125 cups chicken broth.",
            "Cook and stir until mixture thickens and bubbles, and continue cooking for 1 minute more.",
            "Add 0.25 teaspoons lemon juice, 0.25 tablespoons snipped parsley, and 0.25 teaspoons grated onion.",
            "Stir in 0.06 teaspoons celery salt and a dash each of pepper, paprika, and nutmeg.",
            "Cool the mixture.",
            "Combine the sauce with 0.5 cups ground turkey in a large mixing bowl.",
            "Chill thoroughly.",
            "With wet hands, shape mixture into a ball.",
            "Roll the ball in 0.09 cups bread crumbs.",
            "Lightly shape the ball into a cone.",
            "Dip the croquette into 0.5 eggs mixed with water, then roll in 0.09 cups bread crumbs.",
            "Again, dip croquette in egg and roll in bread crumbs.",
            "Fry croquette in deep-fat fryer for approximately 3 minutes or until brown.",
            "Drain and serve with turkey gravy."
        ],
        "processed_ingredients": [
            "0.75 tablespoon butter",
            "0.06 cup flour",
            "0.125 cup milk",
            "0.125 cup chicken broth",
            "0.25 teaspoon lemon juice",
            "0.25 tablespoon parsley",
            "0.25 teaspoon onion",
            "0.06 teaspoon celery salt",
            "0.01 teaspoon pepper",
            "0.01 teaspoon paprika",
            "0.01 teaspoon nutmeg",
            "0.5 cup turkey",
            "0.09 cup bread crumbs",
            "0.5 egg",
            "0.06 cup flour"
        ],
        "pure_ingredients": [
            "butter",
            "flour",
            "milk",
            "chicken broth",
            "lemon juice",
            "parsley",
            "onion",
            "celery salt",
            "pepper",
            "paprika",
            "nutmeg",
            "turkey",
            "bread crumbs",
            "egg"
        ],
        "cooking_time": "1 hour",
        "required_tools": [
            "saucepan",
            "mixing bowl",
            "deep-fat fryer"
        ]
    },
    {
        "recipe_id": "ozAAkE/WamD1.9yIeIOqvHdyzM0WIIu",
        "recipe_title": "Blazing BBQ Sauce or Marinade",
        "original_instructions": "Combine all ingredients except chicken breasts. Add chicken breasts to marinade mixture and marinate chicken breasts in the refrigerator for 2 to 4 hours before grilling.\nPreheat grill. Place chicken breasts on the grill and cook until chicken is opaque in center, flipping twice during cooking, about 15 minutes total.",
        "ingredients": [
            "1 cup soy sauce",
            "1/2 cup Worcestershire sauce",
            "1 cup extra-virgin olive oil",
            "1 tablespoon black pepper",
            "2 tablespoons onion powder",
            "1 tablespoon garlic powder",
            "2 tablespoons salt",
            "1/3 cup lemon juice",
            "1/4 teaspoon cayenne pepper",
            "1/2 cup wine vinegar",
            "3/4 cup brown sugar",
            "2 tablespoons dry mustard",
            "6 chicken breasts"
        ],
        "step_by_step_instructions": [
            "Combine all ingredients except chicken breasts in a bowl to make the marinade.",
            "Add one chicken breast to the marinade mixture, ensuring it is fully coated.",
            "Marinate the chicken breast in the refrigerator for 2 to 4 hours.",
            "Preheat the grill to an appropriate temperature for grilling.",
            "Place the marinated chicken breast on the grill and cook until the chicken is opaque in the center, flipping twice during cooking, about 15 minutes total."
        ],
        "processed_ingredients": [
            "0.17 cup soy sauce",
            "0.08 cup Worcestershire sauce",
            "0.17 cup extra-virgin olive oil",
            "0.17 tablespoon black pepper",
            "0.33 tablespoon onion powder",
            "0.17 tablespoon garlic powder",
            "0.33 tablespoon salt",
            "0.06 cup lemon juice",
            "0.04 teaspoon cayenne pepper",
            "0.08 cup wine vinegar",
            "0.13 cup brown sugar",
            "0.33 tablespoon dry mustard",
            "1 chicken breast"
        ],
        "pure_ingredients": [
            "soy sauce",
            "Worcestershire sauce",
            "olive oil",
            "black pepper",
            "onion powder",
            "garlic powder",
            "salt",
            "lemon juice",
            "cayenne pepper",
            "wine vinegar",
            "brown sugar",
            "dry mustard",
            "chicken"
        ],
        "cooking_time": "4 hours 15 minutes",
        "required_tools": [
            "bowl",
            "refrigerator",
            "grill"
        ]
    },
    {
        "recipe_id": "vOuJFgvyq5JrODsujZPd9lYTMegU2Fu",
        "recipe_title": "Snakehead Fish Smoked In Rice Straw",
        "original_instructions": "Special equipment: 1 thin bamboo stick, about 2 feet (24-inches) in length\nInsert the bamboo stick through the fish's mouth, through its body and out the tail. Move the fish along so it's sitting in the middle part of the bamboo stick.\nNow dig the base of the stick into the ground, deep enough to make the stick stand on its own upright with the mouth of the fish pointing to the sky.\nPour the cup of water down the fish's mouth, and then form a pyramid like shape with the rice straw, enclosing the fish on the stick.\nCarefully, set the rice straw alight and move away.\nWhen the rice straw has finished burning, about 7 minutes, the fish is ready.\nScrape any charred skin with a sharp knife and eat directly off the stick.",
        "ingredients": [
            "1 snakehead fish or mudfish, cleaned and gutted (about 1 1/2 to 2 pounds)",
            "1 cup water",
            "11 pounds rice straw"
        ],
        "step_by_step_instructions": [
            "Insert a thin bamboo stick through the mouth of the snakehead fish, through its body and out the tail. Move the fish along so it's sitting in the middle part of the bamboo stick.",
            "Dig the base of the stick into the ground deep enough to make the stick stand on its own upright with the fish's mouth pointing to the sky.",
            "Pour approximately 0.5 cup of water down the fish's mouth.",
            "Form a pyramid-like shape with approximately 4 pounds of rice straw, enclosing the fish on the stick.",
            "Carefully set the rice straw alight and move away.",
            "Wait for about 7 minutes until the rice straw has finished burning.",
            "Scrape any charred skin from the fish with a sharp knife and eat directly off the stick."
        ],
        "processed_ingredients": [
            "0.75 lb snakehead fish",
            "0.5 cup water",
            "4 lb rice straw"
        ],
        "pure_ingredients": [
            "snakehead fish",
            "water",
            "rice straw"
        ],
        "cooking_time": "7 minutes",
        "required_tools": [
            "thin bamboo stick",
            "knife"
        ]
    },
    {
        "recipe_id": "Q0Xx09S/EiEPuhQjc0SWiTdqpPI8bla",
        "recipe_title": "Baked Spinach Ravioli",
        "original_instructions": "Preheat the broiler. Melt the butter in a large ovenproof skillet over medium-high heat. Add the onion, garlic and rosemary and cook, stirring often, until the onion is soft and just starts browning, about 6 minutes.\nSprinkle in the flour and cook, stirring, until smooth and bubbling, about 2 minutes. Stir in 2 cups water, the milk, 1/2 teaspoon salt and a few grinds of pepper. Bring to a boil, then reduce the heat to a gentle simmer. Stir in the ravioli and cook, stirring occasionally, until the ravioli are tender and the sauce thickens, 5 to 7 minutes.\nRemove from the heat. Discard the rosemary sprigs and stir in the spinach. Sprinkle with the mozzarella and grana padano. Place the skillet under the broiler until golden and bubbling, about 5 minutes.\nPhotograph by Ryan Dausch",
        "ingredients": [
            "4 tablespoons unsalted butter",
            "1 small onion, finely chopped",
            "2 cloves garlic, minced",
            "2 sprigs fresh rosemary",
            "1/4 cup all-purpose flour",
            "2 cups whole milk",
            "Kosher salt and freshly ground pepper",
            "2 9-ounce packages refrigerated cheese ravioli",
            "1 10-ounce package frozen chopped spinach, thawed and squeezed dry",
            "2 ounces low-moisture mozzarella, cut into 1/2-inch cubes",
            "1/4 cup grated grana padano or parmesan cheese"
        ],
        "step_by_step_instructions": [
            "Preheat the broiler.",
            "Melt 0.50 tablespoon butter in a large ovenproof skillet over medium-high heat.",
            "Add approximately 0.12 small onion, finely chopped, 0.25 cloves garlic, minced, and 0.25 sprigs fresh rosemary to the skillet.",
            "Cook, stirring often, until the onion is soft and just starts browning, about 6 minutes.",
            "Sprinkle in 0.03 cup all-purpose flour and cook, stirring, until smooth and bubbling, about 2 minutes.",
            "Stir in 0.25 cup water, 0.25 cup whole milk, 0.06 teaspoon salt, and a few grinds of pepper.",
            "Bring to a boil, then reduce the heat to a gentle simmer.",
            "Stir in approximately 4.50 ounces cheese ravioli and cook, stirring occasionally, until the ravioli are tender and the sauce thickens, 5 to 7 minutes.",
            "Remove from the heat and discard the rosemary sprigs.",
            "Stir in 2.50 ounces chopped spinach.",
            "Sprinkle with 0.25 ounces mozzarella and 0.03 cup grated parmesan cheese.",
            "Place the skillet under the broiler until golden and bubbling, about 5 minutes."
        ],
        "processed_ingredients": [
            "0.50 tablespoon unsalted butter",
            "0.12 small onion",
            "0.25 cloves garlic",
            "0.25 sprigs rosemary",
            "0.03 cup all-purpose flour",
            "0.25 cup whole milk",
            "0.06 teaspoon salt",
            "4.50 ounces cheese ravioli",
            "2.50 ounces spinach",
            "0.25 ounces mozzarella",
            "0.03 cup parmesan cheese"
        ],
        "pure_ingredients": [
            "butter",
            "onion",
            "garlic",
            "rosemary",
            "flour",
            "milk",
            "salt",
            "pepper",
            "ravioli",
            "spinach",
            "mozzarella",
            "parmesan"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "oven",
            "skillet",
            "stirring spoon",
            "measuring cup",
            "measuring spoon"
        ]
    },
    {
        "recipe_id": "rTmHvME35N7tPrHuuXitKTyNQftdssC",
        "recipe_title": "Apple-and-Ham Salad",
        "original_instructions": "Thinly slice the apples. Toss with the lemon juice in a large bowl.\nMake the dressing: Heat the olive oil in a skillet over medium heat. Add the shallots and 1/2 teaspoon salt and cook, stirring occasionally, until golden, about 8 minutes. Whisk in the vinegar and mustard; remove from the heat and let cool slightly. Whisk in the sour cream and 1/4 cup water.\nAdd the dressing to the bowl with the apples. Add the ham, watercress and endives. Season with salt and pepper and toss to coat.\nPhotograph by Con Poulos",
        "ingredients": [
            "3 crisp apples (such as Cortland)",
            "Juice of 1 lemon",
            "3 tablespoons extra-virgin olive oil",
            "5 shallots, thinly sliced",
            "Kosher salt",
            "2 tablespoons apple cider vinegar",
            "2 tablespoons dijon mustard",
            "1/4 cup sour cream",
            "1/2 pound deli-sliced Black Forest ham, torn into pieces",
            "2 bunches watercress, trimmed",
            "4 endives, sliced crosswise",
            "Freshly ground pepper"
        ],
        "step_by_step_instructions": [
            "Thinly slice one apple. Toss with a small amount of lemon juice in a large bowl.",
            "Heat 0.5 tablespoon of olive oil in a skillet over medium heat.",
            "Add a small portion of the thinly sliced shallots and a pinch of salt to the skillet.",
            "Cook, stirring occasionally, until the shallots are golden, about 8 minutes.",
            "Whisk in 0.3 tablespoon of apple cider vinegar and 0.3 tablespoon of dijon mustard; remove from the heat and let cool slightly.",
            "Whisk in 0.3 tablespoon of sour cream and a small amount of water to the shallot mixture to make the dressing.",
            "Add the dressing to the bowl with the apples.",
            "Add a portion of deli-sliced Black Forest ham, watercress, and endives to the bowl.",
            "Season with salt and pepper and toss to coat."
        ],
        "processed_ingredients": [
            "1 apple",
            "0.33 lemon",
            "0.5 tablespoon olive oil",
            "0.83 shallot",
            "0.08 teaspoon salt",
            "0.33 tablespoon apple cider vinegar",
            "0.33 tablespoon dijon mustard",
            "0.33 tablespoon sour cream",
            "2 ounce ham",
            "1.5 ounce watercress",
            "1 endive",
            "0.08 teaspoon pepper"
        ],
        "pure_ingredients": [
            "apple",
            "lemon",
            "olive oil",
            "shallot",
            "salt",
            "apple cider vinegar",
            "dijon mustard",
            "sour cream",
            "ham",
            "watercress",
            "endive",
            "pepper"
        ],
        "cooking_time": "8 minutes",
        "required_tools": [
            "skillet",
            "whisk",
            "bowl"
        ]
    },
    {
        "recipe_id": "8.B8s8TQpU9jsg0.UPc982FO9bDOTTS",
        "recipe_title": "Waldorf Chicken Salad Sandwiches",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 400 degrees F.\nSet the chickens on a rimmed baking sheet, sprinkle them all over with salt and pepper, and drizzle with olive oil. Roast to an internal temperature of 160 degrees F, taken between the breast and thigh, about 1 hour.\nAllow to cool. With two forks, shred all the meat off the bone.\nIn a large bowl, combine the shredded chicken, mayonnaise, grapes, walnuts, celery, apples, chives, lemon juice and big pinches of salt and pepper. Toss well.\nTo assemble the sandwiches: Fill a leaf of butter lettuce with some chicken salad. Sandwich the stuffed lettuce with two slices of bread spread with mayo. Repeat for the remaining sandwiches. Slice in half and enjoy.",
        "ingredients": [
            "2 whole chickens (3 to 4 pounds each)",
            "Salt and freshly ground black pepper",
            "Olive oil, for drizzling",
            "1/3 cup mayonnaise, plus more for serving",
            "1 cup green grapes, sliced",
            "1 cup walnuts, chopped",
            "4 ribs celery, chopped",
            "1 green apple, peeled and chopped",
            "1 bunch chives, chopped",
            "1 lemon, juiced",
            "Butter lettuce, for serving",
            "Country loaf or nice whole-wheat bread, sliced and toasted, for serving"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Set approximately 0.5 lb of chicken on a rimmed baking sheet, sprinkle with salt and pepper, and drizzle with olive oil.",
            "Roast the chicken to an internal temperature of 160 degrees F, about 1 hour.",
            "Allow the chicken to cool, then shred the meat with two forks.",
            "In a large bowl, combine about 0.5 lb of shredded chicken, 1 tbsp mayonnaise, 0.12 cup sliced green grapes, 0.12 cup chopped walnuts, 0.5 rib celery chopped, 0.12 peeled and chopped green apple, 1 tbsp chopped chives, lemon juice from 0.12 lemon, and a pinch of salt and pepper. Toss well.",
            "To assemble, fill a leaf of butter lettuce with some chicken salad.",
            "Sandwich the stuffed lettuce between two slices of bread spread with mayo.",
            "Slice in half and enjoy."
        ],
        "processed_ingredients": [
            "0.5 lb chicken",
            "0.25 tsp salt",
            "0.25 tsp black pepper",
            "0.5 tbsp olive oil",
            "1 tbsp mayonnaise",
            "0.12 cup green grapes",
            "0.12 cup walnuts",
            "0.5 rib celery",
            "0.12 green apple",
            "1 tbsp chives",
            "0.12 lemon",
            "1 leaf butter lettuce",
            "2 slices bread"
        ],
        "pure_ingredients": [
            "chicken",
            "salt",
            "black pepper",
            "olive oil",
            "mayonnaise",
            "green grapes",
            "walnuts",
            "celery",
            "green apple",
            "chives",
            "lemon",
            "butter lettuce",
            "bread"
        ],
        "cooking_time": "1 hour 15 minutes",
        "required_tools": [
            "oven",
            "rimmed baking sheet",
            "forks",
            "large bowl",
            "knife"
        ]
    },
    {
        "recipe_id": "tEMWMI3Xucn5r34PU.IrdWH1vorf2o.",
        "recipe_title": "Creamy Lemon Chicken",
        "original_instructions": "1. Between pieces of plastic wrap or waxed paper, place each chicken breast smooth side down; gently pound with flat side of meat mallet or rolling pin until about 1/2 inch thick. In small shallow dish, mix flour with 1 teaspoon salt and 1/2 teaspoon pepper; dip each chicken breast into flour mixture, coating all sides.\n2. In 10-inch skillet, heat 2 tablespoons vegetable oil over medium-high heat. Cook chicken breasts in oil 6 to 8 minutes, turning once, or until brown. In small bowl, mix cooking sauce and lemon juice.\n3. Pour sauce mixture over chicken. Reduce heat to medium-low; simmer 5 to 10 minutes or until juice of chicken is clear when center of thickest part is cut (at least 165 degrees F). Sprinkle with parsley and lemon peel. Serve with rice.",
        "ingredients": [
            "1/4 cup Gold Medal all-purpose flour",
            "4 boneless skinless chicken breasts",
            "1 can (18 oz) Progresso™ Recipe Starters™ creamy roasted garlic with chicken stock cooking sauce",
            "3 tablespoons lemon juice",
            "Chopped fresh parsley, if desired",
            "Grated lemon peel, if desired",
            "Hot cooked rice, if desired"
        ],
        "step_by_step_instructions": [
            "1. Place one chicken breast smooth side down between two pieces of plastic wrap or waxed paper. Gently pound with the flat side of a meat mallet or rolling pin until about 1/2 inch thick.",
            "2. In a small shallow dish, mix about 1 tablespoon of flour with a pinch of salt and a pinch of pepper. Dip the chicken breast into the flour mixture, coating all sides.",
            "3. In a 10-inch skillet, heat about 1/2 tablespoon of vegetable oil over medium-high heat.",
            "4. Cook the floured chicken breast in the oil for 6 to 8 minutes, turning once, or until brown.",
            "5. In a small bowl, mix approximately 1/4 cup of the cooking sauce with about 3/4 tablespoon of lemon juice.",
            "6. Pour the sauce mixture over the chicken in the skillet.",
            "7. Reduce the heat to medium-low and simmer for 5 to 10 minutes, or until the juice of the chicken is clear when the center of the thickest part is cut (at least 165 degrees F).",
            "8. Sprinkle with a small amount of chopped fresh parsley and grated lemon peel, if desired.",
            "9. Serve the chicken with about 1/2 cup of hot cooked rice, if desired."
        ],
        "processed_ingredients": [
            "1.00 tablespoon flour",
            "1.00 chicken breast",
            "4.50 ounce cooking sauce",
            "0.75 tablespoon lemon juice",
            "1.00 tablespoon parsley",
            "1.00 tablespoon lemon peel",
            "0.50 cup rice"
        ],
        "pure_ingredients": [
            "flour",
            "chicken breast",
            "cooking sauce",
            "lemon juice",
            "parsley",
            "lemon peel",
            "rice",
            "salt",
            "pepper",
            "vegetable oil"
        ],
        "cooking_time": "28 minutes",
        "required_tools": [
            "plastic wrap or waxed paper",
            "meat mallet or rolling pin",
            "shallow dish",
            "skillet",
            "small bowl"
        ]
    },
    {
        "recipe_id": "HThqRw97HDhMH4K3fjyWQOMLAI1B.wq",
        "recipe_title": "Tuscan Chicken",
        "original_instructions": "Heat a large, deep skillet over medium high heat. Season chicken with salt and pepper. Add 2 tablespoons extra-virgin olive oil, half the chicken pieces, and a couple of crushed cloves of garlic.\nBrown chicken 2 minutes on each side and remove from pan. Add remaining oil, another single turn of the pan, remaining chicken pieces and garlic. Brown chicken 2 minutes on each side and remove. Add vinegar to the pan. Let it cook off.\nAdd butter, shallots, and rosemary to the pan and cook 2 minutes, add flour and cook 1 minute more. Whisk in wine, reduce 1 minute. Whisk in broth and bring liquids up to a bubble. Return chicken to the pan and simmer over moderate heat 7 to 8 minutes to finish cooking chicken through.\nDessert: This is a very rich meal. My suggestion for dessert is to set out a small cookie tray and offer coffee or tea.",
        "ingredients": [
            "2 pounds boneless, skinless chicken thighs",
            "1 1/2 pounds chicken breast tenderloins",
            "Salt and pepper",
            "3 tablespoons extra-virgin olive oil",
            "6 cloves garlic, crushed",
            "3 tablespoons white wine vinegar",
            "2 tablespoons butter",
            "2 shallots, chopped",
            "6 sprigs fresh rosemary, finely chopped",
            "2 tablespoons flour",
            "1 cup dry white wine",
            "2 cups beef broth (yes, beef broth)"
        ],
        "step_by_step_instructions": [
            "Heat a large, deep skillet over medium high heat.",
            "Season approximately 0.33 pounds of chicken with salt and pepper.",
            "Add 0.33 tablespoons extra-virgin olive oil, half of the chicken pieces, and 1 crushed clove of garlic to the skillet.",
            "Brown chicken for 2 minutes on each side and remove from the pan.",
            "Add the remaining 0.17 tablespoons of oil, another single turn of the pan, remaining chicken pieces and garlic.",
            "Brown chicken for 2 minutes on each side and remove from the pan.",
            "Add 0.5 tablespoons of white wine vinegar to the pan and let it cook off.",
            "Add 0.33 tablespoons of butter, 0.33 shallots, and 1 sprig of rosemary to the pan and cook for 2 minutes.",
            "Add 0.33 tablespoons of flour and cook for 1 minute more.",
            "Whisk in 0.17 cups of wine, reduce for 1 minute.",
            "Whisk in 0.33 cups of beef broth and bring liquids up to a bubble.",
            "Return chicken to the pan and simmer over moderate heat for 7 to 8 minutes to finish cooking chicken through."
        ],
        "processed_ingredients": [
            "0.33 lb chicken thighs",
            "0.25 lb chicken breast tenderloins",
            "0.5 tsp salt",
            "0.5 tsp pepper",
            "0.5 tbsp extra-virgin olive oil",
            "1 clove garlic",
            "0.5 tbsp white wine vinegar",
            "0.33 tbsp butter",
            "0.33 shallots",
            "1 sprig rosemary",
            "0.33 tbsp flour",
            "1.33 oz white wine",
            "2.67 oz beef broth"
        ],
        "pure_ingredients": [
            "chicken",
            "salt",
            "pepper",
            "olive oil",
            "garlic",
            "white wine vinegar",
            "butter",
            "shallots",
            "rosemary",
            "flour",
            "white wine",
            "beef broth"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "skillet",
            "whisk"
        ]
    }
]