[
    {
        "recipe_id": "nigtST6Cp7UvJUtIe1HE6jnY3Ra/zmq",
        "recipe_title": "Broccoli-Cheddar Cornbread",
        "original_instructions": "Preheat the oven to 400 degrees F. Coat a 9-inch-square baking dish or a 9-inch cast-iron skillet with cooking spray. Whisk the cornmeal, flour, sugar, baking powder, baking soda and 1/4 teaspoon salt in a large bowl. In a separate bowl, whisk the egg, milk, sour cream and melted butter; whisk into the dry ingredients until combined. Fold in the scallions, broccoli and cheddar cheese.\nPour the batter into the prepared dish or skillet. Bake until the cornbread springs back when pressed in the center, 25 to 35 minutes. Let cool 15 minutes in the dish, then loosen the edges and slice.",
        "ingredients": [
            "Cooking spray",
            "1 1/2 cups yellow cornmeal",
            "1/4 cup all-purpose flour",
            "2 tablespoons sugar",
            "1 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "Kosher salt",
            "1 egg",
            "1 cup milk",
            "1 cup sour cream or plain Greek yogurt",
            "2 tablespoons unsalted butter, melted",
            "1/2 cup chopped scallions",
            "1/2 cup chopped broccoli florets, blanched",
            "1/2 cup grated cheddar cheese"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Coat a 9-inch-square baking dish or a 9-inch cast-iron skillet with cooking spray.",
            "Whisk 0.38 cup of yellow cornmeal, 0.06 cup of all-purpose flour, 0.5 tablespoon of sugar, 0.13 teaspoon of baking powder, 0.06 teaspoon of baking soda, and a pinch of kosher salt in a large bowl.",
            "In a separate bowl, whisk 0.25 of an egg, 0.25 cup of milk, 0.25 cup of sour cream, and 0.5 tablespoon of melted butter.",
            "Whisk the wet ingredients into the dry ingredients until combined.",
            "Fold in 0.13 cup of chopped scallions, 0.13 cup of chopped blanched broccoli florets, and 0.13 cup of grated cheddar cheese.",
            "Pour the batter into the prepared dish or skillet.",
            "Bake until the cornbread springs back when pressed in the center, about 25 to 35 minutes.",
            "Let cool for about 15 minutes in the dish, then loosen the edges and slice."
        ],
        "processed_ingredients": [
            "0.38 cup yellow cornmeal",
            "0.06 cup all-purpose flour",
            "0.5 tablespoon sugar",
            "0.13 teaspoon baking powder",
            "0.06 teaspoon baking soda",
            "0.25 egg",
            "0.25 cup milk",
            "0.25 cup sour cream",
            "0.5 tablespoon unsalted butter",
            "0.13 cup chopped scallions",
            "0.13 cup chopped broccoli florets",
            "0.13 cup grated cheddar cheese",
            "0.06 teaspoon kosher salt"
        ],
        "pure_ingredients": [
            "cooking spray",
            "yellow cornmeal",
            "all-purpose flour",
            "sugar",
            "baking powder",
            "baking soda",
            "salt",
            "egg",
            "milk",
            "sour cream",
            "unsalted butter",
            "scallions",
            "broccoli",
            "cheddar cheese"
        ],
        "cooking_time": "50 minutes",
        "required_tools": [
            "oven",
            "9-inch-square baking dish",
            "9-inch cast-iron skillet",
            "whisk",
            "large bowl"
        ]
    },
    {
        "recipe_id": "t536oYNed6hojUEcb0o6KS7vGdxCa0m",
        "recipe_title": "Grilled Avocado and Tomatoes, Basil Oil and Cotija Cheese with Pine Nuts",
        "original_instructions": "Watch how to make this recipe.\nCombine oil, basil, salt and pepper in a blender and blend for 1 minute. Strain into a bowl, discard solids\nCombine tomatoes and onion in a bowl, add a few tablespoons of the basil oil and season with salt and pepper. Reserve remaining basil oil for Shrimp recipe.\nHeat grill to medium heat. Brush avocado with oil on grill and season with salt and pepper. Grill cut side down until lightly golden brown, about 2 minutes. Remove to a platter, cut side up. Place some of the tomato mixture on top of each avocado, drizzle with more of the oil and sprinkle with the pine nuts and cheese. Garnish with basil leaves.",
        "ingredients": [
            "3/4 cup extra-virgin olive oil",
            "16 basil leaves",
            "Salt and freshly ground black pepper",
            "2 ripe beef steak tomatoes, halves and seeded and finely diced",
            "1/2 small red onion",
            "2 ripe Hass avocados, halved and peeled and pitted",
            "Canola oil",
            "1/4 cup pine nuts, lightly toasted",
            "1/4 cup cotija cheese, grated",
            "Basil leaves"
        ],
        "step_by_step_instructions": [
            "Combine 0.09 cup of olive oil, 2 basil leaves, a pinch of salt and a pinch of pepper in a blender and blend for 1 minute.",
            "Strain the mixture into a bowl and discard the solids.",
            "In another bowl, combine 0.25 of a diced tomato and 0.08 of a diced red onion.",
            "Add a few teaspoons of the basil oil to the tomato mixture and season with a pinch of salt and pepper.",
            "Reserve the remaining basil oil for another use.",
            "Heat the grill to medium heat.",
            "Brush 0.5 of an avocado with canola oil and season with a pinch of salt and pepper.",
            "Grill the avocado cut side down until lightly golden brown, about 2 minutes.",
            "Remove the avocado to a platter, cut side up.",
            "Place some of the tomato mixture on top of each avocado half.",
            "Drizzle with a bit more of the basil oil.",
            "Sprinkle with 0.5 tablespoon of pine nuts and 0.5 tablespoon of cotija cheese.",
            "Garnish with a few basil leaves."
        ],
        "processed_ingredients": [
            "0.09 cup extra-virgin olive oil",
            "2 basil leaves",
            "0.25 beef steak tomato",
            "0.08 small red onion",
            "0.5 Hass avocado",
            "1 teaspoon canola oil",
            "0.5 tablespoon pine nuts",
            "0.5 tablespoon cotija cheese",
            "pinch salt",
            "pinch pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "basil",
            "salt",
            "pepper",
            "tomato",
            "red onion",
            "avocado",
            "canola oil",
            "pine nuts",
            "cotija cheese"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "blender",
            "grill",
            "strainer",
            "bowl",
            "platter"
        ]
    },
    {
        "recipe_id": ".0YokPJ6mBR3sITiA.KjZolpNeJ5gky",
        "recipe_title": "Apple Slaw ",
        "original_instructions": "Put the apple, cabbage, garlic, chile, spring onion, and cilantro in a medium bowl. Pour over the vinegar, season with salt and pepper, and toss to combine.\nPut the apple, cabbage, garlic, chile, spring onion, and cilantro in a medium bowl. Pour over the vinegar, season with salt and pepper, and toss to combine.",
        "ingredients": [
            "2 green apples, coarsely grated",
            "1/3 head red cabbage, coarsely grated",
            "1 garlic clove, crushed",
            "1 red chile, finely chopped (keep the seeds if you like it hot)",
            "8 scallions (spring onions), finely sliced",
            "1 handful cilantro, leaves picked",
            "1 1/4 cups (300 ml) white wine vinegar or apple cider vinegar"
        ],
        "step_by_step_instructions": [
            "Grate approximately 0.67 green apple and put it in a medium bowl.",
            "Grate approximately 0.11 head of red cabbage and add to the bowl.",
            "Crush 0.12 garlic clove and add to the bowl.",
            "Finely chop approximately 0.12 red chile (including seeds if desired) and add to the bowl.",
            "Finely slice about 1 spring onion and add to the bowl.",
            "Pick and add about 0.12 handful of cilantro leaves to the bowl.",
            "Pour approximately 0.16 cup (38 ml) of apple cider vinegar over the ingredients.",
            "Season the mixture with salt and pepper to taste.",
            "Toss all the ingredients together to combine evenly."
        ],
        "processed_ingredients": [
            "0.67 green apple",
            "0.11 head red cabbage",
            "0.12 clove garlic",
            "0.12 red chile",
            "1 spring onion",
            "0.12 handful cilantro leaves",
            "0.16 cup apple cider vinegar",
            "1 teaspoon salt",
            "0.5 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "apple",
            "cabbage",
            "garlic",
            "chile",
            "scallion",
            "cilantro",
            "vinegar",
            "salt",
            "pepper"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "medium bowl",
            "grater",
            "knife",
            "cutting board",
            "measuring cup",
            "measuring spoon"
        ]
    },
    {
        "recipe_id": "Fek6h4qzwhE/U4b7qTMpYVTItLc7Tie",
        "recipe_title": "Pizzoccheri",
        "original_instructions": "Mix the flours in a bowl and make a well in the middle. Beat the eggs, olive oil and 6 tablespoons cold water in a measuring cup and pour into the well. Stir with a fork.\nCut the dough into 6 pieces; wrap 5 pieces in plastic. Roll out 1 piece into a 12-by- 18-inch rectangle on a floured surface (about 18-inch thick).\nTurn the dough out onto a floured surface and knead until smooth, 5 minutes.Wrap in plastic wrap and let rest at room temperature, about 30 minutes.\nCut crosswise into 1/2-inch-wide strips, then cut the strips in half. Toss the pasta with flour on a baking sheet. Repeat with the remaining dough.\nPhotograph by Anna Williams",
        "ingredients": [
            "2 3/4 cups all-purpose flour, plus more for dusting",
            "3/4 cup buckwheat flour",
            "3 large eggs",
            "3 tablespoons extra-virgin olive oil"
        ],
        "step_by_step_instructions": [
            "Mix approximately 0.46 cups of all-purpose flour and 0.125 cups of buckwheat flour in a bowl and make a well in the middle.",
            "Beat 0.5 large eggs, 0.5 tablespoons of extra-virgin olive oil and 1 tablespoon of cold water in a measuring cup and pour into the well.",
            "Stir with a fork to combine the ingredients.",
            "Cut the dough into 1 piece, wrap the remaining dough in plastic.",
            "Roll out the dough piece into a 12-by-18-inch rectangle on a floured surface (about 18-inch thick).",
            "Turn the dough out onto a floured surface and knead until smooth, about 5 minutes.",
            "Wrap the dough in plastic wrap and let rest at room temperature, about 30 minutes.",
            "Cut the dough crosswise into 1/2-inch-wide strips, then cut the strips in half.",
            "Toss the pasta with flour on a baking sheet."
        ],
        "processed_ingredients": [
            "0.46 cup all-purpose flour",
            "0.125 cup buckwheat flour",
            "0.5 large egg",
            "0.5 tablespoon extra-virgin olive oil",
            "1 tablespoon cold water"
        ],
        "pure_ingredients": [
            "all-purpose flour",
            "buckwheat flour",
            "egg",
            "olive oil",
            "water"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "bowl",
            "measuring cup",
            "fork",
            "plastic wrap",
            "floured surface",
            "baking sheet"
        ]
    },
    {
        "recipe_id": "S31pjGmUCiqqmKpABkXRxq6HzgEHtXa",
        "recipe_title": "Veggie Scrambles with Pesto",
        "original_instructions": "Heat a large nonstick skillet over medium heat. Add extra-virgin olive oil, 3 turns of the pan, then onions and peppers. Cook 6 to 7 minutes then add peas and cook another minute. Whisk eggs with salt and pepper then add to veggies and scramble to desired doneness. Remove from heat and stir in pesto then plate up and serve.",
        "ingredients": [
            "3 tablespoons extra-virgin olive oil, 3 turns of the pan",
            "1 medium onion, chopped",
            "1 small red bell pepper, chopped",
            "1 cup frozen green peas",
            "8 eggs",
            "Salt and pepper",
            "8 rounded teaspoonfuls store bought, good quality basil pesto sauce"
        ],
        "step_by_step_instructions": [
            "Heat a large nonstick skillet over medium heat.",
            "Add 0.38 tablespoon of extra-virgin olive oil, then add 0.13 cup of chopped onions and 0.13 cup of chopped red bell pepper.",
            "Cook for 6 to 7 minutes, then add 0.13 cup of frozen green peas and cook for another minute.",
            "Whisk 1 egg with salt and pepper, then add the egg to the veggies and scramble to desired doneness.",
            "Remove from heat and stir in 1 rounded teaspoonful of basil pesto sauce, then plate up and serve."
        ],
        "processed_ingredients": [
            "0.38 tablespoon extra-virgin olive oil",
            "0.13 cup onion",
            "0.13 cup red bell pepper",
            "0.13 cup green peas",
            "1 egg",
            "0.13 teaspoon salt",
            "0.13 teaspoon pepper",
            "1 teaspoon basil pesto sauce"
        ],
        "pure_ingredients": [
            "olive oil",
            "onion",
            "red bell pepper",
            "green peas",
            "egg",
            "salt",
            "pepper",
            "basil"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "nonstick skillet",
            "whisk",
            "spatula"
        ]
    },
    {
        "recipe_id": "yu0wxDHcI0xXP1hx6gBbpOVXEiaycje",
        "recipe_title": "Rice Pilaf",
        "original_instructions": "Heat olive oil in a medium saucepan and saute onion and garlic until the onion begins to turn translucent. Add rice and stir to coat with oil, onions and garlic, and let rice \"toast\" lightly. Stir in chicken stock and poultry seasoning and bring to a boil. Then reduce heat and simmer covered until all liquid is absorbed, about 20 minutes. Remove from heat and flake rice.",
        "ingredients": [
            "1/4 cup olive oil",
            "1 medium onion, finely chopped",
            "2 cloves garlic, finely chopped",
            "2 cups white rice",
            "1 quart chicken stock",
            "1 teaspoon poultry seasoning"
        ],
        "step_by_step_instructions": [
            "Heat 0.5 tablespoon of olive oil in a small saucepan.",
            "Saute 0.08 cup of finely chopped onion and 0.4 cloves of finely chopped garlic until the onion begins to turn translucent.",
            "Add 0.33 cups of white rice and stir to coat with oil, onions, and garlic, and let rice 'toast' lightly.",
            "Stir in 0.5 cups of chicken stock and 0.17 teaspoon of poultry seasoning and bring to a boil.",
            "Reduce heat and simmer covered until all liquid is absorbed, about 20 minutes.",
            "Remove from heat and flake rice."
        ],
        "processed_ingredients": [
            "0.5 tablespoon olive oil",
            "0.08 cup onion",
            "0.4 clove garlic",
            "0.33 cup white rice",
            "0.5 cup chicken stock",
            "0.17 teaspoon poultry seasoning"
        ],
        "pure_ingredients": [
            "olive oil",
            "onion",
            "garlic",
            "rice",
            "chicken stock",
            "poultry seasoning"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "saucepan",
            "measuring spoons",
            "measuring cups",
            "knife",
            "cutting board",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "qN5cXFUVetNBWpwrzZjaa0T/3GnYSAa",
        "recipe_title": "Roasted Tomatoes",
        "original_instructions": "Preheat the oven to 450 degrees F.\nArrange the tomatoes on a sheet pan, cut sides up, in a single layer. Drizzle with olive oil and balsamic vinegar. Sprinkle the garlic, sugar, salt, and pepper over the tomatoes. Roast for 25 to 30 minutes, until the tomatoes are concentrated and beginning to caramelize. Serve warm or at room temperature.",
        "ingredients": [
            "12 plum tomatoes, halved lengthwise, cores and seeds removed",
            "4 tablespoons good olive oil",
            "1 1/2 tablespoons balsamic vinegar",
            "2 large garlic cloves, minced",
            "2 teaspoons sugar",
            "1 1/2 teaspoons kosher salt",
            "1/2 teaspoon freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450 degrees F.",
            "Halve 2 plum tomatoes lengthwise, and remove the cores and seeds.",
            "Arrange the halved tomatoes on a sheet pan, cut sides up, in a single layer.",
            "Drizzle about 0.33 tablespoon of olive oil and 0.13 tablespoon of balsamic vinegar over the tomatoes.",
            "Sprinkle approximately 0.33 minced garlic cloves, 0.33 teaspoon of sugar, 0.25 teaspoon of kosher salt, and 0.08 teaspoon of freshly ground black pepper over the tomatoes.",
            "Roast in the preheated oven for 25 to 30 minutes, until the tomatoes are concentrated and beginning to caramelize.",
            "Serve the roasted tomatoes warm or at room temperature."
        ],
        "processed_ingredients": [
            "2.00 oz plum tomatoes",
            "0.33 tbsp olive oil",
            "0.13 tbsp balsamic vinegar",
            "0.33 clove garlic",
            "0.33 tsp sugar",
            "0.25 tsp kosher salt",
            "0.08 tsp black pepper"
        ],
        "pure_ingredients": [
            "tomato",
            "olive oil",
            "balsamic vinegar",
            "garlic",
            "sugar",
            "salt",
            "black pepper"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "oven",
            "sheet pan"
        ]
    },
    {
        "recipe_id": "d0ATZBvMJ1BSCPmpimxvXpV6WwFMeAa",
        "recipe_title": "Cornbread",
        "original_instructions": "Preheat the oven to 400 degrees F. Butter a 9-inch cast iron skillet.\nIn a large bowl, whisk together the cornmeal, flour, baking powder, and salt.\nIn a standing mixer fitted with the paddle attachment, or with a hand-held electric mixer and a large bowl, combine the butter and sugar and mix until light and airy. Add the eggs one at a time, mixing well between each addition.\nAdd the cornmeal mixture to the butter mixture in 3 parts, alternating with the milk in 2 parts, until just combined into a thick batter. Using a rubber spatula, scrape the batter into the prepared pan and smooth the top. Bake until lightly browned and a toothpick inserted in the center comes out clean, about 30 minutes. Set aside to cool slightly before serving.",
        "ingredients": [
            "2 cups stone-ground yellow cornmeal",
            "1 cup all-purpose flour",
            "4 teaspoons baking powder",
            "3/4 teaspoon fine salt",
            "6 tablespoons unsalted butter, at room temperature, plus more for preparing the pan",
            "1/4 cup sugar",
            "2 large eggs, at room temperature",
            "2 cups milk"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Butter a 9-inch cast iron skillet.",
            "In a large bowl, whisk together 0.33 cup cornmeal, 0.17 cup flour, 0.67 teaspoon baking powder, and 0.13 teaspoon salt.",
            "In another bowl, combine 1 tablespoon butter and 1 tablespoon sugar and mix until light and airy.",
            "Add 0.33 egg to the butter mixture, mixing well.",
            "Add the cornmeal mixture to the butter mixture in 3 parts, alternating with 0.33 cup milk in 2 parts, until just combined into a thick batter.",
            "Using a rubber spatula, scrape the batter into the prepared pan and smooth the top.",
            "Bake until lightly browned and a toothpick inserted in the center comes out clean, about 30 minutes.",
            "Set aside to cool slightly before serving."
        ],
        "processed_ingredients": [
            "0.33 cup stone-ground yellow cornmeal",
            "0.17 cup all-purpose flour",
            "0.67 teaspoon baking powder",
            "0.13 teaspoon fine salt",
            "1 tablespoon unsalted butter",
            "1 tablespoon sugar",
            "0.33 large egg",
            "0.33 cup milk"
        ],
        "pure_ingredients": [
            "cornmeal",
            "flour",
            "baking powder",
            "salt",
            "butter",
            "sugar",
            "eggs",
            "milk"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "oven",
            "cast iron skillet",
            "large bowl",
            "whisk",
            "standing mixer or hand-held electric mixer",
            "rubber spatula",
            "toothpick"
        ]
    },
    {
        "recipe_id": "Q8Ww3sYsaKBgNZmj9XjnNTEw.UjuzA.",
        "recipe_title": "Traditional Supper Stuffing with Cider Gravy",
        "original_instructions": "Watch how to make this recipe.\nHeat the oven to 325 degrees F and scatter bread on baking sheet, season with poultry seasoning and bake to toast bread, 10-12 minutes.\nQuarter the apples and slice into each quarter on an angle to cut away the core. Chop apples into bite size pieces.\nHeat a large skillet over medium heat with 3 tablespoons butter, when the butter melts, add the apples, onions, celery, bay leaf and parsley. Season with salt and pepper and cook until tender, 7 to 8 minutes. Add turkey to the skillet and combine with vegetables, heat through 2 to 3 minutes then fold in bread and moisten with about 2 cups chicken stock.\nWhile stuffing cooks, melt 3 tablespoons butter in a sauce pan over medium heat and whisk in flour, 1 minute, whisk in cider and chicken stock and season with salt and pepper to taste, reduce 4 to 5 minutes.\nServe stuffing doused with 1/2 cup gravy.",
        "ingredients": [
            "4-5 cups farmhouse-style crusty bread, cut into 1-inch cubes",
            "1 teaspoon poultry seasoning, 1/3 palmful",
            "6 tablespoons butter, divided",
            "4 McIntosh, Golden Delicious, Gala or Honey Crisp apples",
            "2 onions, chopped into bite size pieces",
            "6 ribs celery from the heart, chopped into bite sized pieces",
            "1 fresh bay leaf",
            "Salt and pepper",
            "A handful flat-leaf parsley, chopped",
            "2 pounds roast turkey breast, 3 slices - inch thick from the deli counter, cut into bite sized cubes",
            "4 cups chicken stock, divided",
            "3 tablespoons all-purpose flour",
            "1 cup apple cider"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 325 degrees F.",
            "Scatter approximately 1 cup of bread cubes on a baking sheet, season with a pinch of poultry seasoning, and bake to toast for about 10-12 minutes.",
            "Quarter 1 apple and slice to remove the core, then chop it into bite-sized pieces.",
            "Chop about 0.5 onion into bite-sized pieces.",
            "Chop about 1 celery rib into bite-sized pieces.",
            "Heat a large skillet over medium heat with 1 tablespoon of butter.",
            "Once the butter melts, add the chopped apple, onion, celery, a small piece of bay leaf, and a pinch of parsley to the skillet.",
            "Season with salt and pepper and cook until the mixture is tender, about 7-8 minutes.",
            "Add approximately 3 oz of turkey breast cubes to the skillet and combine with the vegetables, heating through for 2-3 minutes.",
            "Fold in the toasted bread cubes and moisten the mixture with about 0.5 cup of chicken stock.",
            "While the stuffing cooks, melt 1 tablespoon of butter in a saucepan over medium heat.",
            "Whisk in 1 teaspoon of flour for 1 minute.",
            "Whisk in about 0.25 cup of apple cider and 0.5 cup of chicken stock, then season with salt and pepper to taste.",
            "Reduce the gravy for about 4-5 minutes.",
            "Serve the stuffing doused with about 2 tablespoons of the gravy."
        ],
        "processed_ingredients": [
            "1 cup bread",
            "0.08 teaspoon poultry seasoning",
            "2 tablespoon butter",
            "1 apple",
            "0.5 onion",
            "1 rib celery",
            "0.17 leaf bay leaf",
            "0.25 cup parsley",
            "3 oz turkey breast",
            "1 cup chicken stock",
            "1 teaspoon flour",
            "0.25 cup apple cider"
        ],
        "pure_ingredients": [
            "bread",
            "poultry seasoning",
            "butter",
            "apple",
            "onion",
            "celery",
            "bay leaf",
            "salt",
            "pepper",
            "parsley",
            "turkey",
            "chicken stock",
            "flour",
            "apple cider"
        ],
        "cooking_time": "35 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "large skillet",
            "saucepan",
            "whisk"
        ]
    },
    {
        "recipe_id": "RP32WnHhq3RRP3MaegXu5wbNPnEzTva",
        "recipe_title": "Roasted Pears with Amaretti and Amaretto",
        "original_instructions": "Preheat oven to 425 degrees F.\nMix amaretto and vinegar in a 13 by 9-inch baking dish. Put pears, cut sides down, in dish.\nRoast pears 15 minutes. Add water and roast until pears are tender but still hold their shape, 8 to 10 minutes more.\nArrange pears, cut sides up, on a platter and spoon pan juices over them. Sprinkle with half of cookie crumbs, then baste with pan juices. Sprinkle with remaining crumbs and serve warm or at room temperature.",
        "ingredients": [
            "3 tablespoons amaretto or other almond-flavored liqueur",
            "1 tablespoon balsamic vinegar",
            "4 firm-ripe Bartlett pears, halved lengthwise and cored",
            "1/3 cup water",
            "4 amaretti cookies (Italian almond macaroons; 1/2 inch in diameter), crumbled"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 425 degrees F.",
            "Mix 0.75 tablespoons amaretto and 0.25 tablespoons balsamic vinegar in a small baking dish.",
            "Cut 1 pear in half lengthwise and core it.",
            "Place the pear halves, cut sides down, in the dish.",
            "Roast the pears for 15 minutes.",
            "Add 0.08 cups of water to the dish and continue roasting until the pears are tender but still hold their shape, about 8 to 10 minutes more.",
            "Arrange the pear halves, cut sides up, on a platter and spoon the pan juices over them.",
            "Sprinkle with half of the crumbled cookies, then baste with pan juices.",
            "Sprinkle with the remaining cookie crumbs and serve warm or at room temperature."
        ],
        "processed_ingredients": [
            "0.75 tablespoon amaretto",
            "0.25 tablespoon balsamic vinegar",
            "1 pear",
            "0.08 cup water",
            "1 amaretti cookie"
        ],
        "pure_ingredients": [
            "amaretto",
            "balsamic vinegar",
            "pear",
            "water",
            "amaretti cookies"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "oven",
            "baking dish",
            "spoon",
            "platter"
        ]
    },
    {
        "recipe_id": "ASbH9sJK76T0EfH0PjglwUm//ApN8F6",
        "recipe_title": "Blistered Green Beans",
        "original_instructions": "Heat a cast-iron skillet over medium-high heat. Add the butter and when melted, add the beans. Let the beans sit and blister for about 90 seconds, then toss and allow to blister some more. Add the soy sauce, toss to coat the beans and serve.",
        "ingredients": [
            "2 tablespoons butter",
            "8 ounces green beans, trimmed",
            "1 tablespoon soy sauce"
        ],
        "step_by_step_instructions": [
            "Heat a cast-iron skillet over medium-high heat.",
            "Add 0.50 tablespoons butter to the skillet and let it melt.",
            "Add 4 ounces green beans to the skillet.",
            "Let the beans sit and blister for about 90 seconds.",
            "Toss the beans and allow to blister some more.",
            "Add 0.50 tablespoons soy sauce to the skillet.",
            "Toss to coat the beans with the soy sauce.",
            "Serve the beans."
        ],
        "processed_ingredients": [
            "0.50 tablespoon butter",
            "4.00 ounce green beans",
            "0.50 tablespoon soy sauce"
        ],
        "pure_ingredients": [
            "butter",
            "green beans",
            "soy sauce"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "cast-iron skillet"
        ]
    },
    {
        "recipe_id": "P5sKOcU94Ix3VK.IsbSTPNX503gFbTa",
        "recipe_title": "Roasted Peruvian Potatoes",
        "original_instructions": "Preheat oven to 400 degrees F.\nHalve the potatoes and place them in a bowl. Cover them with water if you cut them ahead of time.\nIn another bowl, mix olive oil, oregano, garlic, salt, and pepper. Mix well. Drain potatoes well and add them to the oil mixture. Toss with olive oil mixture. Spread the potatoes on a sheet pan. Roast for 30 minutes until potatoes are tender. Sprinkle with cilantro and serve.",
        "ingredients": [
            "2 pounds Peruvian purple potatoes, scrubbed",
            "1/2 cup extra-virgin olive oil",
            "1 tablespoon Mexican oregano",
            "1 tablespoon minced garlic",
            "Salt and freshly ground black pepper",
            "1 tablespoon cilantro"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 400 degrees F.",
            "Halve approximately 0.5 pounds of Peruvian purple potatoes and place them in a bowl. Cover them with water if you cut them ahead of time.",
            "In another bowl, mix 2 tablespoons of extra-virgin olive oil, 0.25 tablespoon of Mexican oregano, 0.25 tablespoon of minced garlic, a pinch of salt, and a pinch of freshly ground black pepper. Mix well.",
            "Drain potatoes well and add them to the oil mixture. Toss with olive oil mixture.",
            "Spread the potatoes on a sheet pan.",
            "Roast for 30 minutes until potatoes are tender.",
            "Sprinkle with 0.25 tablespoon of cilantro and serve."
        ],
        "processed_ingredients": [
            "0.5 lb Peruvian purple potatoes",
            "2 tbsp extra-virgin olive oil",
            "0.25 tbsp Mexican oregano",
            "0.25 tbsp minced garlic",
            "1 pinch salt",
            "1 pinch black pepper",
            "0.25 tbsp cilantro"
        ],
        "pure_ingredients": [
            "potato",
            "olive oil",
            "oregano",
            "garlic",
            "salt",
            "pepper",
            "cilantro"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "oven",
            "bowl",
            "sheet pan"
        ]
    },
    {
        "recipe_id": "8cTtpIUVhfNpKsXRqni5ZNjy.U8fWGG",
        "recipe_title": "10-Minute White Pizza",
        "original_instructions": "Watch how to make this recipe.\nPreheat oven to 500 degrees F.\nPut the pizza shell or focaccia onto a pizza pan or cookie sheet. Drizzle shell with oil and scatter minced garlic over shell to edges. Cover the pie with a layer of all 3 cheeses combined and work all the way to the edge of the shells. Top with artichoke hearts. Cook 6 to 8 minutes, until cheeses have melted and begin to bubble. Remove from oven and garnish with parsley. Cut pie with pizza wheel or knife into bite-size squares and serve.",
        "ingredients": [
            "1 package thin crust prepared pizza shell or prepared focaccia, 16 ounces",
            "Extra-virgin olive oil, for drizzling",
            "3 large cloves garlic, minced",
            "1 cup shredded mozzarella (found in dairy aisle)",
            "1 cup shredded provolone (found in dairy aisle)",
            "1/4 cup grated Parmigiano Reggiano or Romano (a handful)",
            "1 (15-ounce) can artichoke hearts in water, drained and thinly sliced",
            "1/4 cup chopped parsley"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 500 degrees F.",
            "Place approximately 4 ounces of the pizza shell or focaccia onto a pizza pan or cookie sheet.",
            "Drizzle the shell with about 0.25 tablespoon of olive oil.",
            "Scatter around 0.5 clove of minced garlic over the shell to the edges.",
            "Combine 0.25 cup of shredded mozzarella, 0.25 cup of shredded provolone, and 0.06 cup of grated Parmigiano Reggiano or Romano.",
            "Cover the pie with the mixed cheeses all the way to the edge of the shell.",
            "Top with about 3.75 ounces of sliced artichoke hearts.",
            "Cook in the oven for 6 to 8 minutes, until the cheeses have melted and begin to bubble.",
            "Remove from oven and garnish with approximately 0.06 cup of chopped parsley.",
            "Cut the pie into bite-size squares and serve."
        ],
        "processed_ingredients": [
            "4.00 oz pizza shell",
            "0.25 tbsp olive oil",
            "0.50 clove garlic",
            "0.25 cup mozzarella",
            "0.25 cup provolone",
            "0.06 cup Parmigiano Reggiano",
            "3.75 oz artichoke hearts",
            "0.06 cup parsley"
        ],
        "pure_ingredients": [
            "pizza shell",
            "olive oil",
            "garlic",
            "mozzarella",
            "provolone",
            "Parmigiano Reggiano",
            "artichoke hearts",
            "parsley"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "oven",
            "pizza pan",
            "cookie sheet",
            "knife",
            "pizza wheel"
        ]
    },
    {
        "recipe_id": "5HgE9J84XflKVXywGYYde7yDjmBXY0W",
        "recipe_title": "French Potato Puree",
        "original_instructions": "Put the potatoes, whole, in a pot and cover with cold water. Salt the water. Bring to a boil, and simmer until very tender, about 30 minutes, depending on size.\nMeanwhile, drop the garlic, bay leaf, and thyme in a saucepan with the milk, bring to a boil, turn off the heat, cover, and set aside to infuse 10 minutes. Pull out the garlic and herbs, and discard.\nWhen the potatoes are done, drain them and peel while hot. Put them through a food mill set on the smallest setting over a large pot. Beat in the butter a piece at a time. Bring the milk to a boil and beat it in, splash by splash, until completely absorbed. You are looking for a very soft, fine puree, not unlike baby food! Check the seasonings, and serve.",
        "ingredients": [
            "2 pounds/1 kg floury potatoes, scrubbed",
            "Salt and freshly ground black pepper",
            "1 clove garlic, peeled",
            "1 bay leaf",
            "1 sprig fresh thyme",
            "About 1 cup/250 ml milk",
            "1/2 cup/110 g butter, cold"
        ],
        "step_by_step_instructions": [
            "Put approximately 0.33 pounds (150 g) of potatoes, whole, in a pot and cover with cold water.",
            "Add a pinch of salt to the water.",
            "Bring to a boil, and simmer until very tender, about 30 minutes.",
            "Meanwhile, drop a portion of garlic, bay leaf, and thyme in a saucepan with approximately 0.17 cups (40 ml) of milk.",
            "Bring to a boil, turn off the heat, cover, and set aside to infuse for 10 minutes.",
            "Pull out the garlic and herbs, and discard.",
            "When the potatoes are done, drain them and peel while hot.",
            "Put them through a food mill set on the smallest setting over a large pot.",
            "Beat in approximately 0.08 cups (17 g) of butter a piece at a time.",
            "Bring the milk to a boil again and beat it in, splash by splash, until completely absorbed.",
            "Check the seasonings and add salt and freshly ground black pepper to taste.",
            "Serve the puree."
        ],
        "processed_ingredients": [
            "150.00 g potatoes",
            "0.17 tsp salt",
            "0.01 tsp black pepper",
            "0.33 clove garlic",
            "0.33 leaf bay leaf",
            "0.33 sprig thyme",
            "40.00 ml milk",
            "17.00 g butter"
        ],
        "pure_ingredients": [
            "potatoes",
            "salt",
            "black pepper",
            "garlic",
            "bay leaf",
            "thyme",
            "milk",
            "butter"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "pot",
            "saucepan",
            "food mill"
        ]
    },
    {
        "recipe_id": "DeSPqqOi3dzO17/JTLBn6AU82KEJrIK",
        "recipe_title": "Gina's Turkey Meatloaf",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 350 degrees F.\nHeat olive oil in a large saute pan over medium-high heat. Add mushrooms, onions, and garlic. Saute until mushrooms are browned, about 5 to 6 minutes.\nStir in red pepper flakes and saute for 1 more minute. Add chicken stock and Worcestershire sauce, remove from heat and allow to cool.\nIn a large bowl, combine egg, panko, blue cheese, and mushroom mixture. Fold in turkey and combine. Don't over work or the meatloaf will be tough.\nShape into a long rectangular loaf directly on a sheet tray. Spoon tomato sauce on top of the loaf and shingle sliced shallots down the top. Bake for 1 hour and 10 minutes, and serve.",
        "ingredients": [
            "2 tablespoons olive oil",
            "8 ounces mushrooms, finely chopped",
            "1 large Vidalia onion, chopped",
            "2 cloves garlic, chopped",
            "Pinch red pepper flakes",
            "1/4 cup chicken stock",
            "1 tablespoon Worcestershire sauce",
            "1 egg, lightly beaten",
            "1/2 cup panko (Japanese) breadcrumbs",
            "6 ounces crumbled blue cheese",
            "2 pounds ground turkey",
            "1 (8-ounce) can tomato sauce",
            "1 shallot, sliced",
            "Kosher salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Heat 0.25 tablespoon of olive oil in a large saute pan over medium-high heat.",
            "Add 1 ounce of mushrooms, 0.125 of a large onion, and 0.25 clove of garlic.",
            "Saute until mushrooms are browned, about 5 to 6 minutes.",
            "Stir in a pinch of red pepper flakes and saute for 1 more minute.",
            "Add 0.03 cup of chicken stock and 0.125 tablespoon of Worcestershire sauce, remove from heat and allow to cool.",
            "In a large bowl, combine 0.125 of a lightly beaten egg, 1 tablespoon of panko, 0.75 ounce of crumbled blue cheese, and the cooled mushroom mixture.",
            "Fold in 0.25 pound of ground turkey and combine. Don't over work.",
            "Shape into a small loaf directly on a sheet tray.",
            "Spoon 1 ounce of tomato sauce on top of the loaf and shingle 0.125 of a shallot, sliced, down the top.",
            "Bake for 1 hour and 10 minutes, and serve."
        ],
        "processed_ingredients": [
            "0.25 tablespoon olive oil",
            "1 ounce mushrooms",
            "0.125 large Vidalia onion",
            "0.25 clove garlic",
            "0.03 cup chicken stock",
            "0.125 tablespoon Worcestershire sauce",
            "0.125 egg",
            "1 tablespoon panko",
            "0.75 ounce blue cheese",
            "0.25 pound ground turkey",
            "1 ounce tomato sauce",
            "0.125 shallot",
            "0.01 teaspoon red pepper flakes"
        ],
        "pure_ingredients": [
            "olive oil",
            "mushrooms",
            "onion",
            "garlic",
            "red pepper flakes",
            "chicken stock",
            "Worcestershire sauce",
            "egg",
            "panko",
            "blue cheese",
            "turkey",
            "tomato sauce",
            "shallot",
            "salt",
            "black pepper"
        ],
        "cooking_time": "80 minutes",
        "required_tools": [
            "oven",
            "saute pan",
            "large bowl",
            "sheet tray",
            "spoon"
        ]
    },
    {
        "recipe_id": "lzxH6EHaVJ9VCr7FrNAVwfonqMMeVXO",
        "recipe_title": "Porchetta",
        "original_instructions": "Preheat oven to 350 degrees Fahrenheit Butterfly meat until about 2-inches thick around. Season with garlic and fresh herbs and spices to your taste. From the narrow end, roll tightly toward the broad end. Place fat or skin over roll and tie to secure. Bake for 20 minutes per pound. For a crispier skin, roast at 400 degrees Fahrenheit for the first 20 minutes then reduce heat to 350 degrees until done. Slice and serve as you wish.;",
        "ingredients": [
            "1 pork shoulder, boneless, roast with skin",
            "Garlic, herbs and spices, to taste"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees Fahrenheit.",
            "Butterfly the pork shoulder until it is about 2-inches thick.",
            "Season the pork with garlic, fresh herbs, and spices to taste.",
            "From the narrow end, roll the pork tightly toward the broad end.",
            "Place the fat or skin over the roll and tie it to secure.",
            "Bake the pork in the oven for approximately 20 minutes per pound.",
            "For a crispier skin, roast at 400 degrees Fahrenheit for the first 20 minutes, then reduce the heat to 350 degrees until done.",
            "Slice and serve the porchetta as desired."
        ],
        "processed_ingredients": [
            "0.50 lb pork shoulder",
            "1.00 teaspoon garlic",
            "1.00 teaspoon herbs",
            "1.00 teaspoon spices"
        ],
        "pure_ingredients": [
            "pork shoulder",
            "garlic",
            "herbs",
            "spices"
        ],
        "cooking_time": "120 minutes",
        "required_tools": [
            "oven",
            "knife",
            "string or twine",
            "baking tray"
        ]
    },
    {
        "recipe_id": "/mpRzcPoLK2fvvKyy.WA.QKbPPDW0eC",
        "recipe_title": "Lyonnaise Potatoes ",
        "original_instructions": "Preheat oven to 350°F. Lightly coat a small baking pan with olive oil. Layer potatoes and onion in pan. Season with salt and pepper. Pour stock over potatoes and onion; cover and bake 30 minutes. Lightly spray or brush with olive oil and return to oven, uncovered, 10 more minutes to lightly brown potatoes.\nPreheat oven to 350°F. Lightly coat a small baking pan with olive oil. Layer potatoes and onion in pan. Season with salt and pepper. Pour stock over potatoes and onion; cover and bake 30 minutes. Lightly spray or brush with olive oil and return to oven, uncovered, 10 more minutes to lightly brown potatoes.",
        "ingredients": [
            "Olive oil",
            "2 large russet potatoes, peeled and sliced",
            "1 large yellow onion, thinly sliced",
            "1/3 cup chicken stock"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350°F.",
            "Lightly coat a small baking pan with olive oil.",
            "Layer approximately 1/2 of a large russet potato in the pan.",
            "Add approximately 1/4 of a large yellow onion, thinly sliced, on top of the potatoes.",
            "Season with salt and pepper.",
            "Pour approximately 2 tablespoons of chicken stock over the potatoes and onion.",
            "Cover and bake for 30 minutes.",
            "Lightly spray or brush with olive oil and return to oven, uncovered, for 10 more minutes to lightly brown the potatoes."
        ],
        "processed_ingredients": [
            "0.50 tablespoon olive oil",
            "4.50 ounce russet potato",
            "1.50 ounce yellow onion",
            "2.67 tablespoon chicken stock",
            "0.25 teaspoon salt",
            "0.25 teaspoon pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "potato",
            "onion",
            "chicken stock",
            "salt",
            "pepper"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "oven",
            "baking pan",
            "knife",
            "cutting board",
            "measuring spoons"
        ]
    },
    {
        "recipe_id": "oBlTLHjDB4ovlhmMO3x9KNi0HqNP1L2",
        "recipe_title": "Bell Pepper and Tomato Soup",
        "original_instructions": "Heat the oil in a medium saucepan over medium heat. Add the red onion and cook, stirring, until soft, 3 to 5 minutes. Add the potato, cayenne, garlic, bay leaf, 1/2 teaspoon salt and a few grinds of pepper and cook, stirring, until the potatoes are well coated, 2 to 3 minutes. Pour in the broth and bring to a simmer.\nAdd bell pepper and tomatoes, bring the mixture back to a simmer and cook until the potatoes and vegetables are tender, adjusting the heat as needed to maintain a simmer, about 20 minutes. Remove from the heat, discard the bay leaf and let cool at least 5 minutes. Carefully puree until smooth with a handheld immersion blender or in 2 to 3 batches in a blender (do not fill the blender more than halfway full).\nReheat the soup and adjust the consistency with water if needed. Season with salt and pepper. Serve hot with a sprinkle of parsley and almonds and a drizzle of oil.",
        "ingredients": [
            "2 tablespoons olive oil, plus more for drizzling",
            "1 cup chopped red onion",
            "1 cup chopped and peeled potato",
            "Pinch cayenne pepper",
            "1 medium clove garlic, minced",
            "1 bay leaf",
            "Kosher salt and freshly ground black pepper",
            "3 1/2 cups low-sodium vegetable broth",
            "2 cups chopped red bell pepper",
            "1 cup canned whole peeled plum tomatoes, crushed by hand",
            "Chopped parsley and chopped and toasted almonds, for garnish"
        ],
        "step_by_step_instructions": [
            "Heat 0.33 tablespoons of olive oil in a medium saucepan over medium heat.",
            "Add 0.17 cups of chopped red onion and cook, stirring, until soft, 3 to 5 minutes.",
            "Add 0.17 cups of chopped and peeled potato, a pinch of cayenne, 0.17 teaspoons of minced garlic, 1 bay leaf, 0.08 teaspoons of salt, and a few grinds of pepper. Cook, stirring, until the potatoes are well coated, 2 to 3 minutes.",
            "Pour in 0.58 cups of low-sodium vegetable broth and bring to a simmer.",
            "Add 0.33 cups of chopped red bell pepper and 0.17 cups of crushed canned whole peeled plum tomatoes.",
            "Bring the mixture back to a simmer and cook until the potatoes and vegetables are tender, adjusting the heat as needed to maintain a simmer, about 20 minutes.",
            "Remove from the heat, discard the bay leaf and let cool at least 5 minutes.",
            "Carefully puree until smooth with a handheld immersion blender or in 2 to 3 batches in a blender (do not fill the blender more than halfway full).",
            "Reheat the soup and adjust the consistency with water if needed.",
            "Season with salt and pepper.",
            "Serve hot with a sprinkle of parsley and almonds and a drizzle of oil."
        ],
        "processed_ingredients": [
            "0.33 tablespoon olive oil",
            "0.17 cup chopped red onion",
            "0.17 cup chopped and peeled potato",
            "0.01 teaspoon cayenne pepper",
            "0.17 teaspoon minced garlic",
            "1 bay leaf",
            "0.08 teaspoon salt",
            "0.58 cup low-sodium vegetable broth",
            "0.33 cup chopped red bell pepper",
            "0.17 cup canned whole peeled plum tomatoes",
            "0.08 tablespoon chopped parsley",
            "0.08 tablespoon chopped and toasted almonds"
        ],
        "pure_ingredients": [
            "olive oil",
            "red onion",
            "potato",
            "cayenne pepper",
            "garlic",
            "bay leaf",
            "salt",
            "black pepper",
            "vegetable broth",
            "red bell pepper",
            "tomatoes",
            "parsley",
            "almonds"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "medium saucepan",
            "handheld immersion blender",
            "blender"
        ]
    },
    {
        "recipe_id": "DC9NNUZD38QE0/K97Nbm/x79Zks7hpm",
        "recipe_title": "Salt-Crusted Baby Potatoes with Ranch, Bacon and Scallions",
        "original_instructions": "Put the potatoes and 1/2 cup salt in a large saucepan. Cover by about 1 inch with cold water. Bring to a boil, lower the heat and simmer until the potatoes are fork tender, 5 to 8 minutes. Drain the potatoes and return to the pot. Set aside to dry so the salt crystalizes, about 5 minutes. Keep warm.\nDivide the potatoes among 4 plates. Drizzle with some Ranch Dressing and sprinkle with some bacon and scallions.\nSmash the garlic on a cutting board, sprinkle with 1/2 teaspoon salt, and, with the side of a large knife, mash and smear the mixture to a coarse paste. Scrape the paste into a small bowl and add the mayonnaise, buttermilk, chives, parsley, vinegar, scallion and black pepper to taste. Whisk well to make a creamy dressing. Use immediately or refrigerate in a tightly sealed container for up to 3 days.",
        "ingredients": [
            "1 pound mixed baby potatoes",
            "Kosher salt",
            "Ranch Dressing, recipe follows, for serving",
            "Crumbled cooked bacon, for serving",
            "Sliced scallions, for serving",
            "1 clove garlic",
            "Kosher salt and freshly ground black pepper",
            "1 cup mayonnaise",
            "1/3 cup buttermilk",
            "2 tablespoons minced fresh chives",
            "2 tablespoons minced fresh flat-leaf parsley leaves",
            "1 teaspoon white wine vinegar",
            "1 scallion (white and light green parts), thinly sliced"
        ],
        "step_by_step_instructions": [
            "Put 113.40 g of baby potatoes and 2 tbsp salt in a large saucepan.",
            "Cover with cold water, about 1 inch above the potatoes.",
            "Bring to a boil, then lower the heat and simmer until the potatoes are fork tender, about 5 to 8 minutes.",
            "Drain the potatoes and return them to the pot.",
            "Set aside to dry, allowing the salt to crystallize, about 5 minutes.",
            "Keep the potatoes warm.",
            "Divide the potatoes onto a plate.",
            "Drizzle with Ranch Dressing.",
            "Sprinkle with crumbled bacon and sliced scallions.",
            "Smash 0.25 clove of garlic on a cutting board.",
            "Sprinkle with 0.13 tsp salt and mash to a coarse paste.",
            "Scrape the paste into a small bowl.",
            "Add 0.25 cup mayonnaise, 1 tbsp buttermilk, 0.5 tbsp minced chives, 0.5 tbsp minced parsley, 0.25 tsp white wine vinegar, 0.25 scallion sliced, and black pepper to taste to the bowl.",
            "Whisk well to make a creamy dressing.",
            "Use immediately or refrigerate in a tightly sealed container for up to 3 days."
        ],
        "processed_ingredients": [
            "113.40 g baby potatoes",
            "2 tbsp salt",
            "0.25 clove garlic",
            "0.13 tsp salt",
            "0.25 cup mayonnaise",
            "1 tbsp buttermilk",
            "0.5 tbsp chives",
            "0.5 tbsp parsley",
            "0.25 tsp white wine vinegar",
            "0.25 scallion",
            "0.25 tsp black pepper",
            "1 tbsp Ranch Dressing",
            "1 tbsp bacon",
            "0.5 tbsp scallions"
        ],
        "pure_ingredients": [
            "potatoes",
            "salt",
            "garlic",
            "mayonnaise",
            "buttermilk",
            "chives",
            "parsley",
            "vinegar",
            "scallion",
            "black pepper",
            "bacon"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "large saucepan",
            "cutting board",
            "knife",
            "small bowl",
            "whisk"
        ]
    },
    {
        "recipe_id": "JgrwTDpOa19ltLjZ8/zXKFWB4.w7Oyu",
        "recipe_title": "Sausage and Cheddar Baked Potatoes",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 350 degrees F.\nUsing a paring knife, poke 3 small slits into each potato. Bake in the oven for 1 hour and 15 minutes. Remove the potatoes from the oven and turn the oven temperature up to 425 degrees F. Let the potatoes cool for 5 minutes.\nUsing a fork punch some holes in the top of each potato. Press inward on the ends of each potato so that the tops break open. Divide the apple sauerkraut evenly between the potatoes and then top them with the sausage and Cheddar. Arrange the potatoes on a sheet pan and bake until the cheese is melted, about 5 minutes. Remove from the oven to a serving platter and serve.",
        "ingredients": [
            "4 russet potatoes, washed and scrubbed",
            "1 cup leftover apple sauerkraut from the Turkey Sausage with Apple Sauerkraut recipe",
            "2 leftover cooked sausages from the Turkey Sausage with Apple Sauerkraut recipe, finely chopped",
            "1/2 cup shredded Cheddar"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Using a paring knife, poke 3 small slits into the potato.",
            "Bake the potato in the oven for 1 hour and 15 minutes.",
            "Remove the potato from the oven and turn the oven temperature up to 425 degrees F.",
            "Let the potato cool for 5 minutes.",
            "Using a fork, punch some holes in the top of the potato.",
            "Press inward on the ends of the potato so that the top breaks open.",
            "Divide approximately 0.25 cup of apple sauerkraut over the potato.",
            "Top with around 0.5 sausage, finely chopped, and 0.125 cup of shredded Cheddar.",
            "Arrange the potato on a sheet pan and bake until the cheese is melted, about 5 minutes.",
            "Remove from the oven to a serving platter and serve."
        ],
        "processed_ingredients": [
            "1 potato russet",
            "0.25 cup apple sauerkraut",
            "0.50 sausage",
            "0.13 cup Cheddar shredded"
        ],
        "pure_ingredients": [
            "potato",
            "apple sauerkraut",
            "sausage",
            "Cheddar"
        ],
        "cooking_time": "80 minutes",
        "required_tools": [
            "oven",
            "paring knife",
            "fork",
            "sheet pan",
            "serving platter"
        ]
    },
    {
        "recipe_id": "38qSOatz.TDV5TOLAsJuPrdvWk.30V.",
        "recipe_title": "Sweet and Spicy Brussels Sprouts",
        "original_instructions": "Watch how to make this recipe.\nIn a skillet, combine vinegar, honey and stock with a whisk. Stir in bay leaf, onion, pepper, mustard seed and turmeric, stir and bring to a boil. Trim the Brussels sprouts and halve them. Add to stock mixture and season with celery salt and pepper. Cover and reduce heat and simmer 10 minutes, uncover and cook 5 minutes more.",
        "ingredients": [
            "3 tablespoons white wine vinegar",
            "3 tablespoons honey",
            "1 cup chicken stock",
            "1 fresh bay leaf",
            "1/2 red onion, chopped",
            "1/2 red bell pepper, chopped",
            "2 teaspoons mustard seed",
            "1/4 teaspoon turmeric",
            "2 tubs Brussels sprouts (about 2 pounds)",
            "2 tablespoons celery salt",
            "Black pepper"
        ],
        "step_by_step_instructions": [
            "In a skillet, combine 0.38 tablespoons white wine vinegar, 0.38 tablespoons honey, and 0.13 cups chicken stock with a whisk.",
            "Stir in 0.13 bay leaf, 0.06 red onion (chopped), 0.06 red bell pepper (chopped), 0.25 teaspoons mustard seed, and 0.03 teaspoons turmeric. Stir and bring to a boil.",
            "Trim about 5.33 ounces Brussels sprouts and halve them.",
            "Add the Brussels sprouts to the stock mixture and season with 0.25 tablespoons celery salt and black pepper to taste.",
            "Cover and reduce heat to simmer for 10 minutes.",
            "Uncover and cook for 5 minutes more."
        ],
        "processed_ingredients": [
            "0.38 tablespoon white wine vinegar",
            "0.38 tablespoon honey",
            "0.13 cup chicken stock",
            "0.13 bay leaf",
            "0.06 red onion",
            "0.06 red bell pepper",
            "0.25 teaspoon mustard seed",
            "0.03 teaspoon turmeric",
            "5.33 ounce Brussels sprouts",
            "0.25 tablespoon celery salt",
            "0.13 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "white wine vinegar",
            "honey",
            "chicken stock",
            "bay leaf",
            "red onion",
            "red bell pepper",
            "mustard seed",
            "turmeric",
            "Brussels sprouts",
            "celery salt",
            "black pepper"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "skillet",
            "whisk",
            "knife"
        ]
    },
    {
        "recipe_id": "bYvt1Jx4RMDT9L4A0Ccs9WWogz2BiD6",
        "recipe_title": "Potato Torta",
        "original_instructions": "Melt the butter in a saucepan, add the flour. Stirring continuously, cook for 2 minutes, do not allow the mixture to color. Whisk in the milk and cook until mixture becomes thick. Add the cheese and season with salt. Rinse the green peppercorns well and add to the sauce. Butter a 4-inch spring form pan. Slice the potatoes about a 1/8-inch thick. Alternate layers of potato and sauce. Push down the layers as you go so you will get a nice tight torta. Wrap the whole spring form pan in aluminum foil, completely covering the top and bottom. Place in a 350-degree oven for about 1 1/2 hours, or until golden and cooked all the way through.;",
        "ingredients": [
            "4 tablespoons butter",
            "4 tablespoons flour",
            "1 quart milk",
            "10 ounces Gorgonzola cheese",
            "Salt",
            "4 tablespoons green peppercorns in brine",
            "10 Idaho potatoes (peeled and placed in cold water)"
        ],
        "step_by_step_instructions": [
            "Melt 0.5 tablespoon of butter in a saucepan.",
            "Add 0.5 tablespoon of flour to the butter.",
            "Stir continuously and cook for 2 minutes without allowing the mixture to color.",
            "Whisk in 0.25 quart of milk and cook until the mixture becomes thick.",
            "Add 1.25 ounces of Gorgonzola cheese and season with a pinch of salt.",
            "Rinse 0.5 tablespoon of green peppercorns well and add to the sauce.",
            "Butter a 4-inch springform pan.",
            "Slice 1 Idaho potato about 1/8-inch thick.",
            "Alternate layers of potato slices and sauce in the springform pan.",
            "Push down the layers as you go to get a nice tight torta.",
            "Wrap the whole springform pan in aluminum foil, completely covering the top and bottom.",
            "Place in a 350-degree oven for about 1.5 hours, or until golden and cooked all the way through."
        ],
        "processed_ingredients": [
            "0.5 tablespoon butter",
            "0.5 tablespoon flour",
            "0.25 quart milk",
            "1.25 ounce Gorgonzola cheese",
            "0.5 tablespoon green peppercorns",
            "1 Idaho potato"
        ],
        "pure_ingredients": [
            "butter",
            "flour",
            "milk",
            "Gorgonzola cheese",
            "salt",
            "green peppercorns",
            "potato"
        ],
        "cooking_time": "1.5 hours",
        "required_tools": [
            "saucepan",
            "whisk",
            "springform pan",
            "oven",
            "aluminum foil"
        ]
    },
    {
        "recipe_id": "cLBQy7H/swPDaYLb7Xim3zgqN3BS5zO",
        "recipe_title": "Bistecca alla Fiorentina",
        "original_instructions": "Let the steak come to room temperature for 30 minutes. Preheat the grill to high heat.\nSprinkle the steak generously with salt and pepper on both sides and grill over high heat, about 6 minutes per side. You're looking for a nice crust on each side, but to be true to the Fiorentina method, it should be rare on the inside. If you prefer not to eat your meat rare, cook it a little longer on each side, about 8 minutes per side for medium and longer for well done.\nThen let it rest for about 10 minutes before you carve into it.\nCut the steak off of the bone, carving the strip off on one side and the filet off on the other. Then slice the meat against the grain and serve it on a cutting board or platter with the bone (true Fiorentina style).",
        "ingredients": [
            "One 2 1/4-inch-thick porterhouse steak",
            "Sea salt",
            "Freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Let the steak come to room temperature for 30 minutes.",
            "Preheat the grill to high heat.",
            "Sprinkle the steak generously with salt and pepper on both sides.",
            "Grill the steak over high heat for about 6 minutes per side for rare, 8 minutes per side for medium.",
            "Let it rest for about 10 minutes before carving.",
            "Cut the steak off the bone, carving the strip off on one side and the filet off on the other.",
            "Slice the meat against the grain and serve it on a cutting board or platter with the bone."
        ],
        "processed_ingredients": [
            "14.00 oz porterhouse steak",
            "0.25 tsp salt",
            "0.25 tsp black pepper"
        ],
        "pure_ingredients": [
            "porterhouse steak",
            "salt",
            "black pepper"
        ],
        "cooking_time": "70 minutes",
        "required_tools": [
            "grill",
            "cutting board",
            "knife",
            "platter"
        ]
    },
    {
        "recipe_id": "0n4gLHT/RpRRIgE1D79/URsKElU5dom",
        "recipe_title": "Green Green Spring Vegetables",
        "original_instructions": "Blanch the string beans in a large pot of boiling salted water for 1 minute only. Lift the beans from the water with a slotted spoon or sieve and immerse them in a bowl of ice water. Add the snap peas to the same boiling water and cook for 1 minute, until al dente, adding them to the ice water and the beans. Cut the asparagus into 2-inch lengths diagonally and cook in the boiling water for 2 minutes, and add to the ice water. Cut the broccolini in half, boil for 1 minute, and add to the ice water. When all the vegetables in the water are cold, drain well.\nWhen ready to serve, heat the butter and oil in a very large saute pan or large pot. Saute the shallots over medium heat for 5 minutes, tossing occasionally, until lightly browned. Add the drained vegetables to the shallots with 1/2 teaspoon salt and the pepper and toss. Cook just until the vegetables are heated through. Serve hot.",
        "ingredients": [
            "1/4 pound French string beans (haricots verts), ends removed",
            "Kosher salt",
            "1/4 pound sugar snap peas, ends and strings removed",
            "1/4 pound asparagus, ends removed",
            "1/2 pound broccolini, ends removed",
            "2 tablespoons unsalted butter",
            "1 tablespoon good olive oil",
            "3 large shallots, sliced",
            "1/2 teaspoon freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Blanch the string beans in a large pot of boiling salted water for 1 minute.",
            "Lift the beans from the water with a slotted spoon or sieve and immerse them in a bowl of ice water.",
            "Add the snap peas to the same boiling water and cook for 1 minute, until al dente, then add them to the ice water with the beans.",
            "Cut the asparagus into 2-inch lengths diagonally and cook in the boiling water for 2 minutes.",
            "Add the asparagus to the ice water.",
            "Cut the broccolini in half, boil for 1 minute, and add to the ice water.",
            "Once all the vegetables in the water are cold, drain them well.",
            "When ready to serve, heat the butter and oil in a very large saute pan or large pot.",
            "Saute the shallots over medium heat for 5 minutes, tossing occasionally, until lightly browned.",
            "Add the drained vegetables to the shallots with salt and pepper and toss.",
            "Cook just until the vegetables are heated through.",
            "Serve hot."
        ],
        "processed_ingredients": [
            "28.35 g French string beans",
            "1.25 g salt",
            "28.35 g sugar snap peas",
            "28.35 g asparagus",
            "56.70 g broccolini",
            "14.18 g unsalted butter",
            "7.09 g olive oil",
            "21.85 g shallots",
            "0.25 g black pepper"
        ],
        "pure_ingredients": [
            "string beans",
            "salt",
            "sugar snap peas",
            "asparagus",
            "broccolini",
            "butter",
            "oil",
            "shallots",
            "pepper"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "pot",
            "slotted spoon",
            "bowl",
            "sieve",
            "saute pan"
        ]
    },
    {
        "recipe_id": "PjizN3AeQ7SXH45E/JHkZM5rcncasnG",
        "recipe_title": "Bacon and Cheese Deviled Eggs",
        "original_instructions": "Halve eggs lengthwise. Spoon yolks into a bowl. Reserve whites.\nMash yolks with fork. Add mayonnaise, honey-mustard, salt and pepper. Fold in bacon and cheese.\nFill each half egg white with yolk mixture. Cover and refrigerate until ready to serve.",
        "ingredients": [
            "12 hard-cooked eggs, peeled",
            "1/2 cup mayonnaise",
            "1 tablespoon honey mustard",
            "1/2 teaspoon salt",
            "1/4 teaspoon black pepper",
            "4 strips bacon, cooked, crumbled",
            "2 tablespoons shredded sharp Cheddar",
            "Parsley, for garnish, optional"
        ],
        "step_by_step_instructions": [
            "Halve 2 eggs lengthwise.",
            "Spoon yolks into a bowl. Reserve the whites.",
            "Mash yolks with fork.",
            "Add 0.67 tablespoon mayonnaise, 0.08 tablespoon honey mustard, 0.04 teaspoon salt, and 0.02 teaspoon black pepper.",
            "Fold in 0.67 strip bacon, crumbled, and 0.33 tablespoon shredded sharp Cheddar.",
            "Fill each half egg white with yolk mixture.",
            "Cover and refrigerate until ready to serve."
        ],
        "processed_ingredients": [
            "2 unit eggs",
            "0.67 tablespoon mayonnaise",
            "0.08 tablespoon honey mustard",
            "0.04 teaspoon salt",
            "0.02 teaspoon black pepper",
            "0.67 strip bacon",
            "0.33 tablespoon Cheddar",
            "0.08 tablespoon parsley"
        ],
        "pure_ingredients": [
            "eggs",
            "mayonnaise",
            "honey mustard",
            "salt",
            "black pepper",
            "bacon",
            "Cheddar",
            "parsley"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "bowl",
            "fork",
            "knife",
            "spoon",
            "refrigerator"
        ]
    },
    {
        "recipe_id": "7Pat.jXm.a1bC1qcKs3fd9RfsxDykmu",
        "recipe_title": "Mixed Vegetable Potage",
        "original_instructions": "In a tall stockpot, bring all the ingredients except the salt, pepper, and butter to a boil. Lower the heat and simmer for 30 minutes, or until each vegetable is easily pierced by the point of a knife. Pass soup through the medium disc of a food mill. Or skim the vegetables out of the liquid, pulse to a coarse puree in a food processor, and recombine the vegetables with the liquid. Season with salt and pepper. The soup can be refrigerated at this point for up to 4 days or frozen for up to 2 months. Bring the soup to a simmer. Stir in the butter just before serving.;",
        "ingredients": [
            "1 3/4 pounds spinach, stemmed and washed well",
            "2 pounds potatoes, peeled, halved lengthwise, and cut across into slices",
            "12 medium carrots, peeled and sliced",
            "2 medium onions, cut into chunks",
            "10 cups basic chicken stock, or commercial low sodium chicken broth",
            "3 cloves garlic, smashed and peeled",
            "Kosher salt, to taste",
            "Freshly ground black pepper, to taste",
            "3 tablespoons unsalted butter"
        ],
        "step_by_step_instructions": [
            "In a tall stockpot, combine approximately 70g spinach, 80g potatoes, 50g carrots, 20g onions, 400ml chicken stock, and 1/4 clove garlic. Bring to a boil.",
            "Lower the heat and simmer for 30 minutes, or until each vegetable is easily pierced by the point of a knife.",
            "Pass the soup through the medium disc of a food mill, or skim the vegetables out of the liquid and pulse to a coarse puree in a food processor, then recombine with the liquid.",
            "Season with salt and freshly ground black pepper to taste.",
            "Bring the soup to a simmer again.",
            "Stir in approximately 1 teaspoon of unsalted butter just before serving."
        ],
        "processed_ingredients": [
            "70 g spinach",
            "80 g potatoes",
            "50 g carrots",
            "20 g onions",
            "400 ml chicken stock",
            "0.25 clove garlic",
            "0.25 tsp kosher salt",
            "0.25 tsp black pepper",
            "1 tsp unsalted butter"
        ],
        "pure_ingredients": [
            "spinach",
            "potatoes",
            "carrots",
            "onions",
            "chicken stock",
            "garlic",
            "salt",
            "black pepper",
            "butter"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "tall stockpot",
            "food mill or food processor",
            "knife"
        ]
    },
    {
        "recipe_id": "itySvz0UcDQqrq/KZV4bSW6QfbN0gsS",
        "recipe_title": "Char Grilled Hmong Black Pig Skewers with Sesame Salt: Thit Lon Nuong Muoi Vung",
        "original_instructions": "Special equipment: 12 bamboo skewers, soaked in water for 30 minutes\nMix the sesame seeds with salt.\nPlace the spring onions, lemongrass, sugar, black pepper, vegetable oil, fish sauce, honey, and oyster sauce in a mixing bowl and stir to combine. Add the pork, toss to coat, then cover and marinate in the refrigerator overnight.\nPreheat a grill. Thread the pork onto bamboo skewers and char grill each side for 3 minutes.\nDip into sesame salt.",
        "ingredients": [
            "2 tablespoons sesame seeds",
            "Salt",
            "2 spring onions, bashed",
            "4 tablespoons minced lemongrass",
            "1 tablespoon sugar",
            "1/2 teaspoon freshly ground black pepper",
            "3 tablespoons vegetable oil",
            "3 tablespoons fish sauce",
            "1 tablespoon honey",
            "1 teaspoon oyster sauce",
            "10 1/2 ounces/300 g pork neck, finely sliced"
        ],
        "step_by_step_instructions": [
            "Mix 0.33 tablespoons sesame seeds with 0.17 teaspoons salt.",
            "Place 0.33 spring onions, 1.33 tablespoons lemongrass, 0.33 tablespoons sugar, 0.17 teaspoons black pepper, 1 tablespoon vegetable oil, 1 tablespoon fish sauce, 0.33 tablespoons honey, and 0.33 teaspoons oyster sauce in a mixing bowl and stir to combine.",
            "Add 3.5 ounces pork to the bowl, toss to coat, then cover and marinate in the refrigerator overnight.",
            "Preheat a grill.",
            "Thread the pork onto bamboo skewers and char grill each side for 3 minutes.",
            "Dip into sesame salt."
        ],
        "processed_ingredients": [
            "0.33 tablespoon sesame seeds",
            "0.17 teaspoon salt",
            "0.33 spring onions",
            "1.33 tablespoon lemongrass",
            "0.33 tablespoon sugar",
            "0.17 teaspoon black pepper",
            "1 tablespoon vegetable oil",
            "1 tablespoon fish sauce",
            "0.33 tablespoon honey",
            "0.33 teaspoon oyster sauce",
            "3.5 ounce pork neck"
        ],
        "pure_ingredients": [
            "sesame seeds",
            "salt",
            "spring onions",
            "lemongrass",
            "sugar",
            "black pepper",
            "vegetable oil",
            "fish sauce",
            "honey",
            "oyster sauce",
            "pork"
        ],
        "cooking_time": "12 hours 24 minutes",
        "required_tools": [
            "bamboo skewers",
            "mixing bowl",
            "grill"
        ]
    },
    {
        "recipe_id": "RIaES4X0PvWr.GWZyqHYTVenhqm6oti",
        "recipe_title": "Creamed Spinach",
        "original_instructions": "Preheat oven to 325 degrees.\nTrim and wash the spinach. In a large pot of salted, boiling water add spinach. Simmer the spinach, stirring occasionally, for 10 minutes. Then drain, refresh, and squeeze dry.\nSaute the onions in the butter until tender. Add the cooked spinach, sour cream, cream cheese, grated Parmesan cheese, salt, pepper and nutmeg to taste. Transfer mixture to a buttered baking dish.\nSaute 1/2 cup bread crumbs in 2 tablespoons of butter until browned. Sprinkle bread crumbs on spinach. Put it in the oven and bake for 20 minutes, then serve.\nSuggested drink: Beck's Beer",
        "ingredients": [
            "4 pounds of fresh spinach",
            "1 small onion, diced",
            "4 tablespoons butter",
            "1/2 cup sour cream",
            "1 pound cream cheese",
            "1/2 cup grated Parmesan cheese",
            "Salt and pepper to taste",
            "Nutmeg",
            "1/2 cup bread crumbs"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 325 degrees.",
            "Trim and wash approximately 0.5 pounds of fresh spinach.",
            "In a large pot of salted, boiling water, add the spinach.",
            "Simmer the spinach, stirring occasionally, for about 10 minutes.",
            "Drain the spinach, refresh with cold water, and squeeze dry.",
            "Saute about 0.12 of a small onion (diced) in 0.5 tablespoons of butter until tender.",
            "Add the cooked spinach, 1 tablespoon of sour cream, 0.25 pound of cream cheese, 0.12 cup of grated Parmesan cheese, salt, pepper, and a pinch of nutmeg to taste, and mix well.",
            "Transfer the mixture to a small buttered baking dish.",
            "Saute 0.12 cup of bread crumbs in 0.5 tablespoons of butter until browned.",
            "Sprinkle the browned bread crumbs over the spinach mixture.",
            "Put the dish in the oven and bake for 20 minutes.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "0.50 lb fresh spinach",
            "0.12 small onion",
            "0.50 tbsp butter",
            "1.00 tbsp sour cream",
            "0.25 lb cream cheese",
            "0.12 cup grated Parmesan cheese",
            "0.12 cup bread crumbs",
            "0.50 tbsp butter",
            "1.00 pinch salt",
            "1.00 pinch pepper",
            "1.00 pinch nutmeg"
        ],
        "pure_ingredients": [
            "spinach",
            "onion",
            "butter",
            "sour cream",
            "cream cheese",
            "Parmesan cheese",
            "salt",
            "pepper",
            "nutmeg",
            "bread crumbs"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "oven",
            "large pot",
            "baking dish",
            "sauté pan",
            "stirring spoon",
            "knife"
        ]
    },
    {
        "recipe_id": "6qV.WNpK/DvN7MykDbvkKjaddI.98BG",
        "recipe_title": "Sausage-Stuffed Mushrooms",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 400 degrees F. Line a baking sheet with parchment paper.\nIn a saute pan over medium-high heat, add the olive oil, sausage and shallots. Saute until browned, breaking up the sausage into small pieces with a wooden spoon, 5 to 7 minutes.\nAdd the browned sausage and reserved mushroom stems to the bowl of a food processor and pulse until combined. Add the pine nuts and pulse a few more times until slightly smooth. Transfer to a mixing bowl and fold in the Swiss cheese, Gruyere and cream.\nAdd the breadcrumbs and parsley to a small bowl and mix to combine.\nPlace the mushroom caps hollow-side up on the prepared baking sheet. Using a tablespoon, spoon the mushroom and sausage mixture into each mushroom cap. Top with the breadcrumb mixture. Bake until golden brown, about 20 minutes.",
        "ingredients": [
            "1 tablespoon olive oil",
            "8 ounces loose Italian sausage",
            "1 shallot, chopped",
            "20 large white mushrooms, stems removed and reserved",
            "1/4 cup pine nuts",
            "3/4 cup grated Swiss cheese",
            "1/2 cup grated Gruyere cheese",
            "1/4 cup heavy cream",
            "1/2 cup breadcrumbs",
            "2 tablespoons chopped fresh parsley"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Line a baking sheet with parchment paper.",
            "In a saute pan over medium-high heat, add approximately 0.13 tablespoon olive oil, 1.33 ounces sausage, and a small portion of chopped shallots (about 0.05 ounce).",
            "Saute until browned, breaking up the sausage into small pieces, for about 5 to 7 minutes.",
            "Transfer the browned sausage and an estimated 1.33 mushroom stems to a food processor and pulse until combined.",
            "Add approximately 0.02 ounce pine nuts to the processor and pulse a few more times until slightly smooth.",
            "Transfer the mixture to a mixing bowl and fold in about 0.05 cup Swiss cheese, 0.03 cup Gruyere cheese, and 0.03 cup heavy cream.",
            "In a small bowl, mix about 0.03 cup breadcrumbs and 0.01 tablespoon chopped parsley to combine.",
            "Place approximately 1 mushroom cap hollow-side up on the prepared baking sheet.",
            "Using a tablespoon, spoon the mushroom and sausage mixture into the mushroom cap.",
            "Top with the breadcrumb mixture.",
            "Bake until golden brown, about 20 minutes."
        ],
        "processed_ingredients": [
            "0.13 tablespoon olive oil",
            "1.33 ounce Italian sausage",
            "0.05 ounce shallot",
            "1.33 large white mushroom",
            "0.02 ounce pine nuts",
            "0.05 cup Swiss cheese",
            "0.03 cup Gruyere cheese",
            "0.03 cup heavy cream",
            "0.03 cup breadcrumbs",
            "0.01 tablespoon fresh parsley"
        ],
        "pure_ingredients": [
            "olive oil",
            "Italian sausage",
            "shallot",
            "mushroom",
            "pine nuts",
            "Swiss cheese",
            "Gruyere cheese",
            "heavy cream",
            "breadcrumbs",
            "parsley"
        ],
        "cooking_time": "27 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "parchment paper",
            "saute pan",
            "wooden spoon",
            "food processor",
            "mixing bowl",
            "small bowl",
            "tablespoon"
        ]
    },
    {
        "recipe_id": "SX6O2bcwMQcfiJVkfhQRpj5iOJ6A4yq",
        "recipe_title": "Cucumber Kimchi (Oie Sobaegi)",
        "original_instructions": "Halve each cucumber horizontally, then each half vertically in 4 to make 32 pieces in all. Rub them all over with salt and set aside to drain in a colander for 1 hour. In a medium bowl combine remaining ingredients.\nRinse cucumbers with cold water, drain well and pat dry. Taste for seasoning and salt lightly if no salty flavor remains. Toss with dressing. Transfer to a 1-pint jar and cover tightly. Let sit at room temperature for 24 hours before serving. Can be made several weeks ahead and refrigerated.",
        "ingredients": [
            "4 Kirby (pickling) cucumbers (about 1 pound)",
            "3 tablespoons coarse salt",
            "1 small onion, finely chopped",
            "10 Chinese chives, cut in 1-inch pieces",
            "3 scallions, finely chopped",
            "1/4 cup finely-minced carrot",
            "3 tablespoons salted baby shrimp (saewoo jut), chopped",
            "2 tablespoons hot red chili powder",
            "2 tablespoons hot water",
            "2 teaspoons very finely-minced garlic",
            "1 teaspoon finely-minced ginger"
        ],
        "step_by_step_instructions": [
            "Halve each cucumber horizontally, then each half vertically to make 8 pieces in total.",
            "Rub the cucumber pieces all over with approximately 0.38 tablespoon of coarse salt.",
            "Set the salted cucumber pieces aside to drain in a colander for 1 hour.",
            "In a medium bowl, combine about 0.13 small onion (finely chopped), 1 Chinese chive (cut into 1-inch pieces), 0.38 scallion (finely chopped), 0.03 cup finely-minced carrot, 0.25 tablespoon salted baby shrimp (chopped), 0.25 tablespoon hot red chili powder, 0.25 tablespoon hot water, 0.17 teaspoon very finely-minced garlic, and 0.08 teaspoon finely-minced ginger.",
            "Rinse the cucumbers with cold water, drain well, and pat dry.",
            "Taste the cucumbers for seasoning and salt lightly if no salty flavor remains.",
            "Toss the cucumbers with the dressing.",
            "Transfer the dressed cucumbers to a small jar and cover tightly.",
            "Let the jar sit at room temperature for 24 hours before serving."
        ],
        "processed_ingredients": [
            "0.25 lb cucumbers",
            "0.38 tablespoon salt",
            "0.13 small onion",
            "1 Chinese chive",
            "0.38 scallion",
            "0.03 cup carrot",
            "0.25 tablespoon salted baby shrimp",
            "0.25 tablespoon chili powder",
            "0.25 tablespoon water",
            "0.17 teaspoon garlic",
            "0.08 teaspoon ginger"
        ],
        "pure_ingredients": [
            "cucumbers",
            "salt",
            "onion",
            "chives",
            "scallions",
            "carrot",
            "shrimp",
            "chili",
            "water",
            "garlic",
            "ginger"
        ],
        "cooking_time": "25 hours",
        "required_tools": [
            "colander",
            "bowl",
            "jar"
        ]
    },
    {
        "recipe_id": "WOx2sMolXPDQhtoi1mnGauICEbx39ki",
        "recipe_title": "Good Morning Bacon Quesadilla",
        "original_instructions": "BEAT egg with wire whisk in small microwaveable bowl. Stir in bacon and peppers. Microwave on HIGH 1 min., stirring after 30 sec. Let stand 1 min. or until egg is set and no visible liquid remains.\nSPRAY medium skillet with cooking spray; add tortilla. Spoon egg mixture onto half of the tortilla; sprinkle with cheese. Cook on medium heat 2 to 3 min. or until tortilla is lightly browned and cheese is melted.\nFOLD tortilla in half to serve.\nAdd a little curl to your bacon, and make breakfast or other dishes even more special!\nWhile bacon is still very warm right after draining on paper towels, wrap each cooked slice around the tines of a metal fork. Cool completely. Then, remove bacon curls from forks and use as a garnish for salads, potato and pasta dishes, and meat entrees.",
        "ingredients": [
            "1 egg",
            "3 OSCAR MAYER Bacon slices, cooked and cut into 1/2-inch pieces",
            "1 tbsp. chopped mixed red and green peppers",
            "1 whole wheat tortilla (6 inch)",
            "2 tbsp. shredded Colby & Monterey Jack Cheese"
        ],
        "step_by_step_instructions": [
            "Beat 1 egg with a wire whisk in a small microwaveable bowl.",
            "Stir in 3 cooked bacon slices cut into 1/2-inch pieces and 1 tablespoon of chopped mixed red and green peppers.",
            "Microwave on HIGH for 1 minute, stirring after 30 seconds.",
            "Let stand for 1 minute or until the egg is set and no visible liquid remains.",
            "Spray a medium skillet with cooking spray and add 1 whole wheat tortilla.",
            "Spoon the egg mixture onto half of the tortilla and sprinkle with 2 tablespoons of shredded Colby & Monterey Jack Cheese.",
            "Cook on medium heat for 2 to 3 minutes or until the tortilla is lightly browned and the cheese is melted.",
            "Fold the tortilla in half to serve."
        ],
        "processed_ingredients": [
            "1 large egg",
            "3 slice bacon",
            "1 tbsp red peppers",
            "1 tbsp green peppers",
            "1 whole wheat tortilla",
            "2 tbsp Colby & Monterey Jack Cheese"
        ],
        "pure_ingredients": [
            "egg",
            "bacon",
            "peppers",
            "tortilla",
            "cheese"
        ],
        "cooking_time": "7 minutes",
        "required_tools": [
            "whisk",
            "microwaveable bowl",
            "microwave",
            "skillet",
            "cooking spray"
        ]
    },
    {
        "recipe_id": "/vv96lrD13klfTNWTrfoF4h6ueuRLI2",
        "recipe_title": "Best Beet Salad",
        "original_instructions": "Preheat the oven to 400 degrees F. Wrap the beets individually in tin foil and roast directly on the rack in the oven until tender, about 1 hour. Open the foil packets and let cool. Once they're cool, peel the beets and cut into small chunks.\nIn a large bowl, whisk together the olive oil, vinegar, honey, red onion, and mustard. Season with salt and pepper. Add the beets and spinach to the dressing and toss to coat. Transfer the salad to a platter or plates, top with the goat cheese and walnuts, and serve.",
        "ingredients": [
            "3 medium beets, washed and trimmed",
            "1/4 cup extra-virgin olive oil",
            "2 tablespoons sherry vinegar",
            "1 tablespoon honey",
            "1 tablespoon minced red onion",
            "1/2 teaspoon Dijon mustard",
            "Kosher salt",
            "Freshly ground black pepper",
            "6 cups baby spinach",
            "1/2 cup crumbled goat cheese",
            "1/2 cup coarsely chopped toasted walnuts"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Wrap 1 medium beet (approximately 3.3 oz) individually in tin foil.",
            "Roast the beet directly on the rack in the oven until tender, about 1 hour.",
            "Open the foil packet and let the beet cool.",
            "Once cool, peel the beet and cut into small chunks.",
            "In a large bowl, whisk together 2 tbsp of olive oil, 1 tsp of sherry vinegar, 0.5 tsp of honey, 0.25 tsp of minced red onion, and 0.08 tsp of Dijon mustard.",
            "Season the dressing with a pinch of salt and a pinch of freshly ground black pepper.",
            "Add the beet chunks and 1 cup of baby spinach to the dressing and toss to coat.",
            "Transfer the salad to a plate, top with 1.33 tbsp of crumbled goat cheese and 1.33 tbsp of coarsely chopped toasted walnuts.",
            "Serve the salad."
        ],
        "processed_ingredients": [
            "3.33 oz beets",
            "2 tbsp olive oil",
            "1 tsp sherry vinegar",
            "0.5 tsp honey",
            "0.25 tsp red onion",
            "0.08 tsp Dijon mustard",
            "1 pinch salt",
            "1 pinch black pepper",
            "1 cup spinach",
            "1.33 tbsp goat cheese",
            "1.33 tbsp walnuts"
        ],
        "pure_ingredients": [
            "beets",
            "olive oil",
            "vinegar",
            "honey",
            "onion",
            "mustard",
            "salt",
            "pepper",
            "spinach",
            "cheese",
            "walnuts"
        ],
        "cooking_time": "1 hour 10 minutes",
        "required_tools": [
            "oven",
            "tin foil",
            "knife",
            "large bowl",
            "whisk",
            "plate"
        ]
    },
    {
        "recipe_id": "zL/shlovZ513RN3fisnI8NPl.2tcdb6",
        "recipe_title": "Sixteen Spice Smoked Chicken",
        "original_instructions": "Combine all spices in a bowl. Rub the entire chicken with the spice rub, including the cavity, and set aside while you prepare the grill.\nSet up a charcoal grill for indirect grilling. Throw the soaked wood chips on the hot coals. Place the cover on the grill and adjust the vents holes on the top and bottom to obtain the desired temperature (in this case it should be about 350 degrees F).\nPlace the chicken on the rack of the grill opposite the coals and smoke until the chicken reaches an internal temperature of 160 degrees F, using an instant-read thermometer, about 2 to 2 1/2 hours. Remove from the grill, tent loosely with foil, and let rest 10 minutes before carving.",
        "ingredients": [
            "1 tablespoon ground cinnamon",
            "1 tablespoon ancho chili powder",
            "1 tablespoon pasilla chili powder",
            "1 tablespoon ground cumin",
            "1 tablespoon ground coriander",
            "1 teaspoon garlic powder",
            "1 teaspoon onion powder",
            "1 teaspoon ground ginger",
            "1 teaspoon ground cloves",
            "1 teaspoon ground fennel seed",
            "1 teaspoon ground allspice",
            "1 teaspoon chili de arbol powder",
            "2 tablespoons brown sugar",
            "1 tablespoon kosher salt",
            "1 tablespoon coarsely ground black pepper",
            "1/2 teaspoon cayenne pepper",
            "1 (3 to 4-pound) chicken",
            "1 cup applewood or hickory wood chips, soaked in water for 10 minutes"
        ],
        "step_by_step_instructions": [
            "Combine all spices in a bowl.",
            "Rub the entire chicken with the spice rub, including the cavity.",
            "Set aside the chicken while you prepare the grill.",
            "Set up a charcoal grill for indirect grilling.",
            "Throw the soaked wood chips on the hot coals.",
            "Place the cover on the grill and adjust the vents holes on the top and bottom to obtain the desired temperature of about 350 degrees F.",
            "Place the chicken on the rack of the grill opposite the coals.",
            "Smoke until the chicken reaches an internal temperature of 160 degrees F, about 2 to 2 1/2 hours.",
            "Remove from the grill, tent loosely with foil, and let rest 10 minutes before carving."
        ],
        "processed_ingredients": [
            "0.13 tablespoon ground cinnamon",
            "0.13 tablespoon ancho chili powder",
            "0.13 tablespoon pasilla chili powder",
            "0.13 tablespoon ground cumin",
            "0.13 tablespoon ground coriander",
            "0.13 teaspoon garlic powder",
            "0.13 teaspoon onion powder",
            "0.13 teaspoon ground ginger",
            "0.13 teaspoon ground cloves",
            "0.13 teaspoon ground fennel seed",
            "0.13 teaspoon ground allspice",
            "0.13 teaspoon chili de arbol powder",
            "0.25 tablespoon brown sugar",
            "0.13 tablespoon kosher salt",
            "0.13 tablespoon coarsely ground black pepper",
            "0.06 teaspoon cayenne pepper",
            "0.33 lb chicken",
            "0.13 cup applewood or hickory wood chips"
        ],
        "pure_ingredients": [
            "cinnamon",
            "ancho chili",
            "pasilla chili",
            "cumin",
            "coriander",
            "garlic",
            "onion",
            "ginger",
            "cloves",
            "fennel seed",
            "allspice",
            "chili de arbol",
            "brown sugar",
            "salt",
            "black pepper",
            "cayenne pepper",
            "chicken",
            "wood chips"
        ],
        "cooking_time": "2.5 hours",
        "required_tools": [
            "bowl",
            "charcoal grill",
            "instant-read thermometer",
            "foil"
        ]
    },
    {
        "recipe_id": "pAO132H/VUGsZSQcLSYlILpYJfzq222",
        "recipe_title": "First Moon Chicken Stir-Fry",
        "original_instructions": "Combine 1 Tbsp. soy sauce, 1 Tbsp. cornstarch, 1/2 teaspoon sugar and garlic; stir in chicken. Let stand 15 minutes.\nMeanwhile, blend remaining 2 Tbsp. soy sauce, 1 Tbsp. cornstarch, 2 teaspoons sugar and vinegar with 3/4 cup water.\nRemove flowerets from broccoli; cut into bite-size pieces. Peel stalks; cut diagonally into thin slices.\nHeat 1 Tbsp. oil in hot wok or large skillet over high heat. Add chicken and stir-fry 3 minutes; remove.\nHeat remaining 1 Tbsp. oil in same pan. Add broccoli, onion, carrot and red pepper; stir-fry 3 minutes. Add snow peas; stir-fry 2 minutes longer. Stir in chicken and soy sauce mixture. Cook, stirring, until sauce boils and thickens",
        "ingredients": [
            "3 tablespoons Kikkoman Soy Sauce, divided",
            "2 tablespoons cornstarch, divided",
            "2-1/2 teaspoons sugar, divided",
            "1 clove garlic, pressed",
            "2 boneless, skinless chicken breast halves, cut into 1-inch squares",
            "1 teaspoon distilled white vinegar",
            "1/2 pound fresh broccoli",
            "2 tablespoons vegetable oil, divided",
            "1 medium onion, chunked",
            "1 small carrot, cut diagonally into thin slices",
            "1/2 teaspoon crushed red pepper",
            "1/4 pound fresh snow peas, trimmed and cut in half"
        ],
        "step_by_step_instructions": [
            "Combine 0.5 tablespoon soy sauce, 0.5 tablespoon cornstarch, 0.08 teaspoon sugar, and garlic; stir in chicken. Let stand for 15 minutes.",
            "Meanwhile, blend 1 tablespoon soy sauce, 0.5 tablespoon cornstarch, 0.3 teaspoon sugar, and vinegar with 0.125 cup water.",
            "Remove flowerets from broccoli; cut into bite-size pieces. Peel stalks; cut diagonally into thin slices.",
            "Heat 0.5 tablespoon oil in a hot wok or large skillet over high heat. Add chicken and stir-fry for 3 minutes; remove.",
            "Heat remaining 0.5 tablespoon oil in the same pan. Add broccoli, onion, carrot, and red pepper; stir-fry for 3 minutes.",
            "Add snow peas; stir-fry for 2 minutes longer.",
            "Stir in chicken and soy sauce mixture. Cook, stirring, until sauce boils and thickens."
        ],
        "processed_ingredients": [
            "0.5 tablespoon soy sauce",
            "0.5 tablespoon cornstarch",
            "0.08 teaspoon sugar",
            "0.17 clove garlic",
            "3.5 ounce chicken breast",
            "0.17 teaspoon white vinegar",
            "2 ounce broccoli",
            "0.5 tablespoon vegetable oil",
            "1 ounce onion",
            "0.33 ounce carrot",
            "0.08 teaspoon crushed red pepper",
            "1 ounce snow peas"
        ],
        "pure_ingredients": [
            "soy sauce",
            "cornstarch",
            "sugar",
            "garlic",
            "chicken breast",
            "vinegar",
            "broccoli",
            "vegetable oil",
            "onion",
            "carrot",
            "red pepper",
            "snow peas"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "wok",
            "large skillet",
            "knife"
        ]
    },
    {
        "recipe_id": "GvzcatTBVKEQqlUWA3HmS4KBUE5W2I6",
        "recipe_title": "Cornbread Stuffing with Sausage and Apples",
        "original_instructions": "Saute sausage until brown. Remove from pan and place in a large mixing bowl. Saute onions and celery in butter. Add sage, rosemary and thyme. When the mixture is softened, about 3 minutes, put into bowl with sausage. Add the remaining ingredients to the mixing bowl. It mixture is too dry add more stock.",
        "ingredients": [
            "1/2 pound bulk pork sausage",
            "1 cup small diced onions",
            "1 cup small diced celery",
            "2 tablespoons butter",
            "1 tablespoon fresh, chopped sage",
            "1 tablespoon fresh, chopped rosemary",
            "1 tablespoon fresh, chopped thyme",
            "3 cups crumbled cornbread",
            "3 cups cubed stale bread",
            "1 cup chicken stock",
            "1 large peeled, cored and diced apple",
            "2 tablespoons chopped parsley",
            "1 tablespoon poultry seasoning",
            "1 teaspoon salt",
            "1/2 teaspoon ground black pepper",
            "1 cup chopped red pepper",
            "1/2 cup raisins (optional)"
        ],
        "step_by_step_instructions": [
            "Saute approximately 0.08 pound of sausage in a pan until brown. Remove from pan and place in a large mixing bowl.",
            "Saute about 0.13 cup of diced onions and 0.13 cup of diced celery in approximately 0.33 tablespoon of butter.",
            "Add around 0.13 tablespoon each of chopped sage, rosemary, and thyme to the pan.",
            "When the mixture is softened, after about 3 minutes, transfer it to the bowl with the sausage.",
            "Add approximately 0.38 cup of crumbled cornbread and 0.38 cup of cubed stale bread to the mixing bowl.",
            "Add about 0.13 cup of chicken stock. If the mixture is too dry, add more stock as needed.",
            "Include approximately 0.13 of a large diced apple, around 0.33 tablespoon of chopped parsley, about 0.13 tablespoon of poultry seasoning, approximately 0.08 teaspoon of salt, and 0.04 teaspoon of ground black pepper.",
            "Add about 0.13 cup of chopped red pepper.",
            "Mix all ingredients thoroughly in the bowl."
        ],
        "processed_ingredients": [
            "0.08 lb bulk pork sausage",
            "0.13 cup diced onions",
            "0.13 cup diced celery",
            "0.33 tbsp butter",
            "0.13 tbsp chopped sage",
            "0.13 tbsp chopped rosemary",
            "0.13 tbsp chopped thyme",
            "0.38 cup crumbled cornbread",
            "0.38 cup cubed stale bread",
            "0.13 cup chicken stock",
            "0.13 large apple",
            "0.33 tbsp chopped parsley",
            "0.13 tbsp poultry seasoning",
            "0.08 tsp salt",
            "0.04 tsp ground black pepper",
            "0.13 cup chopped red pepper"
        ],
        "pure_ingredients": [
            "pork",
            "onions",
            "celery",
            "butter",
            "sage",
            "rosemary",
            "thyme",
            "cornbread",
            "bread",
            "chicken stock",
            "apple",
            "parsley",
            "poultry seasoning",
            "salt",
            "black pepper",
            "red pepper",
            "raisins"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "pan",
            "mixing bowl"
        ]
    },
    {
        "recipe_id": "IKoCjFdSLNc8ApZKSSdQGXV/VwhjGmG",
        "recipe_title": "Yogurt Mashed Potatoes ",
        "original_instructions": "Combine yogurt, green onions and curry powder in bowl. Place potatoes in microwave-safe dish. Add milk. Cover tightly and cook on High until potatoes are tender but not mushy, about 12 minutes. Remove from microwave. Add yogurt mixture to potatoes and mash roughly. Season with salt and pepper. Garnish with parsley.\nCombine yogurt, green onions and curry powder in bowl. Place potatoes in microwave-safe dish. Add milk. Cover tightly and cook on High until potatoes are tender but not mushy, about 12 minutes. Remove from microwave. Add yogurt mixture to potatoes and mash roughly. Season with salt and pepper. Garnish with parsley.",
        "ingredients": [
            "1 1/4 cups plain yogurt",
            "4 green onions, sliced",
            "1/2 to 1 teaspoon curry powder",
            "2 pounds red potatoes, peeled, cut into eighths",
            "1/4 cup milk",
            "Salt and Pepper",
            "Chopped fresh parsley"
        ],
        "step_by_step_instructions": [
            "Combine 0.31 cups plain yogurt, 1 sliced green onion, and 0.13 to 0.25 teaspoons curry powder in a bowl.",
            "Place 8 ounces peeled and cut red potatoes in a microwave-safe dish.",
            "Add 1 tablespoon milk to the potatoes.",
            "Cover tightly and cook on High in the microwave until potatoes are tender but not mushy, about 12 minutes.",
            "Remove potatoes from the microwave.",
            "Add the yogurt mixture to the potatoes and mash roughly.",
            "Season with salt and pepper to taste.",
            "Garnish with chopped fresh parsley."
        ],
        "processed_ingredients": [
            "0.31 cup plain yogurt",
            "1 whole green onion",
            "0.13 tsp curry powder",
            "8 oz red potatoes",
            "1 tbsp milk",
            "0.13 tsp salt",
            "0.13 tsp pepper",
            "0.13 oz fresh parsley"
        ],
        "pure_ingredients": [
            "yogurt",
            "green onion",
            "curry powder",
            "potato",
            "milk",
            "salt",
            "pepper",
            "parsley"
        ],
        "cooking_time": "12 minutes",
        "required_tools": [
            "microwave-safe dish",
            "microwave",
            "bowl",
            "knife",
            "masher"
        ]
    },
    {
        "recipe_id": "j82RAYO3f.Q2Cx3IV.GtOhYKJhcb8ZG",
        "recipe_title": "Spicy Crunch Mix",
        "original_instructions": "Preheat oven to 350 degrees. Combine cereals and nuts in large bowl. Melt butter in saucepan and add seasonings. Drizzle butter mixture over cereal mixture and toss to coat. Season with salt. Bake for 20 minutes. Serve.",
        "ingredients": [
            "2 cups crunchy wheat cereal (chex)",
            "2 cups crunchy corn cereal (chex)",
            "2 cups pretzel nuggets",
            "1 cup peanuts",
            "6 tablespoons butter",
            "1 teaspoon cayenne",
            "1 teaspoon chili powder",
            "1 teaspoon curry",
            "Salt"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees.",
            "Combine 0.33 cups of crunchy wheat cereal, 0.33 cups of crunchy corn cereal, 0.33 cups of pretzel nuggets, and 0.17 cups of peanuts in a large bowl.",
            "Melt 1 tablespoon of butter in a saucepan and add 0.17 teaspoons of cayenne, 0.17 teaspoons of chili powder, and 0.17 teaspoons of curry.",
            "Drizzle the butter mixture over the cereal mixture and toss to coat.",
            "Season with salt to taste.",
            "Bake the mixture for 20 minutes.",
            "Serve."
        ],
        "processed_ingredients": [
            "0.33 cup crunchy wheat cereal",
            "0.33 cup crunchy corn cereal",
            "0.33 cup pretzel nuggets",
            "0.17 cup peanuts",
            "1 tablespoon butter",
            "0.17 teaspoon cayenne",
            "0.17 teaspoon chili powder",
            "0.17 teaspoon curry",
            "Salt"
        ],
        "pure_ingredients": [
            "wheat cereal",
            "corn cereal",
            "pretzel",
            "peanut",
            "butter",
            "cayenne",
            "chili powder",
            "curry",
            "salt"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "oven",
            "large bowl",
            "saucepan"
        ]
    },
    {
        "recipe_id": "ZU95bC23Gl6HrOdVpT38cvI.nb2qdrC",
        "recipe_title": "Sugar Snap Peas with Onions and Bacon",
        "original_instructions": "Watch how to make this recipe.\nIn a medium skillet over medium high heat, brown chopped bacon. Using a slotted spoon, remove bacon to a paper towel lined plate. Add onion to the pan. Saute chopped onions 3 minutes or so, until they are just tender. Add peas and water to the pan. Cover and cook peas 5 minutes. Uncover and allow the liquid to cook almost out of the pan. Add bacon back to the skillet and remove pan from heat. Transfer to a serving dish and enjoy!",
        "ingredients": [
            "3 slices bacon, cut into 1/2-inch pieces",
            "1 small yellow skinned onion, peeled and chopped",
            "1 pound sugar snap peas",
            "1/2 cup water",
            "Salt and pepper"
        ],
        "step_by_step_instructions": [
            "In a medium skillet over medium-high heat, brown approximately 1 slice of chopped bacon until crispy.",
            "Using a slotted spoon, remove bacon to a paper towel lined plate.",
            "Add about 1/4 of a small chopped yellow onion to the pan.",
            "Saute the chopped onion for about 3 minutes until just tender.",
            "Add approximately 4 ounces of sugar snap peas and 2 tablespoons of water to the pan.",
            "Cover and cook the peas for 5 minutes.",
            "Uncover and allow the liquid to cook almost out of the pan.",
            "Add the bacon back to the skillet and remove the pan from heat.",
            "Transfer to a serving dish and enjoy!"
        ],
        "processed_ingredients": [
            "1 slice bacon",
            "0.25 small onion",
            "4 oz sugar snap peas",
            "2 tbsp water",
            "0.25 tsp salt",
            "0.25 tsp pepper"
        ],
        "pure_ingredients": [
            "bacon",
            "onion",
            "sugar snap peas",
            "water",
            "salt",
            "pepper"
        ],
        "cooking_time": "13 minutes",
        "required_tools": [
            "medium skillet",
            "slotted spoon",
            "paper towel",
            "cover for skillet",
            "serving dish"
        ]
    },
    {
        "recipe_id": "lB3CpajDnuzbhbTxVOemHZmp7n4TUWi",
        "recipe_title": "Sichuan Tofu Gan and Warm Celery Salad",
        "original_instructions": "Whisk together the chili oil, chili bean paste and rice vinegar in a small bowl.\nHeat a wok over high heat until smoking and pour in the vegetable oil. Add the peppercorns and garlic and toss briefly, and then add the celery and stir-fry until softened, 1 minute. Stir in the tofu and carefully toss until heated through, about 1 minute. Pour in the chili oil sauce and toss well until warm throughout.\nStir in the soy sauce and season with sea salt, black pepper and the lemon juice, adding more to taste.\nTransfer to a platter and sprinkle the cilantro and peanuts over the top. Drizzle more chili oil over the salad and serve immediately.",
        "ingredients": [
            "2 tablespoons chili oil, plus more for garnish",
            "1 tablespoon chili bean paste",
            "1 tablespoon rice vinegar",
            "1 tablespoon vegetable oil",
            "1 tablespoon Sichuan peppercorns",
            "1 large clove garlic, coarsely chopped",
            "3 inner celery stalks, with leaves, sliced diagonally 1/4-inch thick",
            "One 8-ounce package firm tofu gan (dried firm beancurd), sliced into 1/8-inch-thick slices",
            "1 teaspoon light soy sauce",
            "Sea salt and freshly ground black pepper",
            "Juice of 1/2 lemon",
            "1/4 cup coarsely chopped fresh cilantro leaves",
            "1/4 cup roasted salted peanuts"
        ],
        "step_by_step_instructions": [
            "Whisk together 0.50 tablespoon chili oil, 0.25 tablespoon chili bean paste, and 0.25 tablespoon rice vinegar in a small bowl.",
            "Heat a wok over high heat until smoking and pour in 0.25 tablespoon vegetable oil.",
            "Add 0.25 tablespoon Sichuan peppercorns and 0.25 large clove garlic, coarsely chopped, and toss briefly.",
            "Add 0.75 inner celery stalks, sliced diagonally 1/4-inch thick, and stir-fry until softened, 1 minute.",
            "Stir in 2 ounce firm tofu gan, sliced into 1/8-inch-thick slices, and carefully toss until heated through, about 1 minute.",
            "Pour in the chili oil sauce and toss well until warm throughout.",
            "Stir in 0.25 teaspoon light soy sauce and season with sea salt, black pepper, and the juice of 0.125 lemon, adding more to taste.",
            "Transfer to a platter and sprinkle 0.06 cup coarsely chopped fresh cilantro leaves and 0.06 cup roasted salted peanuts over the top.",
            "Drizzle more chili oil over the salad and serve immediately."
        ],
        "processed_ingredients": [
            "0.50 tablespoon chili oil",
            "0.25 tablespoon chili bean paste",
            "0.25 tablespoon rice vinegar",
            "0.25 tablespoon vegetable oil",
            "0.25 tablespoon Sichuan peppercorns",
            "0.25 large clove garlic",
            "0.75 inner celery stalks",
            "2 ounce firm tofu gan",
            "0.25 teaspoon light soy sauce",
            "0.125 lemon",
            "0.06 cup fresh cilantro leaves",
            "0.06 cup roasted salted peanuts",
            "sea salt",
            "black pepper"
        ],
        "pure_ingredients": [
            "chili oil",
            "chili bean paste",
            "rice vinegar",
            "vegetable oil",
            "Sichuan peppercorns",
            "garlic",
            "celery",
            "tofu",
            "soy sauce",
            "lemon",
            "cilantro",
            "peanuts",
            "salt",
            "pepper"
        ],
        "cooking_time": "4 minutes",
        "required_tools": [
            "wok",
            "small bowl",
            "knife"
        ]
    },
    {
        "recipe_id": "bhRj7Cl6k8gWWpGYD1iDnzdXR60/MEy",
        "recipe_title": "Bacon-Wrapped Dates",
        "original_instructions": "Watch how to make this recipe.\nSpecial equipment: 35 to 40 toothpicks\nPreheat the oven to 425 degrees F.\nStuff each date with 1 to 2 almonds. Wrap each date with half a piece of bacon and secure with a toothpick.\nBake, turning the dates halfway through so the bacon is evenly cooked, 15 to 18 minutes. Serve warm or at room temperature.",
        "ingredients": [
            "35 to 40 pitted dates",
            "70 to 80 salted roasted almonds",
            "2 pounds thin bacon, cut in half"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 425 degrees F.",
            "Stuff 1 date with 2 almonds.",
            "Wrap the date with half a piece of bacon and secure with a toothpick.",
            "Place in the oven and bake, turning halfway through, for 15 to 18 minutes until bacon is evenly cooked.",
            "Serve warm or at room temperature."
        ],
        "processed_ingredients": [
            "1 date",
            "2 almonds",
            "0.80 oz bacon"
        ],
        "pure_ingredients": [
            "dates",
            "almonds",
            "bacon"
        ],
        "cooking_time": "18 minutes",
        "required_tools": [
            "oven",
            "toothpicks"
        ]
    },
    {
        "recipe_id": "bW1Plrl8cID49fuSeDi5.ekakfqnddS",
        "recipe_title": "Pulled BBQ Chicken Sandwiches",
        "original_instructions": "Watch how to make this recipe.\nHeat the oil in a large saute pan over a medium heat. Add the onions and cook until they are soft and translucent, about 5 minutes. Add the garlic and cook for 1 minute more. Add tomato sauce, tomato paste, water, vinegar, molasses, pepper and liquid smoke and bring to a boil. Reduce heat to medium-low and simmer for 15 minutes. Add chopped chicken, return to a simmer, and cook an additional 10 minutes.\nSplit rolls. Place a leaf of lettuce on each roll, then pile on 3/4 cup of the chicken mixture onto the roll.",
        "ingredients": [
            "1 tablespoon canola oil",
            "1 large onion, chopped",
            "3 cloves garlic, minced",
            "1 (14-ounce) can low-sodium tomato sauce",
            "1/4 cup tomato paste",
            "1/2 cup water",
            "1/3 cup apple cider vinegar",
            "5 tablespoons molasses",
            "1/4 teaspoon ground black pepper",
            "1/2 teaspoon liquid smoke",
            "1 whole rotisserie chicken, skin removed, meat shredded into thin strips (about 4 to 4 1/2 cups)",
            "6 whole-wheat hamburger rolls",
            "6 large green lettuce leaves"
        ],
        "step_by_step_instructions": [
            "Heat 0.17 tablespoon canola oil in a large saute pan over medium heat.",
            "Add 0.17 large onion, chopped, and cook until soft and translucent, about 5 minutes.",
            "Add 0.5 clove garlic, minced, and cook for 1 minute more.",
            "Add 2.33 ounce tomato sauce, 0.04 cup tomato paste, 0.08 cup water, 0.06 cup apple cider vinegar, 0.83 tablespoon molasses, 0.04 teaspoon ground black pepper, and 0.08 teaspoon liquid smoke to the pan and bring to a boil.",
            "Reduce heat to medium-low and simmer for 15 minutes.",
            "Add approximately 0.75 cup shredded chicken to the pan, return to a simmer, and cook for an additional 10 minutes.",
            "Split 1 whole-wheat hamburger roll.",
            "Place 1 large green lettuce leaf on the roll.",
            "Pile on 0.75 cup of the chicken mixture onto the roll."
        ],
        "processed_ingredients": [
            "0.17 tablespoon canola oil",
            "0.17 large onion",
            "0.5 clove garlic",
            "2.33 ounce tomato sauce",
            "0.04 cup tomato paste",
            "0.08 cup water",
            "0.06 cup apple cider vinegar",
            "0.83 tablespoon molasses",
            "0.04 teaspoon ground black pepper",
            "0.08 teaspoon liquid smoke",
            "0.75 cup shredded chicken",
            "1 whole-wheat hamburger roll",
            "1 large green lettuce leaf"
        ],
        "pure_ingredients": [
            "canola oil",
            "onion",
            "garlic",
            "tomato",
            "vinegar",
            "molasses",
            "black pepper",
            "liquid smoke",
            "chicken",
            "wheat",
            "lettuce"
        ],
        "cooking_time": "31 minutes",
        "required_tools": [
            "saute pan",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "hIo63XneU90yy365S8dbA/TAtyTNQRy",
        "recipe_title": "Schooner Ellida Shore Dinner",
        "original_instructions": "In a very large pot with heavy lid, layer leeks, kielbasa, baby red potatoes, and parsley. Cover completely with white wine. Add garlic pepper. Add live lobsters. Top with corn on the cob and finally mussels or steamer clams. Cover tightly and cook over a propane cooker on the beach, or on a stovetop over high heat. Watch for steam starting to escape from the pot. When it does, set timer for 20 to 25 minutes. When done, you should smell the kielbasa and the mussels should be open completely. Lobsters should be bright red in color. Lift out dinner ingredients onto bed of seaweed or large platters. Serve in large bowls with melted butter on the side.;",
        "ingredients": [
            "1 leek, cleaned and chopped, or substitute 1 large yellow onion, chopped",
            "2 packages smoked turkey kielbasa, cut into 3-inch pieces",
            "1 (5 pound) bag baby red potatoes, or about 4 to 5 baby red potatoes per person",
            "1/2 cup chopped parsley",
            "Large bottle white wine, such as Chablis",
            "2 tablespoons garlic pepper",
            "1 dozen (1 1/2 pound) live Maine lobsters",
            "8 ears fresh corn, shucked",
            "4 pounds mussels, or steamer clams, still in shells and washed thoroughly",
            "2 cups melted butter"
        ],
        "step_by_step_instructions": [
            "Clean and chop 0.08 lb of leek or chop 0.13 lb of yellow onion.",
            "Cut 0.33 lb of smoked turkey kielbasa into 3-inch pieces.",
            "Wash and prepare 0.63 lb of baby red potatoes.",
            "Chop enough parsley to fill 1 tbsp.",
            "In a very large pot with a heavy lid, layer the chopped leeks, kielbasa, baby red potatoes, and parsley.",
            "Pour approximately 1.5 cups of white wine into the pot until the ingredients are covered.",
            "Add 0.17 tbsp of garlic pepper.",
            "Place 1 live Maine lobster into the pot.",
            "Top with 1 ear of shucked corn and 0.33 lb of mussels or steamer clams.",
            "Cover the pot tightly and cook over high heat on a stovetop or propane cooker.",
            "Watch for steam starting to escape from the pot. Once it does, set a timer for 20 to 25 minutes.",
            "Check to ensure the mussels are open completely and the lobster is bright red in color.",
            "Lift out dinner ingredients onto a bed of seaweed or a large platter.",
            "Serve in a large bowl with 0.25 cup of melted butter on the side."
        ],
        "processed_ingredients": [
            "0.08 lb leek",
            "0.33 lb smoked turkey kielbasa",
            "0.63 lb baby red potatoes",
            "1 tbsp parsley",
            "1.5 cup white wine",
            "0.17 tbsp garlic pepper",
            "1 lb Maine lobster",
            "1 ear corn",
            "0.33 lb mussels",
            "0.25 cup butter"
        ],
        "pure_ingredients": [
            "leek",
            "turkey",
            "potato",
            "parsley",
            "wine",
            "pepper",
            "lobster",
            "corn",
            "mussels",
            "butter"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "large pot",
            "heavy lid",
            "stovetop or propane cooker"
        ]
    },
    {
        "recipe_id": "w.mmzPC3wEe0NubZF0H8V8jT5y7l9Bi",
        "recipe_title": "Lamb-Fry ",
        "original_instructions": "In a large nonstick frying pan over medium-high heat, fry onion in oil until edges are nicely browned. Add garlic, ginger, and green chile and stir for 1 minute. Mix ground spices with water to form a paste; add to onion mixture. Stir briefly until spices release their fragrance. Add lamb and salt and fry over medium heat, stirring frequently util lamb is cooked through, 10 to 15 minutes. Taste for salt. Stir in lemon juice and remove from heat.\nIn a large nonstick frying pan over medium-high heat, fry onion in oil until edges are nicely browned. Add garlic, ginger, and green chile and stir for 1 minute.\nMix ground spices with water to form a paste; add to onion mixture. Stir briefly until spices release their fragrance.\nAdd lamb and salt and fry over medium heat, stirring frequently util lamb is cooked through, 10 to 15 minutes. Taste for salt.\nStir in lemon juice and remove from heat.",
        "ingredients": [
            "2 cups (360g) thinly sliced onion",
            "3 tablespoons vegetable oil",
            "1 teaspoon minced garlic",
            "1 teaspoon minced ginger",
            "1 teaspoon minced green chile (serrano, Thai, or jalapeño)",
            "3 teaspoons ground coriander",
            "1/2 teaspoon ground cumin",
            "1/4 teaspoon ground red pepper (cayenne)",
            "1/2 teaspoon ground black pepper",
            "1/16 teaspoon ground turmeric",
            "1/16 teaspoon ground cinnamon",
            "1/16 teaspoon ground cloves",
            "2 tablespoons water",
            "2 pounds (900g) cubed leg of lamb trimmed of fat (about 4 cups (3/4-inch) cubes)",
            "1 teaspoon salt",
            "1/2 teaspoon fresh lemon juice"
        ],
        "step_by_step_instructions": [
            "In a nonstick frying pan over medium-high heat, fry 0.5 cup (90g) of sliced onion in 0.75 tablespoon of vegetable oil until the edges are nicely browned.",
            "Add 0.25 teaspoon of minced garlic, 0.25 teaspoon of minced ginger, and 0.25 teaspoon of minced green chile to the pan and stir for 1 minute.",
            "Mix 0.75 teaspoon of ground coriander, 0.125 teaspoon of ground cumin, 0.0625 teaspoon of ground red pepper, 0.125 teaspoon of ground black pepper, 0.016 teaspoon of ground turmeric, 0.016 teaspoon of ground cinnamon, and 0.016 teaspoon of ground cloves with 0.5 tablespoon of water to form a paste.",
            "Add the spice paste to the onion mixture and stir briefly until the spices release their fragrance.",
            "Add 0.5 pound (225g) of cubed leg of lamb and 0.25 teaspoon of salt to the pan and fry over medium heat, stirring frequently until the lamb is cooked through, about 10 to 15 minutes.",
            "Taste for salt and adjust if necessary.",
            "Stir in 0.125 teaspoon of fresh lemon juice and remove from heat."
        ],
        "processed_ingredients": [
            "90.00 g onion",
            "0.75 tbsp vegetable oil",
            "0.25 tsp garlic",
            "0.25 tsp ginger",
            "0.25 tsp green chile",
            "0.75 tsp coriander",
            "0.12 tsp cumin",
            "0.06 tsp red pepper",
            "0.12 tsp black pepper",
            "0.02 tsp turmeric",
            "0.02 tsp cinnamon",
            "0.02 tsp cloves",
            "0.50 tbsp water",
            "225.00 g lamb",
            "0.25 tsp salt",
            "0.12 tsp lemon juice"
        ],
        "pure_ingredients": [
            "onion",
            "vegetable oil",
            "garlic",
            "ginger",
            "green chile",
            "coriander",
            "cumin",
            "red pepper",
            "black pepper",
            "turmeric",
            "cinnamon",
            "cloves",
            "water",
            "lamb",
            "salt",
            "lemon juice"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "nonstick frying pan",
            "measuring spoons",
            "spatula"
        ]
    },
    {
        "recipe_id": "j9RBCtXc241SouJEt/Sz9/W7Kma9uKq",
        "recipe_title": "Paprika Roasted Potatoes",
        "original_instructions": "Combine all the ingredients in a large roasting pan and toss thoroughly to coat the potatoes with the seasonings. Cover with plastic wrap and let marinate for 30 minutes. Meanwhile, preheat the oven to 350 degrees F. Uncover the pan and roast the potatoes for 35 to 40 minutes, until they are golden and crisp. Serve immediately.;",
        "ingredients": [
            "4 cups red bliss potatoes, unpeeled, scrubbed, and cut into 1-inch cubes",
            "1/4 cup olive oil",
            "1 tablespoon chopped fresh rosemary, or 1 1/2 teaspoons crushed dried",
            "1 teaspoon paprika",
            "1/2 teaspoon salt",
            "1/2 teaspoon ground black pepper"
        ],
        "step_by_step_instructions": [
            "Combine 1 cup red bliss potatoes, 1 tablespoon olive oil, 0.25 tablespoon chopped fresh rosemary, 0.25 teaspoon paprika, 0.125 teaspoon salt, and 0.125 teaspoon ground black pepper in a large roasting pan.",
            "Toss thoroughly to coat the potatoes with the seasonings.",
            "Cover with plastic wrap and let marinate for 30 minutes.",
            "Meanwhile, preheat the oven to 350 degrees F.",
            "Uncover the pan and roast the potatoes for 35 to 40 minutes, until they are golden and crisp.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "1 cup potatoes",
            "1 tablespoon olive oil",
            "0.25 tablespoon rosemary",
            "0.25 teaspoon paprika",
            "0.125 teaspoon salt",
            "0.125 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "potatoes",
            "olive oil",
            "rosemary",
            "paprika",
            "salt",
            "black pepper"
        ],
        "cooking_time": "70 minutes",
        "required_tools": [
            "roasting pan",
            "plastic wrap",
            "oven"
        ]
    },
    {
        "recipe_id": "e8KDCoC9f9qpphfAN2kAb3bEYin5X.G",
        "recipe_title": "Market Basket Chicken Vegetable Stir-fry",
        "original_instructions": "Heat the oil in a wok over high heat. Add the garlic, ginger, and scallions. Cook until aromatic, about 2 minutes. Add the chicken. Saute until the edges are brown, about 3 to 4 minutes. Add the broccoli, carrots, and green beans to the wok. Cook approximately 5 to 8 minutes, until the vegetables begin to become tender. Add the red pepper, mushrooms, bok choy, and teriyaki sauce to the wok, cook approximately 5 to 8 minutes more, or until chicken is cooked through and vegetables are done to your likeness. Taste and adjust seasonings. Serve immediately.",
        "ingredients": [
            "1 tablespoon sesame oil",
            "1 tablespoon minced garlic",
            "1 tablespoon minced ginger",
            "1 tablespoon minced scallions",
            "1 pound boneless, skinless, chicken breasts, sliced into strips",
            "1 cup broccoli spears",
            "1 cup julienned carrots",
            "1/2 pound green beans, chopped",
            "1/2 cup julienned red pepper",
            "1 cup quartered button mushrooms",
            "3 heads baby bok choy, chopped",
            "Low sodium teriyaki sauce"
        ],
        "step_by_step_instructions": [
            "Heat 0.33 tablespoon sesame oil in a wok over high heat.",
            "Add 0.33 tablespoon minced garlic, 0.33 tablespoon minced ginger, and 0.33 tablespoon minced scallions. Cook until aromatic, about 2 minutes.",
            "Add 0.33 pound boneless, skinless, chicken breasts, sliced into strips. Saute until the edges are brown, about 3 to 4 minutes.",
            "Add 0.33 cup broccoli spears, 0.33 cup julienned carrots, and 0.17 pound green beans, chopped. Cook approximately 5 to 8 minutes, until the vegetables begin to become tender.",
            "Add 0.17 cup julienned red pepper, 0.33 cup quartered button mushrooms, 1 head baby bok choy, chopped, and low sodium teriyaki sauce to the wok. Cook approximately 5 to 8 minutes more, or until chicken is cooked through and vegetables are done to your likeness.",
            "Taste and adjust seasonings. Serve immediately."
        ],
        "processed_ingredients": [
            "0.33 tablespoon sesame oil",
            "0.33 tablespoon minced garlic",
            "0.33 tablespoon minced ginger",
            "0.33 tablespoon minced scallions",
            "0.33 lb boneless, skinless, chicken breasts",
            "0.33 cup broccoli spears",
            "0.33 cup julienned carrots",
            "0.17 lb green beans",
            "0.17 cup julienned red pepper",
            "0.33 cup quartered button mushrooms",
            "1 head baby bok choy",
            "1 tablespoon low sodium teriyaki sauce"
        ],
        "pure_ingredients": [
            "sesame oil",
            "garlic",
            "ginger",
            "scallions",
            "chicken",
            "broccoli",
            "carrots",
            "green beans",
            "red pepper",
            "mushrooms",
            "baby bok choy",
            "teriyaki sauce"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "wok",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "7bkzGYsJ9qDuw7MedoJXblnEuPz7D7m",
        "recipe_title": "Tortellini in Parmesan Brodo",
        "original_instructions": "To a large saucepan, combine the Parmesan rinds, carrots, celery, garlic, onions, oregano, thyme, bay leaf and salt. Add 8 cups water and bring to a simmer over medium heat. Simmer the broth for 1 hour 15 minutes, adjusting the heat to maintain a simmer and stirring occasionally to prevent sticking. Strain into a clean saucepan and keep warm over low heat.\nMeanwhile, bring a large pot of well-salted water to a boil. Add the tortellini and cook for 2 minutes less than the package instructions, about 4 minutes. Drain well, then add the tortellini to the broth to finish cooking. Stir in the parsley and serve.",
        "ingredients": [
            "1 pound Parmesan rinds",
            "1 carrot, peeled and chopped",
            "1 celery stalk, chopped",
            "1 head garlic, halved across the equator",
            "1 onion, halved",
            "4 sprigs fresh oregano",
            "2 sprigs fresh thyme",
            "1 bay leaf",
            "1 teaspoon salt, plus for pasta water",
            "1 pound spinach pasta tortellini (spinach pasta filled with cheese)",
            "2 tablespoons chopped fresh flat-leaf parsley"
        ],
        "step_by_step_instructions": [
            "Combine 2.5 ounces of Parmesan rinds, 0.25 carrot (about 0.5 ounce), 0.25 celery stalk (about 0.5 ounce), 0.5 head garlic, 0.25 onion (about 1 ounce), 1 sprig fresh oregano, 0.5 sprig fresh thyme, 0.25 bay leaf, and 0.25 teaspoon salt in a large saucepan.",
            "Add 2 cups of water and bring to a simmer over medium heat.",
            "Simmer the broth for 1 hour and 15 minutes, adjusting the heat to maintain a simmer and stirring occasionally to prevent sticking.",
            "Strain the broth into a clean saucepan and keep warm over low heat.",
            "Bring a large pot of well-salted water to a boil.",
            "Add 4 ounces of spinach pasta tortellini and cook for about 4 minutes.",
            "Drain the tortellini well, then add it to the prepared broth to finish cooking.",
            "Stir in 0.5 tablespoon of chopped fresh flat-leaf parsley and serve."
        ],
        "processed_ingredients": [
            "2.5 oz Parmesan rinds",
            "0.5 oz carrot",
            "0.5 oz celery",
            "0.5 head garlic",
            "1 oz onion",
            "1 sprig oregano",
            "0.5 sprig thyme",
            "0.25 bay leaf",
            "0.25 tsp salt",
            "4 oz spinach pasta tortellini",
            "0.5 tbsp parsley"
        ],
        "pure_ingredients": [
            "Parmesan",
            "carrot",
            "celery",
            "garlic",
            "onion",
            "oregano",
            "thyme",
            "bay leaf",
            "salt",
            "spinach pasta",
            "cheese",
            "parsley"
        ],
        "cooking_time": "75 minutes",
        "required_tools": [
            "large saucepan",
            "strainer",
            "large pot"
        ]
    },
    {
        "recipe_id": "oIIpRPR1OssrwuJ82dFlvVjFoVMZvqS",
        "recipe_title": "Roasted Tomato, Arugula and Mozzarella Salad",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 450 degrees F.\nAdd the tomatoes to a shallow 2-quart casserole dish in a single layer.\nToss the tomatoes with the oil, and salt and pepper, to taste. Make sure the tomatoes are cut side up after tossing. Roast until the tomatoes are extremely tender, about 35 to 40 minutes. Remove them from the oven and keep warm.\nIn a large salad bowl, toss the arugula, mozzarella balls, basil and the warm tomatoes along with any juices from the dish. Drizzle with some good balsamic and season with salt and pepper, to taste.",
        "ingredients": [
            "4 plum tomatoes, cut in 1/2 and seeded",
            "3 tablespoons olive oil",
            "Kosher salt and freshly ground black pepper",
            "One 5-ounce box baby arugula",
            "One 8-ounce package baby mozzarella balls, drained",
            "1/4 cup chiffonade basil leaves",
            "Balsamic vinegar"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450 degrees F.",
            "Cut 1 plum tomato in half and seed it.",
            "Add the tomato halves to a shallow baking dish in a single layer.",
            "Toss the tomato halves with 0.38 tablespoon of olive oil, and a pinch of salt and pepper. Make sure the tomatoes are cut side up after tossing.",
            "Roast the tomatoes until they are extremely tender, about 35 to 40 minutes.",
            "Remove the tomatoes from the oven and keep warm.",
            "In a large salad bowl, toss approximately 1.25 ounces of baby arugula, 2 ounces of baby mozzarella balls, 0.06 cup of chiffonade basil leaves, and the warm tomatoes along with any juices from the dish.",
            "Drizzle with a small amount of balsamic vinegar and season with salt and pepper to taste."
        ],
        "processed_ingredients": [
            "1 plum tomato",
            "0.38 tablespoon olive oil",
            "1.25 ounce baby arugula",
            "2 ounce baby mozzarella balls",
            "0.06 cup basil leaves",
            "1 tablespoon balsamic vinegar",
            "1 pinch salt",
            "1 pinch pepper"
        ],
        "pure_ingredients": [
            "tomato",
            "olive oil",
            "salt",
            "pepper",
            "arugula",
            "mozzarella",
            "basil",
            "balsamic vinegar"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "oven",
            "shallow baking dish",
            "salad bowl",
            "knife"
        ]
    },
    {
        "recipe_id": "LDmI2P2tZEqnWvGeXvlcImNn6VrmexO",
        "recipe_title": "Spicy Cole Slaw",
        "original_instructions": "In a large bowl, mix the cabbage and scallions with the mayonnaise, sugar, and hot oil and seasoning. Let sit overnight, or at least 4 hours.\nMix in the peanuts before serving. Serve with an array of smoked fish, raw vegetables, and pickles.",
        "ingredients": [
            "1 head red cabbage, shredded",
            "1 bunch scallions, sliced on the bias into 1-inch strips",
            "1 cup mayonnaise",
            "1 tablespoon light brown sugar",
            "2 tablespoons hot chile sesame oil",
            "Salt and freshly ground black pepper",
            "1 cup peanuts"
        ],
        "step_by_step_instructions": [
            "1. In a large bowl, mix approximately 2.67 ounces of shredded cabbage with about 0.67 ounces of sliced scallions.",
            "2. Add about 2 tablespoons of mayonnaise, 0.33 teaspoons of light brown sugar, and 0.67 teaspoons of hot chile sesame oil.",
            "3. Season with a pinch of salt and freshly ground black pepper.",
            "4. Let the mixture sit in the refrigerator for at least 4 hours or overnight.",
            "5. Before serving, mix in about 0.67 ounces of peanuts."
        ],
        "processed_ingredients": [
            "2.67 oz cabbage",
            "0.67 oz scallions",
            "2 tbsp mayonnaise",
            "0.33 tsp light brown sugar",
            "0.67 tsp hot chile sesame oil",
            "0.01 tsp salt",
            "0.01 tsp black pepper",
            "0.67 oz peanuts"
        ],
        "pure_ingredients": [
            "cabbage",
            "scallions",
            "mayonnaise",
            "brown sugar",
            "sesame oil",
            "salt",
            "black pepper",
            "peanuts"
        ],
        "cooking_time": "4 hours",
        "required_tools": [
            "large bowl",
            "refrigerator"
        ]
    },
    {
        "recipe_id": "waB1yRiRDLttUCNMxtoWSfiiOxpW96u",
        "recipe_title": "Tiny Tomato Salad",
        "original_instructions": "Cut 3/4 of the tomatoes in half, and place in a bowl. Set whole tomatoes aside for garnish.\nArrange basil leaves on each of 4 plates. Top each with 1/4 of the cut tomatoes. Drizzle with olive oil and balsamic vinegar. Garnish with reserved whole tomatoes, the feta cheese, and oregano. Season to taste with salt and pepper. Serve.",
        "ingredients": [
            "2 pints assorted heirloom cherry tomatoes",
            "1 cup fresh basil leaves",
            "Extra-virgin olive oil",
            "Balsamic vinegar",
            "4 ounces feta cheese, crumbled",
            "1 tablespoon fresh oregano leaves",
            "Coarse salt and freshly ground pepper"
        ],
        "step_by_step_instructions": [
            "Cut approximately 3/8 pint of the tomatoes in half, and place in a bowl.",
            "Set a small portion of whole tomatoes aside for garnish.",
            "Arrange about 1/4 cup of basil leaves on a plate.",
            "Top with 1/4 of the cut tomatoes.",
            "Drizzle with a small amount of olive oil and balsamic vinegar.",
            "Garnish with the reserved whole tomatoes, about 1 ounce of feta cheese, and a small amount of oregano.",
            "Season to taste with salt and pepper.",
            "Serve."
        ],
        "processed_ingredients": [
            "0.50 pint cherry tomatoes",
            "0.25 cup basil leaves",
            "0.50 tablespoon olive oil",
            "0.50 tablespoon balsamic vinegar",
            "1.00 ounce feta cheese",
            "0.25 tablespoon oregano leaves",
            "0.25 teaspoon salt",
            "0.25 teaspoon pepper"
        ],
        "pure_ingredients": [
            "cherry tomatoes",
            "basil",
            "olive oil",
            "balsamic vinegar",
            "feta cheese",
            "oregano",
            "salt",
            "pepper"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "knife",
            "cutting board",
            "bowl",
            "plates",
            "spoon"
        ]
    },
    {
        "recipe_id": "ZYEbkibrqAtDDz3XHezhB/1HIXsso9S",
        "recipe_title": "Roasted Fingerling Potatoes with Whole Garlic",
        "original_instructions": "Preheat oven to 375 degrees F.\nIn a large bowl combine all the ingredients and toss. Transfer to a baking sheet and roast for 15 to 20 minutes or until nice and tender.",
        "ingredients": [
            "2 pound fingerling potatoes, washed of any dirt",
            "10 cloves garlic, skin on",
            "3 tablespoons olive oil",
            "Leaves from 5 thyme sprigs",
            "Salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 375 degrees F.",
            "In a large bowl, combine about 0.33 pound of fingerling potatoes, 2 cloves of garlic (skin on), 0.5 tablespoon of olive oil, leaves from 1 thyme sprig, a pinch of salt, and a pinch of freshly ground black pepper.",
            "Toss the ingredients together until the potatoes are well coated.",
            "Transfer the mixture to a baking sheet, spreading it out evenly.",
            "Roast in the oven for 15 to 20 minutes, or until the potatoes are nice and tender."
        ],
        "processed_ingredients": [
            "0.33 lb fingerling potatoes",
            "2 cloves garlic",
            "0.5 tbsp olive oil",
            "1 sprig thyme",
            "0.25 tsp salt",
            "0.25 tsp black pepper"
        ],
        "pure_ingredients": [
            "fingerling potatoes",
            "garlic",
            "olive oil",
            "thyme",
            "salt",
            "black pepper"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "oven",
            "large bowl",
            "baking sheet"
        ]
    }
]