[
    {
        "recipe_id": "rYYJEUXfiEH307bHaYfPPNoKjHznPt6",
        "recipe_title": "Seasoned Pita Chips",
        "original_instructions": "Preheat the oven to 375 degrees F.\nDrizzle a thin layer of olive oil on a baking sheet. Stir together the salt, cumin and paprika in a small bowl until combined. Sprinkle a little of the spice mixture over the surface of the oiled baking sheet.\nSpread the pita wedges evenly on the baking sheet and rub them in the oil to coat the undersides. Drizzle more oil over the tops of the pita, and season lightly with the spice mixture.\nBake until light golden brown and crisp, 7 to 10 minutes. Serve warm or at room temperature.",
        "ingredients": [
            "Extra-virgin olive oil, for drizzling",
            "2 tablespoons kosher salt",
            "1/2 teaspoon ground cumin",
            "1/2 teaspoon smoked paprika",
            "Three 6-inch pita bread pockets, cut into small wedges"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 375 degrees F.",
            "Drizzle a thin layer of olive oil on a baking sheet.",
            "Stir together 0.67 tablespoon kosher salt, 0.17 teaspoon ground cumin, and 0.17 teaspoon smoked paprika in a small bowl until combined.",
            "Sprinkle a little of the spice mixture over the surface of the oiled baking sheet.",
            "Spread approximately 3 ounces of pita wedges evenly on the baking sheet and rub them in the oil to coat the undersides.",
            "Drizzle more olive oil over the tops of the pita, and season lightly with the spice mixture.",
            "Bake until light golden brown and crisp, about 7 to 10 minutes.",
            "Serve warm or at room temperature."
        ],
        "processed_ingredients": [
            "0.67 tablespoon kosher salt",
            "0.17 teaspoon ground cumin",
            "0.17 teaspoon smoked paprika",
            "3 ounce pita bread",
            "2 tablespoon extra-virgin olive oil"
        ],
        "pure_ingredients": [
            "olive oil",
            "salt",
            "cumin",
            "paprika",
            "pita bread"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "small bowl"
        ]
    },
    {
        "recipe_id": "HZeWGMDdw5sldJ0zn.j1lyfXBSF/Yye",
        "recipe_title": "Marzipan Pumpkins",
        "original_instructions": "Place almond paste and fondant in a mixing bowl with the dough hook attachment, set on first speed, beat until soft. Gradually add the syrups, then the powdered sugar to form a nice clay-like dough. Add food coloring by kneading it into the paste, by hand, on a board with a little powdered sugar. Shape into a 1-inch diameter log. Cut into 1-inch pieces and roll into a ball. Take a paring knife and gently make the indentations of the pumpkin.",
        "ingredients": [
            "7 ounces almond paste",
            "2 teaspoons fondant",
            "2 teaspoons corn syrup",
            "4 tablespoons powdered sugar",
            "3 drops orange food coloring"
        ],
        "step_by_step_instructions": [
            "Place 1.75 ounces of almond paste and 0.5 teaspoons of fondant in a mixing bowl with the dough hook attachment, set on first speed, and beat until soft.",
            "Gradually add 0.5 teaspoons of corn syrup, then 1 tablespoon of powdered sugar to form a nice clay-like dough.",
            "Add 1 drop of orange food coloring by kneading it into the paste by hand on a board with a little powdered sugar.",
            "Shape into a 1-inch diameter log.",
            "Cut into 1-inch pieces and roll into a ball.",
            "Take a paring knife and gently make the indentations of the pumpkin."
        ],
        "processed_ingredients": [
            "1.75 ounce almond paste",
            "0.5 teaspoon fondant",
            "0.5 teaspoon corn syrup",
            "1 tablespoon powdered sugar",
            "1 drop orange food coloring"
        ],
        "pure_ingredients": [
            "almond",
            "fondant",
            "corn syrup",
            "sugar",
            "food coloring"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "mixing bowl",
            "dough hook attachment",
            "paring knife",
            "board"
        ]
    },
    {
        "recipe_id": "uDGL4DGGGwKUrFTO7CoP3D2f9.p3Fmq",
        "recipe_title": "Roasted Beet Salad with Pears and Marcona Almonds",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 375 degrees F.\nPlace the beets on a sheet tray and roast until fork tender, about an hour. Remove and let cool.\nUsing a paring knife, peel the beets. Grate the beets and the pears on the largest holes of a box grater. Toss them with the balsamic, olive oil and salt.\nDivide the arugula between 4 salad plates, spoon some of the beet-pear mixture onto the arugula and top with the chopped almonds and chives. Serve immediately.",
        "ingredients": [
            "4 large red beets",
            "2 Anjou pears",
            "3 to 4 tablespoons balsamic vinegar",
            "Extra-virgin olive oil",
            "Kosher salt",
            "2 cups baby washed arugula",
            "1/4 cup Marcona almonds, coarsely chopped",
            "1 bunch chives, finely chopped"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 375 degrees F.",
            "Place 1 beet (approximately 0.25 of the total beets) on a sheet tray and roast until fork tender, about 1 hour. Remove and let cool.",
            "Using a paring knife, peel the beet.",
            "Grate the beet and 0.5 of a pear on the largest holes of a box grater.",
            "Toss the grated beet and pear with 0.75 tablespoon balsamic vinegar, 1 teaspoon olive oil, and a pinch of salt.",
            "Place 0.5 cup arugula on a salad plate.",
            "Spoon some of the beet-pear mixture onto the arugula.",
            "Top with 1 tablespoon chopped almonds and a sprinkle of chives.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "1 beet",
            "0.5 pear",
            "0.75 tablespoon balsamic vinegar",
            "1 teaspoon olive oil",
            "1 pinch salt",
            "0.5 cup arugula",
            "1 tablespoon almonds",
            "1 sprinkle chives"
        ],
        "pure_ingredients": [
            "beets",
            "pears",
            "balsamic vinegar",
            "olive oil",
            "salt",
            "arugula",
            "almonds",
            "chives"
        ],
        "cooking_time": "1 hour",
        "required_tools": [
            "oven",
            "sheet tray",
            "paring knife",
            "box grater",
            "salad plate"
        ]
    },
    {
        "recipe_id": "KlDGmC0ya/KYJN.aWfuFhCJxcNHGLBG",
        "recipe_title": "Crab Salad",
        "original_instructions": "In a medium bowl, lightly toss the crabmeat, celery, chives, and tarragon together.\nIn a small bowl, stir together the mayonnaise, sour cream, lemon juice, and mustard. Add the dressing to the crabmeat mixture and stir until just coated. Season with salt and pepper to taste. If not using right away refrigerate until ready to serve.\nServe on toasted rolls or on a bed of lettuce.",
        "ingredients": [
            "1 pound jumbo lump crabmeat, picked over to remove any shell or cartilage",
            "1 stalk celery, peeled, and cut into 1/8-inch dice",
            "4 teaspoons finely sliced fresh chives",
            "1 teaspoon minced fresh tarragon leaves",
            "1/3 cup prepared mayonnaise",
            "3 tablespoons sour cream",
            "1 teaspoon freshly squeezed lemon juice",
            "1/2 teaspoon Dijon mustard",
            "Kosher salt and freshly ground pepper",
            "Serving suggestions: Toasted hot dog rolls or Boston or Bibb lettuce leaves"
        ],
        "step_by_step_instructions": [
            "In a medium bowl, lightly toss 2.67 oz crabmeat, 0.33 oz celery, 0.27 tsp chives, and 0.07 tsp tarragon together.",
            "In a small bowl, stir together 0.88 tbsp mayonnaise, 0.8 tsp sour cream, 0.2 tsp lemon juice, and 0.1 tsp mustard.",
            "Add the dressing to the crabmeat mixture and stir until just coated.",
            "Season with salt and pepper to taste.",
            "If not using right away, refrigerate until ready to serve.",
            "Serve on a toasted roll or on a bed of lettuce."
        ],
        "processed_ingredients": [
            "2.67 oz crabmeat",
            "0.33 oz celery",
            "0.27 tsp chives",
            "0.07 tsp tarragon",
            "0.88 tbsp mayonnaise",
            "0.8 tsp sour cream",
            "0.2 tsp lemon juice",
            "0.1 tsp mustard",
            "0.03 tsp salt",
            "0.03 tsp pepper"
        ],
        "pure_ingredients": [
            "crabmeat",
            "celery",
            "chives",
            "tarragon",
            "mayonnaise",
            "sour cream",
            "lemon",
            "mustard",
            "salt",
            "pepper",
            "lettuce"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "medium bowl",
            "small bowl",
            "spoon"
        ]
    },
    {
        "recipe_id": "j142BY0KMtLHYpCMVHHdBrL4PfgLJ9i",
        "recipe_title": "Pea and Basil Soup",
        "original_instructions": "Place a medium soup pot over medium heat. Add the olive oil, butter, onions, garlic, salt and pepper. Cook until the onions are soft and translucent, about 5 minutes. Add the peas and basil, and heat until the peas are thawed.\nPlace the pea mixture in a blender. Add 1 cup of the chicken broth and pulse until pureed, adding more broth, if necessary, to puree. Return the pureed mixture to the pot. Stir in the remaining chicken broth and cream. Return the pan to medium heat and cook until hot, but not boiling.\nTo serve, place the soup in bowls. Float a thin slice of fresh mozzarella cheese on top of each soup and sprinkle with the diced roasted red bell peppers. Serve immediately.",
        "ingredients": [
            "2 tablespoons olive oil",
            "1 tablespoon butter",
            "1 small onion, diced",
            "1 clove garlic, minced",
            "1 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper",
            "1 1/2 pounds (about 4 1/2 cups) frozen peas",
            "3/4 cup chopped fresh basil leaves",
            "2 cups chicken broth, divided",
            "2 cups cream",
            "4 to 6 very thin slices fresh mozzarella cheese",
            "1/4 cup diced roasted red bell peppers (jarred is fine)"
        ],
        "step_by_step_instructions": [
            "Place a medium soup pot over medium heat.",
            "Add 0.33 tablespoon olive oil, 0.17 tablespoon butter, 0.17 small onion (diced), 0.17 clove garlic (minced), 0.17 teaspoon salt, and 0.08 teaspoon freshly ground black pepper to the pot.",
            "Cook the mixture until the onions are soft and translucent, about 5 minutes.",
            "Add approximately 0.75 cup frozen peas and 0.13 cup chopped fresh basil leaves to the pot, and heat until the peas are thawed.",
            "Transfer the pea mixture to a blender.",
            "Add 0.33 cup of chicken broth to the blender and pulse until pureed. Add more broth if necessary to puree.",
            "Return the pureed mixture to the pot.",
            "Stir in the remaining 0.67 cup chicken broth and 0.67 cup cream.",
            "Return the pot to medium heat and cook until hot, but not boiling.",
            "To serve, place the soup in a bowl.",
            "Float a very thin slice of fresh mozzarella cheese (approximately 0.5 ounce) on top of the soup and sprinkle with approximately 0.04 cup diced roasted red bell peppers.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "0.33 tablespoon olive oil",
            "0.17 tablespoon butter",
            "0.17 small onion",
            "0.17 clove garlic",
            "0.17 teaspoon salt",
            "0.08 teaspoon freshly ground black pepper",
            "0.75 cup frozen peas",
            "0.13 cup fresh basil leaves",
            "1 cup chicken broth",
            "0.67 cup cream",
            "0.5 ounce fresh mozzarella cheese",
            "0.04 cup diced roasted red bell peppers"
        ],
        "pure_ingredients": [
            "olive oil",
            "butter",
            "onion",
            "garlic",
            "salt",
            "black pepper",
            "peas",
            "basil",
            "chicken broth",
            "cream",
            "mozzarella cheese",
            "red bell peppers"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "soup pot",
            "blender",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "muWLxbH6lRdM0eZ2P0uFXztB.zAccvu",
        "recipe_title": "Grandma Moore's Creamed Corn",
        "original_instructions": "Watch how to make this recipe.\nIn a large skillet, (seasoned cast iron does well here) cook the bacon over medium-high heat until crisp. Turn off the heat and transfer the bacon to a paper towel lined plate. Reserve the drippings in the pan.\nOn a cutting board, cut the stalk ends of the corn cobs to make a flat surface; stand them up and shave the corn from the cobs with a sharp chef's knife. Return the skillet to medium-low heat, and add the corn kernels. With the back of the knife, firmly scrape the cobs over a shallow plate to extract as much liquid (milk) as possible and add it to the skillet.\nSeason corn lightly with salt and pepper and cook until broken down and creamy, about 30 to 45 minutes, stirring often; add water if the pan gets too dry.\nServe warm or at room temperature.",
        "ingredients": [
            "6 slices bacon",
            "8 large cobs fresh corn, preferably white, shucked and cleaned",
            "Kosher salt and freshly cracked black pepper"
        ],
        "step_by_step_instructions": [
            "In a large skillet, cook 1 slice of bacon over medium-high heat until crisp.",
            "Turn off the heat and transfer the bacon to a paper towel lined plate. Reserve the drippings in the pan.",
            "On a cutting board, cut the stalk ends of 1 corn cob to make a flat surface; stand it up and shave the corn from the cob with a sharp chef's knife.",
            "Return the skillet to medium-low heat, and add approximately 1 cup of corn kernels.",
            "With the back of the knife, firmly scrape the cob over a shallow plate to extract as much liquid (milk) as possible and add it to the skillet.",
            "Season corn lightly with a pinch of salt and pepper and cook until broken down and creamy, about 30 to 45 minutes, stirring often; add water if the pan gets too dry.",
            "Serve warm or at room temperature."
        ],
        "processed_ingredients": [
            "1 slice bacon",
            "1 cob corn",
            "1 pinch salt",
            "1 pinch pepper"
        ],
        "pure_ingredients": [
            "bacon",
            "corn",
            "salt",
            "pepper"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "large skillet",
            "paper towel",
            "cutting board",
            "chef's knife",
            "shallow plate"
        ]
    },
    {
        "recipe_id": "rEPOaJ5GzOY9F3nqmitRb9J3LaLNToy",
        "recipe_title": "Sauteed Yellow Squash",
        "original_instructions": "Watch how to make this recipe.\nPreheat skillet over medium high heat. Add oil, then butter. When butter melts, add red peppers and squash. Saute 12 to 14 minutes until squash is tender. Add salt, pepper and parsley. Add chives or scallions if you would like a layer of light onion flavor on the dish as well.",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil",
            "2 tablespoons butter",
            "1/2 red bell pepper, chopped",
            "2 small to medium yellow squash, sliced",
            "Salt and pepper",
            "2 tablespoons chopped parsley leaves",
            "2 tablespoons chopped chives or 2 scallions, optional"
        ],
        "step_by_step_instructions": [
            "Preheat a skillet over medium high heat.",
            "Add 0.25 tablespoon of extra-virgin olive oil and 0.5 tablespoon of butter to the skillet.",
            "When the butter melts, add 0.06 red bell pepper (about 0.5 ounce) chopped and 0.5 small to medium yellow squash (about 3 ounces) sliced.",
            "Sauté for 12 to 14 minutes until the squash is tender.",
            "Add salt, pepper, and 0.5 tablespoon of chopped parsley leaves.",
            "Optionally, add 0.5 tablespoon of chopped chives or scallions for a light onion flavor."
        ],
        "processed_ingredients": [
            "0.25 tablespoon extra-virgin olive oil",
            "0.5 tablespoon butter",
            "0.06 red bell pepper",
            "0.5 small to medium yellow squash",
            "0.5 tablespoon chopped parsley leaves",
            "0.5 tablespoon chopped chives"
        ],
        "pure_ingredients": [
            "olive oil",
            "butter",
            "red bell pepper",
            "yellow squash",
            "salt",
            "pepper",
            "parsley",
            "chives"
        ],
        "cooking_time": "14 minutes",
        "required_tools": [
            "skillet"
        ]
    },
    {
        "recipe_id": "HHfsgqjNgOZSPzDFZpw1aLbiN2.mTBS",
        "recipe_title": "Sunny's Store-Bought Pizza BBQ Chicken \"Pizzaz\"",
        "original_instructions": "Top the pizza with the BBQ sauce, then add the chicken. Top with the onion slices and cheese. Bake according to the instructions on the pizza box, adding an extra minute or 2 if needed.",
        "ingredients": [
            "1 frozen cheese pizza",
            "1/2 cup BBQ sauce",
            "1/2 rotisserie chicken, meat shredded",
            "Several thin slices red onion (sliced on a mandolin)",
            "1 cup shredded Cheddar Jack cheese blend"
        ],
        "step_by_step_instructions": [
            "Preheat your oven according to the instructions on the frozen cheese pizza box.",
            "Spread approximately 2 tablespoons of BBQ sauce evenly over the pizza.",
            "Shred about 3 ounces of rotisserie chicken and distribute it evenly on top of the BBQ sauce.",
            "Slice the red onion thinly, using about 1/8 of an onion, and spread the slices over the chicken.",
            "Sprinkle approximately 1/4 cup of shredded Cheddar Jack cheese evenly over the top.",
            "Bake the pizza according to the instructions on the pizza box, adding an extra minute or two if needed."
        ],
        "processed_ingredients": [
            "1 frozen cheese pizza",
            "2.00 tbsp BBQ sauce",
            "3.00 oz rotisserie chicken",
            "0.13 cup red onion",
            "0.25 cup shredded Cheddar Jack cheese blend"
        ],
        "pure_ingredients": [
            "pizza",
            "BBQ sauce",
            "chicken",
            "onion",
            "Cheddar Jack cheese"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "oven",
            "knife",
            "mandolin",
            "baking sheet"
        ]
    },
    {
        "recipe_id": "8r63CDCdo6ROdHZY3/fPYYYxC/nC/qC",
        "recipe_title": "White Rice Pilaf with Corn, Roasted Chiles, and Fresh Cheese",
        "original_instructions": "In a large heavy saucepan, heat the oil over medium heat. Add the rice and the onion and stir frequently for about 7 minutes, until the onion is softened but not browned. Add the hot broth, salt, and chile strips to the pan and bring it back up to a boil. Reduce the heat and simmer, covered, for about 10 minutes. Add the corn and simmer for 5 minutes more. Remove from the heat and let stand, covered, for 5 to 10 minutes, or until the rice is perfectly tender. Add the crumbled cheese and parsley and fluff with a fork, mixing all the ingredients evenly. Transfer to a warmed serving bowl and serve immediately.",
        "ingredients": [
            "1 1/2 tablespoons vegetable oil",
            "1 cup long grain white rice",
            "1 small onion, finely diced",
            "2 cups hot vegetable or chicken broth, preferably homemade",
            "1/2 teaspoon salt",
            "3 medium poblano chiles, roasted, peeled, stemmed, seeded (see Note), and cut into strips",
            "1 cup fresh or thawed frozen corn kernels",
            "1/2 cup Mexican queso fresco or feta cheese",
            "1/2 bunch flatleaf parsley, leaves only, finely chopped"
        ],
        "step_by_step_instructions": [
            "In a large heavy saucepan, heat 0.25 tablespoons of vegetable oil over medium heat.",
            "Add 0.17 cup of long grain white rice and 0.17 cup of finely diced onion to the pan.",
            "Stir frequently for about 7 minutes, until the onion is softened but not browned.",
            "Add 0.33 cup of hot vegetable or chicken broth, 0.08 teaspoon of salt, and approximately 0.5 medium poblano chile, cut into strips, to the pan.",
            "Bring the mixture back up to a boil.",
            "Reduce the heat and simmer, covered, for about 10 minutes.",
            "Add 0.17 cup of fresh or thawed frozen corn kernels to the pan.",
            "Simmer for 5 minutes more.",
            "Remove from the heat and let stand, covered, for 5 to 10 minutes, or until the rice is perfectly tender.",
            "Add 0.08 cup of crumbled Mexican queso fresco or feta cheese and 0.08 cup of finely chopped flatleaf parsley to the rice.",
            "Fluff with a fork, mixing all the ingredients evenly.",
            "Transfer to a warmed serving bowl and serve immediately."
        ],
        "processed_ingredients": [
            "0.25 tablespoon vegetable oil",
            "0.17 cup long grain white rice",
            "0.17 cup onion",
            "0.33 cup broth",
            "0.08 teaspoon salt",
            "0.5 medium poblano",
            "0.17 cup corn kernels",
            "0.08 cup queso fresco",
            "0.08 cup parsley"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "rice",
            "onion",
            "broth",
            "salt",
            "poblano",
            "corn",
            "queso fresco",
            "parsley"
        ],
        "cooking_time": "27 minutes",
        "required_tools": [
            "large heavy saucepan",
            "fork"
        ]
    },
    {
        "recipe_id": "INX85IWy/JSwAjlT4bVqfVqM2cXmCPG",
        "recipe_title": "Corn Biscuits with Bacon",
        "original_instructions": "Preheat oven to 375 degrees F. Cook bacon until crisp. Transfer bacon to paper towels and drain. Crumble bacon; reserve 2 tablespoons bacon drippings.\nSift flour, cornmeal, sugar, baking powder and salt into bowl. Add butter and rub in using fingertips until mixture resembles coarse meal. Whisk eggs, buttermilk, cumin and reserved bacon drippings in small bowl. Add to flour mixture and stir until moist dough forms. Mix in bacon.\nTurn out dough onto lightly floured surface. Knead gently until smooth. Roll out to 3/4 inch thickness. Cut out biscuits with round cookie cutter. Place on greased baking sheet. Sprinkle with peppercorns.\nBake until golden brown and puffed, about 25 minutes. Serve warm or at room temperature.",
        "ingredients": [
            "8 bacon slices",
            "2 cups all purpose flour",
            "1 cup yellow cornmeal",
            "2 tablespoons sugar",
            "5 teaspoons baking powder",
            "1 teaspoon salt",
            "1/2 cup plus 2 tablespoons chilled unsalted butter, cut into pieces",
            "2 large eggs",
            "6 tablespoons buttermilk",
            "1 teaspoon ground cumin",
            "Fresh cracked black peppercorns"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 375 degrees F.",
            "Cook 1 slice of bacon until crisp. Transfer bacon to paper towels and drain. Crumble bacon; reserve 0.25 tablespoon bacon drippings.",
            "Sift 0.25 cup all-purpose flour, 0.125 cup yellow cornmeal, 0.375 teaspoon sugar, 0.625 teaspoon baking powder, and 0.125 teaspoon salt into a bowl.",
            "Add 1 tablespoon chilled unsalted butter, cut into pieces, and rub in using fingertips until mixture resembles coarse meal.",
            "Whisk 0.25 large egg, 0.75 tablespoon buttermilk, 0.125 teaspoon ground cumin, and reserved bacon drippings in a small bowl.",
            "Add to flour mixture and stir until moist dough forms. Mix in crumbled bacon.",
            "Turn out dough onto a lightly floured surface. Knead gently until smooth.",
            "Roll out to 3/4 inch thickness. Cut out a biscuit with a round cookie cutter.",
            "Place on greased baking sheet. Sprinkle with fresh cracked black peppercorns.",
            "Bake until golden brown and puffed, about 25 minutes. Serve warm or at room temperature."
        ],
        "processed_ingredients": [
            "1 slice bacon",
            "0.25 cup all purpose flour",
            "0.125 cup yellow cornmeal",
            "0.375 teaspoon sugar",
            "0.625 teaspoon baking powder",
            "0.125 teaspoon salt",
            "1 tablespoon butter",
            "0.25 large egg",
            "0.75 tablespoon buttermilk",
            "0.125 teaspoon ground cumin",
            "0.25 tablespoon bacon drippings",
            "0.125 teaspoon black peppercorns"
        ],
        "pure_ingredients": [
            "bacon",
            "flour",
            "cornmeal",
            "sugar",
            "baking powder",
            "salt",
            "butter",
            "egg",
            "buttermilk",
            "cumin",
            "black peppercorns"
        ],
        "cooking_time": "35 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "sifter",
            "mixing bowls",
            "whisk",
            "cookie cutter"
        ]
    },
    {
        "recipe_id": "6qxQIa0xd9Mv7N4u6/O1P4.iYbRBXB.",
        "recipe_title": "Pan-Fried Pork Chops ",
        "original_instructions": "Mix flour, cornstarch and garlic salt in medium bowl. Sprinkle pork chops with salt and pepper. Dredge pork chops in flour mixture (do not shake off excess). Pour enough vegetable oil into heavy large skillet to reach depth of 1 inch. Heat oil to 350°F. Fry pork chops in oil until golden brown and cooked through, about 5 minutes per side\nMix flour, cornstarch and garlic salt in medium bowl. Sprinkle pork chops with salt and pepper. Dredge pork chops in flour mixture (do not shake off excess).\nPour enough vegetable oil into heavy large skillet to reach depth of 1 inch. Heat oil to 350°F. Fry pork chops in oil until golden brown and cooked through, about 5 minutes per side",
        "ingredients": [
            "1/2 cup all purpose flour",
            "1/4 cup cornstarch",
            "1/2 teaspoon garlic salt",
            "4 7-ounce center-cut pork loin rib chops (each about 3/4 inch thick)",
            "Vegetable oil (for frying)"
        ],
        "step_by_step_instructions": [
            "Mix 2 tablespoons of flour, 1 tablespoon of cornstarch, and a pinch of garlic salt in a medium bowl.",
            "Sprinkle the 7-ounce pork chop with salt and pepper.",
            "Dredge the pork chop in the flour mixture, ensuring it is well-coated but not shaking off the excess.",
            "Pour enough vegetable oil into a heavy large skillet to reach a depth of 1 inch.",
            "Heat the oil to 350°F.",
            "Fry the pork chop in the oil until it is golden brown and cooked through, about 5 minutes on each side."
        ],
        "processed_ingredients": [
            "2.00 tbsp flour",
            "1.00 tbsp cornstarch",
            "0.13 tsp garlic salt",
            "7.00 oz pork loin rib chop",
            "0.25 cup vegetable oil"
        ],
        "pure_ingredients": [
            "flour",
            "cornstarch",
            "garlic salt",
            "pork",
            "vegetable oil",
            "salt",
            "pepper"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "medium bowl",
            "heavy large skillet",
            "tongs",
            "meat thermometer"
        ]
    },
    {
        "recipe_id": "pLk6zy5yy45WLr6iG09aSY4leV/zE82",
        "recipe_title": "Green Pea, Asparagus, and Parsley Soup ",
        "original_instructions": "Heat the oil in a large pot over medium heat. Add the leeks and sauté for 4 minutes, until softened. Add the broth and bring to a simmer. Stir in the peas and asparagus and simmer, covered, for 3 minutes longer. Carefully place half of the soup in a high-powered blender and puree until smooth, then return it to the pot. Add the parsley and thyme (if using), and stir well to combine. Season with salt and pepper to taste and serve.\nHeat the oil in a large pot over medium heat. Add the leeks and sauté for 4 minutes, until softened. Add the broth and bring to a simmer. Stir in the peas and asparagus and simmer, covered, for 3 minutes longer. Carefully place half of the soup in a high-powered blender and puree until smooth, then return it to the pot. Add the parsley and thyme (if using), and stir well to combine. Season with salt and pepper to taste and serve.",
        "ingredients": [
            "1 tablespoon coconut oil",
            "1 1/2 cups chopped leeks",
            "8 cups frozen green peas",
            "6 cups low-sodium vegetable broth",
            "2 bunches of asparagus (30 to 40 stalks), tough ends removed and cut into 1-inch pieces",
            "1/2 cup chopped fresh parsley",
            "Himalayan or sea salt and freshly ground black pepper",
            "2 teaspoons minced fresh thyme (optional)"
        ],
        "step_by_step_instructions": [
            "Heat 0.13 tablespoon coconut oil in a large pot over medium heat.",
            "Add 0.19 cup chopped leeks and sauté for 4 minutes, until softened.",
            "Add 0.75 cup low-sodium vegetable broth and bring to a simmer.",
            "Stir in 1 cup frozen green peas and 0.25 cup asparagus pieces, then simmer, covered, for 3 minutes longer.",
            "Carefully place half of the soup in a high-powered blender and puree until smooth, then return it to the pot.",
            "Add 0.06 cup chopped fresh parsley and 0.25 teaspoon minced fresh thyme (optional), and stir well to combine.",
            "Season with Himalayan salt and freshly ground black pepper to taste and serve."
        ],
        "processed_ingredients": [
            "0.13 tablespoon coconut oil",
            "0.19 cup leeks",
            "1 cup green peas",
            "0.75 cup vegetable broth",
            "0.25 cup asparagus",
            "0.06 cup parsley",
            "0.25 teaspoon thyme",
            "0.01 teaspoon salt",
            "0.01 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "coconut oil",
            "leeks",
            "green peas",
            "vegetable broth",
            "asparagus",
            "parsley",
            "salt",
            "black pepper",
            "thyme"
        ],
        "cooking_time": "7 minutes",
        "required_tools": [
            "large pot",
            "blender",
            "measuring spoons",
            "measuring cups"
        ]
    },
    {
        "recipe_id": "bz9OTxYL3XMsxwHAd2du.8jXf/MwRLm",
        "recipe_title": "Savannah-Style Irish Potato Soup",
        "original_instructions": "Heat the oil in a large pot over medium heat. Add the carrots, celery and onions and cook until the onions are soft and translucent, 3 to 5 minutes. Add the thyme and garlic and cook until fragrant, 45 to 60 seconds. Season with salt and pepper. Sprinkle the flour over and cook, stirring, for 2 minutes. Gradually whisk in the stock, and then the milk. Add the potatoes and bring the soup to a boil over high heat. Decrease the heat to low and simmer until the potatoes are tender, about 20 minutes.\nUsing an immersion blender, puree the soup; leave it coarse and chunky if you prefer a more rustic soup, or puree until smooth for a more elegant soup. Add the cheese, about 1/3 cup at a time, stirring after each addition until melted and smooth. Taste and adjust for seasoning with salt and pepper.\nTo serve, ladle the soup into warmed bowls. Sprinkle with chives and serve immediately.",
        "ingredients": [
            "1 teaspoon chopped fresh thyme",
            "2 cloves garlic, finely chopped",
            "Coarse kosher salt and freshly ground black pepper",
            "3 tablespoons all-purpose flour",
            "4 cups chicken stock or reduced-fat low-sodium chicken broth",
            "3 cups whole or 2-percent milk",
            "4 russet potatoes, peeled and cut into 1/2-inch cubes (about 1 3/4 pounds)",
            "2 cups packed grated sharp white Cheddar (about 8 ounces)",
            "Snipped fresh chives, for garnish",
            "2 tablespoons canola oil",
            "1 carrot, finely chopped",
            "1 stalk celery, finely chopped",
            "1 sweet onion, finely chopped"
        ],
        "step_by_step_instructions": [
            "Heat 0.33 tablespoons of canola oil in a large pot over medium heat.",
            "Add 0.08 cups of finely chopped carrots, 0.08 cups of finely chopped celery, and 0.17 cups of finely chopped sweet onion; cook until onions are soft and translucent, about 3 to 5 minutes.",
            "Add 0.17 teaspoons of chopped fresh thyme and 0.33 cloves of finely chopped garlic; cook until fragrant, 45 to 60 seconds.",
            "Season with coarse kosher salt and freshly ground black pepper.",
            "Sprinkle 1 teaspoon of all-purpose flour over the mixture and cook, stirring, for 2 minutes.",
            "Gradually whisk in 0.67 cups of chicken stock and 0.5 cups of whole milk.",
            "Add 0.5 of a russet potato, peeled and cut into 0.5-inch cubes, and bring the soup to a boil over high heat.",
            "Decrease the heat to low and simmer until the potatoes are tender, about 20 minutes.",
            "Using an immersion blender, puree the soup to your desired consistency.",
            "Add 0.67 ounces of grated sharp white Cheddar cheese, about 0.17 ounces at a time, stirring after each addition until melted and smooth.",
            "Taste and adjust for seasoning with salt and pepper.",
            "Ladle the soup into a warmed bowl and sprinkle with snipped fresh chives."
        ],
        "processed_ingredients": [
            "0.17 teaspoon chopped fresh thyme",
            "0.33 clove garlic",
            "0.33 tablespoon canola oil",
            "0.08 cup carrot",
            "0.08 cup celery",
            "0.17 cup sweet onion",
            "1 teaspoon all-purpose flour",
            "0.67 cup chicken stock",
            "0.5 cup whole milk",
            "0.5 russet potato",
            "0.67 ounce sharp white Cheddar",
            "coarse kosher salt",
            "freshly ground black pepper",
            "snipped fresh chives"
        ],
        "pure_ingredients": [
            "thyme",
            "garlic",
            "salt",
            "black pepper",
            "all-purpose flour",
            "chicken stock",
            "milk",
            "potato",
            "cheddar",
            "chives",
            "canola oil",
            "carrot",
            "celery",
            "onion"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "large pot",
            "immersion blender",
            "whisk",
            "ladle"
        ]
    },
    {
        "recipe_id": "vjAtOQ6JDML.OJeEz0/wj/G7fUwj8bO",
        "recipe_title": "Round 2 Recipe - Cajun Quesadillas",
        "original_instructions": "Heat a large skillet over medium heat and drizzle with canola oil. Place 1 tortilla in the skillet to warm. Sprinkle over half the cheese. Spread half the chicken mixture over the cheese and top with a second tortilla. Cook 3 minutes. Flip it over and cook until the bottom is browned and the cheese is melted, another 2 to 3 minutes. Repeat for the second quesadilla. Slice and serve with the remoulade and top with cilantro, if desired.",
        "ingredients": [
            "2 tablespoons canola oil",
            "4 large flour tortillas",
            "1 cup shredded Monterey jack cheese, divided",
            "Reserved 1 1/2 cups Chicken Jambalaya",
            "Reserved 1/2 cup remoulade from Cajun Catfish Cakes with Remoulade",
            "Chopped fresh cilantro, for garnish, optional"
        ],
        "step_by_step_instructions": [
            "Heat a large skillet over medium heat and drizzle with 0.5 tablespoon canola oil.",
            "Place 1 tortilla in the skillet to warm.",
            "Sprinkle over 0.25 cup shredded Monterey jack cheese.",
            "Spread 0.375 cup chicken mixture over the cheese and top with a second tortilla.",
            "Cook for 3 minutes.",
            "Flip it over and cook until the bottom is browned and the cheese is melted, another 2 to 3 minutes.",
            "Slice and serve with 0.125 cup remoulade and top with cilantro if desired."
        ],
        "processed_ingredients": [
            "0.5 tablespoon canola oil",
            "2 ounce flour tortilla",
            "0.25 cup shredded Monterey jack cheese",
            "0.375 cup chicken jambalaya",
            "0.125 cup remoulade",
            "1 tablespoon fresh cilantro"
        ],
        "pure_ingredients": [
            "canola oil",
            "flour tortilla",
            "Monterey jack cheese",
            "chicken",
            "remoulade",
            "cilantro"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "large skillet",
            "spatula"
        ]
    },
    {
        "recipe_id": "k96EaO4.fiwhiudyK0LRx86ar/h6xC6",
        "recipe_title": "Apple Cheese Wraps ",
        "original_instructions": "1. Slice the apple into 1/2 inch thick slices. Rub the apple with the lemon wedge to prevent from going brown. 2. Slice the cheddar cheese into 1/2 inch wide slices and the ham in 1/2 or in 1/4 (the ham needs to be large enough to wrap around the apple). 3. Place an apple slice and a cheese slice on top of the deli meat and fold over deli meat to wrap.\n1. Slice the apple into 1/2 inch thick slices. Rub the apple with the lemon wedge to prevent from going brown.\n2. Slice the cheddar cheese into 1/2 inch wide slices and the ham in 1/2 or in 1/4 (the ham needs to be large enough to wrap around the apple).\n3. Place an apple slice and a cheese slice on top of the deli meat and fold over deli meat to wrap.",
        "ingredients": [
            "1 granny smith apple",
            "1 slice lemon",
            "2 slices cheddar cheese, cut in half",
            "2 slices deli turkey or ham, cut in half"
        ],
        "step_by_step_instructions": [
            "Slice the apple into 1/2 inch thick slices.",
            "Rub the apple slices with the lemon wedge to prevent them from going brown.",
            "Slice the cheddar cheese into 1/2 inch wide slices.",
            "Slice the deli turkey into halves or quarters to ensure it is large enough to wrap around the apple.",
            "Place an apple slice and a cheese slice on top of the deli meat.",
            "Fold over the deli meat to wrap the apple and cheese slice."
        ],
        "processed_ingredients": [
            "0.25 g granny smith apple",
            "0.12 oz lemon",
            "0.50 oz cheddar cheese",
            "0.50 oz deli turkey"
        ],
        "pure_ingredients": [
            "apple",
            "lemon",
            "cheese",
            "turkey"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "BiCfpTA/F7UF9SupjpSYfNsfTyO8dW6",
        "recipe_title": "Potatoes with Coentro (Cilantro)",
        "original_instructions": "Place potatoes in a medium saucepan and add water to cover generously. Add salt, turn on the heat, and bring to a simmer. Simmer 20 minutes or until tender when pierced with a knife. Drain and let cool. As soon as they are cool enough to handle, peel. Heat olive oil in large skillet over medium heat. Add peeled potatoes and roll around to coat evenly. Cook 5 minutes until starting to brown. Sprinkle over cilantro and fresh pepper and roll around to coat evenly. Serve immediately.;",
        "ingredients": [
            "1216 small Yukon Gold or Red Bliss potatoes, scrubbed but not peeled",
            "1 1/2 teaspoons salt",
            "2 tablespoons olive oil",
            "1/4 cup chopped fresh cilantro leaves",
            "1/2 teaspoon freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Place 1 small potato in a medium saucepan and add water to cover generously.",
            "Add 0.01 teaspoon salt, turn on the heat, and bring to a simmer.",
            "Simmer for 20 minutes or until tender when pierced with a knife.",
            "Drain and let cool.",
            "As soon as it is cool enough to handle, peel the potato.",
            "Heat 0.05 tablespoon olive oil in a large skillet over medium heat.",
            "Add peeled potato and roll around to coat evenly.",
            "Cook for 5 minutes until starting to brown.",
            "Sprinkle over 0.01 cup chopped fresh cilantro leaves and 0.01 teaspoon freshly ground black pepper and roll around to coat evenly.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "1 small potato",
            "0.01 teaspoon salt",
            "0.05 tablespoon olive oil",
            "0.01 cup cilantro leaves",
            "0.01 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "potato",
            "salt",
            "olive oil",
            "cilantro",
            "black pepper"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "medium saucepan",
            "knife",
            "large skillet"
        ]
    },
    {
        "recipe_id": "per7xkcSYQyPWB5xrp6oN8mNBjIjDIW",
        "recipe_title": "Braised Mustard Greens",
        "original_instructions": "In a large skillet over medium high heat brown bacon and render its fat. Add chopped greens to the pan in batches and turn until they wilt, then add more greens. When all of the greens are in the pan, add vinegar and cook a minute. Season greens with sugar and salt. Add chicken broth to the pan and cover. Reduce heat to medium low and simmer greens 15 to 20 minutes then serve.",
        "ingredients": [
            "4 slices bacon, chopped",
            "3 bunches mustard greens, trimmed and chopped",
            "2 tablespoons white vinegar",
            "2 teaspoons sugar",
            "Coarse salt",
            "2 cups chicken broth"
        ],
        "step_by_step_instructions": [
            "In a large skillet over medium high heat, brown approximately 1 slice of chopped bacon and render its fat.",
            "Add about 1/3 of a bunch of chopped mustard greens to the pan in batches and turn until they wilt. Repeat until all greens are in the pan.",
            "Add about 2 teaspoons of white vinegar to the greens and cook for a minute.",
            "Season the greens with approximately 0.67 teaspoons of sugar and a pinch of coarse salt.",
            "Add about 0.67 cups of chicken broth to the pan and cover.",
            "Reduce heat to medium low and simmer the greens for 15 to 20 minutes, then serve."
        ],
        "processed_ingredients": [
            "1 slice bacon",
            "0.67 bunch mustard greens",
            "2 teaspoon white vinegar",
            "0.67 teaspoon sugar",
            "0.67 cup chicken broth",
            "0.25 teaspoon salt"
        ],
        "pure_ingredients": [
            "bacon",
            "mustard greens",
            "vinegar",
            "sugar",
            "salt",
            "chicken broth"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "large skillet",
            "knife",
            "cutting board",
            "stove",
            "lid for skillet"
        ]
    },
    {
        "recipe_id": "a2BW7f2sRqm2prW56ylggfhV5lWIDe6",
        "recipe_title": "Zucchine alla Scapece: Zucchini Finished in Vinegar",
        "original_instructions": "Heat up extra-virgin olive oil in a deep, heavy-bottomed pan for frying. Gently place the zucchini in hot oil and fry until golden. Then place the zucchini on an absorbent paper towel to drain excess the oil. Allow to cool. Place the fried zucchini, mint leaves, and garlic into a bowl. Season the zucchini with fresh extra-virgin olive oil, white wine vinegar, and salt. Mix well to coat evenly. Remove the quartered garlic cloves before serving.",
        "ingredients": [
            "Extra-virgin olive oil, for frying, plus extra for seasoning",
            "5 small zucchinis, thinly sliced",
            "Small bunch fresh mint, leaves picked and chopped",
            "2 cloves garlic, quartered",
            "Splash white wine vinegar",
            "Salt"
        ],
        "step_by_step_instructions": [
            "Heat up approximately 2 tablespoons of extra-virgin olive oil in a deep, heavy-bottomed pan for frying.",
            "Gently place about 1 small zucchini, thinly sliced, into the hot oil and fry until golden.",
            "Place the fried zucchini on an absorbent paper towel to drain excess oil. Allow to cool.",
            "In a bowl, combine the fried zucchini with about 0.5 tablespoon of fresh mint leaves and 0.5 clove of garlic, quartered.",
            "Season the zucchini with an additional 0.5 tablespoon of extra-virgin olive oil, 0.5 tablespoon of white wine vinegar, and a pinch of salt.",
            "Mix well to coat the zucchini evenly, then remove the quartered garlic cloves before serving."
        ],
        "processed_ingredients": [
            "2 tbsp extra-virgin olive oil",
            "1 small zucchini",
            "0.5 tbsp fresh mint leaves",
            "0.5 clove garlic",
            "0.5 tbsp white wine vinegar",
            "0.25 tsp salt"
        ],
        "pure_ingredients": [
            "olive oil",
            "zucchini",
            "mint",
            "garlic",
            "vinegar",
            "salt"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "deep heavy-bottomed pan",
            "absorbent paper towel",
            "bowl"
        ]
    },
    {
        "recipe_id": "AZVlhyXroUHMkrjWgRiDlutpebRxZQ.",
        "recipe_title": "Fresh Tomato Corn Soup ",
        "original_instructions": "Combine tomatoes and juice in large bowl. Add corn, green onions, bell pepper, 2 tablespoons basil and garlic and blend well. Season to taste with hot pepper sauce, salt and pepper. Chill at least 15 minutes and up to 2 hours. Ladle soup into four bowls, dividing evenly. Garnish with yogurt and chopped basil and serve.\nCombine tomatoes and juice in large bowl. Add corn, green onions, bell pepper, 2 tablespoons basil and garlic and blend well. Season to taste with hot pepper sauce, salt and pepper. Chill at least 15 minutes and up to 2 hours.\nLadle soup into four bowls, dividing evenly. Garnish with yogurt and chopped basil and serve.",
        "ingredients": [
            "2 cups chopped ripe plum tomatoes (about 14 ounces)",
            "1 1/2 cups V8 vegetable juice",
            "1 cup frozen corn kernels, thawed",
            "2 green onions, finely chopped",
            "1/4 cup chopped green bell pepper",
            "2 tablespoons finely shredded fresh basil or 1 teaspoon dried, crumbled",
            "2 large garlic cloves, minced",
            "Hot pepper sauce (such as Tabasco)",
            "1/4 cup plain low-fat yogurt",
            "Chopped fresh basil or parsley"
        ],
        "step_by_step_instructions": [
            "Combine 0.5 cup chopped ripe plum tomatoes and 0.375 cup V8 vegetable juice in a bowl.",
            "Add 0.25 cup thawed frozen corn kernels, 0.5 finely chopped green onion, 1 tablespoon chopped green bell pepper, 0.5 tablespoon finely shredded fresh basil, and 0.5 minced garlic clove.",
            "Blend well and season with hot pepper sauce, salt, and pepper to taste.",
            "Chill the mixture for at least 15 minutes, up to 2 hours.",
            "Ladle the soup into a bowl.",
            "Garnish with 1 tablespoon plain low-fat yogurt and chopped fresh basil."
        ],
        "processed_ingredients": [
            "3.5 ounce chopped ripe plum tomatoes",
            "3 ounce V8 vegetable juice",
            "2 ounce frozen corn kernels",
            "0.5 green onion",
            "0.5 ounce chopped green bell pepper",
            "0.5 tablespoon finely shredded fresh basil",
            "0.5 clove garlic",
            "1 tablespoon plain low-fat yogurt"
        ],
        "pure_ingredients": [
            "tomatoes",
            "V8 vegetable juice",
            "corn",
            "green onions",
            "green bell pepper",
            "basil",
            "garlic",
            "hot pepper sauce",
            "yogurt",
            "salt",
            "pepper",
            "parsley"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "bowl",
            "knife",
            "spoon"
        ]
    },
    {
        "recipe_id": "u.ug3vVhbm8YUl1BqL9W0kIfck4QHWG",
        "recipe_title": "Croutons",
        "original_instructions": "Preheat the oven to 350 degrees F.\nWhisk the butter, olive oil, oregano and garlic salt. Toss with the bread cubes. Spread in a single layer on a baking sheet. Bake until golden brown and toasted, 15 to 20 minutes.",
        "ingredients": [
            "2 tablespoons unsalted butter, melted",
            "2 tablespoons olive oil",
            "1/2 teaspoon dried oregano",
            "1/2 teaspoon garlic salt",
            "2 cups 1/2-inch cubes crusty Italian bread"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Melt and whisk together 0.33 tablespoons unsalted butter, 0.33 tablespoons olive oil, 0.08 teaspoons dried oregano, and 0.08 teaspoons garlic salt.",
            "Toss the mixture with 0.33 cups of 1/2-inch cubes of crusty Italian bread.",
            "Spread the coated bread cubes in a single layer on a baking sheet.",
            "Bake until golden brown and toasted, approximately 15 to 20 minutes."
        ],
        "processed_ingredients": [
            "0.33 tablespoon unsalted butter",
            "0.33 tablespoon olive oil",
            "0.08 teaspoon dried oregano",
            "0.08 teaspoon garlic salt",
            "0.33 cup crusty Italian bread"
        ],
        "pure_ingredients": [
            "butter",
            "olive oil",
            "oregano",
            "salt",
            "bread"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "oven",
            "whisk",
            "baking sheet"
        ]
    },
    {
        "recipe_id": "gW/hLRKo48nSaMwP1N3fRzEOuSRygSa",
        "recipe_title": "Chocolate Mint Cookies ",
        "original_instructions": "Preheat oven to 350°F. Line 3 large baking sheets with foil; butter foil. Place 1 1/4 cups chocolate chips in medium glass bowl. Microwave on medium-high until melted, stirring every 30 seconds, about 2 minutes. Cool 15 minutes. Mix flour and baking powder in small bowl. Using electric mixer, beat sugar, eggs, corn syrup and extract in medium bowl until thick, about 3 minutes. Gradually beat in melted chocolate, then dry ingredients. Mix in remaining chocolate chips; freeze 10 minutes. Drop 7 heaping tablespoons batter on each prepared baking sheet, spacing 3 inches apart (cookies will spread). Bake until cookies are cracked on top and softly set, about 15 minutes. Cool cookies on baking sheets 5 minutes. Using metal spatula, transfer cookies to racks and cool completely.\nPreheat oven to 350°F. Line 3 large baking sheets with foil; butter foil. Place 1 1/4 cups chocolate chips in medium glass bowl. Microwave on medium-high until melted, stirring every 30 seconds, about 2 minutes. Cool 15 minutes.\nMix flour and baking powder in small bowl. Using electric mixer, beat sugar, eggs, corn syrup and extract in medium bowl until thick, about 3 minutes. Gradually beat in melted chocolate, then dry ingredients. Mix in remaining chocolate chips; freeze 10 minutes.\nDrop 7 heaping tablespoons batter on each prepared baking sheet, spacing 3 inches apart (cookies will spread). Bake until cookies are cracked on top and softly set, about 15 minutes. Cool cookies on baking sheets 5 minutes. Using metal spatula, transfer cookies to racks and cool completely.",
        "ingredients": [
            "2 1/2 cups semisweet chocolate chips",
            "6 tablespoons all purpose flour",
            "1/2 teaspoon baking powder",
            "3/4 cup sugar",
            "2 large eggs",
            "2 tablespoons dark corn syrup",
            "1/2 teaspoon peppermint extract"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350°F.",
            "Line a large baking sheet with foil; butter the foil.",
            "Place approximately 0.31 cup of chocolate chips in a medium glass bowl.",
            "Microwave on medium-high until melted, stirring every 30 seconds, about 2 minutes.",
            "Cool for 15 minutes.",
            "Mix approximately 0.75 tablespoon of flour and 0.06 teaspoon of baking powder in a small bowl.",
            "Using an electric mixer, beat approximately 0.19 cup of sugar, 1 egg, 0.5 tablespoon of corn syrup, and 0.06 teaspoon of peppermint extract in a medium bowl until thick, about 3 minutes.",
            "Gradually beat in melted chocolate, then the dry ingredients.",
            "Mix in the remaining approximately 0.19 cup of chocolate chips; freeze the mixture for 10 minutes.",
            "Drop approximately 2 heaping tablespoons of batter on the prepared baking sheet, spacing 3 inches apart.",
            "Bake until cookies are cracked on top and softly set, about 15 minutes.",
            "Cool cookies on the baking sheet for 5 minutes.",
            "Using a metal spatula, transfer cookies to a rack and cool completely."
        ],
        "processed_ingredients": [
            "0.5 cup semisweet chocolate chips",
            "0.75 tablespoon all purpose flour",
            "0.06 teaspoon baking powder",
            "0.19 cup sugar",
            "1 egg",
            "0.5 tablespoon dark corn syrup",
            "0.06 teaspoon peppermint extract"
        ],
        "pure_ingredients": [
            "chocolate chips",
            "flour",
            "baking powder",
            "sugar",
            "eggs",
            "corn syrup",
            "peppermint extract",
            "butter"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "foil",
            "microwave",
            "medium glass bowl",
            "electric mixer",
            "small bowl",
            "metal spatula",
            "cooling rack"
        ]
    },
    {
        "recipe_id": "hn1QxowxY//EZYalN6ZRW2OHhVv1T2C",
        "recipe_title": "Thai-style Chicken Skewers",
        "original_instructions": "Special equipment: Bamboo Skewers\nPound each chicken breast between 2 lightly oiled sheets of parchment or waxed paper into a 4 by 4 inch piece about 1/8-inch thick.\nLay a piece of chicken smooth-side down on the work surface. Spread 1/2 teaspoon of the chile paste over the surface and season with salt and pepper, to taste. Trim and halve the scallions lengthwise. Lay them side-by-side across the lower third of the chicken, so there is white and greens at both ends. Top with 2 or 3 pieces of the red and yellow peppers. Roll the chicken around the vegetables into a tight cylinder. Thread a wooden skewer through the seam of the roll to seal. Repeat with the remaining chicken and vegetables to make 4 rolls. These can be made up to 24 hours ahead and refrigerated.\nPreheat the oven to 425 degrees F.\nHeat the oil in an oven-proof nonstick skillet over high heat. Season the rolls with salt and pepper, to taste. Lay the rolls, seam side down, in the pan, and cook, turning occasionally, until browned, about 2 minutes. Transfer the pan to the oven, and cook until the chicken is cooked through, about 5 minutes more. Meanwhile, make the sauce. Combine the lime juice, fish sauce, water, chile paste, honey, mint and coriander in a small bowl and set aside.\nTo serve: Carefully remove the skewers, taking care to keep the rolls intact. Cut across the rolls to make round pieces about 3/4-inch thick, and thread onto skewers. Transfer to a platter, sprinkle with peanuts and serve with the dipping sauce.",
        "ingredients": [
            "4 boneless, skinless chicken breast halves (about 4 ounces each)",
            "2 teaspoons Asian chile paste, such as sambal oelek",
            "Kosher salt and freshly ground black pepper",
            "4 scallions",
            "1/4 red bell pepper, cut into long thin strips",
            "1/4 yellow bell pepper, cut into long thin strips",
            "1 tablespoon vegetable oil, like soy or peanut",
            "2 tablespoons chopped toasted peanuts",
            "2 tablespoons freshly squeezed lime juice",
            "2 tablespoons Southeast Asian fish sauce",
            "2 tablespoons water",
            "1/2 teaspoon Asian chile paste, such as sambal oelek",
            "1 teaspoon honey",
            "1 tablespoon chopped fresh mint or coriander (cilantro)"
        ],
        "step_by_step_instructions": [
            "Pound 1 chicken breast between 2 lightly oiled sheets of parchment or waxed paper into a 4 by 4 inch piece about 1/8-inch thick.",
            "Lay the chicken smooth-side down on the work surface.",
            "Spread 1/8 teaspoon of chile paste over the surface and season with salt and pepper, to taste.",
            "Trim and halve 1 scallion lengthwise. Lay them side-by-side across the lower third of the chicken, so there is white and green at both ends.",
            "Top with 1 piece of red bell pepper strip and 1 piece of yellow bell pepper strip.",
            "Roll the chicken around the vegetables into a tight cylinder.",
            "Thread a wooden skewer through the seam of the roll to seal.",
            "Preheat the oven to 425 degrees F.",
            "Heat 1/4 tablespoon vegetable oil in an oven-proof nonstick skillet over high heat.",
            "Season the roll with salt and pepper, to taste.",
            "Lay the roll, seam side down, in the pan, and cook, turning occasionally, until browned, about 2 minutes.",
            "Transfer the pan to the oven, and cook until the chicken is cooked through, about 5 minutes more.",
            "Meanwhile, make the sauce. Combine 0.5 tablespoon lime juice, 0.5 tablespoon fish sauce, 0.5 tablespoon water, 0.125 teaspoon chile paste, 0.25 teaspoon honey, and 0.25 tablespoon chopped fresh mint or coriander in a small bowl and set aside.",
            "Carefully remove the skewer, taking care to keep the roll intact.",
            "Cut across the roll to make round pieces about 3/4-inch thick, and thread onto a skewer.",
            "Transfer to a platter, sprinkle with 0.5 tablespoon chopped toasted peanuts and serve with the dipping sauce."
        ],
        "processed_ingredients": [
            "1 ounce chicken breast",
            "0.13 teaspoon Asian chile paste",
            "1 scallion",
            "0.25 piece red bell pepper",
            "0.25 piece yellow bell pepper",
            "0.25 tablespoon vegetable oil",
            "0.5 tablespoon chopped toasted peanuts",
            "0.5 tablespoon lime juice",
            "0.5 tablespoon fish sauce",
            "0.5 tablespoon water",
            "0.125 teaspoon Asian chile paste",
            "0.25 teaspoon honey",
            "0.25 tablespoon chopped fresh mint"
        ],
        "pure_ingredients": [
            "chicken",
            "chile paste",
            "salt",
            "pepper",
            "scallion",
            "red bell pepper",
            "yellow bell pepper",
            "oil",
            "peanuts",
            "lime",
            "fish sauce",
            "water",
            "honey",
            "mint"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "parchment or waxed paper",
            "wooden skewer",
            "oven-proof nonstick skillet",
            "small bowl",
            "platter"
        ]
    },
    {
        "recipe_id": "JxjpkLZBm/pRlxU2xw.2PA009TxI1lC",
        "recipe_title": "Toasted-Coconut Cookies ",
        "original_instructions": "Preheat oven to 375°F. In a shallow baking pan spread coconut evenly and lightly toast in middle of oven, stirring once, until pale golden, 4 to 5 minutes. Cool coconut. Into a small bowl sift together flour, baking soda, and salt. In a large bowl with an electric mixer beat together butter and sugars until light and fluffy. Beat in egg and vanilla and stir in flour mixture and coconut until combined well. Arrange teaspoons of dough about 1‚ inches apart on ungreased baking sheets and bake in batches in middle of oven until golden, 8 to 10 minutes. Cool cookies on sheets 1 minute and with a metal spatula transfer to racks to cool. Cookies keep in an airtight container at room temperature 1 week.\nPreheat oven to 375°F.\nIn a shallow baking pan spread coconut evenly and lightly toast in middle of oven, stirring once, until pale golden, 4 to 5 minutes. Cool coconut.\nInto a small bowl sift together flour, baking soda, and salt. In a large bowl with an electric mixer beat together butter and sugars until light and fluffy. Beat in egg and vanilla and stir in flour mixture and coconut until combined well.\nArrange teaspoons of dough about 1‚ inches apart on ungreased baking sheets and bake in batches in middle of oven until golden, 8 to 10 minutes. Cool cookies on sheets 1 minute and with a metal spatula transfer to racks to cool. Cookies keep in an airtight container at room temperature 1 week.",
        "ingredients": [
            "1 1/2 cups sweetened flaked coconut",
            "1 1/4 cups all-purpose flour",
            "1 teaspoon baking soda",
            "1/2 teaspoon salt",
            "1 1/4 sticks (1/2 cup plus 2 tablespoons) unsalted butter, softened",
            "1/2 cup packed light brown sugar",
            "1/4 cup granulated sugar",
            "1 large egg",
            "1 teaspoon vanilla"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 375°F.",
            "Spread approximately 0.25 cup of sweetened flaked coconut evenly in a shallow baking pan.",
            "Lightly toast the coconut in the middle of the oven, stirring once, until pale golden, about 4 to 5 minutes.",
            "Cool the toasted coconut.",
            "Sift together approximately 0.31 cup of all-purpose flour, 0.25 teaspoon of baking soda, and 0.13 teaspoon of salt in a small bowl.",
            "In a large bowl, beat together approximately 0.2 cup of unsalted butter, 0.13 cup of packed light brown sugar, and 0.06 cup of granulated sugar with an electric mixer until light and fluffy.",
            "Beat in 0.25 large egg (about 13 grams) and 0.25 teaspoon of vanilla.",
            "Stir in the flour mixture and toasted coconut until combined well.",
            "Arrange teaspoons of dough about 1 inch apart on ungreased baking sheets.",
            "Bake in the middle of oven until golden, about 8 to 10 minutes.",
            "Cool cookies on sheets for 1 minute and transfer to racks to cool completely."
        ],
        "processed_ingredients": [
            "0.25 cup sweetened flaked coconut",
            "0.31 cup all-purpose flour",
            "0.25 teaspoon baking soda",
            "0.13 teaspoon salt",
            "0.2 cup unsalted butter",
            "0.13 cup light brown sugar",
            "0.06 cup granulated sugar",
            "13 g egg",
            "0.25 teaspoon vanilla"
        ],
        "pure_ingredients": [
            "coconut",
            "flour",
            "baking soda",
            "salt",
            "butter",
            "brown sugar",
            "sugar",
            "egg",
            "vanilla"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "oven",
            "baking pan",
            "sifter",
            "large bowl",
            "electric mixer",
            "baking sheets",
            "metal spatula",
            "cooling racks"
        ]
    },
    {
        "recipe_id": "RnpwNybUeVBuZxwnkLtw9cm8/qGrbOu",
        "recipe_title": "Spaghetti Aglio e Olio With Lots of Kale ",
        "original_instructions": "Bring a large pot of salted water to a boil. Meanwhile, strip kale leaves from ribs and stems, then tear leaves crosswise into 2\"–3\" pieces. Cook kale in boiling water until bright green and slightly softened, about 2 minutes. Using tongs, transfer kale to a colander and rinse under cold water, tossing; squeeze out excess liquid from leaves. Keep water at a boil (you’ll use it for the pasta). Whack garlic with the side of a chef’s knife to crush; peel off skins. Heat 1/4 cup oil in a large heavy pot over medium. Cook garlic, stirring occasionally, until sizzling, about 3 minutes. Season very generously with black pepper and cook, smashing with a wooden spoon, until cloves break into rough pieces, soften, and look golden. Add kale to pot and cook, stirring often, until darkened in color and very tender, about 8 minutes (garlic will break into even smaller pieces). Season with kosher salt and pepper. Meanwhile, cook pasta, stirring occasionally, until very al dente (2–3 minutes less than package directions). Using tongs, add pasta to kale; splash in about 1 cup pasta cooking liquid. Cook, tossing and adding more pasta cooking liquid as needed, until sauce lightly coats pasta, about 2 minutes. Serve pasta topped with Parmesan, red pepper flakes, sea salt, and more black pepper.\nBring a large pot of salted water to a boil. Meanwhile, strip kale leaves from ribs and stems, then tear leaves crosswise into 2\"–3\" pieces. Cook kale in boiling water until bright green and slightly softened, about 2 minutes. Using tongs, transfer kale to a colander and rinse under cold water, tossing; squeeze out excess liquid from leaves. Keep water at a boil (you’ll use it for the pasta).\nWhack garlic with the side of a chef’s knife to crush; peel off skins. Heat 1/4 cup oil in a large heavy pot over medium. Cook garlic, stirring occasionally, until sizzling, about 3 minutes. Season very generously with black pepper and cook, smashing with a wooden spoon, until cloves break into rough pieces, soften, and look golden. Add kale to pot and cook, stirring often, until darkened in color and very tender, about 8 minutes (garlic will break into even smaller pieces). Season with kosher salt and pepper.\nMeanwhile, cook pasta, stirring occasionally, until very al dente (2–3 minutes less than package directions).\nUsing tongs, add pasta to kale; splash in about 1 cup pasta cooking liquid. Cook, tossing and adding more pasta cooking liquid as needed, until sauce lightly coats pasta, about 2 minutes.\nServe pasta topped with Parmesan, red pepper flakes, sea salt, and more black pepper.",
        "ingredients": [
            "Kosher salt",
            "3 large or 4 smaller bunches kale, any type (about 1 1/2 pounds)",
            "5 garlic cloves",
            "1/4 cup olive oil, plus more for drizzling",
            "Freshly ground black pepper",
            "12 ounces spaghetti, thick spaghetti, bucatini, or other long strand pasta",
            "Parmesan and crushed red pepper flakes (for serving)",
            "Flaky sea salt"
        ],
        "step_by_step_instructions": [
            "Bring a large pot of salted water to a boil.",
            "Strip about 0.5 pound of kale leaves from ribs and stems, then tear leaves crosswise into 2\"–3\" pieces.",
            "Cook kale in boiling water until bright green and slightly softened, about 2 minutes.",
            "Using tongs, transfer kale to a colander and rinse under cold water, tossing; squeeze out excess liquid from leaves.",
            "Keep water at a boil for the pasta.",
            "Whack 1 garlic clove with the side of a chef’s knife to crush; peel off skins.",
            "Heat 1 tablespoon oil in a large heavy pot over medium.",
            "Cook garlic, stirring occasionally, until sizzling, about 3 minutes.",
            "Season very generously with black pepper and cook, smashing with a wooden spoon, until cloves break into rough pieces, soften, and look golden.",
            "Add kale to pot and cook, stirring often, until darkened in color and very tender, about 8 minutes.",
            "Season with kosher salt and pepper.",
            "Meanwhile, cook 3 ounces of pasta, stirring occasionally, until very al dente (2–3 minutes less than package directions).",
            "Using tongs, add pasta to kale; splash in about 0.25 cup pasta cooking liquid.",
            "Cook, tossing and adding more pasta cooking liquid as needed, until sauce lightly coats pasta, about 2 minutes.",
            "Serve pasta topped with Parmesan, red pepper flakes, sea salt, and more black pepper."
        ],
        "processed_ingredients": [
            "0.5 pound kale",
            "1 clove garlic",
            "1 tablespoon olive oil",
            "3 ounce spaghetti",
            "0.25 cup pasta cooking liquid",
            "Kosher salt",
            "Black pepper",
            "Parmesan",
            "Red pepper flakes",
            "Sea salt"
        ],
        "pure_ingredients": [
            "salt",
            "kale",
            "garlic",
            "olive oil",
            "black pepper",
            "spaghetti",
            "parmesan",
            "red pepper flakes",
            "sea salt"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "large pot",
            "colander",
            "tongs",
            "chef's knife",
            "wooden spoon"
        ]
    },
    {
        "recipe_id": "G.1zGV/BfkOLN5z5XaFSsh1RUJclUY.",
        "recipe_title": "Lemon Sole",
        "original_instructions": "Preheat 2 medium non-stick skillets over medium-low heat for 5 minutes.\nMeanwhile, lay the fillets on a piece of wax paper, parchment, or a baking sheet and blot dry with paper towels. Season the fillets with salt and pepper. (If the fillets tapers down to a very thin tail, fold the tail back to make a more uniformly thick fillet.) Put the flour on a plate. Dredge the rounded-sides of the fillets in the flour and shake off any excess.\nRaise the heat to medium-high and add 1 tablespoon of butter to each skillet. When the butter stops foaming, add 2 fillets to each pan, rounded-side down, and cook, lightly shaking the skillets occasionally, until golden brown, about 2 minutes. Turn off the heat, flip the fillets with a spatula, and let the fillets finish cooking in the residual heat in the pans, about 2 minutes more. Transfer the fillets to 4 warm plates and cover loosely with foil.\nAdd the lemon juice and water to one of the skillets. While moving the skillet in a circular motion, add the remaining 3 tablespoons butter, little by little, until melted and a smooth, creamy sauce is formed. Stir in the parsley and thyme and season with salt and pepper to taste. Spoon some of the sauce over each fillet and serve immediately.",
        "ingredients": [
            "Four 4-ounce skinless sole or flounder fillets",
            "Kosher salt and freshly ground black pepper",
            "Flour for dredging",
            "5 tablespoons cold unsalted butter, cut into tablespoon-sized pieces",
            "2 tablespoons freshly squeezed lemon juice",
            "2 teaspoons water",
            "1 teaspoon minced flat-leaf parsley leaves",
            "1 teaspoon minced fresh thyme leaves"
        ],
        "step_by_step_instructions": [
            "Preheat a medium non-stick skillet over medium-low heat for 5 minutes.",
            "Meanwhile, lay one fillet on a piece of wax paper, parchment, or a baking sheet and blot dry with paper towels.",
            "Season the fillet with salt and pepper.",
            "If the fillet tapers down to a very thin tail, fold the tail back to make a more uniformly thick fillet.",
            "Put some flour on a plate.",
            "Dredge the rounded side of the fillet in the flour and shake off any excess.",
            "Raise the heat to medium-high and add 0.5 tablespoon of butter to the skillet.",
            "When the butter stops foaming, add the fillet to the pan, rounded side down, and cook, lightly shaking the skillet occasionally, until golden brown, about 2 minutes.",
            "Turn off the heat, flip the fillet with a spatula, and let it finish cooking in the residual heat in the pan, about 2 minutes more.",
            "Transfer the fillet to a warm plate and cover loosely with foil.",
            "Add 0.5 tablespoon of lemon juice and 0.5 teaspoon of water to the skillet.",
            "While moving the skillet in a circular motion, add 0.75 tablespoon butter, little by little, until melted and a smooth, creamy sauce is formed.",
            "Stir in 0.25 teaspoon parsley and 0.25 teaspoon thyme and season with salt and pepper to taste.",
            "Spoon some of the sauce over the fillet and serve immediately."
        ],
        "processed_ingredients": [
            "4.00 ounce sole fillet",
            "0.13 teaspoon salt",
            "0.13 teaspoon pepper",
            "0.25 cup flour",
            "1.25 tablespoon butter",
            "0.50 tablespoon lemon juice",
            "0.50 teaspoon water",
            "0.25 teaspoon parsley",
            "0.25 teaspoon thyme"
        ],
        "pure_ingredients": [
            "sole",
            "salt",
            "pepper",
            "flour",
            "butter",
            "lemon",
            "water",
            "parsley",
            "thyme"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "skillet",
            "paper towels",
            "spatula",
            "plate",
            "foil"
        ]
    },
    {
        "recipe_id": "vlgqVRswSIqfsi8g2ppiW7fthV0uEG.",
        "recipe_title": "Grilled Gazpacho Salad with Shrimp ",
        "original_instructions": "Prepare barbecue (medium-high heat). Set aside 2 garlic cloves for bread slices. Place remaining garlic on double layer of heavy-duty foil; drizzle 3 tablespoons olive oil over. Fold up and seal packet. Place directly on grill rack and cook until garlic is very tender and golden, about 30 minutes. Open packet; cool garlic. Toss shrimp (in shells) and 1 tablespoon oil in medium bowl to coat; sprinkle with salt and pepper. Combine plum tomatoes, green onions, sweet onion, both bell peppers, and 2 tablespoons oil in large bowl; toss to coat. Arrange cucumber halves and bread slices on baking sheet; brush with 2 tablespoons oil. Sprinkle all vegetables with salt and pepper. Grill shrimp until just opaque, about 2 1/2 minutes per side; transfer to another bowl and cool. Grill vegetables until crisp-tender, turning frequently, about 3 minutes for plum tomatoes and green onions, 5 minutes for cucumbers, and 15 minutes for sweet onion and bell peppers. Transfer to large rimmed baking sheet. Grill bread slices until just beginning to crisp and grill marks appear, about 2 1/2 minutes per side. Rub bread with reserved garlic cloves, then discard garlic cloves. Peel shrimp; transfer to large bowl. Cut all vegetables and bread into 1/2- to 3/4-inch pieces; add to shrimp along with any accumulated juices. Stir in grilled garlic cloves and grape tomatoes. Whisk vinegar, hot pepper sauce, and remaining 4 tablespoons oil in small bowl; pour over salad and toss to coat. Do ahead: Can be made 1 1/2 hours ahead. Let stand at room temperature. Stir thinly sliced basil into salad. Season salad to taste with salt and pepper. Serve with lime wedges.\nPrepare barbecue (medium-high heat). Set aside 2 garlic cloves for bread slices. Place remaining garlic on double layer of heavy-duty foil; drizzle 3 tablespoons olive oil over. Fold up and seal packet. Place directly on grill rack and cook until garlic is very tender and golden, about 30 minutes. Open packet; cool garlic.\nToss shrimp (in shells) and 1 tablespoon oil in medium bowl to coat; sprinkle with salt and pepper. Combine plum tomatoes, green onions, sweet onion, both bell peppers, and 2 tablespoons oil in large bowl; toss to coat. Arrange cucumber halves and bread slices on baking sheet; brush with 2 tablespoons oil. Sprinkle all vegetables with salt and pepper. Grill shrimp until just opaque, about 2 1/2 minutes per side; transfer to another bowl and cool. Grill vegetables until crisp-tender, turning frequently, about 3 minutes for plum tomatoes and green onions, 5 minutes for cucumbers, and 15 minutes for sweet onion and bell peppers. Transfer to large rimmed baking sheet. Grill bread slices until just beginning to crisp and grill marks appear, about 2 1/2 minutes per side. Rub bread with reserved garlic cloves, then discard garlic cloves.\nPeel shrimp; transfer to large bowl. Cut all vegetables and bread into 1/2- to 3/4-inch pieces; add to shrimp along with any accumulated juices. Stir in grilled garlic cloves and grape tomatoes. Whisk vinegar, hot pepper sauce, and remaining 4 tablespoons oil in small bowl; pour over salad and toss to coat.\nDo ahead: Can be made 1 1/2 hours ahead. Let stand at room temperature.\nStir thinly sliced basil into salad. Season salad to taste with salt and pepper. Serve with lime wedges.",
        "ingredients": [
            "2 medium heads of garlic, separated into cloves, peeled (about 24 cloves)",
            "3/4 cup olive oil, divided",
            "1 1/2 pounds uncooked large shrimp, deveined but with shells intact*",
            "8 firm plum tomatoes, halved lengthwise",
            "2 bunches green onions; root ends trimmed, onions left whole",
            "1 1-pound sweet onion (such as Vidalia or Maui), cut into 1/2-inch-thick slices",
            "1 red bell pepper, quartered, cored",
            "1 yellow bell pepper, quartered, cored",
            "1 1/2 large English hothouse cucumbers, peeled, halved lengthwise",
            "2 6x3x1-inch slices country-style bread",
            "2 cups grape tomatoes, halved (about 1 pint)",
            "1/4 cup red wine vinegar",
            "1 teaspoon hot pepper sauce",
            "1/2 cup thinly sliced fresh basil",
            "Lime wedges"
        ],
        "step_by_step_instructions": [
            "Prepare a barbecue to medium-high heat.",
            "Set aside 2 garlic cloves for bread slices.",
            "Place the remaining garlic cloves on a double layer of heavy-duty foil and drizzle about 1 tablespoon of olive oil over them.",
            "Fold up and seal the foil packet.",
            "Place the packet directly on the grill rack and cook until the garlic is very tender and golden, about 30 minutes. Open the packet and let the garlic cool.",
            "Toss about 3 ounces of shrimp (in shells) with approximately 1 teaspoon of olive oil in a medium bowl. Sprinkle with salt and pepper.",
            "Combine about 1 tomato, 2 green onions, 2 slices of sweet onion, 1/4 red bell pepper, and 1/4 yellow bell pepper with approximately 2 teaspoons of olive oil in a large bowl and toss to coat.",
            "Arrange 1 cucumber half and 1 bread slice on a baking sheet; brush with about 2 teaspoons of olive oil.",
            "Sprinkle all vegetables with salt and pepper.",
            "Grill shrimp until just opaque, approximately 2 1/2 minutes per side, then transfer to another bowl and cool.",
            "Grill vegetables until crisp-tender, turning frequently. Grill for about 3 minutes for tomatoes and green onions, 5 minutes for cucumbers, and 15 minutes for onions and bell peppers. Transfer to a large rimmed baking sheet.",
            "Grill bread slices until just beginning to crisp and grill marks appear, about 2 1/2 minutes per side.",
            "Rub grilled bread with reserved garlic cloves, then discard the garlic cloves.",
            "Peel shrimp and transfer to a large bowl.",
            "Cut all vegetables and bread into 1/2- to 3/4-inch pieces; add to shrimp along with any accumulated juices.",
            "Stir in grilled garlic cloves and about 1/2 cup of halved grape tomatoes.",
            "Whisk 1 tablespoon of red wine vinegar, 1/4 teaspoon of hot pepper sauce, and about 2 teaspoons of olive oil in a small bowl; pour over the salad and toss to coat.",
            "Let the salad stand at room temperature for up to 1 1/2 hours if needed.",
            "Stir about 1 tablespoon of thinly sliced basil into the salad.",
            "Season the salad to taste with salt and pepper.",
            "Serve with lime wedges."
        ],
        "processed_ingredients": [
            "2 cloves garlic",
            "1 tablespoon olive oil",
            "3 ounces shrimp",
            "1 tomato",
            "2 green onions",
            "2 slices sweet onion",
            "0.25 red bell pepper",
            "0.25 yellow bell pepper",
            "0.5 cucumber",
            "1 bread slice",
            "0.5 cup grape tomatoes",
            "1 tablespoon red wine vinegar",
            "0.25 teaspoon hot pepper sauce",
            "1 tablespoon fresh basil",
            "2 lime wedges"
        ],
        "pure_ingredients": [
            "garlic",
            "olive oil",
            "shrimp",
            "tomato",
            "green onions",
            "sweet onion",
            "red bell pepper",
            "yellow bell pepper",
            "cucumber",
            "bread",
            "grape tomatoes",
            "red wine vinegar",
            "hot pepper sauce",
            "basil",
            "lime"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "barbecue grill",
            "heavy-duty foil",
            "baking sheet",
            "bowl",
            "rimmed baking sheet",
            "small bowl"
        ]
    },
    {
        "recipe_id": "AmKb91W..SOQqCZCs1anF1MZF6APVPG",
        "recipe_title": "Oven-Fried Fish with Potato Salad",
        "original_instructions": "Preheat the oven to 450 degrees F. Put the potatoes in a saucepan and cover with cold water by 1 inch; season with salt. Bring to a boil; reduce the heat to medium low and simmer until tender, 10 minutes. Drain.\nCombine the buttermilk, mayonnaise and relish in a large bowl. Add the potatoes, sliced celery, scallions, 1/4 teaspoon salt, and pepper to taste; toss. Refrigerate until ready to serve.\nWhisk the egg whites in a large bowl. Put the breadcrumbs in another bowl. Season the fish with the paprika, 1 teaspoon salt and a few grinds of pepper. Dip each piece in the egg whites, then dredge in the breadcrumbs, pressing to coat. Transfer to a rack set over a baking sheet.\nCoat the fish on both sides with cooking spray. Bake until golden brown and just cooked through, about 12 minutes. Top the potato salad with celery leaves. Serve with the fish and lemon wedges.\nPhotograph by Justin Walker",
        "ingredients": [
            "1 1/2 pounds small red-skinned potatoes, quartered",
            "Kosher salt",
            "3 tablespoons buttermilk",
            "3 tablespoons mayonnaise",
            "4 teaspoons relish",
            "2 stalks celery, thinly sliced, plus chopped celery leaves for topping",
            "2 scallions, thinly sliced",
            "Freshly ground pepper",
            "3 large egg whites",
            "1 1/2 cups panko breadcrumbs",
            "1 1/4 pounds cod (preferably Pacific cod), cut into 8 pieces",
            "1 teaspoon paprika",
            "Cooking spray",
            "Lemon wedges, for serving"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450 degrees F.",
            "Put about 5.4 ounces of quartered potatoes in a saucepan and cover with cold water by 1 inch; season with salt.",
            "Bring to a boil; reduce the heat to medium low and simmer until tender, about 10 minutes. Drain.",
            "Combine 0.5 tablespoon of buttermilk, 0.5 tablespoon of mayonnaise, and 0.67 teaspoon of relish in a large bowl.",
            "Add the cooked potatoes, about 0.5 ounce of sliced celery, 0.5 tablespoon of sliced scallions, approximately 0.05 teaspoon of salt, and pepper to taste; toss.",
            "Refrigerate the potato salad until ready to serve.",
            "Whisk 0.5 large egg white in a large bowl.",
            "Put about 0.25 cup of panko breadcrumbs in another bowl.",
            "Season approximately 2 ounces of cod with about 0.125 teaspoon of paprika, 0.17 teaspoon of salt, and a few grinds of pepper.",
            "Dip each piece of cod in the egg white, then dredge in the breadcrumbs, pressing to coat.",
            "Transfer to a rack set over a baking sheet.",
            "Coat the fish on both sides with cooking spray.",
            "Bake until golden brown and just cooked through, about 12 minutes.",
            "Top the potato salad with chopped celery leaves.",
            "Serve the fish with the potato salad and a lemon wedge."
        ],
        "processed_ingredients": [
            "5.40 oz potatoes",
            "0.50 tbsp buttermilk",
            "0.50 tbsp mayonnaise",
            "0.67 tsp relish",
            "0.50 oz celery",
            "0.50 tbsp scallions",
            "0.05 tsp salt",
            "0.50 egg whites",
            "0.25 cup panko breadcrumbs",
            "2.00 oz cod",
            "0.13 tsp paprika",
            "0.17 tsp salt",
            "1.00 wedge lemon"
        ],
        "pure_ingredients": [
            "potatoes",
            "salt",
            "buttermilk",
            "mayonnaise",
            "relish",
            "celery",
            "scallions",
            "pepper",
            "egg whites",
            "breadcrumbs",
            "cod",
            "paprika",
            "cooking spray",
            "lemon"
        ],
        "cooking_time": "22 minutes",
        "required_tools": [
            "saucepan",
            "large bowl",
            "baking sheet",
            "rack",
            "whisk",
            "oven"
        ]
    },
    {
        "recipe_id": "D2hVbiCEglr9d.QLVg49Gz.CNZizjaW",
        "recipe_title": "Lamb Köfte with Tarator Sauce ",
        "original_instructions": "Soak bread in water to cover 30 minutes, then squeeze gently to remove as much water as possible. Pulse onion in a food processor until finely chopped. Add parsley and pulse to finely chop. Add lamb, bread, spices, and 1 tsp salt and pulse until combined. Divide mixture into 20 portions (about 1/4 cup each), forming each into a ball. Roll each ball into a 5-inch-long \"cigar.\" Slide a skewer lengthwise through center of each. Prepare grill for direct-heat cooking over medium-hot charcoal (medium-high heat for gas). Oil grill rack, then grill köfte, covered only if using a gas grill, rotating a quarter turn occasionally, until just cooked through, about 5 minutes total.\nSoak bread in water to cover 30 minutes, then squeeze gently to remove as much water as possible.\nPulse onion in a food processor until finely chopped. Add parsley and pulse to finely chop. Add lamb, bread, spices, and 1 tsp salt and pulse until combined.\nDivide mixture into 20 portions (about 1/4 cup each), forming each into a ball. Roll each ball into a 5-inch-long \"cigar.\" Slide a skewer lengthwise through center of each.\nPrepare grill for direct-heat cooking over medium-hot charcoal (medium-high heat for gas).\nOil grill rack, then grill köfte, covered only if using a gas grill, rotating a quarter turn occasionally, until just cooked through, about 5 minutes total.",
        "ingredients": [
            "3 slices firm white sandwich bread, torn into pieces",
            "1 medium onion, chopped",
            "1/2 cup chopped flat-leaf parsley",
            "1 1/2 pound ground lamb",
            "1 teaspoon ground allspice",
            "1 teaspoon Aleppo pepper or 1/2 teaspoon hot red-pepper flakes",
            "1/2 teaspoon ground cinnamon",
            "1/8 teaspoon ground cloves",
            "20 (8- to 10-inch) wooden skewers, soaked in water 30 minutes",
            "tarator sauce ; chopped tomatoes; chopped onion; pita bread"
        ],
        "step_by_step_instructions": [
            "Soak 0.15 slices of firm white sandwich bread in water for 30 minutes, then squeeze gently to remove as much water as possible.",
            "Pulse 0.05 medium onion in a food processor until finely chopped.",
            "Add 0.03 cup of chopped flat-leaf parsley to the food processor and pulse to finely chop.",
            "Add 0.08 lb ground lamb, soaked bread, 0.05 teaspoon ground allspice, 0.05 teaspoon Aleppo pepper, 0.03 teaspoon ground cinnamon, 0.01 teaspoon ground cloves, and 0.05 teaspoon salt to the food processor and pulse until combined.",
            "Divide the mixture into 1 portion, forming it into a ball, then roll into a 5-inch-long 'cigar.'",
            "Slide a skewer lengthwise through the center of the 'cigar.'",
            "Prepare grill for direct-heat cooking over medium-hot charcoal or medium-high heat if using gas.",
            "Oil the grill rack, then grill the köfte, covered only if using a gas grill, rotating a quarter turn occasionally, until just cooked through, about 5 minutes."
        ],
        "processed_ingredients": [
            "0.15 slices firm white sandwich bread",
            "0.05 medium onion",
            "0.03 cup flat-leaf parsley",
            "0.08 lb ground lamb",
            "0.05 teaspoon ground allspice",
            "0.05 teaspoon Aleppo pepper",
            "0.03 teaspoon ground cinnamon",
            "0.01 teaspoon ground cloves",
            "0.05 teaspoon salt"
        ],
        "pure_ingredients": [
            "bread",
            "onion",
            "parsley",
            "lamb",
            "allspice",
            "pepper",
            "cinnamon",
            "cloves",
            "salt",
            "tomatoes",
            "pita",
            "skewers"
        ],
        "cooking_time": "35 minutes",
        "required_tools": [
            "food processor",
            "grill",
            "skewers"
        ]
    },
    {
        "recipe_id": "L9y7esZh2jWzTJfuxZEV9zj9CQDX5Ku",
        "recipe_title": "Kimchi-Braised Chicken With Bacon ",
        "original_instructions": "Heat oil in a large Dutch oven or skillet over medium and cook bacon, turning occasionally, until brown and lightly crisped, 5–8 minutes. Transfer to a plate. Season chicken generously with salt and pepper. Cook, skin side down, in bacon drippings, until skin is very deep golden brown, 12–15 minutes. Transfer to plate with bacon, placing skin side up. Add garlic and tomatoes to same pot and cook, stirring occasionally, until garlic is lightly browned and tomatoes have burst, about 5 minutes. Add wine, scraping up browned bits. Bring to a boil and cook until reduced by three-fourths. Add half of kimchi and nestle bacon and chicken, skin side up, into tomatoes (make sure chicken skin is above surface of liquid to keep it crispy). Bring to a simmer and cook, reducing heat if needed, until chicken is tender and cooked through, 45–60 minutes. Transfer chicken back to plate and bring braising liquid to a simmer; cook until slightly thickened, 8–10 minutes. Meanwhile, cook egg noodles in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1/2 cup pasta cooking liquid. Return noodles to pasta pot and add butter and 1/4 cup pasta cooking liquid. Toss, adding more pasta cooking liquid as needed, until pasta is coated with buttery sauce. Season with salt and pepper. Stir remaining kimchi into chicken braising liquid; season with salt and pepper. Place chicken, skin side up, in braising liquid. Sprinkle half of chives over chicken and half over noodles; toss noodles to combine. Serve chicken and tomato-kimchi sauce over buttery noodles.\nHeat oil in a large Dutch oven or skillet over medium and cook bacon, turning occasionally, until brown and lightly crisped, 5–8 minutes. Transfer to a plate.\nSeason chicken generously with salt and pepper. Cook, skin side down, in bacon drippings, until skin is very deep golden brown, 12–15 minutes. Transfer to plate with bacon, placing skin side up.\nAdd garlic and tomatoes to same pot and cook, stirring occasionally, until garlic is lightly browned and tomatoes have burst, about 5 minutes. Add wine, scraping up browned bits. Bring to a boil and cook until reduced by three-fourths.\nAdd half of kimchi and nestle bacon and chicken, skin side up, into tomatoes (make sure chicken skin is above surface of liquid to keep it crispy). Bring to a simmer and cook, reducing heat if needed, until chicken is tender and cooked through, 45–60 minutes.\nTransfer chicken back to plate and bring braising liquid to a simmer; cook until slightly thickened, 8–10 minutes.\nMeanwhile, cook egg noodles in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1/2 cup pasta cooking liquid.\nReturn noodles to pasta pot and add butter and 1/4 cup pasta cooking liquid. Toss, adding more pasta cooking liquid as needed, until pasta is coated with buttery sauce. Season with salt and pepper.\nStir remaining kimchi into chicken braising liquid; season with salt and pepper. Place chicken, skin side up, in braising liquid. Sprinkle half of chives over chicken and half over noodles; toss noodles to combine.\nServe chicken and tomato-kimchi sauce over buttery noodles.",
        "ingredients": [
            "1 tablespoon vegetable oil",
            "4 ounces slab bacon, sliced 1/4 inch thick, cut crosswise into 1-inch pieces",
            "1 (3 1/2–4-pound) chicken, cut into 10 pieces; or 4 chicken legs, drumsticks and thighs separated, plus 2 skin-on, bone-in breasts, cut crosswise",
            "Kosher salt, freshly ground pepper",
            "8 cloves garlic, lightly crushed",
            "1 pint cherry tomatoes",
            "1 cup dry white wine",
            "2 cups kimchi with juices, divided",
            "6 ounces wide egg noodles",
            "2 tablespoons unsalted butter",
            "2 tablespoons sliced chives, divided"
        ],
        "step_by_step_instructions": [
            "Heat 0.5 tablespoon vegetable oil in a large Dutch oven or skillet over medium heat.",
            "Cook 1 ounce slab bacon, sliced 1/4 inch thick and cut crosswise into 1-inch pieces, turning occasionally, until brown and lightly crisped, 5–8 minutes.",
            "Transfer bacon to a plate.",
            "Season 1 chicken piece (about 1/2 lb) generously with salt and pepper.",
            "Cook chicken, skin side down, in bacon drippings, until skin is very deep golden brown, 12–15 minutes.",
            "Transfer chicken to the plate with bacon, placing skin side up.",
            "Add 2 cloves garlic, lightly crushed, and approximately 4 ounces cherry tomatoes to the same pot.",
            "Cook, stirring occasionally, until garlic is lightly browned and tomatoes have burst, about 5 minutes.",
            "Add 1/4 cup dry white wine, scraping up browned bits.",
            "Bring to a boil and cook until reduced by three-fourths.",
            "Add 1/2 cup kimchi and nestle bacon and chicken, skin side up, into tomatoes (make sure chicken skin is above surface of liquid to keep it crispy).",
            "Bring to a simmer and cook, reducing heat if needed, until chicken is tender and cooked through, 45–60 minutes.",
            "Transfer chicken back to plate and bring braising liquid to a simmer; cook until slightly thickened, 8–10 minutes.",
            "Meanwhile, cook 1.5 ounces wide egg noodles in a large pot of boiling salted water, stirring occasionally, until al dente.",
            "Drain, reserving 2 tablespoons pasta cooking liquid.",
            "Return noodles to pasta pot and add 0.5 tablespoon unsalted butter and 1 tablespoon pasta cooking liquid.",
            "Toss, adding more pasta cooking liquid as needed, until pasta is coated with buttery sauce.",
            "Season with salt and pepper.",
            "Stir remaining 1/2 cup kimchi into chicken braising liquid; season with salt and pepper.",
            "Place chicken, skin side up, in braising liquid.",
            "Sprinkle 1 tablespoon sliced chives over chicken and 1 tablespoon over noodles; toss noodles to combine.",
            "Serve chicken and tomato-kimchi sauce over buttery noodles."
        ],
        "processed_ingredients": [
            "0.5 tablespoon vegetable oil",
            "1 ounce slab bacon",
            "0.5 lb chicken",
            "2 cloves garlic",
            "4 ounces cherry tomatoes",
            "0.25 cup dry white wine",
            "1 cup kimchi",
            "1.5 ounce wide egg noodles",
            "0.5 tablespoon unsalted butter",
            "1 tablespoon sliced chives",
            "salt",
            "pepper"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "bacon",
            "chicken",
            "salt",
            "pepper",
            "garlic",
            "tomatoes",
            "white wine",
            "kimchi",
            "egg noodles",
            "butter",
            "chives"
        ],
        "cooking_time": "128 minutes",
        "required_tools": [
            "large Dutch oven or skillet",
            "plate",
            "pot"
        ]
    },
    {
        "recipe_id": "Wn.SyoqOZOCw8jAA8KpL6SH2QrEwK2S",
        "recipe_title": "Chicken Pot-au Feu",
        "original_instructions": "Preheat the oven to 400 degrees F.\nWash the fingerling potatoes, pat dry, and season with olive oil spray and half of the salt, pepper, and fresh herbs. Place the potatoes on a baking sheet and roast for 10 minutes or until soft to the touch.\nSlice the zucchini in thirds crosswise; slice each piece into quarters lengthwise. For a classic French presentation, round the angled sides to form 12 oval sticks\nSeason the chicken with the remaining 1/4 teaspoon salt, 1/8 teaspoon pepper, and 1 teaspoon herbs. Heat a saute pan over medium-high heat and add the olive oil to lightly coat the bottom of the pan. Sear the chicken breasts on 1 side for about 2 minutes and turn over. Add the leeks, carrots, mushrooms, zucchini, and garlic. Cook, stirring constantly, for 1 minute to sear the vegetables. Add the white wine, and boil until the wine is reduced by half, about 2 minutes. Stir in the stock and bring to boil. Reduce heat and simmer until the chicken is cooked through, 7 to 10 minutes. Add the Swiss chard to 1 side of the pan to braise the greens in the cooking liquid, about 1 minute.\nTo serve: Place 1/2 cup of the Swiss chard in the center of 4 large soup bowls. Slice each chicken breast on an angle into 5 pieces. Arrange the chicken on top of the Swiss chard. Divide the vegetables among the 4 bowls and ladle the broth around the vegetables.",
        "ingredients": [
            "8 fingerling potatoes",
            "Olive oil cooking spray",
            "1/2 teaspoon sea salt",
            "1/4 teaspoon freshly ground black pepper",
            "2 teaspoons fresh herb mix (equal parts finely chopped fresh basil, oregano, flat-leaf parsley, and thyme)",
            "1 medium zucchini",
            "4 (4-ounce) chicken or pheasant breasts, skin removed",
            "1/4 teaspoon extra-virgin olive oil",
            "1 leek (white part only), cut in 1/2 lengthwise, cut into 1/2-inch slices",
            "8 baby carrots",
            "1 cup morel or small crimini mushrooms",
            "1 teaspoon minced garlic",
            "1/2 cup white wine",
            "2 cups chicken stock, or canned chicken broth",
            "4 cups chopped Swiss chard"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Wash 2 fingerling potatoes, pat dry, and season with a light spray of olive oil and a pinch of salt, pepper, and herb mix.",
            "Place the potatoes on a baking sheet and roast for 10 minutes or until soft to the touch.",
            "Slice 1/4 of a zucchini into thirds crosswise; slice each piece into quarters lengthwise to form oval sticks.",
            "Season 1 chicken breast with a pinch of salt, pepper, and herb mix.",
            "Heat a saute pan over medium-high heat and add 0.06 teaspoon olive oil to lightly coat the bottom of the pan.",
            "Sear the chicken breast on one side for about 2 minutes and turn over.",
            "Add 1/4 of a leek, 2 baby carrots, 0.25 cup mushrooms, zucchini slices, and 0.25 teaspoon minced garlic.",
            "Cook, stirring constantly, for 1 minute to sear the vegetables.",
            "Add 0.12 cup white wine, and boil until the wine is reduced by half, about 2 minutes.",
            "Stir in 0.5 cup chicken stock and bring to a boil.",
            "Reduce heat and simmer until the chicken is cooked through, 7 to 10 minutes.",
            "Add 1 cup chopped Swiss chard to one side of the pan to braise the greens in the cooking liquid, about 1 minute.",
            "To serve, place 1/2 cup of the Swiss chard in the center of a soup bowl.",
            "Slice the chicken breast on an angle into 5 pieces and arrange on top of the Swiss chard.",
            "Divide the vegetables among the bowl and ladle the broth around the vegetables."
        ],
        "processed_ingredients": [
            "2 ounce fingerling potatoes",
            "0.06 teaspoon olive oil cooking spray",
            "0.06 teaspoon salt",
            "0.03 teaspoon black pepper",
            "0.5 teaspoon fresh herb mix",
            "0.25 medium zucchini",
            "4 ounce chicken breast",
            "0.06 teaspoon extra-virgin olive oil",
            "0.25 leek",
            "2 baby carrots",
            "0.25 cup crimini mushrooms",
            "0.25 teaspoon minced garlic",
            "0.12 cup white wine",
            "0.5 cup chicken stock",
            "1 cup Swiss chard"
        ],
        "pure_ingredients": [
            "potatoes",
            "olive oil",
            "salt",
            "black pepper",
            "basil",
            "oregano",
            "parsley",
            "thyme",
            "zucchini",
            "chicken",
            "leek",
            "carrots",
            "mushrooms",
            "garlic",
            "white wine",
            "chicken stock",
            "Swiss chard"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "saute pan",
            "knife",
            "cutting board",
            "spatula",
            "soup bowl"
        ]
    },
    {
        "recipe_id": "1KALABOJde33RI83gwTevd28ZmW8X4m",
        "recipe_title": "\"Pearl Balls\" - Pork Meatballs in Sticky Rice",
        "original_instructions": "Put the pork on a large cutting board and very finely mince it with a sharp, heavy knife or cleaver until the fat is broken down (or use 2 large heavy cleavers to get the job done quicker!). Spread out the pork into a thin layer on the board. Grate the ginger, shallot and bouillon over the meat using a fine grater, and then sprinkle on the cornstarch, five-spice, Shaoshing, salt, pepper and egg yolk. Mix well until combined using a knife or spatula.\nPut some cornstarch in a shallow bowl. Roll the pork mixture into ping pong ball-size meatballs, and then roll in the cornstarch to lightly coat. Shake off the excess and transfer the meatballs to a plate.\nUsing wet hands, put some of the soaked rice in your palm and roll the meatball in it with your hands, pressing gently, until evenly coated in rice. Continue rolling until the meatballs are all coated with the rice.\nFill a wok one-third full with water and bring to a boil over medium-high heat. Put a shallow flat bowl or plate with a lip into a bamboo steamer basket (make sure the plate is at least 1/2 inch smaller than the diameter of the basket) and evenly space the rice balls on the plate, being sure they do not touch each other. Cover the basket with the lid and lower it into the wok. Steam the meatballs, adding water to the wok as necessary to prevent the basket from scorching, until set and firm, 20 to 25 minutes.\nCarefully remove the rice balls from the steamer and transfer to a platter. Serve the meatballs with toothpicks on the side for skewering and dipping into vinegar, chili oil, or soy sauce.",
        "ingredients": [
            "One 12-ounce piece boneless, skinless pork belly or ground pork",
            "One 2-inch piece fresh ginger, peeled",
            "1 shallot",
            "1/2 cube vegetable bouillon",
            "1 teaspoon cornstarch, plus more for rolling",
            "1 teaspoon Chinese five-spice powder",
            "1 teaspoon Shaoshing rice wine",
            "Sea salt and freshly ground white pepper",
            "1 large egg yolk, beaten",
            "1/2 cup glutinous white rice, soaked overnight in cold water and drained",
            "Black rice vinegar, chili oil, or soy sauce, for dipping, optional"
        ],
        "step_by_step_instructions": [
            "Finely mince 3 ounces of boneless, skinless pork belly using a sharp knife or cleaver.",
            "Spread the minced pork into a thin layer on the cutting board.",
            "Grate a small piece of ginger and a shallot over the pork using a fine grater.",
            "Sprinkle 0.13 cube of vegetable bouillon over the mixture.",
            "Add 0.25 teaspoon of cornstarch, 0.25 teaspoon of Chinese five-spice powder, 0.25 teaspoon of Shaoshing rice wine, a pinch of salt, a pinch of white pepper, and 0.25 of a beaten egg yolk to the pork mixture.",
            "Mix all ingredients well until combined using a knife or spatula.",
            "Place 0.25 teaspoon of cornstarch in a shallow bowl.",
            "Roll the pork mixture into a ping pong ball-sized meatball and lightly coat with cornstarch. Shake off the excess.",
            "With wet hands, place some soaked glutinous rice in your palm and roll the meatball in it until evenly coated.",
            "Fill a wok one-third full with water and bring to a boil over medium-high heat.",
            "Place a shallow flat bowl or plate with a lip into a bamboo steamer basket.",
            "Evenly space the rice-coated meatball on the plate, ensuring it does not touch the sides.",
            "Cover the basket with the lid and lower it into the wok.",
            "Steam the meatball for 20 to 25 minutes until set and firm, adding water to the wok as necessary.",
            "Carefully remove the rice ball from the steamer and transfer to a platter.",
            "Serve the meatball with a toothpick for dipping into soy sauce."
        ],
        "processed_ingredients": [
            "3.00 oz pork belly",
            "0.25 inch ginger",
            "0.25 shallot",
            "0.13 cube vegetable bouillon",
            "0.25 tsp cornstarch",
            "0.25 tsp Chinese five-spice powder",
            "0.25 tsp Shaoshing rice wine",
            "0.25 egg yolk",
            "0.13 cup glutinous white rice",
            "0.25 tsp salt",
            "0.25 tsp white pepper",
            "1.00 tbsp soy sauce"
        ],
        "pure_ingredients": [
            "pork",
            "ginger",
            "shallot",
            "vegetable bouillon",
            "cornstarch",
            "five-spice powder",
            "Shaoshing rice wine",
            "salt",
            "pepper",
            "egg",
            "glutinous rice",
            "soy sauce"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "knife",
            "grater",
            "shallow bowl",
            "wok",
            "bamboo steamer basket",
            "plate",
            "toothpick"
        ]
    },
    {
        "recipe_id": "dL2kh80ov9gf8ryDDvIg5Cxy6hcfUq6",
        "recipe_title": "Pastry Dough ",
        "original_instructions": "Blend together flour, butter, shortening, and salt in a bowl with your fingertips or a pastry blender (or pulse in a food processor) until most of mixture resembles coarse meal, with the rest in small (roughly pea-size) lumps. Drizzle 4 tablespoons ice water evenly over and gently stir with a fork (or pulse in a food processor) until incorporated. Gently squeeze a small handful: It should hold together without falling apart. If it doesn’t, add more water, 1 tablespoon at a time, stirring (or pulsing) after each addition until incorporated, continuing to test. (Do not overwork dough or it will become tough.) Turn out onto a work surface and divide into 2 portions. With heel of your hand, smear each portion once in a forward motion to help distribute fat. Gather each portion of dough and form it, rotating on work surface, into a disk. Wrap disks separately in plastic wrap and chill until firm, at least 1 hour.\nBlend together flour, butter, shortening, and salt in a bowl with your fingertips or a pastry blender (or pulse in a food processor) until most of mixture resembles coarse meal, with the rest in small (roughly pea-size) lumps. Drizzle 4 tablespoons ice water evenly over and gently stir with a fork (or pulse in a food processor) until incorporated.\nGently squeeze a small handful: It should hold together without falling apart. If it doesn’t, add more water, 1 tablespoon at a time, stirring (or pulsing) after each addition until incorporated, continuing to test. (Do not overwork dough or it will become tough.)\nTurn out onto a work surface and divide into 2 portions. With heel of your hand, smear each portion once in a forward motion to help distribute fat. Gather each portion of dough and form it, rotating on work surface, into a disk. Wrap disks separately in plastic wrap and chill until firm, at least 1 hour.",
        "ingredients": [
            "2 1/2 cups all-purpose flour",
            "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into 1/2-inch cubes",
            "1/4 cup cold vegetable shortening",
            "1/2 teaspoon salt",
            "4 to 8 tablespoons ice water"
        ],
        "step_by_step_instructions": [
            "Blend together 1/4 cup all-purpose flour, 3 tablespoons cold unsalted butter, 1 tablespoon cold vegetable shortening, and a pinch of salt in a bowl with your fingertips or a pastry blender until most of the mixture resembles coarse meal, with the rest in small lumps.",
            "Drizzle 1 tablespoon ice water evenly over the mixture and gently stir with a fork until incorporated.",
            "Gently squeeze a small handful of the mixture: It should hold together without falling apart. If it doesn’t, add more water, 1 teaspoon at a time, stirring after each addition until incorporated.",
            "Turn the mixture out onto a work surface and divide it into 1 portion.",
            "With the heel of your hand, smear the portion once in a forward motion to help distribute the fat.",
            "Gather the dough and form it, rotating on the work surface, into a disk.",
            "Wrap the disk in plastic wrap and chill until firm, at least 1 hour."
        ],
        "processed_ingredients": [
            "0.25 cup all-purpose flour",
            "3 tablespoon cold unsalted butter",
            "1 tablespoon cold vegetable shortening",
            "1 pinch salt",
            "1 tablespoon ice water"
        ],
        "pure_ingredients": [
            "flour",
            "butter",
            "vegetable shortening",
            "salt",
            "water"
        ],
        "cooking_time": "1 hour",
        "required_tools": [
            "bowl",
            "pastry blender",
            "fork",
            "plastic wrap"
        ]
    },
    {
        "recipe_id": "xDVZhBc7s2g2n25RgFT2lLc43sgo9K6",
        "recipe_title": "Oven-Fried Chicken ",
        "original_instructions": "1. Preheat the oven to 375°F. 2. In a large plastic bag, combine the thyme, oregano, basil, garlic powder, salt and pepper. Shake well. Add two breasts at a time to the bag and shake to coat the chicken. Continue until all the breasts are coated. 3. Place the yogurt in a large bowl, and the cereal on a large plate. Dip each breast in the yogurt and then in the cereal. Place the chicken breasts on a baking sheet sprayed with nonstick cooking spray. 4. Bake for 35 to 45 minutes, until the chicken is brown and cooked through. Do not cover or turn the chicken during the baking process. 5. When the chicken is completely cooked, remove the baking sheet from the oven and let cool ten minutes before serving.\n1. Preheat the oven to 375°F.\n2. In a large plastic bag, combine the thyme, oregano, basil, garlic powder, salt and pepper. Shake well. Add two breasts at a time to the bag and shake to coat the chicken. Continue until all the breasts are coated.\n3. Place the yogurt in a large bowl, and the cereal on a large plate. Dip each breast in the yogurt and then in the cereal. Place the chicken breasts on a baking sheet sprayed with nonstick cooking spray.\n4. Bake for 35 to 45 minutes, until the chicken is brown and cooked through. Do not cover or turn the chicken during the baking process.\n5. When the chicken is completely cooked, remove the baking sheet from the oven and let cool ten minutes before serving.",
        "ingredients": [
            "2 teaspoons dried thyme",
            "2 teaspoons dried oregano",
            "2 teaspoons dried basil",
            "2 teaspoons garlic powder",
            "2 teaspoons kosher salt",
            "2 teaspoons fresh black pepper",
            "6 skinless, boneless chicken breasts",
            "2 cups plain nonfat yogurt",
            "2 cups Special K cereal, crushed with a rolling pin or in a food processor or coffee grinder",
            "Nonstick cooking spray"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 375°F.",
            "In a large plastic bag, combine 0.33 tsp dried thyme, 0.33 tsp dried oregano, 0.33 tsp dried basil, 0.33 tsp garlic powder, 0.33 tsp kosher salt, and 0.33 tsp fresh black pepper. Shake well.",
            "Add one chicken breast to the bag and shake to coat the chicken.",
            "Place 0.33 cup plain nonfat yogurt in a large bowl, and 0.33 cup Special K cereal, crushed, on a large plate.",
            "Dip the coated chicken breast in the yogurt and then in the crushed cereal.",
            "Place the chicken breast on a baking sheet sprayed with nonstick cooking spray.",
            "Bake for 35 to 45 minutes, until the chicken is brown and cooked through.",
            "When the chicken is completely cooked, remove the baking sheet from the oven and let cool for ten minutes before serving."
        ],
        "processed_ingredients": [
            "0.33 teaspoon dried thyme",
            "0.33 teaspoon dried oregano",
            "0.33 teaspoon dried basil",
            "0.33 teaspoon garlic powder",
            "0.33 teaspoon kosher salt",
            "0.33 teaspoon fresh black pepper",
            "1 chicken breast",
            "0.33 cup plain nonfat yogurt",
            "0.33 cup Special K cereal",
            "1 spray nonstick cooking spray"
        ],
        "pure_ingredients": [
            "thyme",
            "oregano",
            "basil",
            "garlic",
            "salt",
            "pepper",
            "chicken",
            "yogurt",
            "cereal",
            "nonstick cooking spray"
        ],
        "cooking_time": "55 minutes",
        "required_tools": [
            "oven",
            "large plastic bag",
            "large bowl",
            "large plate",
            "baking sheet"
        ]
    },
    {
        "recipe_id": "qdnjfzsqRu1nGK77zPAiXCS2SObBl.G",
        "recipe_title": "Chicken with Shallots and Morels ",
        "original_instructions": "Melt 2 tablespoons chicken fat in a large heavy skillet over medium-high heat. Season chicken generously with salt and pepper. Add chicken to skillet and cook, turning once, until golden brown, about 6 minutes per side. Transfer chicken to a plate. Reduce heat to medium. Add remaining chicken fat to skillet. Add shallots and sauté until soft, about 2 minutes. Add mushrooms and sauté until they begin to release liquid, about 1 minute. Using a slotted spoon, transfer mushrooms to a plate. Add wine to skillet and boil until reduced by half, about 2 minutes. Add stock; bring to a boil. Return chicken to skillet, cover with lid slightly ajar, reduce heat to medium-low, and simmer until chicken is cooked through, about 20 minutes. Transfer chicken to a platter. Return mushrooms to skillet; add cream. Simmer, uncovered, until sauce thickens slightly, about 5 minutes. Season to taste with salt and pepper. Pour sauce over chicken and serve.\nMelt 2 tablespoons chicken fat in a large heavy skillet over medium-high heat. Season chicken generously with salt and pepper. Add chicken to skillet and cook, turning once, until golden brown, about 6 minutes per side. Transfer chicken to a plate. Reduce heat to medium. Add remaining chicken fat to skillet. Add shallots and sauté until soft, about 2 minutes. Add mushrooms and sauté until they begin to release liquid, about 1 minute. Using a slotted spoon, transfer mushrooms to a plate. Add wine to skillet and boil until reduced by half, about 2 minutes. Add stock; bring to a boil. Return chicken to skillet, cover with lid slightly ajar, reduce heat to medium-low, and simmer until chicken is cooked through, about 20 minutes.\nTransfer chicken to a platter. Return mushrooms to skillet; add cream. Simmer, uncovered, until sauce thickens slightly, about 5 minutes. Season to taste with salt and pepper. Pour sauce over chicken and serve.",
        "ingredients": [
            "3 tablespoons rendered chicken fat (schmaltz), duck fat, or vegetable oil, divided",
            "1 4-pound free-range organic chicken, backbone removed, cut into 8 pieces",
            "Kosher salt and freshly ground black pepper",
            "1/2 cup minced shallots",
            "1 pound fresh morel mushrooms",
            "1 cup dry white wine",
            "1 cup low-salt chicken stock",
            "1/2 cup heavy whipping cream"
        ],
        "step_by_step_instructions": [
            "Melt 0.5 tablespoon chicken fat in a large heavy skillet over medium-high heat.",
            "Season 1 piece of chicken with salt and pepper.",
            "Add chicken to skillet and cook, turning once, until golden brown, about 6 minutes per side.",
            "Transfer chicken to a plate.",
            "Reduce heat to medium.",
            "Add 0.17 tablespoon chicken fat to skillet.",
            "Add 1 tablespoon minced shallots and sauté until soft, about 2 minutes.",
            "Add 4 ounces morel mushrooms and sauté until they begin to release liquid, about 1 minute.",
            "Using a slotted spoon, transfer mushrooms to a plate.",
            "Add 0.25 cup wine to skillet and boil until reduced by half, about 2 minutes.",
            "Add 0.25 cup chicken stock; bring to a boil.",
            "Return chicken to skillet, cover with lid slightly ajar, reduce heat to medium-low, and simmer until chicken is cooked through, about 20 minutes.",
            "Transfer chicken to a platter.",
            "Return mushrooms to skillet; add 0.13 cup cream.",
            "Simmer, uncovered, until sauce thickens slightly, about 5 minutes.",
            "Season to taste with salt and pepper.",
            "Pour sauce over chicken and serve."
        ],
        "processed_ingredients": [
            "0.67 tablespoon chicken fat",
            "0.5 lb chicken",
            "0.5 teaspoon salt",
            "0.5 teaspoon black pepper",
            "1 tablespoon shallots",
            "4 ounces morel mushrooms",
            "0.25 cup white wine",
            "0.25 cup chicken stock",
            "0.13 cup heavy cream"
        ],
        "pure_ingredients": [
            "chicken fat",
            "chicken",
            "salt",
            "black pepper",
            "shallots",
            "morel mushrooms",
            "white wine",
            "chicken stock",
            "heavy cream"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "large heavy skillet",
            "plate",
            "slotted spoon",
            "lid"
        ]
    },
    {
        "recipe_id": "ecmztULkIFTo./X/xdRTJfnyCddP6YS",
        "recipe_title": "Thin & Crispy Pizza",
        "original_instructions": "Make the dough: Put a pizza stone or inverted baking sheet on the lowest oven rack and preheat to 450 degrees F. Combine the flour, baking powder and salt in a large bowl. Add the water and olive oil and mix to make a shaggy, sticky dough. Turn out onto a lightly floured surface and knead into a smooth and elastic ball, 2 to 3 minutes. Divide the dough in half and shape each half into a flat disk. Wrap each disk in plastic wrap and let rest in a warm place, 15 minutes.\nBrush two large sheets of parchment paper with olive oil. Place a ball of dough between the parchment, oiled-sides in; use a rolling pin to roll the dough into a 12- to 14-inch round, about 1/8 inch thick. Remove the top piece of parchment and transfer the dough (and the bottom piece of parchment) to a pizza peel or inverted baking sheet.\nSpread 1/3 cup sauce on the crust; scatter with 3/4 cup mozzarella. Slide the pizza (on the parchment) onto the hot stone. Bake until the crust is crisp and golden brown and the cheese is bubbling, 10 to 12 minutes. Transfer to a cutting board and let cool 1 to 2 minutes before slicing. Repeat to make the second pizza.\nPhotograph by Levi Brown",
        "ingredients": [
            "2 cups all-purpose flour, plus more for dusting",
            "3/4 teaspoon baking powder",
            "3/4 teaspoon kosher salt",
            "3/4 cup water",
            "3 tablespoons extra-virgin olive oil, plus more for brushing",
            "2/3 cup pizza sauce",
            "1 1/2 cups shredded low-moisture mozzarella cheese (about 6 ounces)"
        ],
        "step_by_step_instructions": [
            "Preheat your oven to 450 degrees F and place a pizza stone or inverted baking sheet on the lowest oven rack.",
            "In a large bowl, combine 1 cup of all-purpose flour, 0.38 teaspoon of baking powder, and 0.38 teaspoon of kosher salt.",
            "Add 0.38 cup of water and 1.5 tablespoons of extra-virgin olive oil to the dry ingredients and mix to form a shaggy, sticky dough.",
            "Transfer the dough to a lightly floured surface and knead until smooth and elastic, about 2 to 3 minutes.",
            "Divide the dough into two equal portions and shape each into a flat disk.",
            "Wrap each disk in plastic wrap and let it rest in a warm place for 15 minutes.",
            "Brush a sheet of parchment paper with olive oil and place one dough disk on it.",
            "Use a rolling pin to roll the dough into a round about 12-14 inches in diameter and 1/8 inch thick.",
            "Remove the top parchment paper and transfer the dough with the bottom parchment to a pizza peel or baking sheet.",
            "Spread approximately 0.33 cup of pizza sauce over the crust.",
            "Scatter about 0.75 cup of shredded mozzarella cheese over the sauce.",
            "Slide the pizza (on the parchment) onto the hot stone in the oven.",
            "Bake the pizza until the crust is crisp and golden brown and the cheese is bubbling, about 10 to 12 minutes.",
            "Once baked, transfer the pizza to a cutting board and let it cool for 1 to 2 minutes before slicing."
        ],
        "processed_ingredients": [
            "1 cup all-purpose flour",
            "0.38 teaspoon baking powder",
            "0.38 teaspoon kosher salt",
            "0.38 cup water",
            "1.5 tablespoon extra-virgin olive oil",
            "0.33 cup pizza sauce",
            "0.75 cup shredded low-moisture mozzarella cheese"
        ],
        "pure_ingredients": [
            "flour",
            "baking powder",
            "salt",
            "water",
            "olive oil",
            "pizza sauce",
            "mozzarella cheese"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "oven",
            "pizza stone or baking sheet",
            "large bowl",
            "rolling pin",
            "plastic wrap",
            "parchment paper",
            "pizza peel or baking sheet",
            "cutting board"
        ]
    },
    {
        "recipe_id": "6GmjiFTNKiBtb5yqeRvaX56tkRMJ8TS",
        "recipe_title": "Spicy Stir-Fried Broccoli Rabe",
        "original_instructions": "Preheat oven to 375 degrees F.\nIn a bowl, combine the lemon juice, soy sauce, basil, oil, vinegar, and lemon zest. Lay the tofu slices in a baking dish that can hold them in a single snug layer. Pour the marinade over the tofu. Bake for 30 minutes, or until the tofu is nearly dry and well browned.\nTo make the broccoli rabe, chop the tender stalks and greens into 2-inch pieces and soak them in a large basin of cold water.\nIn a heavy, wide saute pan over medium heat, warm the oil. Add the garlic and saute gently for 3 to 5 minutes, until golden. Add the red pepper flakes and tofu and saute for 1 minute. Scoop the greens from the water and add them to the pan. Raise the heat and turn the greens over in the oil with a pair of tongs. When the greens begin to simmer, reduce the heat to low and cover. Cook for 10 to 15 minutes, until the greens are tender.\nSeason with salt and pepper and serve drizzled with some of the liquor and garnished with the lemon wedges and garlic cloves.",
        "ingredients": [
            "3 tablespoons freshly squeezed lemon juice",
            "2 tablespoons naturally brewed soy sauce",
            "2 tablespoons freshly chopped basil leaves",
            "2 tablespoons extra-virgin olive oil",
            "1 tablespoon balsamic vinegar",
            "1 teaspoon finely grated lemon zest",
            "1 pound firm tofu, rinsed, patted dry, and sliced 1/2 inch thick",
            "2 pounds broccoli rabe, tough stalks trimmed",
            "4 tablespoons extra-virgin olive oil",
            "8 plump garlic cloves",
            "1/2 teaspoon hot red pepper flakes",
            "Coarse sea salt",
            "Freshly milled black pepper",
            "Lemon wedges, for garnish"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 375 degrees F.",
            "In a bowl, combine 0.5 tablespoons of lemon juice, 0.33 tablespoons of soy sauce, 0.33 tablespoons of chopped basil, 0.33 tablespoons of olive oil, 0.17 tablespoons of balsamic vinegar, and 0.17 teaspoons of lemon zest.",
            "Lay 2 slices of tofu in a baking dish.",
            "Pour the marinade over the tofu and bake for 30 minutes, or until the tofu is nearly dry and well browned.",
            "Chop 0.33 pounds of broccoli rabe into 2-inch pieces and soak in a large basin of cold water.",
            "In a heavy, wide saute pan over medium heat, warm 0.67 tablespoons of olive oil.",
            "Add 1 garlic clove, sliced, and saute gently for 3 to 5 minutes, until golden.",
            "Add 0.08 teaspoons of red pepper flakes and the baked tofu, and saute for 1 minute.",
            "Scoop the broccoli rabe from the water and add to the pan.",
            "Raise the heat and turn the greens over in the oil with a pair of tongs.",
            "When the greens begin to simmer, reduce the heat to low and cover.",
            "Cook for 10 to 15 minutes, until the greens are tender.",
            "Season with salt and pepper to taste and serve drizzled with some of the cooking liquid and garnished with lemon wedges and remaining garlic clove."
        ],
        "processed_ingredients": [
            "0.5 tbsp lemon juice",
            "0.33 tbsp soy sauce",
            "0.33 tbsp basil leaves",
            "0.33 tbsp olive oil",
            "0.17 tbsp balsamic vinegar",
            "0.17 tsp lemon zest",
            "4 oz tofu",
            "0.67 tbsp olive oil",
            "0.33 lb broccoli rabe",
            "1 garlic clove",
            "0.08 tsp red pepper flakes",
            "0.08 tsp salt",
            "0.08 tsp black pepper",
            "0.5 lemon wedges"
        ],
        "pure_ingredients": [
            "lemon juice",
            "soy sauce",
            "basil",
            "olive oil",
            "balsamic vinegar",
            "lemon zest",
            "tofu",
            "broccoli rabe",
            "garlic",
            "red pepper flakes",
            "salt",
            "black pepper",
            "lemon"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "oven",
            "bowl",
            "baking dish",
            "saute pan",
            "tongs"
        ]
    },
    {
        "recipe_id": "0igHW2aL5RdnH3ecfccT2YPBNrxCi.G",
        "recipe_title": "Skirt Steak Fajitas with Grilled Cabbage and Scallions ",
        "original_instructions": "For steak: Purée garlic, lime juice, oil, paprika, cilantro, cumin, salt, and onion powder in a blender until smooth. Transfer marinade to a resealable plastic bag and add steak. Seal bag and turn to coat; chill at least 4 hours. DO AHEAD: Steak can be marinated 1 day ahead. Keep chilled.\nPurée garlic, lime juice, oil, paprika, cilantro, cumin, salt, and onion powder in a blender until smooth. Transfer marinade to a resealable plastic bag and add steak. Seal bag and turn to coat; chill at least 4 hours.\nDO AHEAD: Steak can be marinated 1 day ahead. Keep chilled.\nFor vegetables and assembly: Prepare grill for medium-high heat. (Alternatively, heat a grill pan over medium-high heat.) Drizzle cabbage, white onion, and scallions with 4 tablespoons oil; season with salt and pepper. Grill, turning occasionally, until vegetables are charred and softened, about 4 minutes for scallions, 10–12 minutes for cabbage and onion. Let vegetables cool slightly. Core cabbage and cut into bite-size pieces along with scallions and onion. Toss chopped vegetables in a large bowl with red onion, lime juice, cilantro, and remaining 2 tablespoons oil; season with salt and pepper. Remove steak from marinade, scraping off excess; season with salt and pepper. Grill steak until medium-rare, about 3 minutes per side. Transfer to a cutting board and let rest 5–10 minutes before slicing. Serve steak with vegetables, tortillas, and Dried Chile Salsa.\nPrepare grill for medium-high heat. (Alternatively, heat a grill pan over medium-high heat.) Drizzle cabbage, white onion, and scallions with 4 tablespoons oil; season with salt and pepper. Grill, turning occasionally, until vegetables are charred and softened, about 4 minutes for scallions, 10–12 minutes for cabbage and onion. Let vegetables cool slightly.\nCore cabbage and cut into bite-size pieces along with scallions and onion. Toss chopped vegetables in a large bowl with red onion, lime juice, cilantro, and remaining 2 tablespoons oil; season with salt and pepper.\nRemove steak from marinade, scraping off excess; season with salt and pepper. Grill steak until medium-rare, about 3 minutes per side. Transfer to a cutting board and let rest 5–10 minutes before slicing. Serve steak with vegetables, tortillas, and Dried Chile Salsa.",
        "ingredients": [
            "4 garlic cloves, peeled",
            "1/4 cup fresh lime juice",
            "1/4 cup olive oil",
            "3 tablespoons hot smoked Spanish paprika",
            "2 tablespoons chopped fresh cilantro",
            "1 tablespoon ground cumin",
            "1 teaspoon kosher salt",
            "1 teaspoon onion powder",
            "2 pounds skirt steak, cut into 4 equal pieces",
            "1/2 medium head green cabbage, cut into 2 wedges, core intact",
            "1 large white onion, halved with some root end attached",
            "1 bunch scallions, trimmed",
            "6 tablespoons olive oil, divided",
            "Kosher salt, freshly ground pepper",
            "1 freshly ground pepper",
            "1/4 small red onion, finely chopped",
            "3 tablespoons fresh lime juice",
            "1 tablespoon chopped fresh cilantro",
            "Warm flour tortillas (for serving)",
            "Dried Chile Salsa"
        ],
        "step_by_step_instructions": [
            "Purée 0.5 garlic cloves, 1 tablespoon lime juice, 1 tablespoon olive oil, 0.75 tablespoon paprika, 0.5 tablespoon cilantro, 0.25 tablespoon cumin, 0.25 teaspoon salt, and 0.25 teaspoon onion powder in a blender until smooth.",
            "Transfer marinade to a resealable plastic bag and add 0.5 pound skirt steak. Seal bag and turn to coat; chill for at least 4 hours.",
            "Prepare grill for medium-high heat. Drizzle 0.12 medium head cabbage, 0.25 large white onion, and 2-3 scallions with 1 tablespoon olive oil; season with salt and pepper.",
            "Grill vegetables, turning occasionally, until charred and softened, about 4 minutes for scallions, 10–12 minutes for cabbage and onion.",
            "Let vegetables cool slightly. Core cabbage and cut into bite-size pieces along with scallions and onion.",
            "Toss chopped vegetables in a large bowl with 0.06 small red onion, 0.75 tablespoon lime juice, 0.25 tablespoon cilantro, and 0.5 tablespoon olive oil; season with salt and pepper.",
            "Remove steak from marinade, scraping off excess; season with salt and pepper.",
            "Grill steak until medium-rare, about 3 minutes per side.",
            "Transfer steak to a cutting board and let rest 5–10 minutes before slicing.",
            "Serve steak with vegetables, warm flour tortillas, and Dried Chile Salsa."
        ],
        "processed_ingredients": [
            "0.5 cloves garlic",
            "1 tablespoon lime juice",
            "1.5 tablespoons olive oil",
            "0.75 tablespoons paprika",
            "0.5 tablespoons cilantro",
            "0.25 tablespoons cumin",
            "0.25 teaspoons salt",
            "0.25 teaspoons onion powder",
            "0.5 pounds skirt steak",
            "0.12 medium head cabbage",
            "0.25 large white onion",
            "2-3 scallions",
            "0.06 small red onion",
            "1 warm flour tortilla"
        ],
        "pure_ingredients": [
            "garlic",
            "lime",
            "olive",
            "paprika",
            "cilantro",
            "cumin",
            "salt",
            "onion",
            "steak",
            "cabbage",
            "scallion",
            "flour",
            "salsa"
        ],
        "cooking_time": "5 hours",
        "required_tools": [
            "blender",
            "resealable plastic bag",
            "grill or grill pan",
            "cutting board"
        ]
    },
    {
        "recipe_id": "eYNP2Ess0GVRshv7mkJx7bCFArDNxUe",
        "recipe_title": "Spicy Barbequed Beef Sandwiches",
        "original_instructions": "To cook en papillote (on the grill, enclosed in foil), preheat grill to medium-high heat.\nRinse beef to remove any unwanted smells, pat dry with paper toweling and season with garlic powder and salt and pepper, and set aside briefly. Make an oven pouch out of a 3 foot length of heavy duty foil by bringing the 2 ends to the center, folding the sides to seal, and leaving an opening at the top center through which to place the sauce and beef. Shake flour in the pouch to coat the inside. Sear all sides of beef on the grill, then put beef in pouch and pour 1/2 cup of the barbecue sauce and 1 tablespoon of the hot sauce over the meat (reserving the rest of the barbeque sauce and hot sauce). Seal the foil pouch by folding shut. Grill bagged beef directly on grill for about 30 minutes per pound. Ideally this should be cooked until fork tender, so that you can pull it apart with a fork.\nLet beef rest 10 minutes before carving into thin slices, or pulling it apart with a fork. Heat the reserved barbeque sauce and hot sauce in a small saucepan. Then chop or shred the sliced beef and serve on Kaiser rolls or crusty Italian rolls. Spoon a bit of the extra sauce over the meat.",
        "ingredients": [
            "1 (2 1/2 to 3-pound) beef chuck pot roast, or other cut suitable for roasting",
            "1 tablespoon garlic powder",
            "Salt",
            "Freshly ground black pepper",
            "1 tablespoon all-purpose flour",
            "1 cup barbecue sauce, divided",
            "2 tablespoons hot sauce, divided",
            "12 Kaiser rolls or crusty Italian rolls, sliced"
        ],
        "step_by_step_instructions": [
            "Preheat grill to medium-high heat.",
            "Rinse a portion of beef, approximately 0.25 lb, to remove any unwanted smells, pat dry with paper toweling.",
            "Season with about 0.08 tablespoon garlic powder and a pinch of salt and freshly ground black pepper.",
            "Set aside briefly.",
            "Make an oven pouch out of a piece of heavy-duty foil large enough to enclose the beef portion.",
            "Shake a small pinch of flour in the pouch to coat the inside.",
            "Sear all sides of the beef on the grill for a few minutes until browned.",
            "Put the beef in the pouch and pour about 0.04 cup of barbecue sauce and 0.02 tablespoon of hot sauce over the meat.",
            "Seal the foil pouch by folding shut.",
            "Grill bagged beef directly on grill for about 30 minutes.",
            "Let beef rest for 10 minutes before carving into thin slices or pulling it apart with a fork.",
            "Heat the remaining barbecue sauce and hot sauce in a small saucepan.",
            "Chop or shred the sliced beef and serve on one Kaiser roll or crusty Italian roll.",
            "Spoon a bit of the extra sauce over the meat."
        ],
        "processed_ingredients": [
            "0.25 lb beef chuck pot roast",
            "0.08 tbsp garlic powder",
            "0.01 tbsp salt",
            "0.01 tbsp freshly ground black pepper",
            "0.01 tbsp all-purpose flour",
            "0.04 cup barbecue sauce",
            "0.02 tbsp hot sauce",
            "1 Kaiser roll"
        ],
        "pure_ingredients": [
            "beef",
            "garlic powder",
            "salt",
            "black pepper",
            "flour",
            "barbecue sauce",
            "hot sauce",
            "Kaiser roll"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "grill",
            "heavy-duty foil",
            "paper towels",
            "small saucepan"
        ]
    },
    {
        "recipe_id": "7zCl8Bj2SV45uxTgoOgEvcIgqc5Lp5C",
        "recipe_title": "Grilled Rosemary Steaks",
        "original_instructions": "For the steaks: In a baking dish, sprinkle the steaks on both sides with the salt and pepper and drizzle with the oil. Place the rosemary in the dish and allow to marinate on the counter at room temperature for 1 hour, turning the steaks halfway through to infuse all over with rosemary.\nFor the rosemary butter: In a saucepan over medium-low heat, add the butter and salt. Stir to melt the butter and dissolve the salt, then add the rosemary. Continue cooking on low until the butter is fragrant from the rosemary, 10 to 12 minutes. Remove the rosemary and discard.\nPreheat a grill or grill pan to high heat. Remove the steaks from the baking dish, discard the rosemary and place the steaks directly on the grill. Cook for about 5 minutes on both sides for medium-rare. Remove from the grill and allow to rest under loosely fitted aluminum foil for 10 minutes.\nUsing the direction of the muscles as a guide, thinly slice the meat against the grain into strips and place on a serving dish. Pour the infused butter over the meat and serve.",
        "ingredients": [
            "4 (1 pound) New York strip steaks, 1-inch thick",
            "2 teaspoons salt",
            "1/4 teaspoon freshly ground black pepper",
            "2 tablespoons vegetable oil",
            "2 sprigs fresh rosemary, cut in half",
            "6 tablespoons butter",
            "1 teaspoon salt",
            "3 sprigs fresh rosemary"
        ],
        "step_by_step_instructions": [
            "Sprinkle 1 steak on both sides with 0.50 teaspoon salt and 0.06 teaspoon freshly ground black pepper.",
            "Drizzle the steak with 0.50 tablespoon vegetable oil.",
            "Place 1 half-sprig fresh rosemary in the dish with the steak.",
            "Allow the steak to marinate on the counter at room temperature for 1 hour, turning the steak halfway through.",
            "In a saucepan over medium-low heat, add 1.50 tablespoons butter and 0.25 teaspoon salt.",
            "Stir to melt the butter and dissolve the salt, then add 0.75 sprig fresh rosemary.",
            "Continue cooking on low until the butter is fragrant from the rosemary, 10 to 12 minutes.",
            "Remove the rosemary from the butter and discard.",
            "Preheat a grill or grill pan to high heat.",
            "Remove the steak from the baking dish, discard the rosemary, and place the steak directly on the grill.",
            "Cook for about 5 minutes on each side for medium-rare.",
            "Remove from the grill and allow to rest under loosely fitted aluminum foil for 10 minutes.",
            "Thinly slice the steak against the grain into strips and place on a serving dish.",
            "Pour the infused butter over the meat and serve."
        ],
        "processed_ingredients": [
            "1 steak New York strip steak",
            "0.50 teaspoon salt",
            "0.06 teaspoon freshly ground black pepper",
            "0.50 tablespoon vegetable oil",
            "0.50 sprig fresh rosemary",
            "1.50 tablespoon butter",
            "0.25 teaspoon salt",
            "0.75 sprig fresh rosemary"
        ],
        "pure_ingredients": [
            "New York strip steak",
            "salt",
            "black pepper",
            "vegetable oil",
            "rosemary",
            "butter"
        ],
        "cooking_time": "1 hour 30 minutes",
        "required_tools": [
            "baking dish",
            "saucepan",
            "grill",
            "aluminum foil",
            "serving dish"
        ]
    },
    {
        "recipe_id": "7nzmdkcxg83vlQdRq/QLrzewq2XvJT2",
        "recipe_title": "Classic Manicotti",
        "original_instructions": "Preheat oven to 350 degrees F. First, make the marinara sauce. In a saucepan heat oil. Add onion and cook for 3 minutes. Add garlic and cook for 2 minutes more. Add tomatoes, pinch of sugar, salt and pepper and simmer, covered, stirring occasionally, for 20 minutes. Puree the mixture through the fine disk of a food mill and then return to the saucepan. Reduce for 15 minutes. Meanwhile, make your filling. In a bowl mix together ricotta cheese, Parmesan cheese, egg yolk, minced basil, parsley, nutmeg, salt and pepper to taste. Fill your manicotti tubes with the filling mixture. When all the tubes are filled place them in a baking dish. Spoon marinara sauce over the tubes and sprinkle with mozzarella cheese. (Can be refrigerated for several hours or overnight at this point or may be frozen.) When ready to cook, place in the oven and bake, covered for 20 minutes. Uncover and bake for 5 to 10 minutes longer, or until bubbling and heated through. Serve each portion with a sprig of fresh basil.",
        "ingredients": [
            "1/3 cup olive oil",
            "1 cup minced onions",
            "3 cloves garlic, minced",
            "2 pounds ripe tomatoes, cored and cut into 1-inch pieces or 2 (28-ounce) cans plum tomatoes, drained",
            "Pinch of sugar",
            "Salt and pepper",
            "8 large pasta tubes",
            "1 pound fresh ricotta cheese",
            "2/3 cup freshly grated Parmesan cheese",
            "1 egg yolk",
            "2 tablespoons minced fresh basil",
            "2 tablespoons minced fresh parsley",
            "Freshly grated nutmeg to taste",
            "Salt and pepper to taste",
            "8 ounces grated Mozzarella cheese",
            "4 sprigs of basil-garnish"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Heat 2 teaspoons of olive oil in a saucepan over medium heat.",
            "Add 2 tablespoons of minced onions and cook for 3 minutes.",
            "Add 1 clove of minced garlic and cook for 2 minutes more.",
            "Add 7 ounces of ripe tomatoes, a pinch of sugar, a pinch of salt, and a pinch of pepper. Simmer, covered, stirring occasionally, for 20 minutes.",
            "Puree the mixture through a fine disk of a food mill and return to the saucepan. Reduce for 15 minutes.",
            "In a bowl, mix together 2 ounces of ricotta cheese, 1 tablespoon of grated Parmesan cheese, 1/8 of an egg yolk, 1 teaspoon of minced basil, 1 teaspoon of minced parsley, a small pinch of freshly grated nutmeg, and a pinch of salt and pepper.",
            "Fill 1 large pasta tube with the ricotta filling mixture.",
            "Place the filled pasta tube in a baking dish.",
            "Spoon a portion of the marinara sauce over the tube and sprinkle with 1 ounce of mozzarella cheese.",
            "Place in the oven and bake, covered, for 20 minutes.",
            "Uncover and bake for an additional 5 to 10 minutes, or until bubbling and heated through.",
            "Serve with a sprig of fresh basil."
        ],
        "processed_ingredients": [
            "2 tsp olive oil",
            "2 tbsp minced onions",
            "1 clove garlic",
            "7 oz ripe tomatoes",
            "1 pinch sugar",
            "1 pinch salt",
            "1 pinch pepper",
            "1 large pasta tube",
            "2 oz ricotta cheese",
            "1 tbsp Parmesan cheese",
            "0.13 egg yolk",
            "1 tsp basil",
            "1 tsp parsley",
            "1 pinch nutmeg",
            "1 oz Mozzarella cheese",
            "1 sprig basil"
        ],
        "pure_ingredients": [
            "olive oil",
            "onions",
            "garlic",
            "tomatoes",
            "sugar",
            "salt",
            "pepper",
            "pasta",
            "ricotta cheese",
            "Parmesan cheese",
            "egg",
            "basil",
            "parsley",
            "nutmeg",
            "Mozzarella cheese"
        ],
        "cooking_time": "75 minutes",
        "required_tools": [
            "saucepan",
            "food mill",
            "bowl",
            "baking dish",
            "oven"
        ]
    },
    {
        "recipe_id": "qkp.OODkDEFMx0Td8vdA5CO0lVJJzHS",
        "recipe_title": "Sichuan Pepper-Salt Roast Chicken ",
        "original_instructions": "Preheat oven to 425°F with rack in middle. Finely grind peppercorns with salt in grinder. Pat chicken dry, then rub with olive oil and 2 teaspoons pepper-salt (reserve remainder). Transfer to a rack set over a roasting pan. Pour 1 cup water into bottom of pan and roast chicken until skin is golden and crisp and a thermometer inserted into thickest part of thigh (do not touch bone) registers 170°F, 50 minutes to 1 hour. Transfer chicken to a platter and let rest 10 minutes. Serve chicken with remaining pepper-salt on the side.\nPreheat oven to 425°F with rack in middle.\nFinely grind peppercorns with salt in grinder.\nPat chicken dry, then rub with olive oil and 2 teaspoons pepper-salt (reserve remainder). Transfer to a rack set over a roasting pan. Pour 1 cup water into bottom of pan and roast chicken until skin is golden and crisp and a thermometer inserted into thickest part of thigh (do not touch bone) registers 170°F, 50 minutes to 1 hour.\nTransfer chicken to a platter and let rest 10 minutes. Serve chicken with remaining pepper-salt on the side.",
        "ingredients": [
            "1 tablespoon Sichuan peppercorns, toasted",
            "2 teaspoons coarse salt",
            "1 whole chicken (about 3 1/2 pound)",
            "1 tablespoon olive oil",
            "an electric coffee/spice grinder; an instant-read thermometer"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 425°F with rack in middle.",
            "Finely grind 0.25 tablespoon Sichuan peppercorns with 0.5 teaspoon salt in grinder.",
            "Pat chicken dry, then rub with 0.25 tablespoon olive oil and 0.5 teaspoon pepper-salt.",
            "Transfer to a rack set over a roasting pan.",
            "Pour 0.25 cup water into bottom of pan and roast chicken until skin is golden and crisp and a thermometer inserted into thickest part of thigh (do not touch bone) registers 170°F, about 50 minutes.",
            "Transfer chicken to a platter and let rest 10 minutes.",
            "Serve chicken with remaining pepper-salt on the side."
        ],
        "processed_ingredients": [
            "0.25 tablespoon Sichuan peppercorns",
            "0.5 teaspoon salt",
            "14 ounce chicken",
            "0.25 tablespoon olive oil"
        ],
        "pure_ingredients": [
            "Sichuan peppercorns",
            "salt",
            "chicken",
            "olive oil",
            "water"
        ],
        "cooking_time": "60 minutes",
        "required_tools": [
            "oven",
            "coffee/spice grinder",
            "instant-read thermometer",
            "roasting pan",
            "rack"
        ]
    },
    {
        "recipe_id": "1p/LiT2McrsjKA1FMPMNcpEoDdzO7iW",
        "recipe_title": "Grilled Pizzetta with Ricotta, Sausage, Arugula and Chili Oil",
        "original_instructions": "For the chili oil: Bring the chilies and oil to a simmer in a small saucepan; remove from the heat and let the peppers steep in the oil for at least an hour or until the dough has risen and you're ready to make the pizzas. This can be done way in advance.\nFor the dough: In a small bowl, add 1/2 cup warm water (if the water is too hot the yeast will die and if the water is too cold the yeast will not activate). Add the dry yeast and sugar, stir to combine and let sit for 15 minutes. The top of the water will bubble and it will smell very yeasty; this is what you want.\nIn a large mixing bowl, combine the flour and salt. Make a well in the center of the flour and add the olive oil and the yeast/water mixture. Using a fork, gradually stir the flour into the yeast/water mix. Once most of the flour has combined, turn the dough out to a smooth, clean work surface dusted with flour and use your hands to knead the dough to a smooth consistency.\nLightly coat the mixing bowl with oil, return the dough to the bowl, cover with plastic wrap and set in a warm place until the dough has doubled in size, at least 1 hour.\nFor the pizza topping: Coat a large saute pan with oil, add the sausage and bring to medium heat. Cook the sausage until brown, 10 to 15 minutes. Remove with a slotted spoon and reserve.\nWhile the sausage cooks, mix together in a medium bowl the ricotta, Parmigiano-Reggiano and oregano.\nPreheat the oven to 425 degrees F and preheat a grill.\nWhen the dough is ready, portion it into six golf-ball-size pieces. (If you're not using the dough right away, wrap each ball individually in plastic and refrigerate until ready to use.) Dust a work surface with flour and roll each piece of dough into a rectangle (or whatever shape you like; I like irregular shapes).\nBrush the grill with oil and arrange each piece of dough on the grill; you might need to work in batches here. Grill until the dough is stiff and crisp and has lovely grill marks on it, then flip and repeat on the second side, moving occasionally so the bottom doesn't burn.\nPut the pizzas on baking sheets, smear each with some of the ricotta mixture, top with sausage and put as many pizzas as will comfortably fit in the oven; bake until the cheese has melted, 3 to 4 minutes. Again, you may have to work in batches. Remove the pizzas from the oven, top with arugula and drizzle with the deliciously spicy chili oil!",
        "ingredients": [
            "5 to 6 Fresno chili peppers, roughly chopped",
            "1 1/2 cups extra-virgin olive oil",
            "1 1/2 teaspoons dry yeast",
            "1/2 teaspoon sugar",
            "1 1/2 cups all-purpose flour, plus more for dusting",
            "1/2 teaspoon kosher salt",
            "2 tablespoons extra-virgin olive oil, plus more for coating bowl and grill",
            "Extra-virgin olive oil, for coating pan",
            "8 ounces sweet Italian sausage, casings removed",
            "1 cup ricotta",
            "1/2 cup grated Parmigiano-Reggiano",
            "1 sprig fresh oregano, leaves removed and gently chopped",
            "1 bunch of arugula, trimmed"
        ],
        "step_by_step_instructions": [
            "For the chili oil, take approximately 1 Fresno chili pepper and roughly chop it. Combine with around 0.25 cup extra-virgin olive oil in a small saucepan. Bring to a simmer, then remove from heat and let steep for at least 1 hour.",
            "In a small bowl, add about 0.08 cup warm water, along with roughly 0.25 teaspoon dry yeast and a pinch of sugar. Stir to combine and let sit for 15 minutes until bubbly.",
            "In a large mixing bowl, combine approximately 0.25 cup all-purpose flour with a pinch of kosher salt. Make a well in the center, add about 0.33 tablespoon extra-virgin olive oil and the yeast mixture, and gradually stir to form a dough.",
            "Knead the dough on a floured surface until smooth. Coat the mixing bowl with a bit of oil, place the dough back in, cover, and let rise in a warm place for at least 1 hour until doubled in size.",
            "Coat a large saute pan with a small amount of oil. Add about 1.33 ounces of sweet Italian sausage (with casings removed) and cook over medium heat until browned, around 10-15 minutes. Remove with a slotted spoon and reserve.",
            "In a medium bowl, mix approximately 0.17 cup ricotta, 0.08 cup grated Parmigiano-Reggiano, and a few chopped fresh oregano leaves.",
            "Preheat the oven to 425 degrees F and preheat a grill.",
            "Divide the dough into one portion (about 1/6 of the total dough), roll out into a rectangle on a floured surface.",
            "Brush the grill with oil and grill the dough until stiff and crisp with grill marks, then flip and repeat on the second side.",
            "Place the grilled dough on a baking sheet. Smear with the ricotta mixture, top with the cooked sausage, and bake in the oven for 3 to 4 minutes until the cheese melts.",
            "Remove from oven, top with a handful of arugula, and drizzle with the prepared chili oil."
        ],
        "processed_ingredients": [
            "1 Fresno chili pepper",
            "0.25 cup extra-virgin olive oil",
            "0.25 teaspoon dry yeast",
            "0.08 teaspoon sugar",
            "0.25 cup all-purpose flour",
            "0.08 teaspoon kosher salt",
            "0.33 tablespoon extra-virgin olive oil",
            "1.33 ounces sweet Italian sausage",
            "0.17 cup ricotta",
            "0.08 cup grated Parmigiano-Reggiano",
            "0.17 teaspoon fresh oregano leaves",
            "0.17 bunch arugula"
        ],
        "pure_ingredients": [
            "chili pepper",
            "olive oil",
            "yeast",
            "sugar",
            "flour",
            "salt",
            "sausage",
            "ricotta",
            "Parmigiano-Reggiano",
            "oregano",
            "arugula"
        ],
        "cooking_time": "120 minutes",
        "required_tools": [
            "small saucepan",
            "mixing bowls",
            "fork",
            "saute pan",
            "slotted spoon",
            "grill",
            "baking sheet",
            "oven"
        ]
    },
    {
        "recipe_id": "rMRKp3h6QI0J7dQdHCch.NdxnUPmcNy",
        "recipe_title": "Lettuce Cups with Tofu and Beef",
        "original_instructions": "Watch how to make this recipe.\nIn a bowl, whisk together chili-garlic sauce, sesame oil, soy sauce, hoisin sauce, vinegar and sherry.\nSlice the tofu into 1/2-inch thick slabs and lay the slices on top of paper towels. Use more paper towels to firmly pat the tofu in order to remove as much water as possible. This should take about 2 minutes and use about 3 paper towels. Finely mince dried tofu and set aside.\nHeat the oil in a wok or extra-large skillet over medium heat. Add the ginger and scallion whites and cook until scallion whites are translucent and ginger is fragrant, about 2 to 3 minutes. Add ground beef and tofu and cook, stirring, until beef is opaque and just cooked through, about 4 to 5 minutes. Add reserved sauce. Reduce heat to a simmer and cook, stirring, an additional 3 to 4 minutes. Add water chestnuts and stir to incorporate.\nFill each lettuce leaf with the filling. Serve garnished with scallion greens, red peppers and peanuts.",
        "ingredients": [
            "1 tablespoons bottled chili-garlic sauce",
            "1 1/2 teaspoons toasted sesame oil",
            "3 tablespoons low-sodium soy sauce",
            "1/4 cup hoisin sauce",
            "2 tablespoons rice vinegar",
            "2 tablespoons sherry or Chinese cooking wine",
            "8 ounces extra-firm tofu",
            "2 teaspoons canola oil",
            "2 tablespoons fresh minced ginger",
            "4 scallions, greens trimmed and reserved, thinly sliced (about 1/3 cup each greens and whites - 3/4-ounce each)",
            "1/2 pound lean ground beef (90 percent or leaner)",
            "1/2 cup finely diced water chestnuts",
            "1 large head Bibb lettuce, outer leaves discarded, leaves separated",
            "1 red bell pepper, finely diced",
            "1/4 cup chopped peanuts"
        ],
        "step_by_step_instructions": [
            "In a small bowl, whisk together 0.17 tablespoons chili-garlic sauce, 0.25 teaspoons sesame oil, 0.5 tablespoons soy sauce, 0.06 cup hoisin sauce, 0.33 tablespoons rice vinegar, and 0.33 tablespoons sherry.",
            "Slice 1 ounce of tofu into 0.5-inch thick slabs and lay the slices on top of paper towels. Use more paper towels to firmly pat the tofu to remove as much water as possible. This should take about 2 minutes.",
            "Finely mince the dried tofu and set aside.",
            "Heat 0.25 teaspoons canola oil in a wok or extra-large skillet over medium heat.",
            "Add 0.33 tablespoons minced ginger and 0.5 tablespoons scallion whites. Cook until scallion whites are translucent and ginger is fragrant, about 2 to 3 minutes.",
            "Add 2 ounces ground beef and the minced tofu to the pan. Cook, stirring, until beef is opaque and just cooked through, about 4 to 5 minutes.",
            "Add the reserved sauce to the pan. Reduce heat to a simmer and cook, stirring, an additional 3 to 4 minutes.",
            "Add 0.06 cup finely diced water chestnuts and stir to incorporate.",
            "Fill 2 lettuce leaves with the filling.",
            "Serve garnished with 0.06 ounce scallion greens, 0.06 cup diced red peppers, and 0.06 cup chopped peanuts."
        ],
        "processed_ingredients": [
            "0.17 tablespoons chili-garlic sauce",
            "0.25 teaspoons sesame oil",
            "0.5 tablespoons soy sauce",
            "0.06 cup hoisin sauce",
            "0.33 tablespoons rice vinegar",
            "0.33 tablespoons sherry",
            "1 ounce tofu",
            "0.25 teaspoons canola oil",
            "0.33 tablespoons ginger",
            "0.5 tablespoons scallions",
            "2 ounces ground beef",
            "0.06 cup water chestnuts",
            "2 leaves lettuce",
            "0.06 cup red bell pepper",
            "0.06 cup peanuts"
        ],
        "pure_ingredients": [
            "chili-garlic sauce",
            "sesame oil",
            "soy sauce",
            "hoisin sauce",
            "vinegar",
            "sherry",
            "tofu",
            "canola oil",
            "ginger",
            "scallions",
            "beef",
            "water chestnuts",
            "lettuce",
            "bell pepper",
            "peanuts"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "bowl",
            "paper towels",
            "wok",
            "skillet"
        ]
    },
    {
        "recipe_id": "t9eGJhRHllXAbUUMKOW/g20HIHPWAXK",
        "recipe_title": "Apple Spice Cake With Brown Sugar Glaze ",
        "original_instructions": "For cake: Position rack in center of oven and preheat to 325F. Spray 12-cup Bundt pan with nonstick spray. Sift flour and next 6 ingredients into medium bowl. Drain grated apples in strainer. Using hands or kitchen towel, squeeze out excess liquid from apples. Measure 2 cups grated apples. Using electric mixer, beat butter, both sugars, and lemon peel in large bowl until fluffy. Beat in eggs, 1 at a time. Mix in vanilla and lemon juice. Beat in flour mixture. Mix in grated apples. Transfer batter to prepared pan. Bake cake until tester inserted near center comes out clean, about 1 hour. Cool in pan on rack 20 minutes.\nPosition rack in center of oven and preheat to 325F. Spray 12-cup Bundt pan with nonstick spray. Sift flour and next 6 ingredients into medium bowl. Drain grated apples in strainer. Using hands or kitchen towel, squeeze out excess liquid from apples. Measure 2 cups grated apples.\nUsing electric mixer, beat butter, both sugars, and lemon peel in large bowl until fluffy. Beat in eggs, 1 at a time. Mix in vanilla and lemon juice. Beat in flour mixture. Mix in grated apples. Transfer batter to prepared pan. Bake cake until tester inserted near center comes out clean, about 1 hour. Cool in pan on rack 20 minutes.\nMeanwhile, prepare glaze: Stir all ingredients in small nonstick skillet over medium-high heat until sugar dissolves and mixture comes to boil. Reduce heat to medium; whisk until glaze is smooth, about 1 minute. Remove from heat. Invert cake onto rack set over baking sheet. Using small skewer, pierce holes all over top of warm cake. Pour glaze over top, allowing it to be absorbed before adding more. Cool cake 30 minutes. Serve warm or at room temperature.\nStir all ingredients in small nonstick skillet over medium-high heat until sugar dissolves and mixture comes to boil. Reduce heat to medium; whisk until glaze is smooth, about 1 minute. Remove from heat. Invert cake onto rack set over baking sheet. Using small skewer, pierce holes all over top of warm cake. Pour glaze over top, allowing it to be absorbed before adding more. Cool cake 30 minutes. Serve warm or at room temperature.",
        "ingredients": [
            "Nonstick vegetable oil spray",
            "3 cups all purpose flour",
            "1 teaspoon baking soda",
            "1 teaspoon ground cinnamon",
            "3/4 teaspoon salt",
            "1/2 teaspoon ground nutmeg",
            "1/4 teaspoon ground cloves",
            "1/4 teaspoon ground allspice",
            "1 3/4 pounds Granny Smith apples, peeled, cored, coarsely grated",
            "1 1/2 cups (3 sticks) unsalted butter, room temperature",
            "1 1/2 cups sugar",
            "1/2 cup (packed) golden brown sugar",
            "1 teaspoon grated lemon peel",
            "3 large eggs",
            "1 teaspoon vanilla extract",
            "1 teaspoon fresh lemon juice",
            "1/2 cup (packed) golden brown sugar",
            "1/4 cup (1/2 stick) unsalted butter",
            "1/4 cup whipping cream",
            "1/2 teaspoon vanilla extract",
            "1/2 teaspoon fresh lemon juice",
            "1/4 teaspoon salt"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 325F and spray a 12-cup Bundt pan with nonstick spray.",
            "Sift together 0.5 cup of flour, 0.17 teaspoon of baking soda, 0.17 teaspoon of ground cinnamon, 0.13 teaspoon of salt, 0.08 teaspoon of ground nutmeg, 0.04 teaspoon of ground cloves, and 0.04 teaspoon of ground allspice into a medium bowl.",
            "Drain 0.3 pound of grated apples using a strainer, then squeeze out excess liquid using hands or a kitchen towel.",
            "Using an electric mixer, beat 0.25 cup of butter, 0.25 cup of sugar, 0.08 cup of brown sugar, and 0.17 teaspoon of grated lemon peel in a large bowl until fluffy.",
            "Beat in 0.5 egg at a time into the mixture.",
            "Mix in 0.17 teaspoon of vanilla extract and 0.17 teaspoon of fresh lemon juice.",
            "Beat in the flour mixture from step 2 into the wet mixture.",
            "Mix in the grated apples from step 3.",
            "Transfer the batter to the prepared Bundt pan and bake until a tester inserted near the center comes out clean, about 1 hour.",
            "Cool the cake in the pan on a rack for 20 minutes.",
            "Meanwhile, prepare the glaze by stirring 0.08 cup of brown sugar, 0.04 cup of butter, 0.04 cup of whipping cream, 0.08 teaspoon of vanilla extract, 0.08 teaspoon of fresh lemon juice, and 0.04 teaspoon of salt in a small nonstick skillet over medium-high heat until the sugar dissolves and the mixture comes to a boil.",
            "Reduce the heat to medium and whisk until the glaze is smooth, about 1 minute. Remove from heat.",
            "Invert the cake onto a rack set over a baking sheet.",
            "Using a small skewer, pierce holes all over the top of the warm cake.",
            "Pour the glaze over the top, allowing it to be absorbed before adding more.",
            "Cool the cake for 30 minutes, then serve warm or at room temperature."
        ],
        "processed_ingredients": [
            "0.5 cup all purpose flour",
            "0.17 teaspoon baking soda",
            "0.17 teaspoon ground cinnamon",
            "0.13 teaspoon salt",
            "0.08 teaspoon ground nutmeg",
            "0.04 teaspoon ground cloves",
            "0.04 teaspoon ground allspice",
            "0.3 pound Granny Smith apples",
            "0.25 cup unsalted butter",
            "0.25 cup sugar",
            "0.08 cup golden brown sugar",
            "0.17 teaspoon grated lemon peel",
            "0.5 large egg",
            "0.17 teaspoon vanilla extract",
            "0.17 teaspoon fresh lemon juice",
            "0.08 cup golden brown sugar",
            "0.04 cup unsalted butter",
            "0.04 cup whipping cream",
            "0.08 teaspoon vanilla extract",
            "0.08 teaspoon fresh lemon juice",
            "0.04 teaspoon salt"
        ],
        "pure_ingredients": [
            "flour",
            "baking soda",
            "cinnamon",
            "salt",
            "nutmeg",
            "cloves",
            "allspice",
            "apples",
            "butter",
            "sugar",
            "brown sugar",
            "lemon peel",
            "eggs",
            "vanilla extract",
            "lemon juice",
            "whipping cream"
        ],
        "cooking_time": "110 minutes",
        "required_tools": [
            "oven",
            "Bundt pan",
            "sifter",
            "strainer",
            "electric mixer",
            "large bowl",
            "small nonstick skillet",
            "baking sheet",
            "skewer"
        ]
    },
    {
        "recipe_id": "g5cEpQAwFvpsn8GCsPkzJQqgxh5YgkC",
        "recipe_title": "Broccoli Pasta with Capicola",
        "original_instructions": "Bring a large pot of salted water to a boil. Add the broccoli florets and stems and cook until tender but still bright green, about 3 minutes. Remove to a bowl using a slotted spoon; set aside. Return the water to a boil, then add the pasta and cook as the label directs. Reserve 2 cups cooking water, then drain the pasta and set aside.\nHeat the olive oil in the empty pot over medium heat. Add the garlic and cook until slightly softened, about 1 minute. Add the broccoli stems, half of the florets and 1 cup of the reserved cooking water. Cover and cook until very soft, about 12 minutes.\nReturn the pasta to the pot along with another 1/2 cup of the reserved cooking water. Add the remaining broccoli florets, half of the ricotta salata, and the herbs and scallions; stir to combine, adding more cooking water to loosen, if needed. Top each serving with the capicola and the remaining ricotta salata.\nPhotograph by Charles Masters",
        "ingredients": [
            "Kosher salt",
            "1 large bunch broccoli, cut into florets, stems peeled and thinly sliced",
            "10 ounces fusilli pasta",
            "1 tablespoon extra-virgin olive oil",
            "4 cloves garlic, chopped",
            "1 cup crumbled ricotta salata cheese (about 4 ounces)",
            "2 tablespoons chopped fresh dill, mint, basil, parsley and/or chives",
            "2 tablespoons chopped scallions",
            "2 ounces deli-sliced capicola or coppa ham, cut into strips"
        ],
        "step_by_step_instructions": [
            "Bring a large pot of salted water to a boil.",
            "Add approximately 2.5 ounces of broccoli florets and stems to the pot and cook until tender but still bright green, about 3 minutes.",
            "Remove the broccoli to a bowl using a slotted spoon and set aside.",
            "Return the water to a boil, then add about 2.5 ounces of fusilli pasta and cook as the label directs.",
            "Reserve 0.5 cup of cooking water, then drain the pasta and set aside.",
            "Heat 0.25 tablespoon of olive oil in the empty pot over medium heat.",
            "Add 1 clove of chopped garlic to the pot and cook until slightly softened, about 1 minute.",
            "Add the broccoli stems, half of the broccoli florets, and 0.25 cup of the reserved cooking water to the pot.",
            "Cover and cook until very soft, about 12 minutes.",
            "Return the pasta to the pot along with another 0.125 cup of the reserved cooking water.",
            "Add the remaining broccoli florets, 0.5 cup of ricotta salata, and about 0.5 tablespoon of chopped herbs and scallions; stir to combine.",
            "Top each serving with about 0.5 ounce of capicola and the remaining ricotta salata."
        ],
        "processed_ingredients": [
            "2.5 oz broccoli",
            "2.5 oz fusilli pasta",
            "0.25 tbsp olive oil",
            "1 clove garlic",
            "0.5 oz ricotta salata cheese",
            "0.5 tbsp fresh dill",
            "0.5 tbsp scallions",
            "0.5 oz capicola",
            "1 tsp salt"
        ],
        "pure_ingredients": [
            "salt",
            "broccoli",
            "fusilli pasta",
            "olive oil",
            "garlic",
            "ricotta salata cheese",
            "dill",
            "mint",
            "basil",
            "parsley",
            "chives",
            "scallions",
            "capicola"
        ],
        "cooking_time": "16 minutes",
        "required_tools": [
            "large pot",
            "slotted spoon",
            "bowl"
        ]
    }
]