[
    {
        "recipe_id": "gZxL/v73k7mdH7bTwagJL1e3QI47kFm",
        "recipe_title": "Salad on a Stick",
        "original_instructions": "Watch how to make this recipe.\nSpecial equipment: 12 wooden skewers\nBuild each skewer by threading on a chunk of lettuce, a tomato, a cheese cube, lettuce chunk, cucumber chunk and finally, another lettuce chunk. Arrange the skewers on a platter.\nWhisk together the oil, vinegar, Italian seasoning and some salt and pepper in a small bowl. Right before serving, brush the dressing onto the skewers.",
        "ingredients": [
            "1/2 head iceberg lettuce, cut into small chunks",
            "12 cherry tomatoes",
            "8 ounces mild Cheddar, cut into cubes",
            "1/2 English cucumber, cut into chunks",
            "1/4 cup extra-virgin olive oil",
            "2 tablespoons red wine vinegar",
            "1 teaspoon Italian seasoning",
            "Kosher salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Cut the iceberg lettuce into small chunks.",
            "Cut the Cheddar cheese into cubes.",
            "Cut the English cucumber into chunks.",
            "Prepare a single skewer by threading on a chunk of lettuce, a cherry tomato, a cheese cube, another lettuce chunk, a cucumber chunk, and one more lettuce chunk.",
            "Arrange the skewer on a platter.",
            "In a small bowl, whisk together 0.42 tablespoon of extra-virgin olive oil, 0.14 tablespoon of red wine vinegar, 0.05 teaspoon of Italian seasoning, and a pinch of salt and pepper.",
            "Right before serving, brush the dressing onto the skewer."
        ],
        "processed_ingredients": [
            "0.04 head iceberg lettuce",
            "1 cherry tomato",
            "0.67 ounce mild Cheddar",
            "0.05 English cucumber",
            "0.42 tablespoon extra-virgin olive oil",
            "0.14 tablespoon red wine vinegar",
            "0.05 teaspoon Italian seasoning",
            "0.01 teaspoon salt",
            "0.01 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "lettuce",
            "tomato",
            "cheddar",
            "cucumber",
            "olive oil",
            "red wine vinegar",
            "italian seasoning",
            "salt",
            "black pepper"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "knife",
            "cutting board",
            "wooden skewer",
            "platter",
            "small bowl",
            "whisk",
            "brush"
        ]
    },
    {
        "recipe_id": "EnkckFesxA6YXV/mTKva7XAj4xBYKnO",
        "recipe_title": "Lefse",
        "original_instructions": "Mix together first 7 ingredients, then add flour until you have a stiff dough. Using a corrugated rolling pin, roll out dough into 8-inch circles that are 1/8 to 1/4-inch thick. Place circles, 1 at a time, in lefse pan or heavy frying pan. Cook for about 3 minutes per side, or until cooked through.\nThe recipes for this program, which were provided by contributors and guests who may not be professional chefs, have not been tested in the Food Network's kitchens. Therefore, the Food Network cannot attest to the accuracy of any of the recipes.",
        "ingredients": [
            "2 cups buttermilk",
            "2 teaspoons baking soda (for buttermilk)",
            "1/4 to 1/2 cup fresh lemon juice",
            "1/2 to 2/3 cups sugar",
            "1/3 to 1/2 cup corn syrup",
            "3 eggs, beaten",
            "2 1/2 teaspoons salt",
            "Flour"
        ],
        "step_by_step_instructions": [
            "Mix together 0.25 cups of buttermilk, 0.25 teaspoons of baking soda, 0.06 cups of fresh lemon juice, 0.08 cups of sugar, 0.04 cups of corn syrup, 1 egg, and 0.31 teaspoons of salt.",
            "Add flour gradually until you have a stiff dough.",
            "Using a corrugated rolling pin, roll out dough into an 8-inch circle that is about 0.18-inch thick.",
            "Place the circle in a lefse pan or heavy frying pan.",
            "Cook for about 3 minutes per side, or until cooked through."
        ],
        "processed_ingredients": [
            "0.25 cup buttermilk",
            "0.25 teaspoon baking soda",
            "0.06 cup lemon juice",
            "0.08 cup sugar",
            "0.04 cup corn syrup",
            "1 egg",
            "0.31 teaspoon salt",
            "0.25 cup flour"
        ],
        "pure_ingredients": [
            "buttermilk",
            "baking soda",
            "lemon",
            "sugar",
            "corn syrup",
            "egg",
            "salt",
            "flour"
        ],
        "cooking_time": "6 minutes",
        "required_tools": [
            "corrugated rolling pin",
            "lefse pan",
            "frying pan"
        ]
    },
    {
        "recipe_id": "HFS0.39WRcnFWIliiiQxVtMQMzVgqoK",
        "recipe_title": "Mustard Scallion Potato Salad ",
        "original_instructions": "In a saucepan cover potatoes with salted cold water by 1 inch and simmer, covered, until just tender, about 15 minutes. Drain potatoes well in a colander and, when just cool enough to handle, halve. Transfer hot potatoes to a bowl and immediately toss with vinegar. Add remaining ingredients and salt and pepper to taste and gently toss until combined well. Serve potato salad warm or at room temperature.\nIn a saucepan cover potatoes with salted cold water by 1 inch and simmer, covered, until just tender, about 15 minutes. Drain potatoes well in a colander and, when just cool enough to handle, halve. Transfer hot potatoes to a bowl and immediately toss with vinegar. Add remaining ingredients and salt and pepper to taste and gently toss until combined well. Serve potato salad warm or at room temperature.",
        "ingredients": [
            "1 pound small boiling potatoes (about 1 1/2 inches each)",
            "1 teaspoon cider vinegar, or to taste",
            "2 teaspoons olive oil",
            "1 teaspoon Dijon mustard, or to taste",
            "1/4 cup sliced scallion greens"
        ],
        "step_by_step_instructions": [
            "Cover potatoes with salted cold water by 1 inch in a saucepan.",
            "Simmer, covered, until just tender, about 15 minutes.",
            "Drain potatoes well in a colander.",
            "When just cool enough to handle, halve the potatoes.",
            "Transfer hot potatoes to a bowl.",
            "Immediately toss with vinegar.",
            "Add olive oil, Dijon mustard, scallion greens, salt, and pepper.",
            "Gently toss until combined well.",
            "Serve potato salad warm or at room temperature."
        ],
        "processed_ingredients": [
            "250.00 g potatoes",
            "0.25 tsp cider vinegar",
            "0.50 tsp olive oil",
            "0.25 tsp Dijon mustard",
            "0.06 cup scallion greens"
        ],
        "pure_ingredients": [
            "potatoes",
            "cider vinegar",
            "olive oil",
            "Dijon mustard",
            "scallion",
            "salt",
            "pepper"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "saucepan",
            "colander",
            "bowl"
        ]
    },
    {
        "recipe_id": "GAOZP9kofGlMiAUUF8axq3JNpNuzxdC",
        "recipe_title": "Basic Chicken Salad",
        "original_instructions": "Cut the roast chicken into small pieces and discard the skin and bones. Put the chicken, grapes, almonds, scallions and celery in a large bowl. In another bowl, mix the mayonnaise, yogurt, cream, dill, brown sugar and some salt and pepper. Pour the dressing over the salad ingredients and toss gently to combine. Taste and adjust the seasoning. Allow to chill for several hours or even overnight.\nBefore serving, garnish with halved grapes and chopped dill. Serve on a bed of lettuce or in a sandwich.\nPreheat the oven to 400 degrees F.\nPut the chicken in a roasting pan, drizzle with olive oil and sprinkle generously with salt and pepper. Roast until the juices run clear, about 1 hour 15 minutes. Let cool completely before using for chicken salad.",
        "ingredients": [
            "One 3- to 4-pound roast chicken, home roasted or store-bought, recipe follows",
            "2 cups green or red seedless grapes, halved, plus more halved grapes, for garnish",
            "1/2 cup slivered almonds",
            "4 scallions, sliced",
            "3 stalks celery, sliced",
            "1/2 cup mayonnaise",
            "1/2 cup plain Greek yogurt",
            "1/4 cup heavy cream",
            "2 tablespoons chopped fresh dill, plus more for garnish",
            "1 tablespoon brown sugar",
            "Kosher salt and freshly ground black pepper",
            "One 3- to 4-pound chicken",
            "Olive oil, for drizzling",
            "Kosher salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Put approximately 0.35 lb chicken in a roasting pan, drizzle with a small amount of olive oil, and sprinkle generously with salt and pepper.",
            "Roast the chicken until the juices run clear, about 1 hour 15 minutes, then let it cool completely.",
            "Cut the cooled roast chicken into small pieces, discarding the skin and bones.",
            "In a large bowl, combine about 0.5 cup of chicken pieces, 0.25 cup of halved grapes, 0.06 cup of slivered almonds, 0.5 scallion sliced, and 0.25 stalk of celery sliced.",
            "In another bowl, mix 1 tbsp of mayonnaise, 1 tbsp of plain Greek yogurt, 0.5 tbsp of heavy cream, 1 tsp of chopped fresh dill, 1 tsp of brown sugar, and a pinch of salt and pepper.",
            "Pour the dressing over the salad ingredients and toss gently to combine.",
            "Taste and adjust the seasoning as needed.",
            "Allow the salad to chill for several hours or overnight.",
            "Before serving, garnish with a few halved grapes and a bit of chopped dill.",
            "Serve the chicken salad on a bed of lettuce or in a sandwich."
        ],
        "processed_ingredients": [
            "0.35 lb chicken",
            "0.25 cup grapes",
            "0.06 cup almonds",
            "0.5 scallion",
            "0.25 stalk celery",
            "1 tbsp mayonnaise",
            "1 tbsp Greek yogurt",
            "0.5 tbsp heavy cream",
            "1 tsp dill",
            "1 tsp brown sugar",
            "0.05 tsp salt",
            "0.05 tsp black pepper",
            "0.1 tbsp olive oil"
        ],
        "pure_ingredients": [
            "chicken",
            "grapes",
            "almonds",
            "scallions",
            "celery",
            "mayonnaise",
            "Greek yogurt",
            "heavy cream",
            "dill",
            "brown sugar",
            "salt",
            "black pepper",
            "olive oil",
            "lettuce"
        ],
        "cooking_time": "4 hours",
        "required_tools": [
            "oven",
            "roasting pan",
            "knife",
            "cutting board",
            "large bowl",
            "small bowl",
            "refrigerator"
        ]
    },
    {
        "recipe_id": "cfRp8z1f.5Ru9V2z.Hlv/e1t7xJ4.fq",
        "recipe_title": "Garlic Tomato Sauce ",
        "original_instructions": "Cut an X in bottom of each tomato and blanch in a large pot of boiling water 10 seconds. Immediately transfer tomatoes with a slotted spoon to an ice bath to cool, then peel, seed, and chop. Cook garlic in oil in a small heavy pot over medium heat, stirring occasionally, until golden, 3 to 5 minutes. Add tomatoes, red-pepper flakes, and 1/2 teaspoon salt and simmer, covered, stirring occasionally, 1 hour. Season with salt.\nCut an X in bottom of each tomato and blanch in a large pot of boiling water 10 seconds. Immediately transfer tomatoes with a slotted spoon to an ice bath to cool, then peel, seed, and chop.\nCook garlic in oil in a small heavy pot over medium heat, stirring occasionally, until golden, 3 to 5 minutes. Add tomatoes, red-pepper flakes, and 1/2 teaspoon salt and simmer, covered, stirring occasionally, 1 hour. Season with salt.",
        "ingredients": [
            "2 lb ripe plum tomatoes (see cooks' note, below)",
            "2 heads garlic, cloves peeled and halved lengthwise and any green sprouts from center discarded",
            "6 tablespoons extra-virgin olive oil",
            "3/4 teaspoon hot red-pepper flakes"
        ],
        "step_by_step_instructions": [
            "Cut an X in the bottom of 1 to 2 tomatoes.",
            "Blanch the tomatoes in a large pot of boiling water for 10 seconds.",
            "Immediately transfer the tomatoes with a slotted spoon to an ice bath to cool.",
            "Peel, seed, and chop the tomatoes.",
            "Peel 2 to 3 garlic cloves and halve them lengthwise, discarding any green sprouts from the center.",
            "Cook the garlic in 1 tablespoon of olive oil in a small heavy pot over medium heat, stirring occasionally, until golden, about 3 to 5 minutes.",
            "Add the chopped tomatoes, 0.13 teaspoon of red-pepper flakes, and 0.13 teaspoon of salt to the pot.",
            "Simmer the mixture, covered, stirring occasionally, for 1 hour.",
            "Season with additional salt if needed."
        ],
        "processed_ingredients": [
            "0.50 lb tomatoes",
            "2.50 cloves garlic",
            "1.00 tablespoon olive oil",
            "0.13 teaspoon red-pepper flakes",
            "0.13 teaspoon salt"
        ],
        "pure_ingredients": [
            "tomatoes",
            "garlic",
            "olive oil",
            "red-pepper flakes",
            "salt"
        ],
        "cooking_time": "65 minutes",
        "required_tools": [
            "large pot",
            "slotted spoon",
            "ice bath",
            "small heavy pot"
        ]
    },
    {
        "recipe_id": "GT1CnfVaWStj3o305f8JcQYiBwBo.ua",
        "recipe_title": "Chocolate Orange Fondue",
        "original_instructions": "For serving: pound cake, doughnuts, long-stemmed strawberries, bananas or pretzels\nChop the chocolate and place it in a heat-proof bowl set over a pan of simmering water. Add the cream, zest, coffee, and liqueur and stir constantly until the chocolate is melted and smooth. Transfer the mixture to a fondue pot and serve warm with pound cake, doughnuts, strawberries, bananas or pretzels.",
        "ingredients": [
            "7 ounces good semisweet chocolate",
            "1/3 cup heavy cream",
            "1 1/2 teaspoons grated orange zest",
            "1/2 teaspoon instant coffee granules",
            "2 tablespoons orange-flavored liqueur (recommended: Grand Marnier)"
        ],
        "step_by_step_instructions": [
            "Chop approximately 1.75 ounces of semisweet chocolate and place it in a heat-proof bowl set over a pan of simmering water.",
            "Add about 2.67 tablespoons of heavy cream to the bowl.",
            "Add roughly 0.37 teaspoons of grated orange zest to the mixture.",
            "Add approximately 0.12 teaspoons of instant coffee granules to the bowl.",
            "Pour in around 0.5 tablespoons of orange-flavored liqueur.",
            "Stir the mixture constantly until the chocolate is melted and smooth.",
            "Transfer the mixture to a fondue pot.",
            "Serve warm with pieces of pound cake, doughnuts, strawberries, bananas, or pretzels."
        ],
        "processed_ingredients": [
            "1.75 oz semisweet chocolate",
            "2.67 tbsp heavy cream",
            "0.37 tsp orange zest",
            "0.12 tsp instant coffee granules",
            "0.5 tbsp orange-flavored liqueur"
        ],
        "pure_ingredients": [
            "chocolate",
            "heavy cream",
            "orange zest",
            "coffee",
            "liqueur",
            "pound cake",
            "doughnuts",
            "strawberries",
            "bananas",
            "pretzels"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "heat-proof bowl",
            "pan",
            "fondue pot"
        ]
    },
    {
        "recipe_id": "f.H6TAVolujc.3i/X8tDN3UFiwY93U2",
        "recipe_title": "Turkey or Chicken, Summer Squash and Tomato Stir-Fry",
        "original_instructions": "Combine 2 tablespoons olive oil, lemon juice, thyme, 1/4 teaspoon salt, pepper, and red pepper in a large bowl. Add the chicken or turkey and toss. Marinate 15 minutes.\nDrain the meat and pat very dry. Heat a wok or large skillet over high heat. Add the remaining 2 tablespoons oil to the pan. Add the chicken and stir-fry until opaque and firm, about 4 minutes. Use a slotted spoon to transfer to a large bowl. Add the onion and pepper to the pan and stir-fry, until softened, 1 to 2 minutes. Add to the chicken. Add the squash to the pan, and stir-fry until tender-crisp, about 2 minutes. Add to the chicken. Add the tomatoes and garlic to the pan and stir-fry until glazed and slightly charred, about 2 minutes longer. Return the chicken and vegetables to the pan. Season with salt and pepper. Heat until warmed through, about 2 minutes. Add the basil and toss to combine. Serve with rice.",
        "ingredients": [
            "4 tablespoons extra-virgin olive oil",
            "2 tablespoons fresh lemon juice",
            "2 tablespoons chopped fresh thyme",
            "Kosher salt and freshly ground black pepper",
            "Pinch of red pepper flakes",
            "1 pound chicken or turkey breast, cut into 1-inch pieces",
            "1 small onion, cut into 3/4-inch dice (about 1 cup)",
            "1 red bell pepper, seeded and cut into 3/4-inch dice (about 1 cup)",
            "2 cloves garlic, minced",
            "2 small summer squash, seeds removed and cut into a 3/4-inch dice (about 1 1/2 cups)",
            "8 to 10 small cherry tomatoes, mixed colors",
            "1/3 cup loosely packed fresh basil leaves",
            "Rice, for serving"
        ],
        "step_by_step_instructions": [
            "Combine 0.5 tablespoons olive oil, 0.25 tablespoons lemon juice, 0.25 tablespoons chopped thyme, a small pinch of salt, a pinch of pepper, and a very small pinch of red pepper flakes in a large bowl.",
            "Add 0.25 pound chicken breast cut into 1-inch pieces and toss to coat.",
            "Marinate for 15 minutes.",
            "Drain the chicken and pat it very dry.",
            "Heat a wok or large skillet over high heat.",
            "Add 0.5 tablespoons olive oil to the pan.",
            "Add the chicken and stir-fry until opaque and firm, about 4 minutes.",
            "Use a slotted spoon to transfer the chicken to a bowl.",
            "Add 0.25 cup diced onion and 0.25 cup red bell pepper to the pan and stir-fry until softened, 1 to 2 minutes.",
            "Transfer the onion and pepper to the bowl with the chicken.",
            "Add 0.375 cup diced summer squash to the pan and stir-fry until tender-crisp, about 2 minutes.",
            "Transfer the squash to the bowl with the chicken.",
            "Add 2 small cherry tomatoes and 0.5 clove minced garlic to the pan and stir-fry until glazed and slightly charred, about 2 minutes longer.",
            "Return the chicken and vegetables to the pan.",
            "Season with a pinch of salt and pepper.",
            "Heat until warmed through, about 2 minutes.",
            "Add 0.083 cup fresh basil leaves and toss to combine.",
            "Serve with 0.33 cup cooked rice."
        ],
        "processed_ingredients": [
            "1.00 tablespoon olive oil",
            "0.50 tablespoon lemon juice",
            "0.50 tablespoon thyme",
            "0.06 teaspoon salt",
            "0.06 teaspoon pepper",
            "0.01 teaspoon red pepper flakes",
            "0.25 lb chicken breast",
            "0.25 cup onion",
            "0.25 cup red bell pepper",
            "0.50 clove garlic",
            "0.375 cup summer squash",
            "2.00 cherry tomatoes",
            "0.083 cup basil leaves",
            "0.33 cup rice"
        ],
        "pure_ingredients": [
            "olive oil",
            "lemon juice",
            "thyme",
            "salt",
            "pepper",
            "red pepper flakes",
            "chicken",
            "onion",
            "bell pepper",
            "garlic",
            "summer squash",
            "tomatoes",
            "basil",
            "rice"
        ],
        "cooking_time": "29 minutes",
        "required_tools": [
            "bowl",
            "wok",
            "slotted spoon"
        ]
    },
    {
        "recipe_id": "4biHhk1bU3MGwPyei5BG0Z5ZBfdx/um",
        "recipe_title": "Orange-Pistachio Wild Rice Salad",
        "original_instructions": "Watch how to make this recipe.\nCombine brown rice, wild rice and chicken broth in a saucepan and bring to a boil. Cover, reduce heat to a simmer and cook until all water is evaporated and rice is fully cooked, about 45 to 55 minutes. Remove from heat and cool completely.\nWhen rice is cool, add orange slices, basil, red onion, pistachios and orange zest; mix to incorporate.\nFor the dressing:\nCombine the red wine vinegar, olive oil, orange juice, mustard, honey and salt in a metal bowl and whisk to incorporate.\nPour over rice mixture and toss to incorporate.",
        "ingredients": [
            "2/3 cup brown rice",
            "2/3 cup wild rice",
            "3 cups low-sodium chicken broth",
            "1 orange, peel and pith removed, segmented and sliced (about 2/3 cup)",
            "10 large basil leaves, sliced into ribbons (about 1/3 cup)",
            "1/4 cup minced red onion",
            "3 tablespoons chopped pistachios, lightly toasted",
            "1 teaspoon finely grated orange zest",
            "1/3 cup red wine vinegar",
            "1/4 cup olive oil",
            "1 tablespoon orange juice",
            "1 1/2 teaspoons Dijon mustard",
            "1 teaspoon honey",
            "1/4 teaspoon salt"
        ],
        "step_by_step_instructions": [
            "Combine 0.11 cup brown rice, 0.11 cup wild rice, and 0.5 cup low-sodium chicken broth in a saucepan and bring to a boil.",
            "Cover, reduce heat to a simmer, and cook until all water is evaporated and rice is fully cooked, about 45 to 55 minutes.",
            "Remove from heat and cool completely.",
            "When rice is cool, add 0.11 cup orange slices, 0.06 cup basil leaves, 0.04 cup minced red onion, 0.5 tablespoon chopped pistachios, and 0.17 teaspoon finely grated orange zest; mix to incorporate.",
            "For the dressing, combine 0.06 cup red wine vinegar, 0.04 cup olive oil, 0.17 tablespoon orange juice, 0.25 teaspoon Dijon mustard, 0.17 teaspoon honey, and 0.04 teaspoon salt in a metal bowl and whisk to incorporate.",
            "Pour the dressing over the rice mixture and toss to incorporate."
        ],
        "processed_ingredients": [
            "0.11 cup brown rice",
            "0.11 cup wild rice",
            "0.5 cup low-sodium chicken broth",
            "0.11 cup orange",
            "0.06 cup basil leaves",
            "0.04 cup red onion",
            "0.5 tbsp pistachios",
            "0.17 tsp orange zest",
            "0.06 cup red wine vinegar",
            "0.04 cup olive oil",
            "0.17 tbsp orange juice",
            "0.25 tsp Dijon mustard",
            "0.17 tsp honey",
            "0.04 tsp salt"
        ],
        "pure_ingredients": [
            "brown rice",
            "wild rice",
            "chicken broth",
            "orange",
            "basil",
            "red onion",
            "pistachio",
            "orange zest",
            "red wine vinegar",
            "olive oil",
            "orange juice",
            "mustard",
            "honey",
            "salt"
        ],
        "cooking_time": "55 minutes",
        "required_tools": [
            "saucepan",
            "knife",
            "cutting board",
            "metal bowl",
            "whisk"
        ]
    },
    {
        "recipe_id": "8cvtymDmRU9IWl8/jAIlU4mTzcThFRG",
        "recipe_title": "Peas Portuguesa",
        "original_instructions": "In a large shallow flameproof casserole, melt the butter over medium heat. Saute the onion for 8 to 10 minutes, until softened and golden. Add the broth, peas, parsley, cilantro, sugar, salt, and pepper. Overlap the sausage slices in a circle around the very outside edge of the dish. Bring to a boil, cover, and reduce the heat. Simmer for 5 minutes. Break 1 egg into a small saucer and, holding the saucer close to the pan, slide the egg on top of the peas. Repeat with the remaining eggs, grouping them in the center of the sausage ring but keeping them slightly apart from each other. Sprinkle the eggs with salt and pepper, cover the pan tightly, and cook for 3 to 4 minutes more, until the eggs are covered with an opaque film and the white are set, or continue cooking the eggs to your liking. Sprinkle the cilantro over the top and serve from the skillet with a large spoon.",
        "ingredients": [
            "2 tablespoons unsalted butter",
            "1 medium white onion, finely chopped",
            "1 cup chicken broth, preferably homemade",
            "3 (10 ounce) packages thoroughly defrosted petits pois or, if available, 4 pounds fresh peas, shelled and blanched",
            "1/2 small bunch flat leaf parsley, leaves only, finely chopped",
            "1/2 teaspoon sugar",
            "3/4 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper",
            "6 ounces linguica sausage, or cooked, dry chorizo, sliced 1/4inch thick",
            "6 large eggs, preferably free range",
            "1/2 small bunch cilantro, leaves only, finely chopped"
        ],
        "step_by_step_instructions": [
            "Melt 0.33 tablespoon of unsalted butter in a large shallow flameproof casserole over medium heat.",
            "Saute 0.17 medium white onion, finely chopped, for 8 to 10 minutes until softened and golden.",
            "Add 0.17 cup of chicken broth, 5 ounces of defrosted petits pois, 0.08 of a small bunch of flat leaf parsley leaves, finely chopped, 0.08 teaspoon of sugar, 0.13 teaspoon of salt, and 0.08 teaspoon of freshly ground black pepper.",
            "Overlap 1 ounce of linguica sausage slices in a circle around the very outside edge of the dish.",
            "Bring to a boil, cover, and reduce the heat. Simmer for 5 minutes.",
            "Break 1 egg into a small saucer and slide the egg on top of the peas, grouping it in the center of the sausage ring.",
            "Sprinkle the egg with a pinch of salt and pepper, cover the pan tightly, and cook for 3 to 4 minutes more, until the egg is covered with an opaque film and the white is set.",
            "Sprinkle 0.08 of a small bunch of cilantro leaves over the top and serve from the skillet with a large spoon."
        ],
        "processed_ingredients": [
            "0.33 tablespoon unsalted butter",
            "0.17 medium white onion",
            "0.17 cup chicken broth",
            "5.00 ounce petits pois",
            "0.08 small bunch flat leaf parsley",
            "0.08 teaspoon sugar",
            "0.13 teaspoon salt",
            "0.08 teaspoon freshly ground black pepper",
            "1.00 ounce linguica sausage",
            "1.00 large egg",
            "0.08 small bunch cilantro"
        ],
        "pure_ingredients": [
            "butter",
            "onion",
            "chicken broth",
            "peas",
            "parsley",
            "sugar",
            "salt",
            "pepper",
            "sausage",
            "egg",
            "cilantro"
        ],
        "cooking_time": "17 minutes",
        "required_tools": [
            "large shallow flameproof casserole",
            "small saucer",
            "large spoon"
        ]
    },
    {
        "recipe_id": "DsQ6W.bcBDFnkGTpp3b/ApW25F5k1VS",
        "recipe_title": "Boiled Peanuts",
        "original_instructions": "Wash the peanuts in cool water until the water runs clear. Soak in cool water for 30 minutes to loosen any remaining dirt.\nDrain and rinse the peanuts. Add the peanuts to a 12-quart pot along with the salt and 3 gallons of water. Stir well. Cover and cook on high for 4 hours. Check the texture of the peanut at this point for doneness. When done, boiled peanuts should have a similar texture to a cooked dry bean. It should hold its shape, but not crunch when bitten. Add more water throughout the cooking process, if needed. If necessary, continue cooking for 3 to 4 hours longer.\nDrain the peanuts and store in a covered container in the refrigerator for up to 1 week.\n*Cook's note: The cooking time can vary greatly depending on how fresh the peanuts are. The fresher the peanut, the less time it will take to cook.",
        "ingredients": [
            "2 pounds in-shell raw Virginia or Valencia peanuts",
            "3 ounces kosher salt",
            "3 gallons water"
        ],
        "step_by_step_instructions": [
            "Wash approximately 4 ounces of in-shell raw peanuts in cool water until the water runs clear.",
            "Soak the peanuts in cool water for 30 minutes to loosen any remaining dirt.",
            "Drain and rinse the peanuts.",
            "Add the peanuts to a pot along with about 0.6 ounces of kosher salt and 0.6 gallons (about 2.3 liters) of water.",
            "Stir well.",
            "Cover the pot and cook on high for 4 hours.",
            "Check the texture of the peanuts for doneness. They should have a similar texture to a cooked dry bean, holding their shape but not crunchy.",
            "Add more water throughout the cooking process if needed.",
            "If necessary, continue cooking for an additional 3 to 4 hours until the desired texture is achieved.",
            "Drain the peanuts and store them in a covered container in the refrigerator for up to 1 week."
        ],
        "processed_ingredients": [
            "4.00 oz raw in-shell peanuts",
            "0.60 oz kosher salt",
            "2.30 L water"
        ],
        "pure_ingredients": [
            "peanuts",
            "salt",
            "water"
        ],
        "cooking_time": "8 hours",
        "required_tools": [
            "pot",
            "stove",
            "measuring cup"
        ]
    },
    {
        "recipe_id": "c5sFiPrHk3LEF7pJNO5FO8fmba1xTsi",
        "recipe_title": "Sausage Scrambles and Cheese",
        "original_instructions": "Preheat a nonstick skillet over medium high heat. Add extra-virgin olive oil or vegetable oil, 1 turn of the pan, add sausage and brown and crumble the meat, 5 or 6 minutes. Remove the sausage from the pan and drain off some of the fat. Return pan to heat and reduce the temperature to medium low.\nWhisk together the eggs, half-and-half or milk, hot sauce, salt and pepper. Scramble the eggs until soft, then add cheese and continue to scramble another minute or so to finish cooking eggs and to begin to melt the cheese bits. Remove pan from heat and combine sausage and eggs. Garnish servings of the eggs with a few pieces of diced fresh tomato. Serve plates of sausage scrambles with pancakes, or for a simple supper, serve with toasted whole grain bread, buttered and drizzled with honey.",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil or vegetable oil, 1 turn of the pan",
            "1 pound bulk breakfast sausage, such as maple sausage",
            "8 large eggs",
            "A splash half-and-half or whole milk",
            "A few drops hot sauce",
            "Salt and pepper",
            "6 ounces (1/3 pound) Cheddar, diced",
            "1 plum tomato, seeded and diced"
        ],
        "step_by_step_instructions": [
            "Preheat a nonstick skillet over medium high heat.",
            "Add approximately 0.5 tablespoon of olive oil to the skillet.",
            "Add about 0.25 pounds of breakfast sausage to the skillet and cook, breaking it into crumbles, for 5 to 6 minutes until browned.",
            "Remove the sausage from the skillet and drain excess fat. Return the skillet to heat, reducing it to medium low.",
            "Whisk 2 large eggs with a splash of half-and-half or milk, a few drops of hot sauce, salt, and pepper.",
            "Pour the egg mixture into the skillet and scramble until the eggs are soft.",
            "Add approximately 1.5 ounces of diced Cheddar cheese and continue to cook for another minute until the eggs are fully cooked and the cheese begins to melt.",
            "Remove the skillet from the heat and mix back in the cooked sausage.",
            "Garnish with a few pieces of diced tomato.",
            "Serve the dish with toasted whole grain bread, optionally buttered and drizzled with honey."
        ],
        "processed_ingredients": [
            "0.5 tablespoon olive oil",
            "0.25 lb breakfast sausage",
            "2 large eggs",
            "0.5 tablespoon half-and-half",
            "0.25 teaspoon hot sauce",
            "0.25 teaspoon salt",
            "0.25 teaspoon pepper",
            "1.5 oz Cheddar cheese",
            "0.5 oz tomato"
        ],
        "pure_ingredients": [
            "olive oil",
            "sausage",
            "eggs",
            "milk",
            "hot sauce",
            "salt",
            "pepper",
            "cheese",
            "tomato"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "nonstick skillet",
            "whisk",
            "spatula",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "Z/FHc/Cbw.jUshV0aYK89u0EyXNxXQa",
        "recipe_title": "Creamy Mashed Potatoes",
        "original_instructions": "Preheat the oven to 350 degrees F. Peel and cut the potatoes into chunks. Bring a large pot of water to a simmer and add the potatoes. Bring to a boil and cook until fork tender, 20 to 25 minutes. Drain the potatoes in a large colander. Place them back into the dry pot and put the pot on the stove. Mash the potatoes over low heat, allowing all the steam to escape before adding in all the other ingredients. Turn off the heat and add the 1 1/2 sticks of butter, the cream cheese, heavy cream, seasoned salt, salt and pepper. Mash to combine. Spread the potatoes in a medium buttered baking dish. Throw a few pats of butter if desired over the top of the potatoes and place in the oven until the butter is melted and the potatoes are warmed through, 20 to 30 minutes.",
        "ingredients": [
            "5 pounds russet or Yukon gold potatoes",
            "12 tablespoons (1 1/2 sticks) butter, softened, plus 4 tablespoons (1/2 stick), optional",
            "One 8-ounce package cream cheese, softened",
            "1 cup heavy cream",
            "1/2 to 1 teaspoon seasoned salt",
            "1/2 teaspoon salt",
            "1 teaspoon black pepper"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Peel and cut approximately 0.5 pounds of potatoes into chunks.",
            "Bring a large pot of water to a simmer and add the potato chunks.",
            "Bring to a boil and cook the potatoes until fork tender, about 20 to 25 minutes.",
            "Drain the potatoes in a large colander.",
            "Place them back into the dry pot and put the pot on the stove.",
            "Mash the potatoes over low heat, allowing all the steam to escape before adding other ingredients.",
            "Turn off the heat and add about 1.5 tablespoons of butter, 1 ounce of cream cheese, 0.13 cups of heavy cream, 0.13 teaspoons of seasoned salt, 0.06 teaspoons of salt, and 0.13 teaspoons of black pepper.",
            "Mash to combine.",
            "Spread the mashed potatoes in a small buttered baking dish.",
            "Optionally, add a few small pats of butter over the top of the potatoes.",
            "Place in the oven until the butter is melted and the potatoes are warmed through, about 20 to 30 minutes."
        ],
        "processed_ingredients": [
            "0.5 lb potatoes",
            "1.5 tbsp butter",
            "1 oz cream cheese",
            "0.13 cup heavy cream",
            "0.13 tsp seasoned salt",
            "0.06 tsp salt",
            "0.13 tsp black pepper"
        ],
        "pure_ingredients": [
            "potatoes",
            "butter",
            "cream cheese",
            "heavy cream",
            "salt",
            "pepper"
        ],
        "cooking_time": "75 minutes",
        "required_tools": [
            "oven",
            "pot",
            "colander",
            "stove",
            "masher",
            "baking dish"
        ]
    },
    {
        "recipe_id": "PkERRQu9P/6nzN5bhOOaFC6MhYbxTQe",
        "recipe_title": "Chile Mashed Potatoes",
        "original_instructions": "Preheat the oven to 350 degrees. Boil the potatoes in salted water for 15 minutes, or until tender. Drain, place on a sheet pan, and bake at 350 degrees for 10 minutes. Remove the potatoes from the oven and transfer to a large bowl. Add the butter to the bowl and mix with an electric mixer until smooth. Add the cream until it reaches the desired consistency. Stir in the poblanos and season to taste with salt and pepper.",
        "ingredients": [
            "6 Idaho potatoes, peeled",
            "1/2 cup butter",
            "1 cup heavy whipping cream, warm",
            "2 roasted poblanos, peeled, seeded, and diced",
            "Salt and pepper"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees.",
            "Boil 1 Idaho potato in salted water for 15 minutes, or until tender.",
            "Drain the potato, place on a sheet pan, and bake at 350 degrees for 10 minutes.",
            "Remove the potato from the oven and transfer to a large bowl.",
            "Add 0.67 tablespoon butter to the bowl and mix with an electric mixer until smooth.",
            "Add 0.11 cup heavy whipping cream until it reaches the desired consistency.",
            "Stir in 0.33 roasted poblano and season to taste with salt and pepper."
        ],
        "processed_ingredients": [
            "1 potato",
            "0.67 tablespoon butter",
            "0.11 cup heavy whipping cream",
            "0.33 roasted poblano",
            "0.08 teaspoon salt",
            "0.04 teaspoon pepper"
        ],
        "pure_ingredients": [
            "potato",
            "butter",
            "heavy whipping cream",
            "poblano",
            "salt",
            "pepper"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "oven",
            "pot",
            "sheet pan",
            "electric mixer",
            "large bowl"
        ]
    },
    {
        "recipe_id": "0AZ/xuZMjuxc7VqX/SiK35PsFQ1lFG.",
        "recipe_title": "Crab Bake",
        "original_instructions": "Preheat the oven to 375 degrees F.\nCombine all ingredients except crackers, adding enough milk to make dip consistency. Place in a small baking dish and bake for 15 minutes. Serve hot on crackers.",
        "ingredients": [
            "4 ounces ricotta",
            "1 can crabmeat, shells removed",
            "2 tablespoons instant chopped onions",
            "1/2 teaspoon prepared horseradish",
            "1/2 teaspoon pepper",
            "2 to 4 tablespoons milk",
            "Assorted crackers"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 375 degrees F.",
            "Combine 1 ounce of ricotta, 3 ounces of crabmeat, 0.5 tablespoons of instant chopped onions, 0.125 teaspoon of prepared horseradish, 0.125 teaspoon of pepper, and 0.5 to 1 tablespoon of milk to make a dip consistency.",
            "Place the mixture in a small baking dish.",
            "Bake for 15 minutes.",
            "Serve hot on crackers."
        ],
        "processed_ingredients": [
            "1.00 ounce ricotta",
            "3.00 ounces crabmeat",
            "0.50 tablespoon instant chopped onions",
            "0.13 teaspoon prepared horseradish",
            "0.13 teaspoon pepper",
            "0.50 tablespoon milk",
            "5.00 ounces crackers"
        ],
        "pure_ingredients": [
            "ricotta",
            "crabmeat",
            "onions",
            "horseradish",
            "pepper",
            "milk",
            "crackers"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "oven",
            "small baking dish"
        ]
    },
    {
        "recipe_id": "x58Uk7UxvntNefim2A6S7RQ2.f/Hnzq",
        "recipe_title": "Peanut Butter Fudge",
        "original_instructions": "Line an 8-by-8-inch baking pan with aluminum foil and lightly grease with vegetable spray. Sprinkle the peanuts over the bottom of the pan. Put the milk and sugar in a medium, heavy-bottomed saucepan fitted with a candy thermometer. Boil over medium heat, occasionally stirring to keep from sticking. Cook until the mixture reaches 240 degrees F (soft ball). Remove from the heat and gently place the butter, peanut butter and vanilla in the pan, taking care not to disturb the syrup. Do not stir. Let the mixture cool down for 5 minutes, then beat vigorously with a spoon or the flat beater of a stationary mixer until dense and smooth. Turn the fudge into the prepared pan, spreading it evenly with a metal spatula. With a sharp knife, score into portions. Let set, 45 minutes then cut into 1 1/3-inch squares.",
        "ingredients": [
            "Non-stick vegetable spray",
            "1/4 cup roasted, unsalted peanuts, coarsely chopped",
            "1 cup milk",
            "2 1/2 cups sugar",
            "3 tablespoons unsalted butter",
            "6 ounces creamy peanut butter",
            "1 teaspoon vanilla extract"
        ],
        "step_by_step_instructions": [
            "Line a small section of the baking pan with aluminum foil and lightly grease with vegetable spray.",
            "Sprinkle approximately 0.01 cup of chopped peanuts over the bottom of the pan.",
            "Put about 0.08 cup of milk and 0.2 cup of sugar in a medium, heavy-bottomed saucepan fitted with a candy thermometer.",
            "Boil over medium heat, occasionally stirring to keep from sticking, until the mixture reaches 240 degrees F (soft ball).",
            "Remove from the heat and gently place about 0.36 tablespoons of butter, 0.48 ounces of peanut butter, and 0.08 teaspoons of vanilla in the pan, taking care not to disturb the syrup. Do not stir.",
            "Let the mixture cool down for 5 minutes, then beat vigorously with a spoon or the flat beater of a stationary mixer until dense and smooth.",
            "Turn the fudge into the prepared pan, spreading it evenly with a metal spatula.",
            "With a sharp knife, score into portions.",
            "Let set for 45 minutes, then cut into approximately 1 1/3-inch squares."
        ],
        "processed_ingredients": [
            "0.01 cup peanuts",
            "0.08 cup milk",
            "0.2 cup sugar",
            "0.36 tablespoon butter",
            "0.48 ounce peanut butter",
            "0.08 teaspoon vanilla extract"
        ],
        "pure_ingredients": [
            "peanuts",
            "milk",
            "sugar",
            "butter",
            "peanut butter",
            "vanilla"
        ],
        "cooking_time": "55 minutes",
        "required_tools": [
            "baking pan",
            "aluminum foil",
            "vegetable spray",
            "candy thermometer",
            "saucepan",
            "spoon",
            "stationary mixer",
            "metal spatula",
            "knife"
        ]
    },
    {
        "recipe_id": "51BEhkHwuBGNWD8m2ZAPT/Vi.wnCcdS",
        "recipe_title": "Chicken Piccata",
        "original_instructions": "Shake flour, salt and pepper in a plastic bag. Add chicken pieces in batches to coat. Heat butter over medium heat in a skillet and brown each side of the coated chicken. Squeeze fresh lemon juice over the chicken and add capers. Remove to a platter and set aside in a warm place.\nTo the same pan add butter for the sauce and mix with flour to make a roux. Gradually add chicken broth and allow thickening. Strain sauce, if desired, and serve spooned over chicken.",
        "ingredients": [
            "1/2 cup all-purpose flour",
            "1/2 teaspoon salt",
            "1/4 teaspoon pepper",
            "1 pound chicken breasts, sliced thin and pounded into cutlets",
            "3 tablespoons butter",
            "1 lemon, halved crosswise and seeds removed",
            "2 teaspoons capers",
            "3 tablespoons butter",
            "3 tablespoons all-purpose flour",
            "1/2 cup hot chicken broth"
        ],
        "step_by_step_instructions": [
            "Combine 2 tablespoons flour, 1/8 teaspoon salt, and 1/16 teaspoon pepper in a plastic bag.",
            "Add 4 ounces chicken breast cutlet to the bag and shake to coat.",
            "Heat 1 tablespoon butter over medium heat in a skillet.",
            "Brown the chicken cutlet on each side for about 3-4 minutes until golden brown.",
            "Squeeze juice from 1/4 of a lemon over the chicken and add 1/2 teaspoon capers.",
            "Remove the chicken to a warm platter and set aside.",
            "In the same pan, add 1 tablespoon butter for the sauce.",
            "Mix in 1 tablespoon flour to make a roux.",
            "Gradually add 1/8 cup hot chicken broth and stir until thickened.",
            "Strain the sauce if desired and spoon over the chicken before serving."
        ],
        "processed_ingredients": [
            "2.00 tbsp all-purpose flour",
            "0.13 tsp salt",
            "0.06 tsp pepper",
            "4.00 oz chicken breasts",
            "2.00 tbsp butter",
            "0.25 unit lemon",
            "0.50 tsp capers",
            "1.00 tbsp all-purpose flour",
            "0.13 cup hot chicken broth"
        ],
        "pure_ingredients": [
            "flour",
            "salt",
            "pepper",
            "chicken",
            "butter",
            "lemon",
            "capers",
            "chicken broth"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "plastic bag",
            "skillet",
            "platter",
            "strainer"
        ]
    },
    {
        "recipe_id": "pbEZZvqx/qSw842caoiuqdRc59/ixpO",
        "recipe_title": "Spinach Salad with Slumped Mushrooms",
        "original_instructions": "Combine the mushrooms and onions in a bowl and add the lemon zest, lemon juice, salt and pepper, to taste, the fennel and the red pepper flakes. Let stand until softened and slumped, about 20 minutes. Chop the spinach and arrange in large shallow bowl, top with the mushrooms and onion mixture and gently toss to wilt spinach.",
        "ingredients": [
            "6 to 8 very large white mushroom caps, very thinly sliced",
            "1 small red onion, very thinly sliced",
            "2 teaspoons lemon zest",
            "2 lemons, juiced",
            "1/3 cup extra-virgin olive oil",
            "Salt and pepper",
            "1 teaspoon ground fennel or a sprinkle of fennel seeds",
            "1/2 teaspoon crushed red pepper flakes",
            "3 bundles farm spinach, trimmed and washed"
        ],
        "step_by_step_instructions": [
            "Combine about 1 large mushroom cap (approximately 50g) and 1/8 of a small red onion (approximately 12.5g) in a bowl.",
            "Add approximately 0.33 teaspoons of lemon zest, juice from half a lemon, 0.5 tablespoons of extra-virgin olive oil, salt and pepper to taste, about 0.17 teaspoons of ground fennel or a pinch of fennel seeds, and about 0.08 teaspoons of crushed red pepper flakes to the bowl.",
            "Let the mixture stand until softened and slumped, about 20 minutes.",
            "Chop about 1/3 of a bundle of spinach (approximately 30g) and arrange in a large shallow bowl.",
            "Top the spinach with the mushroom and onion mixture and gently toss to wilt the spinach."
        ],
        "processed_ingredients": [
            "50 g white mushroom caps",
            "12.50 g red onion",
            "0.33 tsp lemon zest",
            "1 tbsp lemon juice",
            "0.50 tbsp extra-virgin olive oil",
            "0.08 tsp salt",
            "0.08 tsp pepper",
            "0.17 tsp ground fennel",
            "0.08 tsp crushed red pepper flakes",
            "30 g spinach"
        ],
        "pure_ingredients": [
            "white mushroom caps",
            "red onion",
            "lemon zest",
            "lemon",
            "olive oil",
            "salt",
            "pepper",
            "fennel",
            "red pepper flakes",
            "spinach"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "bowl",
            "knife",
            "cutting board",
            "large shallow bowl"
        ]
    },
    {
        "recipe_id": "b8.psaTuOkHQeIYXwa9iiPb.gNSUeau",
        "recipe_title": "Deep Fried Ribs",
        "original_instructions": "Set smoker at 350 degrees F.\nWash each rack under water. Pat dry. Place racks on a wood-burning smoker. A hickory wood fire is best. Smoke ribs for 30 minutes. Remove ribs from smoker and rub each side with the rib rub. Return the ribs to smoker and smoke at 350 degrees F for about 1 hour 30 minutes. Remove ribs and cool completely. When cool, cut ribs into individual sections. Dip each rib into pre-wash solution then the breading mixture, lightly dredging. Shake off the excess then dip into wash again and then the breading mixture.\nPlace ribs into a 350-degree F deep fryer and cook for 5 minutes or until golden brown. You will have to do multiple batches. Serve with your favorite barbecue sauce for dipping.",
        "ingredients": [
            "2 racks St. Louis style ribs",
            "Your favorite rib rub",
            "Peanut oil, for frying",
            "Your favorite barbecue sauce",
            "2 cups milk",
            "2 eggs",
            "4 ounces beer",
            "All-purpose flour",
            "Pepper, salt, and Cajun spices, to taste"
        ],
        "step_by_step_instructions": [
            "Set the smoker to 350 degrees F.",
            "Wash a portion of a rack of ribs (approximately one-sixth of a rack) under water and pat dry.",
            "Place the portion on a wood-burning smoker with a hickory wood fire and smoke for 5 minutes.",
            "Remove the ribs from the smoker and rub each side with rib rub.",
            "Return the ribs to the smoker and smoke at 350 degrees F for about 15 minutes.",
            "Remove the ribs from the smoker and let them cool completely.",
            "Cut the cooled ribs into individual sections.",
            "Prepare the pre-wash solution by mixing a small amount of milk, eggs, and beer.",
            "Prepare the breading mixture by combining all-purpose flour, pepper, salt, and Cajun spices to taste.",
            "Dip each rib section into the pre-wash solution and then lightly dredge in the breading mixture.",
            "Shake off the excess breading, then dip again into the wash and dredge once more in the breading mixture.",
            "Heat peanut oil in a deep fryer to 350 degrees F.",
            "Place the rib sections into the deep fryer and cook for 5 minutes or until golden brown.",
            "Repeat frying in batches if necessary.",
            "Serve the ribs with your favorite barbecue sauce for dipping."
        ],
        "processed_ingredients": [
            "0.33 lb ribs",
            "1 tbsp rib rub",
            "0.17 cup milk",
            "0.33 egg",
            "0.67 ounce beer",
            "0.33 cup all-purpose flour",
            "0.25 tsp pepper",
            "0.25 tsp salt",
            "0.25 tsp Cajun spices",
            "2 cup peanut oil",
            "2 tbsp barbecue sauce"
        ],
        "pure_ingredients": [
            "ribs",
            "rib rub",
            "peanut oil",
            "barbecue sauce",
            "milk",
            "eggs",
            "beer",
            "all-purpose flour",
            "pepper",
            "salt",
            "Cajun spices"
        ],
        "cooking_time": "55 minutes",
        "required_tools": [
            "smoker",
            "deep fryer",
            "knife",
            "mixing bowl",
            "whisk",
            "measuring spoons",
            "measuring cups"
        ]
    },
    {
        "recipe_id": "xcm44iNO1.eL7TgASaTuu5yB6cxSrsq",
        "recipe_title": "Avocado Egg-in-a-Hole ",
        "original_instructions": "Cut the avocado in half and remove the pit. Place the halves face up on a muffin tin so they won't tip over. Pour the beaten egg into each hole (one egg fills two halves). Sprinkle with grated cheese, garlic powder, salt, and pepper. Bake at 375° F for 15 to 20 minutes or until desired egg hardness.\nCut the avocado in half and remove the pit. Place the halves face up on a muffin tin so they won't tip over.\nPour the beaten egg into each hole (one egg fills two halves). Sprinkle with grated cheese, garlic powder, salt, and pepper.\nBake at 375° F for 15 to 20 minutes or until desired egg hardness.",
        "ingredients": [
            "1 avocado",
            "1 egg, beaten",
            "grated cheese",
            "garlic powder",
            "Salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Cut the avocado in half and remove the pit.",
            "Place the halves face up on a muffin tin so they won't tip over.",
            "Pour the beaten egg into each hole (one egg fills two halves).",
            "Sprinkle with grated cheese, garlic powder, salt, and pepper.",
            "Bake at 375° F for 15 to 20 minutes or until desired egg hardness."
        ],
        "processed_ingredients": [
            "0.50 avocado",
            "0.50 egg",
            "0.50 tablespoon grated cheese",
            "0.25 teaspoon garlic powder",
            "0.25 teaspoon salt",
            "0.25 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "avocado",
            "egg",
            "cheese",
            "garlic powder",
            "salt",
            "black pepper"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "knife",
            "muffin tin",
            "oven"
        ]
    },
    {
        "recipe_id": "9Oz6B0TGdikfyP04QV9cRyzUUU84N4W",
        "recipe_title": "Tuna Tartare on Fried Potato Gaufrettes",
        "original_instructions": "Preheat a deep pot of oil or a deep fryer to 325 degrees F.\nIn a bowl, combine the tuna, green onions, ginger, wasabi, sesame oil, soy sauce and lime juice, and mix until well blended. Taste and adjust seasoning with lime juice or soy sauce. Set bowl over ice.\nDeep-fry the potato gaufrettes until crisp and golden. Drain onto a paper towel lined plate and season with salt.\nPlace a spoonful of the tuna tartare on one end of each potato gaufrette. Repeat process until you have enough to arrange on a serving platter. Serve immediately.",
        "ingredients": [
            "1/2 pound ahi tuna, small dice",
            "1/2 cup minced green onions",
            "1 teaspoon minced fresh ginger",
            "1 teaspoon wasabi paste",
            "1/2 teaspoon sesame oil",
            "1/4 cup soy sauce",
            "Lime juice or yuzu",
            "1 pound potato, waffle sliced on a mandolin",
            "Cooking oil, for deep frying",
            "Salt"
        ],
        "step_by_step_instructions": [
            "Preheat a deep pot of oil or a deep fryer to 325 degrees F.",
            "In a bowl, combine 2 ounces of diced ahi tuna, 1 tablespoon of minced green onions, 0.2 teaspoon of minced fresh ginger, 0.2 teaspoon of wasabi paste, 0.1 teaspoon of sesame oil, 1 tablespoon of soy sauce and a splash of lime juice. Mix until well blended.",
            "Taste the tuna mixture and adjust seasoning with additional lime juice or soy sauce as needed.",
            "Set the bowl with the tuna mixture over ice to keep it cool.",
            "Deep-fry approximately 4 ounces of potato gaufrettes until they are crisp and golden.",
            "Drain the fried potato gaufrettes onto a paper towel lined plate and season with a pinch of salt.",
            "Place a spoonful of the tuna tartare on one end of each potato gaufrette.",
            "Arrange the prepared potato gaufrettes on a serving platter.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "2.00 oz ahi tuna",
            "1.00 tbsp green onions",
            "0.20 tsp ginger",
            "0.20 tsp wasabi paste",
            "0.10 tsp sesame oil",
            "1.00 tbsp soy sauce",
            "0.50 oz lime juice",
            "4.00 oz potato",
            "1.00 cup cooking oil",
            "0.10 tsp salt"
        ],
        "pure_ingredients": [
            "ahi tuna",
            "green onions",
            "ginger",
            "wasabi paste",
            "sesame oil",
            "soy sauce",
            "lime juice",
            "potato",
            "cooking oil",
            "salt"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "deep fryer",
            "bowl",
            "mandolin",
            "paper towel",
            "plate",
            "serving platter"
        ]
    },
    {
        "recipe_id": "L4Pxp0c6TBu.S51xsvLNolUmlYB9vOa",
        "recipe_title": "Tangy Almond Garlic String Beans",
        "original_instructions": "Watch how to make this recipe.\nBring a pot of salted water to a boil. Add the beans and cook for just 1 to 2 minutes, until the beans turn bright green. Strain them and run under cold water to stop them from cooking.\nHeat a large nonstick skillet over medium heat. Add the almonds and toast them until golden brown, about 4 minutes, shaking the pan often to avoid burning the almonds. Remove the toasted almonds from the pan.\nReturn the skillet to the burner and increase the heat to medium-high. Heat the olive oil in the pan and add a few pinches of salt, the garlic, ginger, and chili flakes. Cook just until the garlic starts to brown. Add the vinegar and let cook down for 1 to 2 minutes. Remove pan from heat and toss in the beans to coat them thoroughly and evenly with the dressing.\nServe on a platter and scatter the top with the toasted almonds.",
        "ingredients": [
            "Salt",
            "1 pound string beans, trimmed",
            "1/2 cup sliced almonds",
            "1/2 cup olive oil",
            "4 to 5 cloves garlic, smashed",
            "1-inch piece ginger, grated",
            "1/2 teaspoon dried red chili flakes",
            "1/4 cup red wine vinegar"
        ],
        "step_by_step_instructions": [
            "Bring a small pot of salted water to a boil.",
            "Add approximately 4 ounces of string beans to the boiling water and cook for just 1 to 2 minutes, until the beans turn bright green.",
            "Strain the beans and run them under cold water to stop them from cooking.",
            "Heat a small nonstick skillet over medium heat.",
            "Add about 2 tablespoons of sliced almonds to the skillet and toast them until golden brown, about 4 minutes, shaking the pan often to avoid burning the almonds.",
            "Remove the toasted almonds from the pan.",
            "Return the skillet to the burner and increase the heat to medium-high.",
            "Heat approximately 2 tablespoons of olive oil in the pan and add a pinch of salt, 1 smashed garlic clove, a small amount of grated ginger, and a pinch of dried red chili flakes.",
            "Cook just until the garlic starts to brown.",
            "Add about 1 tablespoon of red wine vinegar and let cook down for 1 to 2 minutes.",
            "Remove the pan from heat and toss in the beans to coat them thoroughly and evenly with the dressing.",
            "Serve the beans on a platter and scatter the top with the toasted almonds."
        ],
        "processed_ingredients": [
            "1 pinch salt",
            "4.00 ounce string beans",
            "2.00 tablespoon sliced almonds",
            "2.00 tablespoon olive oil",
            "1.00 clove garlic",
            "0.25 teaspoon grated ginger",
            "0.12 teaspoon dried red chili flakes",
            "1.00 tablespoon red wine vinegar"
        ],
        "pure_ingredients": [
            "salt",
            "string beans",
            "almonds",
            "olive oil",
            "garlic",
            "ginger",
            "chili",
            "vinegar"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "pot",
            "strainer",
            "skillet",
            "spoon",
            "platter"
        ]
    },
    {
        "recipe_id": "YzCNz0pW9jfGDMD/o2X7Np0NtZU5q6u",
        "recipe_title": "Roasted Cauliflower and Broccoli",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 375 degrees F.\nPlace cauliflower and broccoli into a 9 by 13 inch baking dish, toss with the olive oil, and sprinkle with salt. Cover the dish and bake for 1/2 hour. Remove the cover, stir and cook for 30 to 40 minutes more, until vegetables are tender and nicely browned, stirring occasionally.",
        "ingredients": [
            "1 small head cauliflower (2 pounds), cut into florets",
            "2 large stalks broccoli (1 pound), cut into florets",
            "1 head garlic, broken into cloves",
            "2 tablespoons olive oil",
            "1/2 teaspoon salt"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 375 degrees F.",
            "Cut the cauliflower and broccoli into florets.",
            "Place approximately 170g of cauliflower florets and 85g of broccoli florets into a baking dish.",
            "Add 0.5 tablespoon of olive oil and 0.06 teaspoon of salt to the dish.",
            "Toss the vegetables to coat them with oil and salt.",
            "Cover the dish with a lid or foil.",
            "Bake in the preheated oven for 15 minutes.",
            "Remove the cover, stir the vegetables.",
            "Continue to bake uncovered for an additional 15 to 20 minutes, stirring occasionally, until the vegetables are tender and browned."
        ],
        "processed_ingredients": [
            "170.00 g cauliflower",
            "85.00 g broccoli",
            "1.50 clove garlic",
            "0.50 tablespoon olive oil",
            "0.06 teaspoon salt"
        ],
        "pure_ingredients": [
            "cauliflower",
            "broccoli",
            "garlic",
            "olive oil",
            "salt"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "oven",
            "baking dish",
            "knife",
            "cutting board",
            "measuring spoons",
            "stirring spoon",
            "foil or lid"
        ]
    },
    {
        "recipe_id": "SMiO3GKua8Z03vhMdLb52ABGclgHOVK",
        "recipe_title": "Scalloped Potatoes 2 Ways",
        "original_instructions": "Preheat oven to 375 degrees. Rub a baking dish with garlic clove and then with butter.\nIn a medium saucepan, combine potatoes, milk, water, bay leaf and pinch of salt. Bring to a boil, stir, reduce heat and simmer until potatoes are tender.\nDrain the potatoes and layer half of them in the buttered baking dish. Sprinkle on half of the cheese and season with salt, pepper and nutmeg. Spread out remaining potatoes and top with remaining cheese and seasoning. Pour heavy cream over potatoes. Bake for 45 minutes to 1 hour or until golden and bubbly.",
        "ingredients": [
            "1 clove garlic",
            "2 tablespoons butter",
            "4 large russet potatoes, peeled and thinly sliced",
            "1 cup milk",
            "1 cup water",
            "1 bay leaf",
            "Salt",
            "1 1/2 cups grated Swiss cheese",
            "Fresh ground pepper",
            "Nutmeg",
            "2/3 cup heavy cream"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 375 degrees.",
            "Rub a small portion of a baking dish with 0.25 clove of garlic and then with 0.5 tablespoon butter.",
            "In a medium saucepan, combine 1 potato (about 0.25 of the total), 0.25 cup milk, 0.25 cup water, 0.25 bay leaf, and a pinch of salt.",
            "Bring the mixture to a boil, then stir, reduce heat, and simmer until the potatoes are tender.",
            "Drain the potatoes and layer half of them in the buttered baking dish.",
            "Sprinkle on 0.375 cup grated Swiss cheese and season with salt, pepper, and a small amount of nutmeg.",
            "Spread out the remaining potatoes and top with another 0.375 cup Swiss cheese and seasoning.",
            "Pour 0.167 cup heavy cream over the potatoes.",
            "Bake for 45 minutes to 1 hour or until golden and bubbly."
        ],
        "processed_ingredients": [
            "0.25 clove garlic",
            "0.5 tablespoon butter",
            "1 potato",
            "0.25 cup milk",
            "0.25 cup water",
            "0.25 bay leaf",
            "0.375 cup Swiss cheese",
            "0.167 cup heavy cream",
            "1 pinch salt",
            "1 pinch pepper",
            "1 pinch nutmeg"
        ],
        "pure_ingredients": [
            "garlic",
            "butter",
            "potato",
            "milk",
            "water",
            "bay leaf",
            "salt",
            "Swiss cheese",
            "pepper",
            "nutmeg",
            "heavy cream"
        ],
        "cooking_time": "1 hour 15 minutes",
        "required_tools": [
            "oven",
            "baking dish",
            "saucepan",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "CCkaJ62Wm4Je4dC9mV06QEOv5lUzZIu",
        "recipe_title": "Pork Fried Rice",
        "original_instructions": "Heat 2 teaspoons of the oil in a large skillet over medium heat. Add eggs and cook 2 to 3 minutes, stirring frequently, until cooked through and scrambled. Remove eggs from pan and set aside.\nTo the same skillet over medium heat, add remaining 2 teaspoons oil. Add scallions, carrots and garlic and saute 2 minutes. Add rice and pork; cook 1 minute, stirring constantly. Add black bean sauce and stir to coat rice. If the black bean sauce is overly thick, add chicken stock and bring to a boil. Reduce heat to low, cover and simmer 5 minutes, until liquid is absorbed. Fluff with a fork and season, to taste, with salt and black pepper. Stir in cooked egg just before serving.",
        "ingredients": [
            "4 teaspoons peanut oil, divided",
            "2 large eggs",
            "1/4 cup chopped scallions",
            "1/2 cup carrots, diced or pre-shredded",
            "3 cloves garlic, minced",
            "2 cups leftover white rice",
            "1/4 cup black bean sauce",
            "1/4 cups reduced-sodium chicken broth, optional",
            "1 cup diced cooked pork",
            "Salt and ground black pepper"
        ],
        "step_by_step_instructions": [
            "Heat 1 teaspoon of peanut oil in a large skillet over medium heat.",
            "Add 0.5 large eggs and cook for 2 to 3 minutes, stirring frequently, until cooked through and scrambled.",
            "Remove eggs from pan and set aside.",
            "To the same skillet over medium heat, add remaining 1 teaspoon oil.",
            "Add 1 tablespoon chopped scallions, 2 tablespoons carrots, and 1 clove garlic; saute for 2 minutes.",
            "Add 0.5 cup leftover white rice and 0.25 cup diced cooked pork; cook for 1 minute, stirring constantly.",
            "Add 1 tablespoon black bean sauce and stir to coat rice.",
            "If the black bean sauce is overly thick, add 1 tablespoon chicken stock and bring to a boil.",
            "Reduce heat to low, cover, and simmer for 5 minutes, until liquid is absorbed.",
            "Fluff with a fork and season, to taste, with salt and black pepper.",
            "Stir in cooked egg just before serving."
        ],
        "processed_ingredients": [
            "2 teaspoon peanut oil",
            "0.5 large egg",
            "1 tablespoon chopped scallions",
            "2 tablespoon carrots",
            "1 clove garlic",
            "0.5 cup leftover white rice",
            "1 tablespoon black bean sauce",
            "1 tablespoon reduced-sodium chicken broth",
            "0.25 cup diced cooked pork",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper"
        ],
        "pure_ingredients": [
            "peanut oil",
            "egg",
            "scallions",
            "carrots",
            "garlic",
            "white rice",
            "black bean sauce",
            "chicken broth",
            "pork",
            "salt",
            "black pepper"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "large skillet",
            "stirring spoon",
            "fork"
        ]
    },
    {
        "recipe_id": "KU9NgHUOSmvwt.hWi1JavXvY.S81pQO",
        "recipe_title": "Turkey and Bacon Chili",
        "original_instructions": "Heat the oil in a large pot over medium heat. Add the turkey and cook until the color changes, about 5 minutes. Next add the onions and cook till translucent. Then add the garlic and cook for another 2 minutes. Next add the stock, hot sauce, chipotles, tomato paste, chili powder and cumin. Cook it on very low heat, covered, for about 40 minutes. Add three-quarters of the bacon, saving one-quarter for garnish, and cook for an additional 20 minutes, uncovered. Add salt if needed. Serve topped with the chopped bacon and sliced avocado with tortilla chips.",
        "ingredients": [
            "1 tablespoon vegetable oil",
            "4 pounds ground turkey",
            "2 large onions, chopped",
            "3 cloves garlic, crushed",
            "2 cups chicken stock",
            "1 cup hot sauce, such as Frank's Hot Sauce",
            "1/2 cup canned chipotles, diced",
            "1/4 cup tomato paste",
            "3 tablespoons chili powder",
            "1 teaspoon ground cumin",
            "1 pound bacon, cooked and chopped",
            "Salt",
            "1 ripe avocado, sliced",
            "Tortilla chips, for serving"
        ],
        "step_by_step_instructions": [
            "Heat 0.25 tablespoon of vegetable oil in a large pot over medium heat.",
            "Add 0.5 pound of ground turkey and cook until the color changes, about 5 minutes.",
            "Add 0.5 of a large onion, chopped, and cook until translucent.",
            "Add 0.5 clove of garlic, crushed, and cook for another 2 minutes.",
            "Add 0.25 cup of chicken stock, 0.125 cup of hot sauce, 0.06 cup of canned chipotles, 0.03 cup of tomato paste, 0.375 tablespoon of chili powder, and 0.125 teaspoon of ground cumin to the pot.",
            "Cook on very low heat, covered, for about 40 minutes.",
            "Add 0.25 pound of cooked and chopped bacon, saving a small portion for garnish, and cook for an additional 20 minutes, uncovered.",
            "Add salt if needed.",
            "Serve topped with the reserved chopped bacon and 0.25 of a ripe avocado, sliced, along with tortilla chips."
        ],
        "processed_ingredients": [
            "0.25 tablespoon vegetable oil",
            "0.5 lb ground turkey",
            "0.5 large onion",
            "0.5 clove garlic",
            "0.25 cup chicken stock",
            "0.125 cup hot sauce",
            "0.06 cup canned chipotles",
            "0.03 cup tomato paste",
            "0.375 tablespoon chili powder",
            "0.125 teaspoon ground cumin",
            "0.25 lb bacon",
            "0.25 avocado",
            "1 oz tortilla chips"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "turkey",
            "onion",
            "garlic",
            "chicken stock",
            "hot sauce",
            "chipotles",
            "tomato paste",
            "chili powder",
            "cumin",
            "bacon",
            "salt",
            "avocado",
            "tortilla chips"
        ],
        "cooking_time": "67 minutes",
        "required_tools": [
            "large pot"
        ]
    },
    {
        "recipe_id": "yjsGwpGKoT.KtxNJ01.Ux5a.xjNsuDO",
        "recipe_title": "Tomato Sauce",
        "original_instructions": "Watch how to make this recipe.\nPreheat oven to 325 degrees F.\nIn 2 (13 by 9-inch) pans place tomato halves cut side up. Sprinkle with oil, salt and pepper, onion, garlic, and herbs. Bake tomatoes for 2 hours. Check the tomatoes after 1 hour and turn down the heat if they seem to be cooking too quickly. Then turn the oven to 400 degrees and bake another 30 minutes. Remove from the oven and process tomatoes through a food mill on medium dye setting over a small saucepan. Discard skins. Add white wine, bring to a boil, reduce heat to low and cook for 5 minutes.",
        "ingredients": [
            "20 Roma tomatoes, halved and seeded",
            "1/4 cup olive oil",
            "1/2 teaspoon kosher salt",
            "1 teaspoon pepper",
            "1 cup finely diced onion",
            "2 teaspoons minced garlic",
            "1 tablespoon finely chopped oregano leaves",
            "1 tablespoon finely chopped thyme leaves",
            "1 cup white wine"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 325 degrees F.",
            "In a 13 by 9-inch pan, place approximately 5 Roma tomato halves cut side up.",
            "Sprinkle with about 1.25 tablespoons olive oil, 0.06 teaspoon kosher salt, 0.12 teaspoon pepper, 0.25 cup finely diced onion, 0.5 teaspoon minced garlic, 0.25 tablespoon finely chopped oregano leaves, and 0.25 tablespoon finely chopped thyme leaves.",
            "Bake tomatoes for 2 hours.",
            "Check the tomatoes after 1 hour and turn down the heat if they seem to be cooking too quickly.",
            "Turn the oven to 400 degrees and bake for another 30 minutes.",
            "Remove from the oven and process tomatoes through a food mill on medium dye setting over a small saucepan.",
            "Discard skins.",
            "Add about 0.25 cup white wine, bring to a boil, reduce heat to low and cook for 5 minutes."
        ],
        "processed_ingredients": [
            "5 Roma tomatoes",
            "1.25 tbsp olive oil",
            "0.06 tsp kosher salt",
            "0.12 tsp pepper",
            "0.25 cup onion",
            "0.5 tsp garlic",
            "0.25 tbsp oregano leaves",
            "0.25 tbsp thyme leaves",
            "0.25 cup white wine"
        ],
        "pure_ingredients": [
            "tomatoes",
            "olive oil",
            "salt",
            "pepper",
            "onion",
            "garlic",
            "oregano",
            "thyme",
            "white wine"
        ],
        "cooking_time": "2 hours 35 minutes",
        "required_tools": [
            "oven",
            "13 by 9-inch pan",
            "food mill",
            "small saucepan"
        ]
    },
    {
        "recipe_id": "WDkBERKkVLaLMeICvnWW1apH4Zra0Hy",
        "recipe_title": "Tomato Salad of Tiny Tomatoes",
        "original_instructions": "Rinse the tomatoes, remove the stems, and cut them into halves or quarters. Leave tiny currant tomatoes whole. Put in a bowl with the shallot, season with a pinch of salt and freshly ground pepper, then toss with the olive oil and marjoram. Taste the salad and add a little balsamic vinegar if needed or desired.",
        "ingredients": [
            "1 pint basket of small tomatoes: cherry, red or golden currant tomatoes, yellow pear",
            "1 shallot, finely diced",
            "Salt and freshly ground pepper, to taste",
            "1 tablespoon extra-virgin olive oil",
            "2 teaspoons chopped marjoram or torn basil leaves",
            "Few drops balsamic vinegar, to taste"
        ],
        "step_by_step_instructions": [
            "Rinse about 7.50 oz (half of the pint basket) of small tomatoes and remove the stems.",
            "Cut the tomatoes into halves or quarters, leaving tiny currant tomatoes whole.",
            "Place the tomatoes in a bowl.",
            "Finely dice half of a shallot and add it to the bowl with the tomatoes.",
            "Season the mixture with a pinch of salt and freshly ground pepper.",
            "Add about 0.50 tbsp of extra-virgin olive oil to the bowl.",
            "Chop or tear about 1 tsp of marjoram or basil leaves and add to the mixture.",
            "Toss the ingredients together to combine.",
            "Taste the salad and add a few drops of balsamic vinegar if needed or desired."
        ],
        "processed_ingredients": [
            "7.50 oz small tomatoes",
            "0.50 shallot",
            "0.25 tsp salt",
            "0.25 tsp freshly ground pepper",
            "0.50 tbsp extra-virgin olive oil",
            "1.00 tsp marjoram",
            "0.25 tsp balsamic vinegar"
        ],
        "pure_ingredients": [
            "tomatoes",
            "shallot",
            "salt",
            "pepper",
            "olive oil",
            "marjoram",
            "balsamic vinegar"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "knife",
            "cutting board",
            "bowl",
            "spoon"
        ]
    },
    {
        "recipe_id": "CJYIs3PIr0BMUlbwGIQVTzD8Lbi9I7K",
        "recipe_title": "Buffalo Blue Snappy Chicken Wings",
        "original_instructions": "1. Preheat oven to 425 degree F.\n2. Cut tips off wings; cut wings in half at joint. Combine cayenne pepper sauce, Spread and ground cayenne pepper in bowl. Stir in wings until coated.\n3. Arrange wings in roasting pan or bottom of broiler pan, without the rack. Bake 1 hour or until wings are thoroughly cooked and crisp. Serve with 1/2 cup of your favorite Dressing.\n*Use more or less as desired\n**Also terrific with Wish-Bone Light or Fat Free! Chunky Blue Cheese Dressing.",
        "ingredients": [
            "2 lbs. chicken wings",
            "2/3 cup cayenne pepper sauce",
            "1/3 cup I Can't Believe It's Not Butter! Spread, melted",
            "1 half tsp. ground cayenne pepper*",
            "1/2 cup Wish-Bone Chunky Blue Cheese Dressing or your favorite Wish-Bone creamy dressing, such as Buffalo Blue Cheese, Chunky Blue Cheese, or Ranch"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 425 degrees F.",
            "Cut the tips off approximately 3 chicken wings and cut them in half at the joint.",
            "In a bowl, combine 1.5 tablespoons of cayenne pepper sauce, 0.75 tablespoons of melted butter spread, and a pinch of ground cayenne pepper.",
            "Stir the chicken wings into the sauce until they are coated.",
            "Arrange the wings in a roasting pan or the bottom of a broiler pan without the rack.",
            "Bake the wings in the oven for about 1 hour or until they are thoroughly cooked and crisp.",
            "Serve the wings with approximately 1 tablespoon of chunky blue cheese dressing."
        ],
        "processed_ingredients": [
            "0.50 lb chicken wings",
            "1.50 tablespoon cayenne pepper sauce",
            "0.75 tablespoon butter spread",
            "0.13 teaspoon ground cayenne pepper",
            "1.00 tablespoon chunky blue cheese dressing"
        ],
        "pure_ingredients": [
            "chicken",
            "cayenne pepper sauce",
            "butter",
            "cayenne pepper",
            "blue cheese dressing"
        ],
        "cooking_time": "1 hour 10 minutes",
        "required_tools": [
            "oven",
            "bowl",
            "roasting pan",
            "knife"
        ]
    },
    {
        "recipe_id": "Tp8gDNX3VmaT1cIPS5QyZXUI2IkF3hK",
        "recipe_title": "MYOTO - Make Your Own Take Out: Thai Chicken Noodle Soup",
        "original_instructions": "Heat a large heavy-bottomed soup pot with vegetable oil, 2 turns of the pan, over high heat. Once you see the oil ripple, add the sliced onion, chopped garlic and sliced peppers. Season the vegetables with salt and pepper and cook, stirring frequently, for 2 minutes. Add 1 cup shredded carrot and 6 cups chicken stock or broth. Cover with a lid and bring up to a simmer. Once simmering, add the chicken simmer 5 minutes then add noodles and simmer 5 minutes more. Remove the soup from the heat and add the cilantro, basil and the juice of 1 lime.",
        "ingredients": [
            "2 tablespoons vegetable oil, 2 turns of the pan",
            "1 medium size yellow onion, peeled, quartered and thinly sliced",
            "3 garlic cloves, peeled and finely chopped",
            "2 poblano or anaheim peppers, seeded and thinly sliced",
            "Salt and freshly ground black pepper",
            "1 cup shredded carrots, available in pouches in the produce department",
            "6 cups, 1 1/2 quarts, chicken broth",
            "1 1/2 pound chicken tenders cut into bite size chunks, 2 packages",
            "2 small bundles from a 3.75 ounce package of bean thread noodles, there is usually 3 bundles in one package (recommended: Kame)",
            "3 tablespoons cilantro leaves, chopped",
            "15 fresh basil leaves, roughly chopped",
            "1 lime"
        ],
        "step_by_step_instructions": [
            "Heat a large heavy-bottomed soup pot with 0.33 tablespoons vegetable oil over high heat.",
            "Once you see the oil ripple, add 0.17 medium size yellow onion (peeled, quartered, and thinly sliced), 1 finely chopped garlic clove, and 0.33 poblano pepper (seeded and thinly sliced).",
            "Season the vegetables with a pinch of salt and freshly ground black pepper and cook, stirring frequently, for 2 minutes.",
            "Add 0.17 cup shredded carrot and 1 cup chicken broth. Cover with a lid and bring up to a simmer.",
            "Once simmering, add 0.25 pound chicken tenders (cut into bite-size chunks) and simmer for 5 minutes.",
            "Add approximately 0.67 ounces of bean thread noodles and simmer for an additional 5 minutes.",
            "Remove the soup from the heat and add 1 tablespoon chopped cilantro, 5 chopped fresh basil leaves, and the juice of 0.33 lime."
        ],
        "processed_ingredients": [
            "0.33 tbsp vegetable oil",
            "0.17 medium yellow onion",
            "1 clove garlic",
            "0.33 poblano pepper",
            "1 pinch salt",
            "1 pinch black pepper",
            "0.17 cup shredded carrots",
            "1 cup chicken broth",
            "0.25 lb chicken tenders",
            "0.67 oz bean thread noodles",
            "1 tbsp cilantro leaves",
            "5 leaves basil",
            "0.33 lime"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "yellow onion",
            "garlic",
            "poblano pepper",
            "salt",
            "black pepper",
            "carrot",
            "chicken broth",
            "chicken",
            "bean thread noodles",
            "cilantro",
            "basil",
            "lime"
        ],
        "cooking_time": "17 minutes",
        "required_tools": [
            "soup pot",
            "lid",
            "knife",
            "cutting board",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "2vh8HJrremzool6rXg0/1os/UB/gzfW",
        "recipe_title": "Nutty Brown Rice ",
        "original_instructions": "Bring water to a boil in a heavy medium saucepan. Add rice and 1/4 teaspoon salt, then reduce heat to low and simmer, uncovered, until rice is tender, about 40 minutes. Drain in a sieve. Heat butter in a large heavy skillet over medium heat until foam subsides. Add nuts and cook, stirring, until butter and nuts are golden brown, about 4 minutes. Add rice and nutmeg to skillet and toss to coat.\nBring water to a boil in a heavy medium saucepan. Add rice and 1/4 teaspoon salt, then reduce heat to low and simmer, uncovered, until rice is tender, about 40 minutes. Drain in a sieve.\nHeat butter in a large heavy skillet over medium heat until foam subsides. Add nuts and cook, stirring, until butter and nuts are golden brown, about 4 minutes.\nAdd rice and nutmeg to skillet and toss to coat.",
        "ingredients": [
            "4 cups water",
            "1 1/2 cups short-grain brown rice",
            "3 tablespoons unsalted butter",
            "1 1/4 cups mixed nuts, chopped",
            "1/4 teaspoon grated nutmeg"
        ],
        "step_by_step_instructions": [
            "Bring 1 cup of water to a boil in a heavy medium saucepan.",
            "Add 0.375 cups short-grain brown rice and a small pinch of salt, then reduce heat to low and simmer, uncovered, until rice is tender, about 40 minutes.",
            "Drain the rice in a sieve.",
            "Heat 0.75 tablespoons unsalted butter in a large heavy skillet over medium heat until foam subsides.",
            "Add 0.3125 cups mixed nuts, chopped, and cook, stirring, until butter and nuts are golden brown, about 4 minutes.",
            "Add the drained rice and a small pinch of grated nutmeg to the skillet and toss to coat."
        ],
        "processed_ingredients": [
            "1 cup water",
            "0.375 cup short-grain brown rice",
            "0.75 tablespoon unsalted butter",
            "0.3125 cup mixed nuts, chopped",
            "0.0625 teaspoon grated nutmeg",
            "small pinch salt"
        ],
        "pure_ingredients": [
            "water",
            "brown rice",
            "butter",
            "mixed nuts",
            "nutmeg",
            "salt"
        ],
        "cooking_time": "44 minutes",
        "required_tools": [
            "saucepan",
            "sieve",
            "skillet"
        ]
    },
    {
        "recipe_id": "Bm.eij4jLF6nbSlZEpRqkWLwj3ORrzW",
        "recipe_title": "Mushroom Burgers",
        "original_instructions": "In a small saute pan over medium heat, heat 1 tablespoon olive oil and saute shallot until translucent. Add mushrooms, garlic, carrots and saute for 10 to 15 minutes, until most of the liquid from mushrooms has evaporated. Remove from heat and pour mixture into a large bowl. Let cool. Stir in parsley, bread crumbs, egg, balsamic vinegar and salt and pepper to taste. The mixing spoon should stand in the mixture. If not, add more bread crumbs Preheat oven to 400 degrees F.\nShape mushroom mixture into 4 burgers. Heat remaining oil in a large saute pan over medium high heat and sear until golden on both sides. Crumble cheese over the top and place pan in oven for 15 minutes until lightly browned. Remove each burger to a bun and serve with traditional garnish of sliced onion, tomato and fries.",
        "ingredients": [
            "2 tablespoons olive oil, divided",
            "1 large shallot, finely chopped",
            "2 pounds portobello mushrooms, finely chopped",
            "1/2 cup button mushrooms (roughly chop)",
            "2 garlic cloves, minced",
            "1/2 cup carrots, minced",
            "1/4 bunch of Italian parsley, washed, stems removed, finely chopped",
            "2 cups fresh bread crumbs (about 3 slices)",
            "1 egg",
            "1 1/2 tablespoons balsamic vinegar",
            "Salt and pepper to taste",
            "4 ounces Stilton cheese, crumbled",
            "Hamburger buns"
        ],
        "step_by_step_instructions": [
            "Heat 0.5 tablespoon olive oil in a small saute pan over medium heat.",
            "Saute 0.25 shallot until translucent.",
            "Add 0.5 pound portobello mushrooms, 0.06 cup button mushrooms, 0.5 garlic clove, and 0.13 cup carrots to the pan.",
            "Saute for 2.5 minutes until most of the liquid from the mushrooms has evaporated.",
            "Remove from heat and pour the mixture into a large bowl. Let cool.",
            "Stir in 0.06 bunch of parsley, 0.5 cup bread crumbs, 0.25 egg, 0.38 tablespoon balsamic vinegar, and salt and pepper to taste.",
            "Ensure the mixing spoon can stand in the mixture. If not, add more bread crumbs.",
            "Preheat the oven to 400 degrees F.",
            "Shape the mushroom mixture into 1 burger.",
            "Heat 0.25 tablespoon olive oil in a large saute pan over medium-high heat.",
            "Sear the burger until golden on both sides.",
            "Crumble 1 ounce Stilton cheese over the top.",
            "Place the pan in the oven for 15 minutes until lightly browned.",
            "Remove the burger to a bun and serve with traditional garnish of sliced onion, tomato, and fries."
        ],
        "processed_ingredients": [
            "0.5 tablespoon olive oil",
            "0.25 shallot",
            "0.5 pound portobello mushrooms",
            "0.06 cup button mushrooms",
            "0.5 clove garlic",
            "0.13 cup carrots",
            "0.06 bunch parsley",
            "0.5 cup bread crumbs",
            "0.25 egg",
            "0.38 tablespoon balsamic vinegar",
            "1 ounce Stilton cheese",
            "1 hamburger bun"
        ],
        "pure_ingredients": [
            "olive oil",
            "shallot",
            "portobello mushrooms",
            "button mushrooms",
            "garlic",
            "carrots",
            "parsley",
            "bread",
            "egg",
            "balsamic vinegar",
            "salt",
            "pepper",
            "Stilton cheese",
            "onion",
            "tomato",
            "fries",
            "bun"
        ],
        "cooking_time": "60 minutes",
        "required_tools": [
            "saute pan",
            "large bowl",
            "oven"
        ]
    },
    {
        "recipe_id": "6XFfwoW9UhPP6QKwTyv8CoMYYFDUiVC",
        "recipe_title": "Corn and Tomato Pizza",
        "original_instructions": "Preheat a grill to medium-high heat.\nPlace the pizza dough on the grill. Let cook for 1 minute, and then flip with tongs. Move to a cooler spot on the grill (about medium heat). Brush with the olive oil and top with the corn, tomatoes and mozzarella. Cover the grill and cook until the cheese melts and the dough is crisp, about 4 minutes. Top with the scallions and basil.",
        "ingredients": [
            "8 ounces prepared pizza dough, formed into a circle",
            "Olive oil, for brushing",
            "1 ear of corn, kernels cut from the cob",
            "1/4 cup grape tomatoes, sliced in half",
            "Fresh mozzarella slices, for topping",
            "1 tablespoon very thinly sliced scallions (white ends)",
            "2 fresh basil leaves, torn into pieces"
        ],
        "step_by_step_instructions": [
            "Preheat a grill to medium-high heat.",
            "Place approximately 4 ounces of pizza dough on the grill.",
            "Let cook for 1 minute, then flip the dough with tongs.",
            "Move the dough to a cooler spot on the grill set to medium heat.",
            "Brush the dough with about 0.5 tablespoon of olive oil.",
            "Top the dough with around 0.5 ounce of corn kernels, 2 tablespoons of sliced grape tomatoes, and enough fresh mozzarella slices to cover lightly.",
            "Cover the grill and cook until the cheese melts and the dough is crisp, about 4 minutes.",
            "Top the cooked pizza with about 0.5 tablespoon of thinly sliced scallions and 1 torn fresh basil leaf."
        ],
        "processed_ingredients": [
            "4.00 ounce pizza dough",
            "0.50 tablespoon olive oil",
            "0.50 ounce corn kernels",
            "2.00 tablespoon grape tomatoes",
            "2.00 ounce fresh mozzarella",
            "0.50 tablespoon scallions",
            "1.00 leaf basil"
        ],
        "pure_ingredients": [
            "pizza dough",
            "olive oil",
            "corn",
            "tomatoes",
            "mozzarella",
            "scallions",
            "basil"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "grill",
            "tongs",
            "brush",
            "knife"
        ]
    },
    {
        "recipe_id": "rldJ2IQ85XoDIphFRT6Jm0yoTCP81.a",
        "recipe_title": "South African Sweet Potato Fritters",
        "original_instructions": "Heat 2 inches of oil in a heavy saucepan or fryer to 375 degrees.\nGrate the sweet potatoes into medium-sized bowl, cover them with boiling water, and let them stand for 15 minutes. Drain off the water and slowly add the remaining ingredients, stirring to make sure that they are well mixed. You should have a thickish paste that will hold its shape when picked up in a tablespoon. If the mixture is too thick, add a bit of warm water. If it is too thin, add a bit more flour.\nDrop the mixture, a few tablespoons at a time, into the hot oil and cook the fritters for 3 to 5 minutes, or until they float to the surface, turning them once to make sure that they are slightly browned on each side. Drain on absorbent paper and serve hot.",
        "ingredients": [
            "Peanut oil for frying",
            "1 pound sweet potatoes, peeled",
            "1/2 cup flour",
            "1 egg, beaten",
            "Salt and freshly ground black pepper, to taste"
        ],
        "step_by_step_instructions": [
            "Heat 2 inches of oil in a heavy saucepan or fryer to 375 degrees.",
            "Grate approximately 113 grams of sweet potatoes into a medium-sized bowl.",
            "Cover them with boiling water and let them stand for 15 minutes.",
            "Drain off the water and slowly add approximately 28 grams of flour, a quarter of a beaten egg, salt, and pepper to taste, stirring to make sure that they are well mixed.",
            "Ensure you have a thickish paste that will hold its shape when picked up in a tablespoon. Adjust with a bit of warm water if too thick or a bit more flour if too thin.",
            "Drop the mixture, a few tablespoons at a time, into the hot oil.",
            "Cook the fritters for 3 to 5 minutes, or until they float to the surface, turning them once to make sure they are slightly browned on each side.",
            "Drain on absorbent paper and serve hot."
        ],
        "processed_ingredients": [
            "113.00 g sweet potatoes",
            "28.00 g flour",
            "0.25 egg",
            "to taste salt",
            "to taste pepper",
            "enough oil"
        ],
        "pure_ingredients": [
            "oil",
            "sweet potatoes",
            "flour",
            "egg",
            "salt",
            "pepper"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "saucepan",
            "grater",
            "bowl",
            "spoon",
            "fryer",
            "absorbent paper"
        ]
    },
    {
        "recipe_id": "y5OnArCxJ0erwDceaCKl38fHBE1iJdK",
        "recipe_title": "Pan Fried Potatoes with Paprika and Lemon ",
        "original_instructions": "Heat oil in heavy large pot over high heat. Add potatoes and sauté until beginning to brown, about 12 minutes. Reduce heat to medium. Add onion; sauté until onion is just tender, about 5 minutes. Mix in paprika. Cook until potatoes are tender, stirring occasionally, about 5 minutes. Sprinkle potato mixture with lemon juice and parsley. Season with salt and pepper.\nHeat oil in heavy large pot over high heat. Add potatoes and sauté until beginning to brown, about 12 minutes. Reduce heat to medium. Add onion; sauté until onion is just tender, about 5 minutes. Mix in paprika. Cook until potatoes are tender, stirring occasionally, about 5 minutes. Sprinkle potato mixture with lemon juice and parsley. Season with salt and pepper.",
        "ingredients": [
            "3 tablespoons olive oil",
            "2 1/4 pounds russet potatoes, unpeeled, cut into 1/2-inch pieces",
            "1 medium onion, chopped",
            "1 teaspoon paprika (preferably Hungarian sweet)",
            "2 tablespoons fresh lemon juice",
            "2 tablespoons chopped fresh Italian parsley"
        ],
        "step_by_step_instructions": [
            "Heat 1 tablespoon of olive oil in a heavy large pot over high heat.",
            "Add approximately 6 ounces of russet potatoes, unpeeled and cut into 1/2-inch pieces, and sauté until beginning to brown, about 12 minutes.",
            "Reduce heat to medium.",
            "Add 1/4 of a medium onion, chopped, and sauté until onion is just tender, about 5 minutes.",
            "Mix in 0.25 teaspoon of paprika.",
            "Cook until potatoes are tender, stirring occasionally, about 5 minutes.",
            "Sprinkle potato mixture with 0.5 tablespoon of fresh lemon juice and 0.5 tablespoon of chopped fresh Italian parsley.",
            "Season with salt and pepper to taste."
        ],
        "processed_ingredients": [
            "1 tablespoon olive oil",
            "6 ounces russet potatoes",
            "0.25 medium onion",
            "0.25 teaspoon paprika",
            "0.5 tablespoon lemon juice",
            "0.5 tablespoon Italian parsley",
            "1 teaspoon salt",
            "1 teaspoon pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "potato",
            "onion",
            "paprika",
            "lemon",
            "parsley",
            "salt",
            "pepper"
        ],
        "cooking_time": "22 minutes",
        "required_tools": [
            "heavy large pot",
            "knife",
            "cutting board",
            "spatula"
        ]
    },
    {
        "recipe_id": "2TQRwg0oN61CXxh4OEXpsDmDnTTy1Z2",
        "recipe_title": "Haricots Verts with Lemon Brown Butter ",
        "original_instructions": "Cook beans in a 2-quart heavy saucepan of boiling water seasoned with 1 teaspoon salt until crisp-tender, about 3 minutes, then drain in a colander. Wipe out pan and cook butter over moderate heat until deep golden, about 2 minutes. Stir in lemon juice and remaining 1/8 teaspoon salt and remove pan from heat. Add beans and toss well.\nCook beans in a 2-quart heavy saucepan of boiling water seasoned with 1 teaspoon salt until crisp-tender, about 3 minutes, then drain in a colander.\nWipe out pan and cook butter over moderate heat until deep golden, about 2 minutes. Stir in lemon juice and remaining 1/8 teaspoon salt and remove pan from heat. Add beans and toss well.",
        "ingredients": [
            "1/4 lb haricots verts or other thin green beans, trimmed",
            "1 1/8 teaspoons salt",
            "2 teaspoons unsalted butter",
            "2 teaspoons fresh lemon juice"
        ],
        "step_by_step_instructions": [
            "Bring a 2-quart heavy saucepan of water to a boil and season with 1 teaspoon salt.",
            "Add the haricots verts to the boiling water and cook until crisp-tender, about 3 minutes.",
            "Drain the beans in a colander.",
            "Wipe the saucepan clean and melt 2 teaspoons of unsalted butter over moderate heat.",
            "Cook the butter until it turns deep golden, about 2 minutes.",
            "Stir in 2 teaspoons of fresh lemon juice and 1/8 teaspoon salt, then remove the pan from heat.",
            "Add the drained beans to the pan and toss well to coat with the lemon brown butter."
        ],
        "processed_ingredients": [
            "113.40 g haricots verts",
            "1.13 tsp salt",
            "2 tsp unsalted butter",
            "2 tsp fresh lemon juice"
        ],
        "pure_ingredients": [
            "haricots verts",
            "salt",
            "butter",
            "lemon juice"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "2-quart heavy saucepan",
            "colander"
        ]
    },
    {
        "recipe_id": "ZIbdUSbMnPVMjeLTlIhRARoNNWxcphe",
        "recipe_title": "Smoked Turkey Leg and Green Bean Salad",
        "original_instructions": "Bring a large pot of salted water to a boil over medium heat and add the string beans. Blanch until bright green, about 3 minutes, then transfer to an ice bath. Warm the butter and the oil in a large skillet over medium heat. Add the onion and garlic, a pinch of salt and pepper, and cook until they are softened but have no color. Add the bell pepper to the skillet and continue to saute another 2 minutes. Strain the string beans and pat dry. Add the beans, tomatoes, turkey and lemon juice and stir until all ingredients are evenly incorporated and warm. Transfer to a serving bowl, top with toasted pine nuts and serve.",
        "ingredients": [
            "1 pound string beans, ends trimmed, cut into 1-inch pieces",
            "1 tablespoon butter",
            "1 tablespoon vegetable oil",
            "1 small red onion, sliced in half moons",
            "3 cloves garlic, minced",
            "Kosher salt and freshly ground black pepper",
            "1 red bell pepper, seeded and julienned",
            "6 sun-dried tomatoes packed in oil, chopped",
            "Meat from 1 (1-pound) smoked turkey leg, skin removed and meat roughly chopped, 10 ounces",
            "1 tablespoon lemon juice",
            "1/4 cup pine nuts, toasted"
        ],
        "step_by_step_instructions": [
            "Bring a large pot of salted water to a boil over medium heat.",
            "Add approximately 113.40 g of string beans. Blanch until bright green, about 3 minutes.",
            "Transfer the blanched beans to an ice bath.",
            "Warm 0.50 tbsp of butter and 0.50 tbsp of vegetable oil in a large skillet over medium heat.",
            "Add approximately 0.13 of a small red onion (sliced into half moons) and 0.50 clove of minced garlic to the skillet.",
            "Add a pinch of salt and pepper.",
            "Cook until the onion and garlic are softened but have no color.",
            "Add approximately 0.17 of a red bell pepper (julienned) to the skillet and continue to sauté for another 2 minutes.",
            "Strain the string beans and pat dry.",
            "Add the beans, approximately 1 chopped sun-dried tomato packed in oil, approximately 56.70 g of roughly chopped smoked turkey leg meat, and 0.50 tbsp of lemon juice to the skillet.",
            "Stir until all ingredients are evenly incorporated and warm.",
            "Transfer to a serving bowl, top with approximately 1 tbsp of toasted pine nuts, and serve."
        ],
        "processed_ingredients": [
            "113.40 g string beans",
            "0.50 tbsp butter",
            "0.50 tbsp vegetable oil",
            "0.13 small red onion",
            "0.50 clove garlic",
            "1.00 pinch salt",
            "1.00 pinch black pepper",
            "0.17 red bell pepper",
            "1.00 sun-dried tomato",
            "56.70 g smoked turkey leg",
            "0.50 tbsp lemon juice",
            "1.00 tbsp pine nuts"
        ],
        "pure_ingredients": [
            "string beans",
            "butter",
            "vegetable oil",
            "red onion",
            "garlic",
            "salt",
            "black pepper",
            "red bell pepper",
            "sun-dried tomatoes",
            "turkey",
            "lemon",
            "pine nuts"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "large pot",
            "skillet",
            "ice bath",
            "serving bowl"
        ]
    },
    {
        "recipe_id": "1rCLSoirLCH8MmOFYmSmECRrUirDQNu",
        "recipe_title": "Roasted Red Potatoes with Rosemary",
        "original_instructions": "Preheat oven to 400 degrees F.\nCombine all ingredients in a large bowl and toss to coat potatoes. Transfer potatoes to a large baking sheet or shallow roasting pan. Roast 25 to 30 minutes, until tender and golden.",
        "ingredients": [
            "6 to 8 small red potatoes, quartered into 1/2-inch pieces",
            "1 tablespoon olive oil or garlic-flavored olive oil",
            "1 tablespoon minced fresh rosemary leaves",
            "1/2 teaspoon salt",
            "1/4 teaspoon ground black pepper"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 400 degrees F.",
            "Quarter 1 small red potato into 1/2-inch pieces.",
            "Combine potato pieces, 0.50 tablespoon olive oil, 0.50 tablespoon minced fresh rosemary leaves, 0.08 teaspoon salt, and 0.04 teaspoon ground black pepper in a large bowl.",
            "Toss to coat the potato pieces evenly with the oil and seasonings.",
            "Transfer the coated potato pieces to a large baking sheet or shallow roasting pan.",
            "Roast the potato pieces in the preheated oven for 25 to 30 minutes, until tender and golden."
        ],
        "processed_ingredients": [
            "1 small red potato",
            "0.50 tablespoon olive oil",
            "0.50 tablespoon minced fresh rosemary leaves",
            "0.08 teaspoon salt",
            "0.04 teaspoon ground black pepper"
        ],
        "pure_ingredients": [
            "potato",
            "olive oil",
            "rosemary",
            "salt",
            "black pepper"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "oven",
            "large bowl",
            "baking sheet",
            "shallow roasting pan"
        ]
    },
    {
        "recipe_id": "QxO/zOvOYMr.zvBfM112pZllXA5gcse",
        "recipe_title": "Upright Deviled Eggs",
        "original_instructions": "Special equipment: a piping bag\nPut the eggs in a pot and cover with cold water. Bring to a simmer, then remove from the heat, cover and let sit 10 minutes. Drain, cool and peel the eggs. Cut off the top third of each egg and scoop out the yolks into a medium bowl.\nMash the yolks with a fork. Add the mayonnaise, mustard, chives, hot sauce and paprika and mix until well blended. Taste and season with salt and pepper.\nTransfer the yolk mixture to a piping bag and pipe back into the whites. Serve immediately or cover and refrigerate until ready to serve.",
        "ingredients": [
            "12 large eggs",
            "1/4 cup mayonnaise",
            "2 tablespoons whole-grain mustard",
            "1 tablespoon chopped chives",
            "2 teaspoons hot sauce",
            "2 teaspoons paprika",
            "Kosher salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Put 2 eggs in a pot and cover with cold water.",
            "Bring to a simmer, then remove from the heat, cover and let sit for 10 minutes.",
            "Drain, cool and peel the eggs.",
            "Cut off the top third of each egg and scoop out the yolks into a medium bowl.",
            "Mash the yolks with a fork.",
            "Add 0.33 tbsp mayonnaise, 0.5 tsp mustard, 0.25 tsp chopped chives, 0.16 tsp hot sauce, and 0.16 tsp paprika to the yolks and mix until well blended.",
            "Taste and season with salt and pepper.",
            "Transfer the yolk mixture to a piping bag and pipe back into the whites.",
            "Serve immediately or cover and refrigerate until ready to serve."
        ],
        "processed_ingredients": [
            "2 large eggs",
            "0.33 tablespoon mayonnaise",
            "0.5 tablespoon whole-grain mustard",
            "0.25 tablespoon chopped chives",
            "0.16 teaspoon hot sauce",
            "0.16 teaspoon paprika",
            "salt",
            "pepper"
        ],
        "pure_ingredients": [
            "eggs",
            "mayonnaise",
            "mustard",
            "chives",
            "hot sauce",
            "paprika",
            "salt",
            "pepper"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "pot",
            "bowl",
            "fork",
            "knife",
            "piping bag"
        ]
    },
    {
        "recipe_id": "wZ/fm545YBZ4lAETg8IdEuOfD4J6Xfu",
        "recipe_title": "Thanksgiving Succotash",
        "original_instructions": "Watch how to make this recipe.\nIn a large Dutch oven or heavy pot set over medium heat, cook the bacon, stirring occasionally until crisp, about 5 minutes. Use a slotted spoon to scoop out the bacon and transfer to a paper-towel-lined plate. Reserve the bacon fat in the pot and continue to heat over medium heat. Add the lima beans, corn, broth, onions and garlic, and bring to a simmer. Cook until the vegetables are heated through, about 15 minutes. Stir in the kale and cook until the kale begins to wilt, 3 to 5 minutes, and then add the butter, reserved bacon and some salt and pepper to serve.",
        "ingredients": [
            "5 slices applewood smoked bacon, cut into 1-by-1/4-inch pieces",
            "6 cups frozen or fresh lima beans",
            "4 cups frozen or fresh corn kernels",
            "2 cups chicken broth",
            "2 cups frozen cipollini onions",
            "3 cloves garlic, smashed and chopped",
            "3 cups finely shredded kale or collard greens",
            "4 tablespoons unsalted butter",
            "Kosher salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "In a large Dutch oven or heavy pot set over medium heat, cook approximately 0.83 ounces of bacon, stirring occasionally until crisp, about 5 minutes.",
            "Use a slotted spoon to scoop out the bacon and transfer to a paper-towel-lined plate.",
            "Reserve the bacon fat in the pot and continue to heat over medium heat.",
            "Add approximately 1 cup of lima beans, 0.67 cup of corn, 0.33 cup of chicken broth, 0.33 cup of cipollini onions, and 0.5 clove of garlic, and bring to a simmer.",
            "Cook until the vegetables are heated through, about 15 minutes.",
            "Stir in approximately 0.5 cup of kale and cook until the kale begins to wilt, 3 to 5 minutes.",
            "Add 0.67 tablespoon of butter, the reserved bacon, and some salt and pepper to taste before serving."
        ],
        "processed_ingredients": [
            "0.83 oz bacon",
            "1 cup lima beans",
            "0.67 cup corn",
            "0.33 cup chicken broth",
            "0.33 cup cipollini onions",
            "0.5 clove garlic",
            "0.5 cup kale",
            "0.67 tbsp butter",
            "0.17 tsp salt",
            "0.17 tsp black pepper"
        ],
        "pure_ingredients": [
            "bacon",
            "lima beans",
            "corn",
            "chicken broth",
            "cipollini onions",
            "garlic",
            "kale",
            "butter",
            "salt",
            "pepper"
        ],
        "cooking_time": "23 minutes",
        "required_tools": [
            "Dutch oven",
            "heavy pot",
            "slotted spoon",
            "paper towels"
        ]
    },
    {
        "recipe_id": "7J7oQ.4A2sIDy4TNKhaeaHAEF7r2FIa",
        "recipe_title": "Sopa de Ajo (Garlic Soup)",
        "original_instructions": "Cut the white bread into cubes. Heat the olive oil in a saucepan and fry the bread cubes in it until golden brown. Add the garlic and let it color a little. Season with the paprika powders and salt and pour on the meat stock. Cover and leave to simmer for about 15 minutes. Fill 4 earthenware bowls with soup. Carefully slip 1 egg into each bowl and leave to cook in a preheated oven at about 390 degree F for around 10 minutes. Serve the soup very hot.;",
        "ingredients": [
            "8 to 9 slices stale white bread",
            "6 tablespoon olive oil",
            "6 to 8 cloves garlic, chopped",
            "1 tablespoon mild paprika powder",
            "1 tablespoon hot paprika powder",
            "Salt",
            "Generous 4 cups meat stock",
            "4 eggs"
        ],
        "step_by_step_instructions": [
            "Cut approximately 2 slices of stale white bread into cubes.",
            "Heat 1.5 tablespoons of olive oil in a saucepan and fry the bread cubes until golden brown.",
            "Add about 1.5 to 2 cloves of chopped garlic and let it color a little.",
            "Season with 0.25 tablespoon of mild paprika powder and 0.25 tablespoon of hot paprika powder, and a pinch of salt.",
            "Pour approximately 1 cup of meat stock into the saucepan.",
            "Cover and leave to simmer for about 15 minutes.",
            "Fill an earthenware bowl with the soup.",
            "Carefully slip 1 egg into the bowl.",
            "Leave to cook in a preheated oven at about 390 degrees F for around 10 minutes.",
            "Serve the soup very hot."
        ],
        "processed_ingredients": [
            "2.00 slice stale white bread",
            "1.50 tablespoon olive oil",
            "1.75 clove garlic",
            "0.25 tablespoon mild paprika powder",
            "0.25 tablespoon hot paprika powder",
            "0.25 teaspoon salt",
            "1.00 cup meat stock",
            "1.00 egg"
        ],
        "pure_ingredients": [
            "bread",
            "olive oil",
            "garlic",
            "paprika",
            "salt",
            "meat stock",
            "egg"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "saucepan",
            "oven",
            "knife",
            "earthenware bowl"
        ]
    },
    {
        "recipe_id": "f4t/38RirXl6RJ5/qU/zTjQKgMNMesm",
        "recipe_title": "Cajun Crudite",
        "original_instructions": "Arrange sliced veggies on a platter and squirt lime juice over them. Season vegetables with salt, chili powder and cayenne, then serve.",
        "ingredients": [
            "Whole baby carrots",
            "1/2 seedless European cucumber (super long and wrapped in plastic) thinly sliced on an angle into ovals",
            "4 small celery stalks from the heart, cut into 4-inch pieces",
            "1/2 green bell pepper, cut into thin strips",
            "1 lime, juiced",
            "Salt",
            "2 teaspoons chili powder",
            "Several drops hot sauce or a sprinkle of cayenne pepper"
        ],
        "step_by_step_instructions": [
            "Arrange approximately 3 ounces of sliced vegetables on a platter.",
            "Squirt juice from 0.25 lime over the vegetables.",
            "Season the vegetables with 0.12 teaspoon of salt, 0.5 teaspoon of chili powder, and a sprinkle of cayenne pepper.",
            "Serve the seasoned vegetables immediately."
        ],
        "processed_ingredients": [
            "3.00 oz baby carrots",
            "0.25 cucumber",
            "1.00 oz celery",
            "1.00 oz green bell pepper",
            "0.25 lime",
            "0.12 tsp salt",
            "0.50 tsp chili powder",
            "0.06 tsp cayenne pepper"
        ],
        "pure_ingredients": [
            "baby carrots",
            "cucumber",
            "celery",
            "green bell pepper",
            "lime",
            "salt",
            "chili powder",
            "cayenne pepper"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "knife",
            "cutting board",
            "platter"
        ]
    },
    {
        "recipe_id": "J84clsY3vJeFUXOd8a2MIZzwiMbkbs.",
        "recipe_title": "Cod Bordelaise",
        "original_instructions": "Make the Bordelaise Garnish: Melt the butter in a large skillet over medium-high heat. Add the shallots and cook until translucent, about 5 minutes. Add the mushrooms and thyme and cook 5 minutes longer. Add the wine and cook until the liquid is reduced by half. Discard the thyme.\nMake the Seared Cod: Heat the olive oil in a nonstick skillet over medium-high heat. Season the fillets with salt and pepper and slip them into the pan, skin side down, along with the garlic and thyme. Sear the fillets for 3 minutes, turn them over and cook for 3 minutes more. Reduce the heat to medium, add the butter and cook another 3 minutes, or until the fish is opaque, moist and lightly firm when pressed.\nSpoon the Bordelaise Garnish onto a serving platter, top with the seared cod, and sprinkle with parsley.",
        "ingredients": [
            "2 tablespoons unsalted butter",
            "1/2 cup finely chopped shallots",
            "12 ounces sliced seasonal mushrooms",
            "2 sprigs thyme",
            "1/2 bottle dry red wine",
            "1 recipe Seared Cod",
            "6 sprigs flat-leaf parsley, leaves finely chopped",
            "1 tablespoon extra-virgin olive oil",
            "4 (6-ounce) center-cut cod fillets, skin left on",
            "Salt and freshly ground black pepper",
            "4 cloves garlic, lightly crushed",
            "4 sprigs thyme",
            "1 tablespoon unsalted butter"
        ],
        "step_by_step_instructions": [
            "Melt 0.5 tablespoons of butter in a large skillet over medium-high heat.",
            "Add 1 tablespoon of finely chopped shallots and cook until translucent, about 5 minutes.",
            "Add 3 ounces of sliced mushrooms and 0.5 sprigs of thyme, and cook 5 minutes longer.",
            "Add 2 ounces of dry red wine and cook until the liquid is reduced by half.",
            "Discard the thyme.",
            "Heat 0.25 tablespoons of olive oil in a nonstick skillet over medium-high heat.",
            "Season 1 (6-ounce) cod fillet with salt and pepper.",
            "Slip the fillet into the pan, skin side down, along with 1 clove of lightly crushed garlic and 1 sprig of thyme.",
            "Sear the fillet for 3 minutes, turn it over and cook for 3 minutes more.",
            "Reduce the heat to medium, add 0.25 tablespoons of butter and cook another 3 minutes, or until the fish is opaque, moist, and lightly firm when pressed.",
            "Spoon the Bordelaise Garnish onto a serving platter, top with the seared cod, and sprinkle with 1.5 sprigs of finely chopped parsley leaves."
        ],
        "processed_ingredients": [
            "0.5 tablespoon unsalted butter",
            "1 tablespoon shallots",
            "3 ounces mushrooms",
            "0.5 sprig thyme",
            "2 ounces dry red wine",
            "0.25 tablespoon extra-virgin olive oil",
            "1 cod fillet",
            "1 clove garlic",
            "0.25 tablespoon unsalted butter",
            "1.5 sprigs parsley"
        ],
        "pure_ingredients": [
            "butter",
            "shallots",
            "mushrooms",
            "thyme",
            "red wine",
            "olive oil",
            "cod",
            "salt",
            "black pepper",
            "garlic",
            "parsley"
        ],
        "cooking_time": "21 minutes",
        "required_tools": [
            "large skillet",
            "nonstick skillet",
            "serving platter"
        ]
    },
    {
        "recipe_id": "giacNzL9W0OPqLkjOY2cg4wP0C2OCTW",
        "recipe_title": "Spitfire Shrimp",
        "original_instructions": "Watch how to make this recipe.\nPreheat large nonstick skillet over medium high heat.\nCombine lime juice, hot sauce, cumin, red pepper flakes and seafood seasoning blend.\nQuickly saute garlic and shallots in oil and butter for 1 minute, add shrimp and cook 3 minutes, tossing and turning frequently. Dump pink, firm, cooked shrimp from hot pan into hot seasoning blend and toss in seasoning mixture to coat shrimp evenly. Garnish with chopped chives. Serve warm or chilled.",
        "ingredients": [
            "1 lime, juiced",
            "2 ounces (1/4 cup) hot cayenne pepper sauce",
            "1 tablespoon ground cumin",
            "1/2 teaspoon crushed red pepper flakes",
            "1 tablespoon crab boil seasoning",
            "4 cloves garlic, crushed and chopped",
            "2 shallots, chopped",
            "1 tablespoon extra-virgin olive oil",
            "2 tablespoons butter, cut into pieces",
            "2 pounds jumbo shrimp peeled and de-veined* (See Cook's Note)",
            "12 to 15 blades fresh chives, chopped, for garnish"
        ],
        "step_by_step_instructions": [
            "Preheat a large nonstick skillet over medium high heat.",
            "Combine the juice of 0.25 lime, 0.5 ounce hot cayenne pepper sauce, 0.25 teaspoon ground cumin, 0.06 teaspoon crushed red pepper flakes, and 0.25 tablespoon crab boil seasoning.",
            "Quickly saute 1 clove garlic and 0.5 shallot in 0.25 tablespoon extra-virgin olive oil and 0.5 tablespoon butter for 1 minute.",
            "Add 0.25 pound jumbo shrimp and cook for 3 minutes, tossing and turning frequently.",
            "Transfer the pink, firm, cooked shrimp from the hot pan into the hot seasoning blend and toss to coat the shrimp evenly.",
            "Garnish with 3 chopped chives.",
            "Serve warm or chilled."
        ],
        "processed_ingredients": [
            "0.25 lime",
            "0.5 ounce hot cayenne pepper sauce",
            "0.25 teaspoon ground cumin",
            "0.06 teaspoon crushed red pepper flakes",
            "0.25 tablespoon crab boil seasoning",
            "1 clove garlic",
            "0.5 shallot",
            "0.25 tablespoon extra-virgin olive oil",
            "0.5 tablespoon butter",
            "0.25 pound jumbo shrimp",
            "3 chives"
        ],
        "pure_ingredients": [
            "lime",
            "hot sauce",
            "cumin",
            "red pepper flakes",
            "crab boil seasoning",
            "garlic",
            "shallot",
            "olive oil",
            "butter",
            "shrimp",
            "chives"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "nonstick skillet"
        ]
    },
    {
        "recipe_id": "CQfJM52eqSy.b7t08S./sSVjmXMMaxq",
        "recipe_title": "Grilled Salmon with Coffee Barbecue Sauce",
        "original_instructions": "Prepare an outdoor barbecue grill with good charcoal briquettes or wood chips stacked against one side of the grill and let them burn until ash white. Brush the salmon lightly with the olive oil and season with salt and pepper.\nPlace the fish on the grill and begin to cook over in-direct heat (cooler part of the grill). Grill 2 to 3 minutes on each side until the salmon begins to develop grill marks.\nBrush the fish with the barbecue sauce and cover the area where the fish was cooking with the reserved corn husks. Lay the fish on top and cover the fish with the remaining husks.\nContinue to barbecue the fish in this manner until it reaches the desired doneness\nWhile the fish is cooking lay the corn to the side on the grill and cook quickly. Cook the scallions in a similar fashion.\nWhen the salmon has barbecued under the corn husks, remove and serve.",
        "ingredients": [
            "1 to 2 pound salmon fillet, skin removed",
            "2 tablespoons olive oil, plus olive oil to brush on grill",
            "Salt and freshly ground black pepper to taste",
            "1 cup Coffee Barbecue Sauce",
            "1/2 pound scallions",
            "4 ears of corn, husk and silk removed, reserve husk"
        ],
        "step_by_step_instructions": [
            "Prepare an outdoor barbecue grill with good charcoal briquettes or wood chips stacked against one side of the grill and let them burn until ash white.",
            "Brush approximately 0.25 lb of salmon with 0.5 tablespoon of olive oil and season with salt and pepper.",
            "Place the fish on the grill and begin to cook over in-direct heat (cooler part of the grill). Grill 2 to 3 minutes on each side until the salmon begins to develop grill marks.",
            "Brush the fish with about 0.25 cup of the barbecue sauce.",
            "Cover the area where the fish was cooking with some of the reserved corn husks. Lay the fish on top and cover the fish with more husks.",
            "Continue to barbecue the fish in this manner until it reaches the desired doneness.",
            "While the fish is cooking, lay 1 ear of corn to the side on the grill and cook quickly.",
            "Cook about 60 g of scallions in a similar fashion.",
            "When the salmon has barbecued under the corn husks, remove and serve."
        ],
        "processed_ingredients": [
            "0.25 lb salmon fillet",
            "0.5 tablespoon olive oil",
            "0.25 cup Coffee Barbecue Sauce",
            "60 g scallions",
            "1 ear of corn",
            "some salt",
            "some black pepper"
        ],
        "pure_ingredients": [
            "salmon",
            "olive oil",
            "salt",
            "black pepper",
            "barbecue sauce",
            "scallions",
            "corn",
            "corn husks"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "barbecue grill",
            "brush"
        ]
    },
    {
        "recipe_id": "WAiTSWtpYFvVrBikSv/UGrPfzfv4Qti",
        "recipe_title": "Sweet Potatoes Anna",
        "original_instructions": "Preheat the oven to 400 degrees F.\nThinly slice the potatoes using a mandoline, the slicing blade of a food processor or a chef's knife.\nPlace the butter in the cast-iron or ovenproof skillet and melt it in the preheated oven. Remove and swirl the butter around to coat, and then pour the butter into a dish.\nArrange the sweet potato slices in overlapping concentric circles in the skillet, brushing each layer with some of the butter, sprinkling with salt and pepper, and pressing down to compact, until all of the potatoes and butter have been used. Place a layer of foil directly on the top layer and place an empty pan on top to pack the potatoes down.\nBake until the potato cake can be easily pierced with a knife indicating the potatoes are tender, about 45 minutes. Run a metal spatula around the edge and then carefully invert the potato cake onto a serving platter.",
        "ingredients": [
            "3 pounds assorted colored sweet potatoes, peeled",
            "3/4 cup (1 1/2 sticks) unsalted butter",
            "Kosher salt and freshly ground pepper"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Thinly slice approximately 0.50 lb of assorted colored sweet potatoes using a mandoline, the slicing blade of a food processor, or a chef's knife.",
            "Place about 1.50 tablespoons of unsalted butter in the cast-iron or ovenproof skillet and melt it in the preheated oven. Remove and swirl the butter around to coat, and then pour the butter into a dish.",
            "Arrange the sweet potato slices in overlapping concentric circles in the skillet, brushing each layer with some of the butter, sprinkling with salt and pepper, and pressing down to compact, until all of the potatoes and butter have been used.",
            "Place a layer of foil directly on the top layer and place an empty pan on top to pack the potatoes down.",
            "Bake until the potato cake can be easily pierced with a knife indicating the potatoes are tender, about 45 minutes.",
            "Run a metal spatula around the edge and then carefully invert the potato cake onto a serving platter."
        ],
        "processed_ingredients": [
            "0.50 lb sweet potatoes",
            "1.50 tbsp unsalted butter",
            "0.13 tsp salt",
            "0.13 tsp pepper"
        ],
        "pure_ingredients": [
            "sweet potatoes",
            "butter",
            "salt",
            "pepper"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "oven",
            "mandoline",
            "food processor",
            "chef's knife",
            "cast-iron skillet",
            "ovenproof skillet",
            "dish",
            "foil",
            "empty pan",
            "metal spatula",
            "serving platter"
        ]
    },
    {
        "recipe_id": "eI2fwv2FozUboJdfTUv/13hj4fVGCom",
        "recipe_title": "Spring Greens Sauté with Bacon and Walnuts ",
        "original_instructions": "Heat oil in heavy large skillet over medium-low heat. Add bacon; sauté until almost crisp, about 6 minutes. Add walnuts; sauté 1 minute. Add greens and toss until wilted but still bright green, 5 to 7 minutes. Season to taste with salt and pepper. Transfer to bowl. Sprinkle with cheese, if desired, and serve.\nHeat oil in heavy large skillet over medium-low heat. Add bacon; sauté until almost crisp, about 6 minutes. Add walnuts; sauté 1 minute. Add greens and toss until wilted but still bright green, 5 to 7 minutes. Season to taste with salt and pepper. Transfer to bowl. Sprinkle with cheese, if desired, and serve.",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil",
            "1 thick-cut bacon slice, chopped",
            "1/2 cup coarsely chopped walnuts",
            "1 bunch dandelion greens, Swiss chard, or mustard greens (about 12 ounces), tough bottom stems removed, leaves cut into 1-inch pieces (about 8 cups)",
            "2 tablespoons finely grated Gruyère cheese (optional)"
        ],
        "step_by_step_instructions": [
            "Heat 0.33 tablespoon of olive oil in a heavy large skillet over medium-low heat.",
            "Add 0.33 ounce of chopped bacon; sauté until almost crisp, about 6 minutes.",
            "Add 0.17 cup of chopped walnuts; sauté 1 minute.",
            "Add 2.67 cups of chopped dandelion greens and toss until wilted but still bright green, 5 to 7 minutes.",
            "Season to taste with salt and pepper.",
            "Transfer to a bowl.",
            "Sprinkle with 0.67 tablespoon of grated Gruyère cheese, if desired, and serve."
        ],
        "processed_ingredients": [
            "0.33 tablespoon olive oil",
            "0.33 ounce bacon",
            "0.17 cup walnuts",
            "2.67 cup dandelion greens",
            "0.67 tablespoon Gruyère cheese"
        ],
        "pure_ingredients": [
            "olive oil",
            "bacon",
            "walnuts",
            "dandelion greens",
            "Gruyère cheese",
            "salt",
            "pepper"
        ],
        "cooking_time": "14 minutes",
        "required_tools": [
            "skillet",
            "bowl"
        ]
    },
    {
        "recipe_id": "1zJf6fugIghBBc4GxPnCh5HCHwto8fm",
        "recipe_title": "Baked Mexican Cheese Sticks",
        "original_instructions": "Place the flour in a shallow bowl or plate. In a separate bowl, whisk together the egg and 1 tablespoon water. In another shallow bowl or plate, combine the panko, cilantro, salt and pepper.\nBegin by coating the mozzarella sticks in batches of 2, first dredging in the flour mixture and shaking off excess. Then dip in the egg mixture, letting any excess drip off. Finish by dredging in the panko crumb mixture and shaking any off excess. Transfer the breaded cheese sticks to a sheet pan greased with nonstick cooking spray. Cover and freeze until frozen, about 4 hours and up to 2 days (this will lessen the oozing of the cheese).\nPreheat the oven to 400 degrees F.\nLightly spray the cheese sticks with nonstick cooking spray. Bake until the cheese is soft and the sticks are lightly browned, about 12 minutes.",
        "ingredients": [
            "1/2 cup all-purpose flour",
            "1 egg",
            "1 1/2 cups panko breadcrumbs",
            "2 tablespoons chopped fresh cilantro",
            "1 teaspoon salt",
            "Pinch freshly ground black pepper",
            "1 (12-count) package mozzarella string cheese",
            "Nonstick cooking spray"
        ],
        "step_by_step_instructions": [
            "Place approximately 0.06 cup of all-purpose flour in a shallow bowl or plate.",
            "In a separate bowl, whisk together approximately 0.08 of an egg and 0.06 tablespoon water.",
            "In another shallow bowl or plate, combine approximately 0.19 cup of panko breadcrumbs, 0.25 tablespoon chopped fresh cilantro, 0.13 teaspoon salt, and a small pinch of freshly ground black pepper.",
            "Begin by coating about 1 mozzarella stick, first dredging in the flour mixture and shaking off excess.",
            "Then dip the mozzarella stick in the egg mixture, letting any excess drip off.",
            "Finish by dredging the mozzarella stick in the panko crumb mixture and shaking any off excess.",
            "Transfer the breaded cheese stick to a sheet pan greased with nonstick cooking spray.",
            "Cover and freeze until frozen, about 4 hours and up to 2 days.",
            "Preheat the oven to 400 degrees F.",
            "Lightly spray the cheese stick with nonstick cooking spray.",
            "Bake until the cheese is soft and the stick is lightly browned, about 12 minutes."
        ],
        "processed_ingredients": [
            "0.06 cup all-purpose flour",
            "0.08 egg",
            "0.19 cup panko breadcrumbs",
            "0.25 tablespoon cilantro",
            "0.13 teaspoon salt",
            "1 pinch black pepper",
            "1 ounce mozzarella string cheese",
            "0.25 teaspoon nonstick cooking spray"
        ],
        "pure_ingredients": [
            "flour",
            "egg",
            "breadcrumbs",
            "cilantro",
            "salt",
            "black pepper",
            "mozzarella",
            "cooking spray"
        ],
        "cooking_time": "4 hours 12 minutes",
        "required_tools": [
            "shallow bowls",
            "whisk",
            "sheet pan",
            "oven"
        ]
    },
    {
        "recipe_id": "PMOhfepzJCTF8.hlkIa9wkHDl3ddbBW",
        "recipe_title": "Chicken Provencale with Bell Peppers and Olives",
        "original_instructions": "Use the heel of your hand to flatten chicken into more or less even 1/2-inch thickness. Sprinkle both sides with herbes de Provence and season with salt and pepper. In a large skillet, heat 1 tablespoon oil. Add chicken and saute over medium to medium high heat until well-browned on both sides and almost cooked through, about 5 minutes. Remove to plate, leaving drippings in pan.\nAdd remaining oil to pan. Add peppers and cook, stirring until they begin to soften and brown, about 3 minutes. Add garlic and cook, stirring, for 1 minute. Add wine, bring to a boil, and cook, stirring up any brown bits, for 30 seconds. Return chicken and any accumulated juices to pan, reduce heat to medium-low, and simmer, partially covered, until chicken is cooked through, about 3 minutes. Add olives and heat through, about 1 minute.",
        "ingredients": [
            "4 skinless boneless chicken breast halves, about 5 ounces each",
            "4 teaspoons dried mixed herbs de Provence",
            "4 tablespoons fruity olive oil",
            "6 cups mixed-color bell pepper strips",
            "6 large garlic cloves, finely chopped",
            "1 cup red or white wine",
            "2/3 cup pitted and halved meaty black olives such as Gaeta"
        ],
        "step_by_step_instructions": [
            "Flatten 1 chicken breast half to about 1/2-inch thickness using the heel of your hand.",
            "Sprinkle both sides of the chicken with 1 teaspoon herbes de Provence and season with salt and pepper.",
            "In a large skillet, heat 1 tablespoon olive oil over medium to medium-high heat.",
            "Add the seasoned chicken to the skillet and sauté until well-browned on both sides and almost cooked through, about 5 minutes.",
            "Remove the chicken to a plate, leaving drippings in the pan.",
            "Add 1.5 tablespoons olive oil to the pan.",
            "Add 1.5 cups mixed-color bell pepper strips to the pan and cook, stirring, until they begin to soften and brown, about 3 minutes.",
            "Add 1.5 large garlic cloves, finely chopped, to the pan and cook, stirring, for 1 minute.",
            "Add 1/4 cup wine to the pan, bring to a boil, and cook, stirring up any brown bits, for 30 seconds.",
            "Return the chicken and any accumulated juices to the pan, reduce heat to medium-low, and simmer, partially covered, until the chicken is cooked through, about 3 minutes.",
            "Add about 2.5 tablespoons pitted and halved black olives to the pan and heat through, about 1 minute."
        ],
        "processed_ingredients": [
            "1 chicken breast half",
            "1 teaspoon herbes de Provence",
            "2.5 tablespoons olive oil",
            "1.5 cups bell pepper strips",
            "1.5 large garlic cloves",
            "0.25 cup wine",
            "2.5 tablespoons black olives",
            "salt",
            "pepper"
        ],
        "pure_ingredients": [
            "chicken",
            "herbes de Provence",
            "olive oil",
            "bell pepper",
            "garlic",
            "wine",
            "olives",
            "salt",
            "pepper"
        ],
        "cooking_time": "12 minutes",
        "required_tools": [
            "skillet",
            "plate",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "WE6.ziUs.bfv0z4IMB4keo9j3h8CFiC",
        "recipe_title": "Pear Plum Combination - Babyfood",
        "original_instructions": "Simmer pears and plums, covered in a large saucepan with 1/3 cup water until tender, about 10 minutes. Drain; reserve cooking liquid Transfer fruit to a blender. Working in small batches, blend until smooth. Add up to 1/3 cup boiled and cooled water if needed. Pass mixture through a fine sieve for the smoothest texture. Fill 1/4-cup plastic containers or ice cube trays with puree. Use same method for other fruits combinations.",
        "ingredients": [
            "1 1/2 pounds pears, washed, peeled, cored, and cut into 1-inch pieces",
            "1 1/2 pounds ripe plums, pitted and quartered"
        ],
        "step_by_step_instructions": [
            "Simmer the pears and plums, covered, in a large saucepan with 1 tablespoon of water until tender, about 10 minutes.",
            "Drain and reserve the cooking liquid.",
            "Transfer the fruit to a blender.",
            "Working in small batches, blend until smooth.",
            "Add up to 1 tablespoon of boiled and cooled water if needed.",
            "Pass the mixture through a fine sieve for the smoothest texture.",
            "Fill 1/4-cup plastic containers or ice cube trays with the puree."
        ],
        "processed_ingredients": [
            "136.08 g pears",
            "136.08 g plums",
            "15 ml water"
        ],
        "pure_ingredients": [
            "pears",
            "plums",
            "water"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "saucepan",
            "blender",
            "fine sieve",
            "plastic containers or ice cube trays"
        ]
    },
    {
        "recipe_id": "85QlkwWZ8P508e3voLmUGrN8Esuyhdy",
        "recipe_title": "Wood-Fired Leg of Lamb",
        "original_instructions": "Heat your wood-fired oven 2 hours before cooking. You want it to be a medium-high heat, about 400 degrees F.\nAdd the olive oil, rosemary, salt, pepper, garlic, lemon juice and zest in a mortar and pestle and smash until it reaches a paste. Place the lamb on a sheet tray and rub the paste all over the lamb, getting into every inch of space. If time allows, you can marinate the lamb for at least 4 hours or overnight.\nPlace the lamb on a sheet tray or roasting pan outfitted with a wire rack. Put in the oven and roast until the lamb reaches an internal temperature of 145 degrees F, about 1 1/2 hours.\nAllow the lamb to rest for 20 minutes for the juices to redistribute before carving. Carve against the grain, using the bone as a handle. Place the slices on a platter and garnish with rosemary sprigs and lemon zest. Serve with a simple arugula salad.",
        "ingredients": [
            "1/3 cup extra-virgin olive oil",
            "3 tablespoons roughly chopped fresh rosemary, plus more for garnish",
            "1 tablespoon kosher salt",
            "1 tablespoon freshly ground black pepper",
            "5 cloves garlic",
            "Juice and zest of 1 lemon, plus more for garnish",
            "One 6 to 7-pound leg of lamb, bone in",
            "Arugula salad, for serving"
        ],
        "step_by_step_instructions": [
            "Heat your wood-fired oven to about 400 degrees F, starting 2 hours before cooking.",
            "In a mortar and pestle, combine 0.5 tbsp olive oil, 1 tsp chopped rosemary, 0.25 tsp kosher salt, 0.25 tsp black pepper, 1 clove garlic, and the juice and zest of 0.15 lemon. Smash until it forms a paste.",
            "Place a portion of the lamb (approximately 0.8 lb) on a sheet tray and rub the paste all over the lamb, ensuring it covers every inch.",
            "If possible, allow the lamb to marinate for at least 4 hours or overnight.",
            "Place the lamb on a sheet tray or roasting pan with a wire rack.",
            "Roast the lamb in the oven until it reaches an internal temperature of 145 degrees F, approximately 90 minutes.",
            "Let the lamb rest for 20 minutes to allow the juices to redistribute.",
            "Carve the lamb against the grain using the bone as a handle.",
            "Serve carved slices on a platter, garnished with rosemary sprigs and lemon zest, alongside a simple arugula salad."
        ],
        "processed_ingredients": [
            "0.50 tbsp extra-virgin olive oil",
            "1.00 tsp fresh rosemary",
            "0.25 tsp kosher salt",
            "0.25 tsp freshly ground black pepper",
            "1.00 clove garlic",
            "0.15 whole lemon",
            "0.80 lb leg of lamb",
            "0.50 cup arugula salad"
        ],
        "pure_ingredients": [
            "olive oil",
            "rosemary",
            "salt",
            "black pepper",
            "garlic",
            "lemon",
            "lamb",
            "arugula"
        ],
        "cooking_time": "6 hours",
        "required_tools": [
            "wood-fired oven",
            "mortar and pestle",
            "sheet tray",
            "wire rack",
            "roasting pan",
            "thermometer",
            "knife",
            "platter"
        ]
    }
]