[
    {
        "recipe_id": "rhNWJWNBleEPbEo8oHX8FRRa1v/QR.S",
        "recipe_title": "Moroccan-Style Mussels ",
        "original_instructions": "Cook onion, garlic, and spices in oil in a 5- to 6-quart heavy pot over moderately low heat, stirring, until onion is softened, about 6 minutes. Stir in vinegar and simmer 1 minute. Add chickpeas, sugar, and tomatoes with their juice, then increase heat to moderate and gently simmer, uncovered, stirring occasionally, until slightly thickened, about 15 minutes. Add mussels and return to a simmer. Cover tightly with lid and cook until mussels just open wide, 3 to 6 minutes. (Discard any mussels that remain unopened after 6 minutes.) Stir in parsley and serve in shallow bowls.\nCook onion, garlic, and spices in oil in a 5- to 6-quart heavy pot over moderately low heat, stirring, until onion is softened, about 6 minutes. Stir in vinegar and simmer 1 minute. Add chickpeas, sugar, and tomatoes with their juice, then increase heat to moderate and gently simmer, uncovered, stirring occasionally, until slightly thickened, about 15 minutes. Add mussels and return to a simmer. Cover tightly with lid and cook until mussels just open wide, 3 to 6 minutes. (Discard any mussels that remain unopened after 6 minutes.) Stir in parsley and serve in shallow bowls.",
        "ingredients": [
            "1 medium onion, coarsely chopped (1 cup)",
            "2 garlic cloves, thinly sliced",
            "1 1/4 teaspoons ground cumin",
            "1 teaspoon paprika (preferably hot)",
            "1 teaspoon ground ginger",
            "3/8 teaspoon ground cinnamon",
            "1/8 teaspoon cayenne",
            "3 tablespoons olive oil",
            "1 tablespoon cider vinegar",
            "1 (15- to 19-oz) can chickpeas, rinsed and drained",
            "2 teaspoons sugar",
            "1 (28-oz) can whole tomatoes in juice, juice reserved and tomatoes coarsely chopped",
            "3 lb cultivated mussels, scrubbed and beards removed",
            "2 tablespoons chopped fresh flat-leaf parsley"
        ],
        "step_by_step_instructions": [
            "Cook 0.17 cup of coarsely chopped onion, 0.33 thinly sliced garlic cloves, 0.21 teaspoon ground cumin, 0.17 teaspoon hot paprika, 0.17 teaspoon ground ginger, 0.06 teaspoon ground cinnamon, and 0.02 teaspoon cayenne in 0.5 tablespoon olive oil in a 5- to 6-quart heavy pot over moderately low heat, stirring, until onion is softened, about 6 minutes.",
            "Stir in 0.17 tablespoon cider vinegar and simmer 1 minute.",
            "Add 2.67 oz of rinsed and drained chickpeas, 0.33 teaspoon sugar, and 4.67 oz of coarsely chopped whole tomatoes with their juice, then increase heat to moderate and gently simmer, uncovered, stirring occasionally, until slightly thickened, about 15 minutes.",
            "Add 0.5 lb scrubbed and de-bearded mussels and return to a simmer.",
            "Cover tightly with lid and cook until mussels just open wide, 3 to 6 minutes. Discard any mussels that remain unopened after 6 minutes.",
            "Stir in 0.33 tablespoon chopped fresh flat-leaf parsley and serve in shallow bowls."
        ],
        "processed_ingredients": [
            "0.17 cup onion",
            "0.33 clove garlic",
            "0.21 tsp ground cumin",
            "0.17 tsp paprika",
            "0.17 tsp ground ginger",
            "0.06 tsp ground cinnamon",
            "0.02 tsp cayenne",
            "0.5 tbsp olive oil",
            "0.17 tbsp cider vinegar",
            "2.67 oz chickpeas",
            "0.33 tsp sugar",
            "4.67 oz whole tomatoes",
            "0.5 lb mussels",
            "0.33 tbsp parsley"
        ],
        "pure_ingredients": [
            "onion",
            "garlic",
            "cumin",
            "paprika",
            "ginger",
            "cinnamon",
            "cayenne",
            "olive oil",
            "cider vinegar",
            "chickpeas",
            "sugar",
            "tomatoes",
            "mussels",
            "parsley"
        ],
        "cooking_time": "28 minutes",
        "required_tools": [
            "heavy pot",
            "lid",
            "knife",
            "cutting board",
            "spoon",
            "measuring cups",
            "measuring spoons"
        ]
    },
    {
        "recipe_id": "P7WSq34dy3FPOcMHmbWzP5GLBRfaw3W",
        "recipe_title": "Italian Vegetable Stew (Ciambotta) ",
        "original_instructions": "Heat oil in a 7-to 8-quart heavy pot over medium-high heat until it shimmers. Add onions, celery, carrots, and garlic and cook, stirring occasionally, until pale golden, about 10 minutes. Add eggplant and water and cook, covered, stirring occasionally, until eggplant is slightly softened, about 10 minutes. Stir in tomatoes with juice and bell peppers, then reduce heat to low and cook, uncovered, stirring occasionally, 15 minutes. Meanwhile, cook green beans in a 3- to 4-quart saucepan of well-salted boiling water until crisp-tender, about 5 minutes. Transfer with a slotted spoon to a large bowl. Add zucchini to boiling water and cook until crisp-tender, about 5 minutes. Transfer with slotted spoon to bowl with green beans. Add potatoes to boiling water and cook until just tender, about 10 minutes. Drain and add to beans and zucchini. Add boiled vegetables to stew and simmer, stirring, until all vegetables are very soft, about 15 minutes. Season with 1 1/2 teaspoons salt and 1/2 teaspoon pepper.\nHeat oil in a 7-to 8-quart heavy pot over medium-high heat until it shimmers. Add onions, celery, carrots, and garlic and cook, stirring occasionally, until pale golden, about 10 minutes. Add eggplant and water and cook, covered, stirring occasionally, until eggplant is slightly softened, about 10 minutes.\nStir in tomatoes with juice and bell peppers, then reduce heat to low and cook, uncovered, stirring occasionally, 15 minutes.\nMeanwhile, cook green beans in a 3- to 4-quart saucepan of well-salted boiling water until crisp-tender, about 5 minutes. Transfer with a slotted spoon to a large bowl. Add zucchini to boiling water and cook until crisp-tender, about 5 minutes. Transfer with slotted spoon to bowl with green beans. Add potatoes to boiling water and cook until just tender, about 10 minutes. Drain and add to beans and zucchini.\nAdd boiled vegetables to stew and simmer, stirring, until all vegetables are very soft, about 15 minutes. Season with 1 1/2 teaspoons salt and 1/2 teaspoon pepper.",
        "ingredients": [
            "1/3 cup olive oil",
            "2 medium onions, chopped",
            "2 celery ribs, halved lengthwise and cut into 1/4-inch-thick slices",
            "3 carrots, halved lengthwise and cut into 1/4-inch-thick slices",
            "4 garlic cloves, finely chopped",
            "1 1/4 pounds eggplant, cut into 1-inch pieces",
            "1/2 cup water",
            "1 (28-ounces) can whole tomatoes in juice, drained, juice reserved and tomatoes chopped, or 1 3/4 pounds fresh tomatoes, chopped",
            "2 red bell peppers, cut into 3/4-inch pieces",
            "3/4 pound green beans, trimmed and cut into 2-inch pieces",
            "1 1/4 pounds zucchini, halved lengthwise and cut into 1/4-inch-thick slices",
            "3/4 pound boiling potatoes (about 2 medium), peeled and cut into 1-inch pieces"
        ],
        "step_by_step_instructions": [
            "Heat 1 tablespoon of olive oil in a heavy pot over medium-high heat until it shimmers.",
            "Add 1/4 cup of chopped onions, 1/4 cup of chopped celery, 1/4 cup of chopped carrots, and 1 garlic clove, finely chopped. Cook, stirring occasionally, until pale golden, about 10 minutes.",
            "Add 0.3 pounds of eggplant, cut into 1-inch pieces, and 2 tablespoons of water to the pot. Cook, covered, stirring occasionally, until the eggplant is slightly softened, about 10 minutes.",
            "Stir in 0.4 cup of chopped tomatoes with juice and 0.1 cup of red bell peppers, then reduce heat to low and cook, uncovered, stirring occasionally, for 15 minutes.",
            "Meanwhile, in a separate saucepan, boil well-salted water. Cook 0.2 pounds of green beans until crisp-tender, about 5 minutes. Transfer with a slotted spoon to a large bowl.",
            "In the same boiling water, cook 0.3 pounds of zucchini until crisp-tender, about 5 minutes. Transfer with a slotted spoon to the bowl with green beans.",
            "Add 0.2 pounds of potatoes to the boiling water and cook until just tender, about 10 minutes. Drain and add to the bowl with green beans and zucchini.",
            "Add the boiled vegetables to the stew and simmer, stirring, until all vegetables are very soft, about 15 minutes.",
            "Season with 0.4 teaspoon of salt and 0.1 teaspoon of pepper."
        ],
        "processed_ingredients": [
            "1 tablespoon olive oil",
            "0.25 cup onions",
            "0.25 cup celery",
            "0.25 cup carrots",
            "1 clove garlic",
            "0.3 lb eggplant",
            "2 tablespoon water",
            "0.4 cup tomatoes",
            "0.1 cup red bell peppers",
            "0.2 lb green beans",
            "0.3 lb zucchini",
            "0.2 lb potatoes",
            "0.4 teaspoon salt",
            "0.1 teaspoon pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "onions",
            "celery",
            "carrots",
            "garlic",
            "eggplant",
            "water",
            "tomatoes",
            "red bell peppers",
            "green beans",
            "zucchini",
            "potatoes",
            "salt",
            "pepper"
        ],
        "cooking_time": "70 minutes",
        "required_tools": [
            "heavy pot",
            "saucepan",
            "slotted spoon",
            "bowl"
        ]
    },
    {
        "recipe_id": "/BiRp..glFlooVCyhk8Vh3BsIp5EkYq",
        "recipe_title": "Sour Cherry-Almond Pie",
        "original_instructions": "Make the crust: Pulse the flour, sugar and salt in a food processor to combine. Add the shortening and pulse until the mixture looks like cornmeal. Add the butter and pulse until it is in pea-size pieces. Add the vodka and 2 tablespoons ice water; pulse until the dough just comes together but is still crumbly. Turn out onto a piece of plastic wrap; shape into a disk and wrap. Refrigerate until firm, at least 1 hour or overnight.\nMake the filling: Put the cherries in a medium bowl. Whisk 1/4 cup cherry juice with the cornstarch in a small bowl. Transfer to a small saucepan and add the remaining 1 1/4 cups cherry juice and the sugar. Bring to a boil over medium-high heat and cook, whisking constantly, until thick and glossy, about 30 seconds. Pour over the cherries. Add the almond extract and gently fold to combine.\nPosition racks in the upper and lower thirds of the oven with a baking sheet on the lower rack; preheat to 425 degrees F. Roll out the dough into a 12-inch round on a lightly floured surface. Ease the dough into a 9-inch pie plate. Fold the overhanging dough under itself and crimp with your fingers or a fork. Refrigerate until firm, about 30 minutes.\nAdd the filling to the chilled crust. Transfer the pie to the hot baking sheet and bake 15 minutes. Reduce the oven temperature to 375 degrees F and continue baking until the crust is golden and the filling is bubbling, about 55 more minutes. (Tent the crust with foil if it browns too quickly.) Transfer to a rack.\nMeanwhile, make the topping: Combine the almonds, sugar and egg white in a medium bowl; stir to coat. Spread on a parchment-lined baking sheet in a single layer. Bake on the upper oven rack, stirring halfway through, until dry and lightly golden, about 10 minutes. Let cool completely, then break into clusters. Sprinkle around the edge of the warm pie. Let cool completely.\nPhotograph by Con Poulos",
        "ingredients": [
            "1 1/4 cups all-purpose flour, plus more for dusting",
            "1 tablespoon sugar",
            "1/2 teaspoon salt",
            "4 tablespoons cold vegetable shortening",
            "6 tablespoons cold unsalted butter, cut into small pieces",
            "2 tablespoons cold vodka",
            "3 cups jarred sour cherries (1 1/2 20-ounce jars), plus 1 1/2 cups juice from the jars",
            "3 tablespoons cornstarch",
            "2/3 cup sugar",
            "1/4 teaspoon pure almond extract",
            "1/2 cup blanched sliced almonds",
            "2 tablespoons sugar",
            "1 tablespoon beaten egg white"
        ],
        "step_by_step_instructions": [
            "Pulse 0.16 cups all-purpose flour, 0.04 tbsp sugar and 0.02 tsp salt in a food processor to combine.",
            "Add 0.53 tbsp cold vegetable shortening and pulse until the mixture looks like cornmeal.",
            "Add 0.80 tbsp cold unsalted butter and pulse until it is in pea-size pieces.",
            "Add 0.27 tbsp cold vodka and 0.27 tbsp ice water; pulse until the dough just comes together but is still crumbly.",
            "Turn out onto a piece of plastic wrap; shape into a disk and wrap. Refrigerate until firm, at least 1 hour.",
            "Put 0.40 cups jarred sour cherries in a medium bowl.",
            "Whisk 0.03 cups cherry juice with 0.40 tbsp cornstarch in a small bowl.",
            "Transfer to a small saucepan and add 0.17 cups cherry juice and 0.09 cups sugar.",
            "Bring to a boil over medium-high heat and cook, whisking constantly, until thick and glossy, about 30 seconds.",
            "Pour over the cherries. Add 0.03 tsp pure almond extract and gently fold to combine.",
            "Position racks in the upper and lower thirds of the oven with a baking sheet on the lower rack; preheat to 425 degrees F.",
            "Roll out the dough into a 12-inch round on a lightly floured surface.",
            "Ease the dough into a 9-inch pie plate.",
            "Fold the overhanging dough under itself and crimp with your fingers or a fork.",
            "Refrigerate until firm, about 30 minutes.",
            "Add the filling to the chilled crust.",
            "Transfer the pie to the hot baking sheet and bake 15 minutes.",
            "Reduce the oven temperature to 375 degrees F and continue baking until the crust is golden and the filling is bubbling, about 55 more minutes.",
            "Combine 0.07 cups blanched sliced almonds, 0.27 tbsp sugar and 0.13 tbsp beaten egg white in a medium bowl; stir to coat.",
            "Spread on a parchment-lined baking sheet in a single layer.",
            "Bake on the upper oven rack, stirring halfway through, until dry and lightly golden, about 10 minutes.",
            "Let cool completely, then break into clusters.",
            "Sprinkle around the edge of the warm pie. Let cool completely."
        ],
        "processed_ingredients": [
            "0.16 cups all-purpose flour",
            "0.04 tbsp sugar",
            "0.02 tsp salt",
            "0.53 tbsp cold vegetable shortening",
            "0.80 tbsp cold unsalted butter",
            "0.27 tbsp cold vodka",
            "0.40 cups jarred sour cherries",
            "0.17 cups cherry juice",
            "0.40 tbsp cornstarch",
            "0.09 cups sugar",
            "0.03 tsp pure almond extract",
            "0.07 cups blanched sliced almonds",
            "0.27 tbsp sugar",
            "0.13 tbsp beaten egg white"
        ],
        "pure_ingredients": [
            "flour",
            "sugar",
            "salt",
            "vegetable shortening",
            "butter",
            "vodka",
            "sour cherries",
            "cherry juice",
            "cornstarch",
            "almond extract",
            "almonds",
            "egg"
        ],
        "cooking_time": "3 hours",
        "required_tools": [
            "food processor",
            "plastic wrap",
            "medium bowl",
            "small bowl",
            "small saucepan",
            "whisk",
            "oven",
            "baking sheet",
            "9-inch pie plate",
            "parchment paper"
        ]
    },
    {
        "recipe_id": "P2V2Arp5fhq0ejuqL3SOO3GK4jToVey",
        "recipe_title": "Parmigiano and Herb Chicken Breast Tenders",
        "original_instructions": "Preheat oven to 350 degrees F. Place a nonstick cookie sheet in oven with a tin foil liner.\nHeat 1/2-inch oil in a large nonstick skillet or frying pan over medium to medium high heat.\nSeason chicken tenders with salt and pepper. Wash hands. Place flour in a shallow dish. Beat eggs with water in a second dish along side the flour. In a third dish, combine the breading ingredients. Coat chicken in flour, then egg, then bread and cheese mixture. To keep your hands clean, ask for plastic gloves at the butcher counter. To ease your clean up, try using disposable tin pie tins for the flour, egg and bread crumbs.\nCook chicken until deeply golden on each side, 3 to 4 minutes. Transfer to cookie sheet in preheated oven and finish off for another 5 minutes cooking time. Cook chicken 5 or 6 tenders at a time in a single layer, adding additional oil if necessary. If the chicken begins to brown too quickly lower heat slightly. Serve chicken hot or cold with green salad or, complete as a Parmigiano.\n2 tablespoons extra virgin olive oil\n1 small white onion, finely chopped\n3 cloves garlic, minced\n1 (14 ounce) can chunky style crushed tomatoes\n1 (28 ounce) can crushed tomatoes\n1 cup chicken broth or stock\nA handful fresh basil leaves, torn into small pieces\nCoarse salt\n1 1/2 cups shredded provolone\n1/2 cup grated Parmigiano-Reggiano\n1 pound spaghetti, cooked to al dente\nSet water on to boil for pasta and prepare according to package directions for al dente. Before coating chicken, add oil, onions and garlic to a saucepan to cook medium low heat. Stir occasionally for 10 minutes while you are working on the chicken. Add both cans of tomatoes and a cup of chicken broth and bring sauce to a bubble. Reduce heat to a simmer until ready to serve. Stir in torn basil and season sauce with salt, to your taste.\nPlace a little of the sauce on the chicken tenders, top with the shredded provolone and Parmigiano. Place in oven or broiler to melt the cheese and then serve. Coat the hot, cooked pasta lightly with sauce then serve.\nEnjoy!",
        "ingredients": [
            "Olive oil, for frying",
            "1 1/2 pounds chicken breast tenders",
            "Salt and pepper",
            "1 cup all-purpose flour",
            "2 large eggs, beaten with 1/4 cup water",
            "2 cups Italian style bread crumbs",
            "1 cup shredded Parmesan",
            "6 sprigs or stems fresh thyme leaves, stripped and chopped, 2 to 3 tablespoons",
            "6 sprigs fresh rosemary leaves, finely chopped, 3 tablespoons",
            "2 handfuls chopped flat-leaf parsley leaves",
            "4 cloves garlic, finely chopped",
            "1 teaspoon crushed red pepper flakes",
            "Chicken Parmigiano, recipe follows"
        ],
        "step_by_step_instructions": [
            "Preheat your oven to 350 degrees F.",
            "Place a nonstick cookie sheet in the oven with a tin foil liner.",
            "Heat 0.5 inches of olive oil in a large nonstick skillet over medium to medium-high heat.",
            "Season about 4 chicken breast tenders with salt and pepper.",
            "Place approximately 0.07 cups of all-purpose flour in a shallow dish.",
            "Beat 0.5 large eggs with 0.03 cups of water in a second dish.",
            "In a third dish, combine 0.27 cups of Italian style bread crumbs, 0.13 cups of shredded Parmesan, 1 teaspoon of fresh chopped thyme, 1.5 teaspoons of fresh chopped rosemary, 0.33 handfuls of chopped flat-leaf parsley, 0.67 cloves of finely chopped garlic, and 0.13 teaspoons of crushed red pepper flakes.",
            "Coat the chicken in flour, then egg, then the bread and cheese mixture.",
            "Cook the chicken in the skillet until deeply golden on each side, about 3 to 4 minutes per side.",
            "Transfer the chicken to the preheated cookie sheet and finish cooking in the oven for another 5 minutes.",
            "Serve the chicken hot or cold with a green salad."
        ],
        "processed_ingredients": [
            "0.5 inch Olive oil",
            "0.27 lb Chicken breast tenders",
            "0.08 tsp Salt",
            "0.08 tsp Pepper",
            "0.07 cup All-purpose flour",
            "0.5 unit Egg",
            "0.03 cup Water",
            "0.27 cup Italian style bread crumbs",
            "0.13 cup Shredded Parmesan",
            "1.00 tsp Fresh thyme",
            "1.50 tsp Fresh rosemary",
            "0.33 handful Flat-leaf parsley",
            "0.67 clove Garlic",
            "0.13 tsp Crushed red pepper flakes"
        ],
        "pure_ingredients": [
            "olive oil",
            "chicken",
            "salt",
            "pepper",
            "all-purpose flour",
            "eggs",
            "water",
            "bread crumbs",
            "parmesan",
            "thyme",
            "rosemary",
            "parsley",
            "garlic",
            "red pepper flakes"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "oven",
            "cookie sheet",
            "tin foil",
            "large skillet",
            "shallow dish",
            "whisk"
        ]
    },
    {
        "recipe_id": "M4fZ4szmoWBjDjX0zvIFtAq6LZvebtC",
        "recipe_title": "Balsamic Chicken Wings",
        "original_instructions": "Remove the tips from the wings by cutting between the joints. Transfer the wings to a large resealable plastic bag.\nCombine the honey, brown sugar, vinegar, ginger, garlic and lemon zest and juice in a large bowl. Season with salt and pepper. Pour half the marinade into the bag with the chicken. Squeeze out most of the air and seal the bag. Shake gently to distribute the marinade. Refrigerate for at least 4 hours.\nPreheat the oven to 350 degrees F (180 degrees C).\nHeat a large skillet over medium heat. Working in batches if necessary, sear the chicken wings, flipping once, until golden brown, about 3 minutes. Transfer the skillet to the oven and cook for about 30 minutes, flipping the wings often to prevent them from burning. Remove the skillet from the oven and add the remaining marinade. Continue to cook the wings on the stovetop until the sauce is thick and coats the chicken wings evenly.\nTo serve, arrange the wings on a platter and garnish with lemon zest.",
        "ingredients": [
            "18 chicken wings",
            "1 cup/250ml honey",
            "1 cup/250ml brown sugar",
            "1 cup/250ml balsamic vinegar",
            "2 tablespoons/30ml peeled and grated fresh ginger",
            "2 cloves garlic, minced",
            "Zest and juice of 1 lemon",
            "Salt and freshly ground black pepper",
            "Lemon zest, for garnish"
        ],
        "step_by_step_instructions": [
            "Remove the tips from 3 chicken wings by cutting between the joints. Transfer the wings to a resealable plastic bag.",
            "In a large bowl, combine 2.78 tbsp honey, 2.78 tbsp brown sugar, 2.78 tbsp balsamic vinegar, 0.31 tbsp grated fresh ginger, 0.11 oz minced garlic, and the zest and juice of 0.06 lemon. Season with salt and pepper.",
            "Pour half of the marinade into the bag with the chicken. Squeeze out most of the air and seal the bag. Shake gently to distribute the marinade. Refrigerate for at least 4 hours.",
            "Preheat the oven to 350 degrees F (180 degrees C).",
            "Heat a large skillet over medium heat. Sear the chicken wings, flipping once, until golden brown, about 3 minutes.",
            "Transfer the skillet to the oven and cook for about 30 minutes, flipping the wings often to prevent them from burning.",
            "Remove the skillet from the oven and add the remaining marinade. Continue to cook the wings on the stovetop until the sauce is thick and coats the chicken wings evenly.",
            "To serve, arrange the wings on a platter and garnish with lemon zest."
        ],
        "processed_ingredients": [
            "3.00 chicken wings",
            "2.78 tbsp honey",
            "2.78 tbsp brown sugar",
            "2.78 tbsp balsamic vinegar",
            "0.31 tbsp fresh ginger",
            "0.11 oz garlic",
            "0.06 lemon",
            "to taste salt",
            "to taste black pepper",
            "to taste lemon zest"
        ],
        "pure_ingredients": [
            "chicken",
            "honey",
            "brown sugar",
            "balsamic vinegar",
            "ginger",
            "garlic",
            "lemon",
            "salt",
            "black pepper",
            "lemon zest"
        ],
        "cooking_time": "4 hours 33 minutes",
        "required_tools": [
            "knife",
            "cutting board",
            "large resealable plastic bag",
            "large bowl",
            "large skillet",
            "oven"
        ]
    },
    {
        "recipe_id": "h9oZIxoE/2bZaGOAIUC93H6.1vByJ7y",
        "recipe_title": "Amarone Braised Beef Short Ribs with Taleggio Polenta and Mission Fig Glaze",
        "original_instructions": "For the short ribs: Heat one tablespoon of the olive oil in a heavy-bottom pot or Dutch oven over high heat. When the oil begins to smoke slightly, place the short ribs in the pot and sprinkle with salt and pepper. Roast on all sides until well browned, about 15 minutes total. Remove from the pot and reduce the temperature to medium.\nAdd the remaining tablespoon of olive oil to the same pot and add the celery, carrots and onion and cook over medium-low heat for 20 minutes, stirring occasionally. Add the garlic and cook for another 2 minutes. Add the wine and raise the heat level to high, bring to a boil and cook until the liquid is reduced by half, about 10 minutes. Add 1 tablespoon salt and 1 teaspoon pepper. Tie the rosemary and thyme together with kitchen twine and add the bundle to the pot.\nPlace the roasted ribs on top of the vegetables in the pot and add the beef stock. Bring to a simmer over high heat. Cover the pot and simmer until the meat is very tender, about 2 1/2 hours.\nCarefully remove the short ribs from the pot and set aside. Discard the herbs and skim the excess fat. Continue to cook the vegetables and sauce over medium heat for 20 minutes until reduced to the desired consistency. Put the ribs back in the pot and heat through.\nFor the polenta: Bring the chicken stock to a boil in a large saucepan over high heat. Reduce the heat to medium-low and very slowly whisk in the cornmeal polenta, whisking constantly to make sure there are no lumps. Switch to a wooden spoon and add the salt and pepper and simmer, stirring almost constantly, until the polenta thickens, about 30 minutes. When the polenta is thick and difficult to stir, quickly turn off the heat, add the grated cheeses and fold together. Be sure to scrape the bottom of the pan thoroughly while combining.\nFor the mission fig glaze: Heat the olive oil in a heavy-bottomed saucepot over low heat and saute the shallots until just translucent, a few minutes. Add the vinegar and herbs and increase the heat to medium high. Reduce by half, stirring constantly. Add the figs, sugar and wine and further reduce by a third, continuing to stir throughout. Remove from the heat when you have about 3/4 cup liquid remaining. Pour the glaze through a fine mesh strainer into a small bowl, discarding the solids.\nHeat the olive oil in a large heavy pot or skillet over medium high heat.\nThoroughly wash the kale and remove the stems. Tear the leaves into large bite-size pieces and dry them, either in a salad spinner or on paper towels.\nDrop 5 to 7 pieces of kale in the hot oil and fry until crisp, 60 to 90 seconds. Drain on a wire rack set over paper towels and season with kosher salt while hot. Repeat with the remaining kale until all the pieces are crisp.\nTo serve, spoon some polenta on each serving plate. Place a hot short rib from the cooking liquid on the polenta and spoon over some of the reduced liquid. Drizzle with the fig glaze. Top with some crispy kale.",
        "ingredients": [
            "2 tablespoons olive oil",
            "6 large bone-in short ribs",
            "1 tablespoon kosher salt, plus more to taste",
            "1 teaspoon fresh ground black pepper, plus more to taste",
            "3 ribs celery, finely chopped",
            "2 large carrots, finely chopped",
            "1 large onion, finely chopped",
            "6 cloves garlic",
            "1 bottle Amarone wine, plus some for tasting while cooking",
            "6 fresh rosemary sprigs",
            "6 fresh thyme sprigs",
            "3 cups beef stock",
            "6 cups chicken stock",
            "2 cups fine-ground cornmeal polenta",
            "2 teaspoons kosher salt",
            "2 teaspoons fresh ground black pepper",
            "1/2 cup grated Parmesan",
            "1 cup grated Taleggio cheese",
            "2 teaspoons olive oil",
            "4 shallots, minced",
            "4 cups balsamic vinegar",
            "1 cup Tuscan herb mix (dried thyme, rosemary and sage)",
            "2 cups black mission figs, cut in quarters",
            "1 cup brown sugar",
            "1 cup Amarone wine",
            "2 teaspoons olive oil",
            "6 to 8 cups kale leaves",
            "1/2 teaspoon kosher salt"
        ],
        "step_by_step_instructions": [
            "Heat 0.33 tablespoons of olive oil in a heavy-bottom pot or Dutch oven over high heat.",
            "When the oil begins to smoke slightly, place 1 short rib in the pot and sprinkle with salt and pepper.",
            "Roast on all sides until well browned, about 15 minutes total.",
            "Remove the short rib from the pot and reduce the temperature to medium.",
            "Add 0.33 tablespoons of olive oil to the same pot and add 0.5 ribs of celery, 0.33 large carrot, and 0.17 large onion. Cook over medium-low heat for 20 minutes, stirring occasionally.",
            "Add 1 clove of garlic and cook for another 2 minutes.",
            "Add 0.17 bottles of Amarone wine, raise the heat to high, bring to a boil, and cook until the liquid is reduced by half, about 10 minutes.",
            "Add 0.17 tablespoons of salt and 0.17 teaspoons of pepper.",
            "Tie 1 rosemary sprig and 1 thyme sprig together with kitchen twine and add to the pot.",
            "Place the roasted rib on top of the vegetables in the pot and add 0.5 cups of beef stock.",
            "Bring to a simmer over high heat. Cover the pot and simmer until the meat is very tender, about 2.5 hours.",
            "Carefully remove the short rib from the pot and set aside.",
            "Discard the herbs and skim the excess fat.",
            "Continue to cook the vegetables and sauce over medium heat for 20 minutes until reduced to the desired consistency.",
            "Put the rib back in the pot and heat through.",
            "Bring 1 cup of chicken stock to a boil in a large saucepan over high heat.",
            "Reduce the heat to medium-low and very slowly whisk in 0.33 cups of cornmeal polenta, whisking constantly to make sure there are no lumps.",
            "Switch to a wooden spoon and add 0.33 teaspoons of salt and 0.33 teaspoons of pepper. Simmer, stirring almost constantly, until the polenta thickens, about 30 minutes.",
            "When the polenta is thick and difficult to stir, quickly turn off the heat, add 0.17 cups of grated Parmesan and 0.33 cups of grated Taleggio cheese, and fold together.",
            "Heat 0.33 teaspoons of olive oil in a heavy-bottomed saucepot over low heat and saute 0.67 shallots until just translucent, a few minutes.",
            "Add 0.67 cups of balsamic vinegar and 0.17 cups of herb mix, increase heat to medium-high, and reduce by half, stirring constantly.",
            "Add 0.33 cups of figs, 0.17 cups of brown sugar, and 0.17 cups of Amarone wine. Further reduce by a third, continuing to stir throughout.",
            "Remove from the heat when you have about 0.06 cups of liquid remaining.",
            "Pour the glaze through a fine mesh strainer into a small bowl, discarding the solids.",
            "Heat 0.33 teaspoons of olive oil in a large heavy pot or skillet over medium-high heat.",
            "Thoroughly wash 1 cup of kale leaves, remove the stems, tear into large bite-size pieces, and dry them.",
            "Drop 1 cup of kale in the hot oil and fry until crisp, 60 to 90 seconds.",
            "Drain on a wire rack set over paper towels and season with 0.08 teaspoons of kosher salt while hot.",
            "Repeat with the remaining kale until all the pieces are crisp.",
            "To serve, spoon some polenta on a plate, place a hot short rib on the polenta, spoon over some reduced liquid, drizzle with fig glaze, and top with crispy kale."
        ],
        "processed_ingredients": [
            "0.33 tablespoon olive oil",
            "1 short rib",
            "0.17 tablespoon kosher salt",
            "0.17 teaspoon black pepper",
            "0.5 rib celery",
            "0.33 large carrot",
            "0.17 large onion",
            "1 clove garlic",
            "0.17 bottle Amarone wine",
            "1 rosemary sprig",
            "1 thyme sprig",
            "0.5 cup beef stock",
            "1 cup chicken stock",
            "0.33 cup cornmeal polenta",
            "0.33 teaspoon kosher salt",
            "0.33 teaspoon black pepper",
            "0.17 cup grated Parmesan",
            "0.33 cup grated Taleggio cheese",
            "0.33 teaspoon olive oil",
            "0.67 shallots",
            "0.67 cups balsamic vinegar",
            "0.17 cup herb mix",
            "0.33 cup black mission figs",
            "0.17 cup brown sugar",
            "0.17 cup Amarone wine",
            "0.33 teaspoon olive oil",
            "1 cup kale leaves",
            "0.08 teaspoon kosher salt"
        ],
        "pure_ingredients": [
            "olive oil",
            "short rib",
            "salt",
            "black pepper",
            "celery",
            "carrot",
            "onion",
            "garlic",
            "wine",
            "rosemary",
            "thyme",
            "beef stock",
            "chicken stock",
            "cornmeal",
            "Parmesan",
            "Taleggio cheese",
            "shallot",
            "balsamic vinegar",
            "herb mix",
            "fig",
            "brown sugar",
            "kale"
        ],
        "cooking_time": "225 minutes",
        "required_tools": [
            "heavy-bottom pot",
            "Dutch oven",
            "saucepan",
            "wooden spoon",
            "kitchen twine",
            "fine mesh strainer",
            "wire rack",
            "paper towels"
        ]
    },
    {
        "recipe_id": "OeTEVzozySYP/CWaNqTR.DRabjX/9X2",
        "recipe_title": "Saltimbocca alla Romana",
        "original_instructions": "Carefully flatten the breasts with the smooth side of a meat mallet, in between 2 pieces of plastic wrap. Place 1 sage leaf and 1 slice of prosciutto on each chicken breast and spear them onto the breast with a wooden toothpick. In a large frying pan, melt 1 tablespoon of butter. Add the breasts and pan-fry 2 to 3 minutes on each side. Lightly season the breasts with salt and pepper. Remove breasts from pan and keep warm.\nDilute the pan juices with 1/4 cup white wine and bring to a rapid boil. With a heat resistant whisk, dissolve 1 tablespoon of butter into the sauce. Season with salt and pepper and return the breast to the pan and heat them up quickly.\nServe on a preheated platter and drizzle with the pan juices.\nThis recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The FN chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
        "ingredients": [
            "4 boneless, skinless chicken breasts",
            "4 sage leaves, fully grown",
            "4 slices prociutto ham",
            "2 tablespoons butter",
            "Salt and freshly ground black pepper",
            "1/4 cup dry white wine"
        ],
        "step_by_step_instructions": [
            "Carefully flatten 1 chicken breast with the smooth side of a meat mallet between 2 pieces of plastic wrap.",
            "Place 1 sage leaf and 1 slice of prosciutto on the chicken breast and secure them with a wooden toothpick.",
            "In a large frying pan, melt 0.25 tablespoon of butter.",
            "Add the chicken breast and pan-fry for 2 to 3 minutes on each side.",
            "Lightly season the chicken breast with salt and freshly ground black pepper.",
            "Remove the chicken breast from the pan and keep warm.",
            "Dilute the pan juices with 0.06 cup of dry white wine and bring to a rapid boil.",
            "With a heat-resistant whisk, dissolve 0.25 tablespoon of butter into the sauce.",
            "Season the sauce with salt and freshly ground black pepper.",
            "Return the chicken breast to the pan and heat it up quickly.",
            "Serve the chicken breast on a preheated platter and drizzle with the pan juices."
        ],
        "processed_ingredients": [
            "1.00 piece chicken breast",
            "1.00 piece sage leaf",
            "1.00 slice prosciutto",
            "0.50 tablespoon butter",
            "0.03 cup dry white wine",
            "0.25 teaspoon salt",
            "0.25 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "chicken",
            "sage",
            "prosciutto",
            "butter",
            "salt",
            "black pepper",
            "white wine"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "meat mallet",
            "plastic wrap",
            "wooden toothpick",
            "large frying pan",
            "heat-resistant whisk",
            "preheated platter"
        ]
    },
    {
        "recipe_id": "bvCa0V5BDjM3UB.2u9S6GfH/J6nHdKe",
        "recipe_title": "Brussels Sprouts with Brown Butter and Grain Mustard",
        "original_instructions": "Remove the rough exterior leaves of the Brussels sprouts along with any of the stem and discard. Remove a few layers of the greenish leaves until the yellow starts to show, keep the green leaves separate from the centers. Quarter the centers. Blanch the centers in salted boiling water until just al dente, about 4-5 minutes, and then spread on a large surface pan to cool. Very briefly plunge the green leaves into the water, remove and spread out to cool.\nTo finish the dish, use a fairly large non-reactive and not black-bottomed pan, place the butter in pan and put on a medium to medium-high heat. Cook the butter until golden brown and giving off a nutty aroma, add the grain mustard to the pan and toast slightly for just a moment. Add the Brussels sprouts and cook for about two minutes or just until the sprouts are hot throughout, add the vinegar and taste for seasoning. Add salt and pepper as necessary and finish with the parsley.",
        "ingredients": [
            "2 pounds Brussels sprouts",
            "1/4 cup butter",
            "3 heaping tablespoons of whole grain mustard",
            "2 tablespoons banyuls vinegar, red wine vinegar can substitute",
            "1/4 cup roughly chopped flat leaf parsley"
        ],
        "step_by_step_instructions": [
            "Remove the rough exterior leaves of approximately 0.5 pounds of Brussels sprouts along with any stem and discard.",
            "Remove a few layers of the greenish leaves until the yellow starts to show. Keep the green leaves separate from the centers.",
            "Quarter the centers of the Brussels sprouts.",
            "Blanch the centers in salted boiling water until just al dente, about 4-5 minutes, then spread on a large surface pan to cool.",
            "Very briefly plunge the green leaves into the boiling water, remove, and spread out to cool.",
            "In a fairly large non-reactive and not black-bottomed pan, place about 1 tablespoon of butter and put on medium to medium-high heat.",
            "Cook the butter until golden brown and giving off a nutty aroma.",
            "Add approximately 0.75 tablespoons of whole grain mustard to the pan and toast slightly for just a moment.",
            "Add the Brussels sprouts and cook for about two minutes or just until the sprouts are hot throughout.",
            "Add approximately 0.5 tablespoons of banyuls vinegar and taste for seasoning.",
            "Add salt and pepper as necessary and finish with about 1 tablespoon of roughly chopped flat leaf parsley."
        ],
        "processed_ingredients": [
            "0.5 lb Brussels sprouts",
            "1 tbsp butter",
            "0.75 tbsp whole grain mustard",
            "0.5 tbsp banyuls vinegar",
            "1 tbsp flat leaf parsley"
        ],
        "pure_ingredients": [
            "Brussels sprouts",
            "butter",
            "mustard",
            "vinegar",
            "parsley",
            "salt",
            "pepper"
        ],
        "cooking_time": "12 minutes",
        "required_tools": [
            "pan",
            "pot",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "qQReAP6/UPTQYMR8wLM9rAbw9zyM//q",
        "recipe_title": "Wild Rice with Butternut Squash, Leeks, and Corn ",
        "original_instructions": "Rinse rice in strainer under cold water; drain. Bring 6 cups water and 2 teaspoons coarse salt to boil in large saucepan. Add rice; bring to boil. Reduce heat; simmer uncovered until rice grains begin to split and are tender but still slightly chewy, about 45 minutes. Drain. Spread on rimmed baking sheet to cool. Transfer to bowl. DO AHEAD: Can be made 1 day ahead. Cover and chill. Preheat oven to 350°F. Oil rimmed baking sheet. Toss squash cubes and 3 tablespoons oil in medium bowl. Spread squash in single layer on prepared sheet; sprinkle with salt and pepper. Roast just until tender but firm enough to hold shape, stirring occasionally, about 15 minutes. Transfer squash to bowl. Cool. DO AHEAD: Can be made 1 day ahead. Cover and chill. Melt 4 tablespoons butter in large skillet over medium heat. Add leeks and 3/4 cup water; simmer until leeks are tender, about 7 minutes. Add corn; simmer 2 minutes longer. Add rice and butternut squash; simmer until heated through and liquid is absorbed, about 4 minutes. Stir in 2 tablespoons butter and parsley. Season with salt and pepper. Transfer to bowl and serve.\nRinse rice in strainer under cold water; drain. Bring 6 cups water and 2 teaspoons coarse salt to boil in large saucepan. Add rice; bring to boil. Reduce heat; simmer uncovered until rice grains begin to split and are tender but still slightly chewy, about 45 minutes. Drain. Spread on rimmed baking sheet to cool. Transfer to bowl. DO AHEAD: Can be made 1 day ahead. Cover and chill.\nPreheat oven to 350°F. Oil rimmed baking sheet. Toss squash cubes and 3 tablespoons oil in medium bowl. Spread squash in single layer on prepared sheet; sprinkle with salt and pepper. Roast just until tender but firm enough to hold shape, stirring occasionally, about 15 minutes. Transfer squash to bowl. Cool. DO AHEAD: Can be made 1 day ahead. Cover and chill.\nMelt 4 tablespoons butter in large skillet over medium heat. Add leeks and 3/4 cup water; simmer until leeks are tender, about 7 minutes. Add corn; simmer 2 minutes longer. Add rice and butternut squash; simmer until heated through and liquid is absorbed, about 4 minutes. Stir in 2 tablespoons butter and parsley. Season with salt and pepper. Transfer to bowl and serve.",
        "ingredients": [
            "1 1/2 cups wild rice (about 9 ounces)",
            "2 teaspoons coarse kosher salt",
            "3 cups 1/2-inch cubes peeled butternut squash (from 11/2-pound squash)",
            "3 tablespoons olive oil",
            "6 tablespoons (3/4 stick) butter, divided",
            "1 1/2 cups finely chopped leeks (white part only)",
            "1 1/2 cups frozen white corn kernels, thawed",
            "1 tablespoon chopped fresh Italian parsley"
        ],
        "step_by_step_instructions": [
            "Rinse 0.25 cup wild rice in strainer under cold water; drain.",
            "Bring 1 cup water and 0.33 teaspoon coarse salt to a boil in a large saucepan.",
            "Add rice; bring to a boil.",
            "Reduce heat; simmer uncovered until rice grains begin to split and are tender but still slightly chewy, about 45 minutes.",
            "Drain the rice.",
            "Spread the rice on a rimmed baking sheet to cool.",
            "Oil a rimmed baking sheet and preheat the oven to 350°F.",
            "Toss 0.5 cup butternut squash cubes and 0.5 tablespoon olive oil in a medium bowl.",
            "Spread squash in a single layer on the prepared sheet; sprinkle with salt and pepper.",
            "Roast just until tender but firm enough to hold shape, about 15 minutes, stirring occasionally.",
            "Transfer squash to a bowl and allow to cool.",
            "Melt 0.67 tablespoon butter in a large skillet over medium heat.",
            "Add 0.25 cup finely chopped leeks and 0.13 cup water; simmer until leeks are tender, about 7 minutes.",
            "Add 0.25 cup corn; simmer 2 minutes longer.",
            "Add rice and butternut squash to the skillet; simmer until heated through and liquid is absorbed, about 4 minutes.",
            "Stir in 0.33 tablespoon butter and 0.17 tablespoon chopped parsley.",
            "Season with salt and pepper.",
            "Transfer to a bowl and serve."
        ],
        "processed_ingredients": [
            "0.25 cup wild rice",
            "0.33 teaspoon coarse salt",
            "0.5 cup butternut squash",
            "0.5 tablespoon olive oil",
            "0.67 tablespoon butter",
            "0.25 cup leeks",
            "0.25 cup corn",
            "0.17 tablespoon Italian parsley"
        ],
        "pure_ingredients": [
            "wild rice",
            "salt",
            "butternut squash",
            "olive oil",
            "butter",
            "leeks",
            "corn",
            "parsley"
        ],
        "cooking_time": "73 minutes",
        "required_tools": [
            "strainer",
            "large saucepan",
            "rimmed baking sheet",
            "medium bowl",
            "large skillet"
        ]
    },
    {
        "recipe_id": "b2whaNnn5DOhUYGXAq3Fd9ZB8.FGGka",
        "recipe_title": "Caramelized Shallot Popovers",
        "original_instructions": "Preheat the oven to 450 degrees F.\nFor the garnish: In a skillet, heat the oil on medium heat and cook the shallots until caramelized, about 10 minutes. Season with salt and pepper. Set aside.\nFor the popovers: Place 6 ramekins on a baking tray and put a spoonful of duck fat into each ramekin. Place the tray in the oven and let warm for about 5 minutes so that the fat melts, but doesn't burn.\nMeanwhile, mix the flour and salt in a bowl. In a saucepan, heat the milk on low heat for about 5 minutes.\nIn a large bowl, whisk the eggs until they get very frothy, 2 to 3 minutes. Slowly add the hot milk and continue to whisk. Stir the liquid ingredients into the flour mixture stirring the batter just until mixed. Do not over beat.\nTake the pan out of the oven and pour the batter into each ramekin, about three quarters full. Divide the caramelized shallot mixture on top of each popover and cover with rosemary, grated Cheddar and freshly ground pepper. Bake in the oven until they start to look crusty and golden brown, about 15 minutes. Reduce the oven temperature to 350 degrees F. Continue cooking for about 15 minutes. Make a small incision in each popover 5 minutes before the time is up to release the steam and dry the inside of the popovers. The popovers will be puffy, light, and golden brown.",
        "ingredients": [
            "2 tablespoons olive oil",
            "3 shallots, minced",
            "Salt and freshly ground pepper",
            "1 tablespoon chopped fresh rosemary",
            "1 cup grated aged Cheddar",
            "1/4 cup bacon fat or duck fat, melted",
            "2 cups flour",
            "1 teaspoon salt",
            "2 cups milk",
            "4 eggs, at room temperature"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450 degrees F.",
            "In a skillet, heat 0.33 tbsp of olive oil on medium heat.",
            "Cook 0.5 minced shallot until caramelized, about 10 minutes.",
            "Season with a pinch of salt and freshly ground pepper.",
            "Set aside the caramelized shallots for garnish.",
            "Place 1 ramekin on a baking tray and add 0.67 tbsp of duck fat into the ramekin.",
            "Place the tray in the oven and let warm for about 5 minutes so that the fat melts, but doesn't burn.",
            "Meanwhile, mix 0.33 cup of flour and 0.17 tsp of salt in a bowl.",
            "In a saucepan, heat 0.33 cup of milk on low heat for about 5 minutes.",
            "In a large bowl, whisk 0.67 egg until very frothy, 2 to 3 minutes.",
            "Slowly add the hot milk to the eggs and continue to whisk.",
            "Stir the liquid ingredients into the flour mixture until just mixed. Do not over beat.",
            "Take the pan out of the oven and pour the batter into the ramekin, about three quarters full.",
            "Divide the caramelized shallot mixture on top of the popover.",
            "Cover with a pinch of rosemary, 0.17 cup of grated Cheddar, and freshly ground pepper.",
            "Bake in the oven until the popover starts to look crusty and golden brown, about 15 minutes.",
            "Reduce the oven temperature to 350 degrees F and continue cooking for about 15 minutes.",
            "Make a small incision in the popover 5 minutes before the time is up to release the steam and dry the inside.",
            "The popover will be puffy, light, and golden brown."
        ],
        "processed_ingredients": [
            "0.33 tablespoon olive oil",
            "0.5 shallot",
            "0.17 teaspoon salt",
            "0.17 tablespoon fresh rosemary",
            "0.17 cup grated aged Cheddar",
            "0.67 tablespoon duck fat",
            "0.33 cup flour",
            "0.17 teaspoon salt",
            "0.33 cup milk",
            "0.67 egg"
        ],
        "pure_ingredients": [
            "olive oil",
            "shallot",
            "salt",
            "pepper",
            "rosemary",
            "cheddar",
            "duck fat",
            "flour",
            "milk",
            "egg"
        ],
        "cooking_time": "50 minutes",
        "required_tools": [
            "oven",
            "skillet",
            "baking tray",
            "ramekin",
            "saucepan",
            "bowl",
            "whisk"
        ]
    },
    {
        "recipe_id": "FgOsX1VdpjEtce5SfdtOLpqRbid9GLi",
        "recipe_title": "Almond Cake ",
        "original_instructions": "Finely grind the almonds in a food processor. With an electric mixer, beat the egg yolks with the sugar to a smooth pale cream. Beat in the zests and almond extract. Add the ground almonds and mix very well. With clean beaters, beat the egg whites in a large bowl until stiff peaks form. Fold them into the egg and almond mixture (the mixture is thick, so that you will need to turn it over quite a bit into the egg whites). Grease an 11-inch springform pan, preferably nonstick, with butter and dust it with flour. Pour in the cake batter, and bake into a preheated 350°F for 40 minutes, or until it feels firm to the touch. Let cool before turning out. Just before serving, dust the top of the cake with confectioners' sugar. Or, if you like, cut a St. James cross out of paper. Place it in the middle of the cake, and dust the cake with confectioners' sugar, then remove the paper.\nFinely grind the almonds in a food processor.\nWith an electric mixer, beat the egg yolks with the sugar to a smooth pale cream. Beat in the zests and almond extract. Add the ground almonds and mix very well.\nWith clean beaters, beat the egg whites in a large bowl until stiff peaks form. Fold them into the egg and almond mixture (the mixture is thick, so that you will need to turn it over quite a bit into the egg whites).\nGrease an 11-inch springform pan, preferably nonstick, with butter and dust it with flour. Pour in the cake batter, and bake into a preheated 350°F for 40 minutes, or until it feels firm to the touch. Let cool before turning out.\nJust before serving, dust the top of the cake with confectioners' sugar. Or, if you like, cut a St. James cross out of paper. Place it in the middle of the cake, and dust the cake with confectioners' sugar, then remove the paper.",
        "ingredients": [
            "1/2 pound (1 3/4 cups) blanched whole almonds",
            "6 large eggs, separated",
            "1 1/4 cups superfine sugar",
            "Grated zest of 1 orange",
            "Grated zest of 1 lemon",
            "4 drops almond extract",
            "Confectioners' sugar for dusting"
        ],
        "step_by_step_instructions": [
            "Finely grind approximately 0.22 cups of blanched whole almonds in a food processor.",
            "With an electric mixer, beat about 1 egg yolk with 0.21 cups of superfine sugar to a smooth pale cream.",
            "Beat in a small amount of orange zest and lemon zest, along with about 1 drop of almond extract.",
            "Add the ground almonds and mix very well.",
            "With clean beaters, beat about 1 egg white in a large bowl until stiff peaks form.",
            "Fold the beaten egg whites into the egg and almond mixture, turning it over quite a bit as the mixture is thick.",
            "Grease a small portion of an 11-inch springform pan with butter and dust with flour.",
            "Pour in the cake batter and bake it in a preheated oven at 350°F for about 40 minutes until it feels firm to the touch.",
            "Let the cake cool before turning it out.",
            "Just before serving, dust the top of the cake with a small amount of confectioners' sugar."
        ],
        "processed_ingredients": [
            "0.22 cup blanched whole almonds",
            "1 large egg yolk",
            "0.21 cup superfine sugar",
            "1.67 g orange zest",
            "1.67 g lemon zest",
            "1 drop almond extract",
            "1 large egg white",
            "5.50 g confectioners' sugar"
        ],
        "pure_ingredients": [
            "almonds",
            "eggs",
            "sugar",
            "orange",
            "lemon",
            "almond extract",
            "confectioners' sugar",
            "butter",
            "flour"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "food processor",
            "electric mixer",
            "large bowl",
            "11-inch springform pan",
            "oven"
        ]
    },
    {
        "recipe_id": "nhAguPLBddh76GTgIV1ECmEYjDT.v.S",
        "recipe_title": "Baked Chicken and Bacon-Wrapped Lady Apples ",
        "original_instructions": "Put oven rack in middle position and preheat oven to 400°F. Cook bacon in a 12-inch heavy skillet over moderate heat, turning over once, until edges are lightly browned but bacon is still flexible (it will continue to cook in oven), 6 to 8 minutes total. Transfer to paper towels to drain, reserving fat in skillet. While bacon cooks, core apples, if desired, from bottom, with pointed end of a vegetable peeler or a paring knife, leaving stems intact. Wrap a slice of bacon around each of 8 apples, securing ends of bacon by piercing with stem or using half a wooden pick. Brush a 3-quart (13- by 9-inch) shallow baking dish with some bacon fat, then add apples to dish and bake, uncovered, 10 minutes. Meanwhile, pat chicken dry and sprinkle with salt and pepper. Heat bacon fat in skillet over moderately high heat until hot but not smoking, then cook chicken, turning over once, until browned, about 8 minutes total. Transfer chicken with tongs to baking dish, rearranging some of apples so that chicken fits in bottom of dish, and bake, uncovered, 5 minutes. While chicken bakes, pour off fat from skillet and add cider, vinegar, and marjoram sprigs to skillet. Boil, stirring and scraping up brown bits, until reduced by half (about 3/4 cup), about 5 minutes. Pour sauce through a fine-mesh sieve into a measuring cup, pressing on and then discarding solids. Add butter and chopped marjoram to sauce, stirring until butter is melted. Pour sauce over chicken and apples and continue to bake, uncovered, until chicken is cooked through and apples are tender, about 20 minutes more.\nPut oven rack in middle position and preheat oven to 400°F.\nCook bacon in a 12-inch heavy skillet over moderate heat, turning over once, until edges are lightly browned but bacon is still flexible (it will continue to cook in oven), 6 to 8 minutes total. Transfer to paper towels to drain, reserving fat in skillet.\nWhile bacon cooks, core apples, if desired, from bottom, with pointed end of a vegetable peeler or a paring knife, leaving stems intact. Wrap a slice of bacon around each of 8 apples, securing ends of bacon by piercing with stem or using half a wooden pick.\nBrush a 3-quart (13- by 9-inch) shallow baking dish with some bacon fat, then add apples to dish and bake, uncovered, 10 minutes.\nMeanwhile, pat chicken dry and sprinkle with salt and pepper. Heat bacon fat in skillet over moderately high heat until hot but not smoking, then cook chicken, turning over once, until browned, about 8 minutes total. Transfer chicken with tongs to baking dish, rearranging some of apples so that chicken fits in bottom of dish, and bake, uncovered, 5 minutes.\nWhile chicken bakes, pour off fat from skillet and add cider, vinegar, and marjoram sprigs to skillet. Boil, stirring and scraping up brown bits, until reduced by half (about 3/4 cup), about 5 minutes. Pour sauce through a fine-mesh sieve into a measuring cup, pressing on and then discarding solids. Add butter and chopped marjoram to sauce, stirring until butter is melted. Pour sauce over chicken and apples and continue to bake, uncovered, until chicken is cooked through and apples are tender, about 20 minutes more.",
        "ingredients": [
            "8 thin slices bacon (from a 1/2-lb package)",
            "12 lady apples (about 1 to 2 inches in diameter",
            "6 chicken thighs (2lb; with skin and bones)",
            "1/2 teaspoon salt",
            "1/2 teaspoon black pepper",
            "1 cup unfiltered apple cider",
            "1/2 cup cider vinegar",
            "2 sprigs fresh marjoram plus 2 teaspoons chopped fresh marjoram, or to taste",
            "1 tablespoon cold unsalted butter"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400°F (200°C).",
            "Cook 1 slice of bacon in a skillet over moderate heat, turning over once, until the edges are lightly browned but still flexible, about 6 to 8 minutes. Drain on paper towels, reserving fat in the skillet.",
            "Core 1 lady apple from the bottom using a vegetable peeler or a paring knife, leaving the stem intact.",
            "Wrap the cooked bacon around the apple, securing it with the stem or using half a wooden pick.",
            "Brush a small section of a baking dish with some reserved bacon fat and place the bacon-wrapped apple in the dish.",
            "Bake the apple, uncovered, for 10 minutes.",
            "Pat 1 chicken thigh dry and sprinkle with a pinch of salt and pepper.",
            "Heat the reserved bacon fat in the skillet over moderately high heat until hot but not smoking.",
            "Cook the chicken thigh in the skillet, turning over once, until browned, about 8 minutes.",
            "Transfer the chicken to the baking dish, rearranging the apple to fit the chicken in the dish, and bake, uncovered, for 5 minutes.",
            "Pour off any remaining fat from the skillet and add 1/6 cup of apple cider, 1/12 cup of cider vinegar, and 1 marjoram sprig.",
            "Boil the mixture, stirring and scraping up brown bits, until reduced by half (about 1/8 cup), about 5 minutes.",
            "Strain the sauce through a fine-mesh sieve into a measuring cup, discarding solids.",
            "Add 1/6 tablespoon of butter and 1/3 teaspoon of chopped marjoram to the sauce, stirring until the butter is melted.",
            "Pour the sauce over the chicken and apple in the baking dish.",
            "Continue to bake, uncovered, until the chicken is cooked through and the apple is tender, about 20 minutes more."
        ],
        "processed_ingredients": [
            "1 slice bacon",
            "1 lady apple",
            "0.33 lb chicken thigh",
            "0.08 teaspoon salt",
            "0.08 teaspoon black pepper",
            "41.67 ml apple cider",
            "20.83 ml cider vinegar",
            "1 sprig marjoram",
            "0.17 tablespoon butter"
        ],
        "pure_ingredients": [
            "bacon",
            "apple",
            "chicken",
            "salt",
            "black pepper",
            "cider",
            "vinegar",
            "marjoram",
            "butter"
        ],
        "cooking_time": "62 minutes",
        "required_tools": [
            "oven",
            "skillet",
            "paper towels",
            "vegetable peeler",
            "paring knife",
            "baking dish",
            "tongs",
            "fine-mesh sieve",
            "measuring cup"
        ]
    },
    {
        "recipe_id": "tliUmS.BNXGtGpXcgT/Qpp17L.P8DkO",
        "recipe_title": "Grill-Roasted Turkey ",
        "original_instructions": "Place a large disposable aluminum pan in the bottom of a charcoal grill; add 2 cups water to pan. Fill a charcoal chimney with charcoal; light. Pat turkey dry with paper towels. Place apple, orange, and onion in cavity. Tie legs with kitchen twine. Rub bird inside and out with butter. Season skin lightly with salt and pepper. When coals are covered with ash, spread half on either side of disposable pan. Set top grate on grill. Place turkey on grate over pan (do not allow any part of turkey to sit over coals). Cover grill. Insert stem of an instant-read thermometer into hole in hood. Maintain temperature as close as possible to 350°F by opening vents to increase temperature and closing vents to reduce it, lifting grate with turkey to replenish coals as needed using charcoal chimney. If using wood chips, scatter a handful of drained chips over charcoal every 30 minutes. Cook turkey, rotating every hour for even browning (lift the grate with the turkey on it; rotate grate 180 degrees), until an instant-read thermometer inserted into thickest part of the thigh without touching bone registers 165°F (juices should run clear when thermometer is removed), about 2 3/4 hours. Transfer turkey to a platter. Tent with foil and let rest for 1 hour before carving.\nPlace a large disposable aluminum pan in the bottom of a charcoal grill; add 2 cups water to pan. Fill a charcoal chimney with charcoal; light.\nPat turkey dry with paper towels. Place apple, orange, and onion in cavity. Tie legs with kitchen twine. Rub bird inside and out with butter. Season skin lightly with salt and pepper.\nWhen coals are covered with ash, spread half on either side of disposable pan. Set top grate on grill. Place turkey on grate over pan (do not allow any part of turkey to sit over coals). Cover grill. Insert stem of an instant-read thermometer into hole in hood. Maintain temperature as close as possible to 350°F by opening vents to increase temperature and closing vents to reduce it, lifting grate with turkey to replenish coals as needed using charcoal chimney. If using wood chips, scatter a handful of drained chips over charcoal every 30 minutes.\nCook turkey, rotating every hour for even browning (lift the grate with the turkey on it; rotate grate 180 degrees), until an instant-read thermometer inserted into thickest part of the thigh without touching bone registers 165°F (juices should run clear when thermometer is removed), about 2 3/4 hours.\nTransfer turkey to a platter. Tent with foil and let rest for 1 hour before carving.",
        "ingredients": [
            "1 12-14-pound turkey, giblets and neck removed, brined, at room temperature for 1 hour",
            "1 apple, cored, quartered",
            "1 orange, quartered",
            "1 red onion, peeled, quartered",
            "2 tablespoons unsalted butter, room temperature",
            "Kosher salt and freshly ground black pepper",
            "Special equipment: A charcoal chimney; 2 cups wood chips, soaked in water for at least 2 hours (optional)"
        ],
        "step_by_step_instructions": [
            "Place a disposable aluminum pan in the bottom of a charcoal grill and add about 0.13 cups of water to the pan.",
            "Fill a charcoal chimney with charcoal and light it.",
            "Pat the turkey dry with paper towels.",
            "Place approximately 0.08 of an apple, 0.08 of an orange, and 0.08 of a red onion in the turkey cavity.",
            "Tie the turkey legs with kitchen twine.",
            "Rub the turkey inside and out with about 0.13 tablespoons of unsalted butter.",
            "Season the turkey skin lightly with kosher salt and freshly ground black pepper.",
            "When coals are covered with ash, spread half on either side of the disposable pan.",
            "Set the top grate on the grill and place the turkey on the grate over the pan, ensuring no part of the turkey sits over coals.",
            "Cover the grill and insert the stem of an instant-read thermometer into the hole in the hood.",
            "Maintain the grill temperature as close as possible to 350°F, adjusting vents as needed and replenishing coals with the charcoal chimney.",
            "If using wood chips, scatter a handful of drained chips over the charcoal every 30 minutes.",
            "Cook the turkey, rotating every hour for even browning, until an instant-read thermometer inserted into the thickest part of the thigh registers 165°F, about 20.5 minutes for a single portion.",
            "Transfer the turkey to a platter, tent with foil, and let rest for approximately 20 minutes before carving."
        ],
        "processed_ingredients": [
            "0.79 lb turkey",
            "0.08 apple",
            "0.08 orange",
            "0.08 red onion",
            "0.13 tablespoon unsalted butter",
            "0.13 cup water",
            "0.13 teaspoon kosher salt",
            "0.13 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "turkey",
            "apple",
            "orange",
            "onion",
            "butter",
            "salt",
            "pepper",
            "water",
            "wood chips"
        ],
        "cooking_time": "2 hours",
        "required_tools": [
            "charcoal grill",
            "disposable aluminum pan",
            "charcoal chimney",
            "paper towels",
            "kitchen twine",
            "instant-read thermometer",
            "foil",
            "platter"
        ]
    },
    {
        "recipe_id": "UeyiED0fDB8Sd9VTzkgald9z5QVwU8m",
        "recipe_title": "Baked Ham with Orange-Pepper Glaze",
        "original_instructions": "Remove the ham from the refrigerator 1 hour before baking. Trim off any skin, leaving an even layer of fat (about 1/2 inch thick). Use a sharp paring knife to score through the fat in a diagonal crosshatch pattern without cutting through to the meat. Place the ham, flat-side down, on a roasting rack set in a large roasting pan.\nPosition a rack in the lower third of the oven; preheat to 350 degrees F. Combine the orange juice, 1 cup chicken broth and the melted butter in a measuring cup. Pour over the ham and tent with foil. Bake, basting with the pan juices every 30 minutes, until a thermometer inserted into the thickest part of the ham registers 130 degrees F, 2 to 2 1/2 hours.\nMake the glaze: Remove the ham from the oven, spoon out about 1/4 cup of the pan juices and transfer to a medium bowl. Whisk the pepper jelly, mustard, brown sugar, marmalade, vinegar, thyme, chile powder, coriander, cayenne and orange zest into the bowl.\nBrush the ham with about one-quarter of the glaze. Add the remaining 1 cup broth to the pan. Return to the oven and bake, brushing the ham with more glaze twice (reserve some for finishing), until the surface is caramelized and a thermometer inserted into the thickest part registers 140 degrees F, 1 1/2 to 2 more hours. Transfer the ham to a cutting board. Brush with the reserved glaze; let rest 15 minutes before carving.\nPhotograph by Con Poulos",
        "ingredients": [
            "1 9-to-10-pound fully cooked bone-in ham (butt half)",
            "Finely grated zest and juice of 1 orange",
            "2 cups low-sodium chicken broth",
            "3 tablespoons unsalted butter, melted",
            "1/2 cup hot pepper jelly",
            "1/2 cup whole-grain mustard",
            "1/2 cup packed light brown sugar",
            "1/4 cup orange marmalade",
            "1/4 cup sherry vinegar",
            "2 tablespoons chopped fresh thyme",
            "1 teaspoon ancho chile powder",
            "1 teaspoon ground coriander",
            "1/2 teaspoon cayenne pepper"
        ],
        "step_by_step_instructions": [
            "Remove approximately 1 pound of ham from the refrigerator and let it sit for 1 hour before baking.",
            "Trim off any skin, leaving a fat layer of about 1/2 inch thick.",
            "Score the fat in a diagonal crosshatch pattern without cutting through to the meat.",
            "Place the ham, flat-side down, on a roasting rack set in a large roasting pan.",
            "Position a rack in the lower third of the oven and preheat to 350 degrees F.",
            "Combine approximately 0.5 ounce of orange juice, 0.25 cup of chicken broth, and 0.5 tablespoon of melted butter.",
            "Pour the mixture over the ham and tent with foil.",
            "Bake, basting with the pan juices every 30 minutes, until a thermometer inserted into the thickest part of the ham registers 130 degrees F, about 30 minutes to 45 minutes.",
            "Remove the ham from the oven and spoon out about 1 tablespoon of the pan juices into a medium bowl.",
            "Whisk in 1 tablespoon of hot pepper jelly, 1 tablespoon of mustard, 1 tablespoon of brown sugar, 1 tablespoon of orange marmalade, 0.5 tablespoon of sherry vinegar, 0.5 tablespoon of chopped fresh thyme, 0.25 teaspoon of ancho chile powder, 0.25 teaspoon of ground coriander, 0.12 teaspoon of cayenne pepper, and 0.5 teaspoon of orange zest.",
            "Brush the ham with about one-quarter of the glaze.",
            "Add the remaining 0.25 cup of broth to the pan.",
            "Return to the oven and bake, brushing the ham with more glaze twice, until the surface is caramelized and a thermometer inserted into the thickest part registers 140 degrees F, about 45 minutes to 60 minutes.",
            "Transfer the ham to a cutting board.",
            "Brush with the reserved glaze and let rest for 15 minutes before carving."
        ],
        "processed_ingredients": [
            "1 lb ham",
            "0.5 oz orange juice",
            "0.5 tsp orange zest",
            "0.5 cup chicken broth",
            "0.5 tbsp butter",
            "1 tbsp hot pepper jelly",
            "1 tbsp whole-grain mustard",
            "1 tbsp light brown sugar",
            "1 tbsp orange marmalade",
            "0.5 tbsp sherry vinegar",
            "0.5 tbsp thyme",
            "0.25 tsp ancho chile powder",
            "0.25 tsp ground coriander",
            "0.12 tsp cayenne pepper"
        ],
        "pure_ingredients": [
            "ham",
            "orange",
            "chicken broth",
            "butter",
            "pepper jelly",
            "mustard",
            "brown sugar",
            "marmalade",
            "vinegar",
            "thyme",
            "chile powder",
            "coriander",
            "cayenne"
        ],
        "cooking_time": "2 hours",
        "required_tools": [
            "refrigerator",
            "paring knife",
            "roasting rack",
            "roasting pan",
            "oven",
            "measuring cup",
            "foil",
            "thermometer",
            "bowl",
            "whisk",
            "cutting board"
        ]
    },
    {
        "recipe_id": "Y3ofubX0f//rjb3v0exiroLh1VzkuF.",
        "recipe_title": "Gratin of Potatoes ",
        "original_instructions": "Wash the potato slices well and dry them on a towel. Pour a thin layer of heavy cream on the bottom of a 9\" by 12\" baking dish and alternate layers of potatoes and cheese.Top with cream. Add salt and pepper to taste. Cover with foil and place in a pan of hot water. Bake at 350°F. until the potatoes are just tender. If all the cream has been absorbed, add more. Remove from pan of water, take off foil and replace in the oven to brown lightly. Just before serving, sprinkle with cheese and brown again. This is delicious served with baby lamb.\nWash the potato slices well and dry them on a towel. Pour a thin layer of heavy cream on the bottom of a 9\" by 12\" baking dish and alternate layers of potatoes and cheese.Top with cream. Add salt and pepper to taste. Cover with foil and place in a pan of hot water. Bake at 350°F. until the potatoes are just tender. If all the cream has been absorbed, add more. Remove from pan of water, take off foil and replace in the oven to brown lightly. Just before serving, sprinkle with cheese and brown again. This is delicious served with baby lamb.",
        "ingredients": [
            "3-4 large potatoes, cut in thin slices",
            "1 cup or more heavy cream",
            "2/3 cup grated Gruyère cheese",
            "Salt, pepper"
        ],
        "step_by_step_instructions": [
            "Wash the potato slices well and dry them on a towel.",
            "Pour a thin layer of heavy cream on the bottom of a 9\" by 12\" baking dish.",
            "Alternate layers of potatoes and cheese, topping with cream.",
            "Add salt and pepper to taste.",
            "Cover with foil and place in a pan of hot water.",
            "Bake at 350°F until the potatoes are just tender.",
            "If all the cream has been absorbed, add more cream.",
            "Remove from the pan of water, take off the foil, and replace in the oven to brown lightly.",
            "Just before serving, sprinkle with cheese and brown again."
        ],
        "processed_ingredients": [
            "1.00 lb potatoes",
            "0.25 cup heavy cream",
            "0.17 cup Gruyère cheese",
            "1.00 tsp salt",
            "0.50 tsp pepper"
        ],
        "pure_ingredients": [
            "potatoes",
            "heavy cream",
            "cheese",
            "salt",
            "pepper"
        ],
        "cooking_time": "90 minutes",
        "required_tools": [
            "towel",
            "baking dish",
            "foil",
            "oven",
            "pan"
        ]
    },
    {
        "recipe_id": "T.U4RZFCy6MASJ4Y2ZPhfA3IemyeWAq",
        "recipe_title": "Easy Arancini ",
        "original_instructions": "1. Soak the mushrooms in 1 cup hot water for 20 minutes. 2. Heat a heavy-based, high-sided frying pan or saucepan over medium heat. Add a generous chunk of butter and a glug of oil and sauté the onion and garlic for about 5 minutes until soft but not colored. 3. Add the rice and stir vigorously around the pan for a couple of minutes until the grains start to turn slightly translucent at the edges. Deglaze the pan by pouring in the wine and scraping up the bits at the bottom. Bring to a boil, then lower the heat and simmer for a minute or two to burn off the alcohol. 4. Meanwhile, heat the stock and add the soaking liquor from the mushrooms. Add a ladleful of the hot stock mixture to the rice and stir over medium heat until absorbed, then add another ladleful. Repeat until all the stock is used up or the rice is tender but still al dente. Make sure to stir regularly to create a creamy risotto. (This should take about 20 minutes.) 5. Chop the rehydrated mushrooms into small pieces and gently stir into the cooked risotto. Add a chunk of butter and the Parmesan, then stir to mix well. Taste and adjust the seasoning if necessary, then leave the risotto to cool (it will do this more quickly if you spread it onto a baking sheet). 6. If using mini mozzarella balls, halve them; if using part of a large ball, cut it into 3/4-inch cubes. 7. Lay out 3 plates or shallow bowls. Put the beaten eggs in one, the flour (seasoned with a pinch of salt and pepper) in another, and the breadcrumbs in the final one. 8. Once the risotto is cooled (it doesn't matter if it is still a little warm, as long as it has stiffened up a bit and is cool enough to handle), roll it into balls the size of golf balls. Push a piece of mozzarella into the middle of each ball, making sure that the cheese is completely enclosed. Leave to set in the fridge for at least 30 minutes or overnight. 9. Heat a deep-fat fryer to 340°F or fill a large saucepan one-third full of flavorless oil and heat until a cube of bread dropped into the hot oil sizzles and turns golden brown in 30 seconds. 10. Dip a rice ball into the flour, shake off any excess, then dip into the egg, allowing any excess to drip off. Finish by coating completely in the breadcrumbs. Repeat with the remaining balls. 11. Deep-fry the balls in batches for 2-3 minutes until golden brown all over. Remove with a slotted spoon and drain on paper towels. Serve immediately while the middles are still melting. Drizzle with lemon juice, if using.\n1. Soak the mushrooms in 1 cup hot water for 20 minutes.\n2. Heat a heavy-based, high-sided frying pan or saucepan over medium heat. Add a generous chunk of butter and a glug of oil and sauté the onion and garlic for about 5 minutes until soft but not colored.\n3. Add the rice and stir vigorously around the pan for a couple of minutes until the grains start to turn slightly translucent at the edges. Deglaze the pan by pouring in the wine and scraping up the bits at the bottom. Bring to a boil, then lower the heat and simmer for a minute or two to burn off the alcohol.\n4. Meanwhile, heat the stock and add the soaking liquor from the mushrooms. Add a ladleful of the hot stock mixture to the rice and stir over medium heat until absorbed, then add another ladleful. Repeat until all the stock is used up or the rice is tender but still al dente. Make sure to stir regularly to create a creamy risotto. (This should take about 20 minutes.)\n5. Chop the rehydrated mushrooms into small pieces and gently stir into the cooked risotto. Add a chunk of butter and the Parmesan, then stir to mix well. Taste and adjust the seasoning if necessary, then leave the risotto to cool (it will do this more quickly if you spread it onto a baking sheet).\n6. If using mini mozzarella balls, halve them; if using part of a large ball, cut it into 3/4-inch cubes.\n7. Lay out 3 plates or shallow bowls. Put the beaten eggs in one, the flour (seasoned with a pinch of salt and pepper) in another, and the breadcrumbs in the final one.\n8. Once the risotto is cooled (it doesn't matter if it is still a little warm, as long as it has stiffened up a bit and is cool enough to handle), roll it into balls the size of golf balls. Push a piece of mozzarella into the middle of each ball, making sure that the cheese is completely enclosed. Leave to set in the fridge for at least 30 minutes or overnight.\n9. Heat a deep-fat fryer to 340°F or fill a large saucepan one-third full of flavorless oil and heat until a cube of bread dropped into the hot oil sizzles and turns golden brown in 30 seconds.\n10. Dip a rice ball into the flour, shake off any excess, then dip into the egg, allowing any excess to drip off. Finish by coating completely in the breadcrumbs. Repeat with the remaining balls.\n11. Deep-fry the balls in batches for 2-3 minutes until golden brown all over. Remove with a slotted spoon and drain on paper towels. Serve immediately while the middles are still melting. Drizzle with lemon juice, if using.",
        "ingredients": [
            "1 ounce mixed dried wild mushrooms",
            "Butter",
            "Flavorless oil, such as peanut",
            "1 small onion or large shallot, peeled and finely diced",
            "1 garlic clove, peeled and crushed",
            "1 1/3 cups risotto rice",
            "1/2 cup dry white wine",
            "2 cups vegetable or chicken stock",
            "1 ounce Parmesan cheese, grated",
            "Sea salt and freshly ground black pepper",
            "9 mini mozzarella cheese balls or 1/2 large ball",
            "2 eggs, beaten",
            "About 3/4 cup all-purpose flour",
            "1 cup panko breadcrumbs or regular breadcrumbs",
            "Lemon wedges, to serve (optional)"
        ],
        "step_by_step_instructions": [
            "1. Soak about 0.14 ounces of dried wild mushrooms in 0.14 cups of hot water for 20 minutes.",
            "2. Heat a heavy-based, high-sided frying pan or saucepan over medium heat. Add a chunk of butter (approximately 0.5 tablespoons) and a glug of oil (approximately 0.5 tablespoons). Sauté 0.17 small onion (or equivalent shallot) and 0.11 garlic clove for about 5 minutes until soft but not colored.",
            "3. Add about 0.19 cups of risotto rice and stir vigorously around the pan for a couple of minutes until the grains start to turn slightly translucent at the edges.",
            "4. Deglaze the pan by pouring in approximately 0.07 cups of dry white wine. Bring to a boil, then lower the heat and simmer for a minute or two to burn off the alcohol.",
            "5. Meanwhile, heat about 0.29 cups of stock and add the soaking liquor from the mushrooms. Add a ladleful of the hot stock mixture to the rice and stir over medium heat until absorbed, then add another ladleful. Repeat until all the stock is used up or the rice is tender but still al dente.",
            "6. Chop the rehydrated mushrooms into small pieces and gently stir into the cooked risotto. Add another chunk of butter (approximately 0.5 tablespoons) and about 0.14 ounces of Parmesan cheese, then stir to mix well. Taste and adjust the seasoning with salt and pepper if necessary, then leave the risotto to cool.",
            "7. If using mini mozzarella balls, halve approximately 1 ball; if using part of a large ball, cut about 0.056 ounces into 3/4-inch cubes.",
            "8. Lay out 3 plates or shallow bowls. Put about 0.33 beaten eggs in one, about 0.11 cups of flour (seasoned with a pinch of salt and pepper) in another, and about 0.14 cups of breadcrumbs in the final one.",
            "9. Once the risotto is cooled, roll it into a ball the size of a golf ball. Push a piece of mozzarella into the middle of the ball, making sure that the cheese is completely enclosed. Leave to set in the fridge for at least 30 minutes.",
            "10. Heat a deep-fat fryer to 340°F or fill a large saucepan one-third full of flavorless oil and heat until a cube of bread dropped into the hot oil sizzles and turns golden brown in 30 seconds.",
            "11. Dip a rice ball into the flour, shake off any excess, then dip into the egg, allowing any excess to drip off. Finish by coating completely in the breadcrumbs.",
            "12. Deep-fry the ball for 2-3 minutes until golden brown all over. Remove with a slotted spoon and drain on paper towels. Serve immediately while the middle is still melting. Drizzle with lemon juice if using."
        ],
        "processed_ingredients": [
            "0.14 oz mushrooms",
            "0.5 tbsp butter",
            "0.5 tbsp oil",
            "0.17 small onion",
            "0.11 garlic clove",
            "0.19 cup risotto rice",
            "0.07 cup white wine",
            "0.29 cup vegetable stock",
            "0.14 oz Parmesan cheese",
            "0.056 oz mozzarella cheese",
            "0.33 eggs",
            "0.11 cup all-purpose flour",
            "0.14 cup breadcrumbs",
            "0.056 lemon wedges"
        ],
        "pure_ingredients": [
            "mushrooms",
            "butter",
            "oil",
            "onion",
            "garlic",
            "risotto rice",
            "white wine",
            "stock",
            "parmesan cheese",
            "mozzarella cheese",
            "eggs",
            "flour",
            "breadcrumbs",
            "lemon"
        ],
        "cooking_time": "105 minutes",
        "required_tools": [
            "frying pan",
            "saucepan",
            "spoon",
            "baking sheet",
            "plates",
            "deep-fat fryer",
            "slotted spoon",
            "paper towels"
        ]
    },
    {
        "recipe_id": "30r.GjQ4G6wFFJgAVDJp4VayxJYifZO",
        "recipe_title": "Pâte Brisée ",
        "original_instructions": "In a large bowl blend the flour, the butter, the vegetable shortening, and the salt until the mixture resembles meal. Add 3 tablespoons ice water, toss the mixture until the water is incorporated, and form the dough into a ball. Knead the dough lightly with the heel of the hand against a smooth surface for a few seconds to distribute the fat evenly and re-form it into a ball. Dust the dough with flour and chill it, wrapped in wax paper, for 1 hour.\nIn a large bowl blend the flour, the butter, the vegetable shortening, and the salt until the mixture resembles meal. Add 3 tablespoons ice water, toss the mixture until the water is incorporated, and form the dough into a ball. Knead the dough lightly with the heel of the hand against a smooth surface for a few seconds to distribute the fat evenly and re-form it into a ball. Dust the dough with flour and chill it, wrapped in wax paper, for 1 hour.",
        "ingredients": [
            "1 1/4 cups all-purpose flour",
            "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits",
            "2 tablespoons cold vegetable shortening",
            "1/4 teaspoon salt"
        ],
        "step_by_step_instructions": [
            "Blend the flour, butter, vegetable shortening, and salt in a large bowl until the mixture resembles meal.",
            "Add 0.75 tablespoons of ice water, then toss the mixture until the water is incorporated.",
            "Form the dough into a ball.",
            "Knead the dough lightly with the heel of your hand against a smooth surface for a few seconds to distribute the fat evenly.",
            "Re-form the dough into a ball.",
            "Dust the dough with flour.",
            "Wrap the dough in wax paper and chill it in the refrigerator for 1 hour."
        ],
        "processed_ingredients": [
            "0.31 cup all-purpose flour",
            "1.5 tablespoon unsalted butter",
            "0.5 tablespoon vegetable shortening",
            "0.06 teaspoon salt"
        ],
        "pure_ingredients": [
            "flour",
            "butter",
            "vegetable shortening",
            "salt",
            "water"
        ],
        "cooking_time": "1 hour",
        "required_tools": [
            "large bowl",
            "wax paper",
            "refrigerator"
        ]
    },
    {
        "recipe_id": "/zbh1BaxBlMAtxOH4kKypEGxgWZD7QC",
        "recipe_title": "The Flatiron Grilled Cheese",
        "original_instructions": "Make dipping mixture: Whisk 2 eggs, milk, vanilla, cinnamon, and nutmeg in wide bowl. Refrigerate until ready to use.\nPeel potatoes and cover with cold water in pot. Season with salt. Bring to a boil; lower heat and simmer for 5 minutes; turn off burner and let sit 15-20 minutes. Drain; rinse potatoes with cold water. When cool, grate with the large holes of box grater. Heat heavy skillet, preferably cast iron, over high heat. Add canola oil; heat. Spread shredded potatoes evenly over skillet bottom. Season with salt and pepper and cook for 5 minutes or until brown on bottom. Do not stir or disturb potatoes while cooking. Using a wide spatula, flip potatoes over and brown other side without stirring.\nFry bacon in skillet until brown and crispy. Remove; drain on paper towels. Return skillet to stove over medium heat and fry remaining 4 eggs. Remove eggs to a plate. Keep warm.\nHeat griddle or skillet over medium heat and add butter. Remove dipping mixture from refrigerator. Rewhisk to blend well. Dip the bread slices, one at a time, in mixture. Grill one side. Flip. Brown second side. Top 4 slices each with 1 ounce Brie, a portion of the potatoes, 1 egg, two slices of bacon, and another ounce of Brie. Top with another prepared bread slice. Continue to grill sandwiches briefly to heat the Brie, being careful not to overbrown bread. Serve with maple syrup on the side, if desired.",
        "ingredients": [
            "6 eggs",
            "1 cup milk",
            "1 teaspoon pure vanilla extract",
            "Pinch cinnamon",
            "Pinch nutmeg",
            "2 large russet potatoes",
            "Salt and pepper",
            "4 tablespoons canola oil",
            "8 slices bacon",
            "8 thick slices firm white bread",
            "4 tablespoons butter",
            "8 ounces Wisconsin Brie cheese, sliced",
            "Pure maple syrup, optional"
        ],
        "step_by_step_instructions": [
            "Step 1: Prepare the dipping mixture by whisking together 0.5 eggs, 0.08 cup milk, 0.08 teaspoon pure vanilla extract, a pinch of cinnamon, and a pinch of nutmeg in a wide bowl. Refrigerate until ready to use.",
            "Step 2: Peel 0.33 russet potatoes and cover with cold water in a pot. Season with salt. Bring to a boil; lower heat and simmer for 5 minutes; then turn off the burner and let sit for 15-20 minutes. Drain and rinse potatoes with cold water. When cool, grate with the large holes of a box grater.",
            "Step 3: Heat a heavy skillet, preferably cast iron, over high heat. Add 0.67 tablespoon canola oil; heat. Spread shredded potatoes evenly over the skillet bottom. Season with salt and pepper and cook for 5 minutes or until brown on the bottom. Do not stir or disturb potatoes while cooking. Using a wide spatula, flip potatoes over and brown the other side without stirring.",
            "Step 4: Fry 1 slice of bacon in a skillet until brown and crispy. Remove and drain on paper towels.",
            "Step 5: Return the skillet to the stove over medium heat and fry 0.5 egg. Remove the egg to a plate and keep warm.",
            "Step 6: Heat a griddle or skillet over medium heat and add 0.5 tablespoon butter. Remove the dipping mixture from the refrigerator and rewhisk to blend well.",
            "Step 7: Dip 1 slice of bread in the mixture. Grill one side. Flip and brown the second side.",
            "Step 8: Top the grilled slice with 1 ounce of Brie, a portion of the potatoes, 0.5 egg, the fried bacon slice, and another ounce of Brie. Top with another prepared bread slice.",
            "Step 9: Continue to grill the sandwich briefly to heat the Brie, being careful not to overbrown the bread.",
            "Step 10: Serve with maple syrup on the side if desired."
        ],
        "processed_ingredients": [
            "0.5 egg",
            "0.08 cup milk",
            "0.08 teaspoon pure vanilla extract",
            "0.01 teaspoon cinnamon",
            "0.01 teaspoon nutmeg",
            "0.33 russet potato",
            "0.01 teaspoon salt",
            "0.01 teaspoon pepper",
            "0.67 tablespoon canola oil",
            "1 slice bacon",
            "2 slices bread",
            "0.5 tablespoon butter",
            "2 ounces Brie cheese",
            "0.5 tablespoon maple syrup"
        ],
        "pure_ingredients": [
            "eggs",
            "milk",
            "vanilla extract",
            "cinnamon",
            "nutmeg",
            "potatoes",
            "salt",
            "pepper",
            "canola oil",
            "bacon",
            "bread",
            "butter",
            "Brie cheese",
            "maple syrup"
        ],
        "cooking_time": "60 minutes",
        "required_tools": [
            "bowl",
            "pot",
            "box grater",
            "skillet",
            "spatula",
            "plate",
            "griddle"
        ]
    },
    {
        "recipe_id": "9XUaJB0uaVsUftAkjFVdm81foo5eC.C",
        "recipe_title": "Paniolo Steak with Wicked Wahine Chimichurri",
        "original_instructions": "Heat oven to 325 degrees F. Set an oven-proof (cast iron) grill pan on a burner over high heat. Lightly brush steaks with olive oil on both sides and season with salt and pepper. When the grill pan is very hot, add the steaks. Sear the steaks over high heat for 3 to 4 minutes on each side. Remove the pan from the heat and set it in the oven to finish cooking. Keep the steak in the oven for 6 to 8 minutes for rare to medium-rare (or until an instant-read thermometer inserted in the middle of the steaks registers 165 degrees F). When steaks reach desired doneness, remove them from the oven and let them \"rest\" for another 4 to 6 minutes before slicing.\nWhile the steaks are cooking, prepare the chimichurri sauce. Combine all of the ingredients in a food processor or blender and pulse until all ingredients are chopped fine and well combined, stopping to scrape down the sides, if necessary. The mixture should have the consistency of a coarse pesto. Set aside until ready to serve.\nTo serve, slice the steaks thinly against the grain and arrange on a platter. Drizzle some of the chimichurri sauce over the steak and sprinkle with toasted sesame seeds. Garnish the platter with pineapple rings, if desired. Transfer the remaining sauce to a bowl and pass with the steak.",
        "ingredients": [
            "2 (1 to 1 1/2 pound) flat iron steaks (beef chuck top blade)",
            "Olive oil, for brushing steaks",
            "Salt and freshly ground black pepper",
            "1 bunch cilantro, tough stems removed, coarsely chopped (about 1 cup)",
            "1 bunch Italian parsley, tough stems removed, coarsely chopped (about 1 cup)",
            "4 cloves garlic, coarsely chopped",
            "2 tablespoons fresh ginger root, peeled and coarsely chopped",
            "4 green onions (root tips and tough green ends removed) coarsely chopped",
            "4 tablespoons rice wine vinegar",
            "3 tablespoons fresh squeezed lime juice",
            "3 tablespoons sesame oil",
            "1/2 to 3/4 cup vegetable oil",
            "3 tablespoons pineapple juice",
            "1 teaspoons Asian hot chili sauce (use 2 if you like it spicy!)",
            "Salt",
            "For garnish: 2 tablespoons toasted sesame seeds and a few pineapple rings (use good quality canned), if desired."
        ],
        "step_by_step_instructions": [
            "Heat the oven to 325 degrees F.",
            "Set an oven-proof grill pan on a burner over high heat.",
            "Brush approximately 0.5 tablespoon of olive oil on each side of the steak and season with a pinch of salt and pepper.",
            "When the grill pan is very hot, add the steak and sear over high heat for about 1.5 to 2 minutes on each side.",
            "Remove the pan from the heat and place it in the oven to finish cooking for about 3 to 4 minutes for rare to medium-rare, or until an instant-read thermometer registers 165 degrees F.",
            "Once cooked, remove the steak from the oven and let it rest for 2 to 3 minutes before slicing.",
            "While the steak is cooking, combine roughly 0.25 cup of chopped cilantro, 0.25 cup of chopped parsley, 1 clove of chopped garlic, 0.5 tablespoon of chopped ginger, 1 chopped green onion, 1 tablespoon of rice wine vinegar, 0.75 tablespoon of lime juice, 0.75 tablespoon of sesame oil, 1 to 2 tablespoons of vegetable oil, 0.75 tablespoon of pineapple juice, and 0.25 teaspoon of Asian hot chili sauce in a food processor.",
            "Pulse until all ingredients are chopped fine and well combined, resembling a coarse pesto.",
            "Slice the steak thinly against the grain and arrange on a platter.",
            "Drizzle some of the chimichurri sauce over the steak and sprinkle with about 0.5 tablespoon of toasted sesame seeds.",
            "Garnish the platter with a couple of pineapple rings, if desired.",
            "Transfer the remaining sauce to a bowl to serve alongside the steak."
        ],
        "processed_ingredients": [
            "0.5 lb flat iron steak",
            "0.5 tablespoon olive oil",
            "1 pinch salt",
            "1 pinch black pepper",
            "0.25 cup cilantro",
            "0.25 cup parsley",
            "1 clove garlic",
            "0.5 tablespoon ginger root",
            "1 green onion",
            "1 tablespoon rice wine vinegar",
            "0.75 tablespoon lime juice",
            "0.75 tablespoon sesame oil",
            "1.5 tablespoon vegetable oil",
            "0.75 tablespoon pineapple juice",
            "0.25 teaspoon Asian hot chili sauce",
            "0.5 tablespoon toasted sesame seeds",
            "2 rings pineapple"
        ],
        "pure_ingredients": [
            "beef",
            "olive oil",
            "salt",
            "pepper",
            "cilantro",
            "parsley",
            "garlic",
            "ginger",
            "green onion",
            "rice wine vinegar",
            "lime",
            "sesame oil",
            "vegetable oil",
            "pineapple",
            "chili sauce",
            "sesame seeds"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "oven",
            "oven-proof grill pan",
            "brush",
            "food processor",
            "instant-read thermometer",
            "platter",
            "bowl"
        ]
    },
    {
        "recipe_id": "BDOX3iyjYegbpccN1/W5SSyVZ0vR5xe",
        "recipe_title": "Lemon Herb Chicken Pasta with Green Peas, Snap Peas and Spinach",
        "original_instructions": "Watch how to make this recipe.\nBring a large pot of water to a boil and salt it generously. Add the pasta and cook until al dente, 8 to 10 minutes. Reserve 1/4 cup of the cooking liquid. Drain the pasta and set aside.\nSprinkle the chicken with salt and pepper. Add 2 tablespoons olive oil to a large pan over medium-high heat. Cook the chicken until the internal temperature reaches 160 degrees F, about 5 minutes per side. Remove the chicken and slice it into strips.\nAdd 1 tablespoon olive oil to the pan. Add the garlic and shallot and sprinkle with salt and pepper. Cook until fragrant, 1 minute. Add the lemon juice and sugar snap peas and cook, 2 minutes. Add the reserved pasta water and the frozen peas. Cook until the peas are just cooked through, 2 minutes more.\nAdd the cooked pasta, spinach, sliced chicken, chopped basil, chopped parsley and the remaining 2 tablespoons olive oil. Toss all the ingredients together to coat, season with additional salt and pepper and garnish with parsley leaves. Serve immediately.",
        "ingredients": [
            "Kosher salt and freshly ground black pepper",
            "1 pound vegetable penne pasta",
            "4 boneless skinless chicken breasts",
            "5 tablespoons olive oil",
            "3 cloves garlic, finely chopped",
            "1 large shallot, finely chopped",
            "1/2 cup freshly squeezed lemon juice",
            "1 1/2 cups trimmed and sliced sugar snap peas",
            "One 10-ounce bag frozen peas",
            "3 cups baby spinach",
            "3 tablespoons chopped fresh basil",
            "3 tablespoons chopped fresh flat-leaf parsley, plus additional leaves for serving"
        ],
        "step_by_step_instructions": [
            "Bring a large pot of water to a boil and salt it generously.",
            "Add approximately 113 g of penne pasta and cook until al dente, about 8 to 10 minutes.",
            "Reserve around 15 ml of the cooking liquid.",
            "Drain the pasta and set aside.",
            "Sprinkle a single chicken breast with salt and pepper.",
            "Add 0.5 tbsp olive oil to a large pan over medium-high heat.",
            "Cook the chicken until the internal temperature reaches 160 degrees F, about 5 minutes per side.",
            "Remove the chicken and slice it into strips.",
            "Add 0.15 tbsp olive oil to the pan.",
            "Add 0.75 finely chopped garlic clove and 0.25 finely chopped shallot, sprinkle with salt and pepper.",
            "Cook until fragrant, about 1 minute.",
            "Add 2 tbsp lemon juice and 57 g of sugar snap peas.",
            "Cook for 2 minutes.",
            "Add the reserved pasta water and approximately 71 g of frozen peas.",
            "Cook until the peas are just cooked through, about 2 minutes more.",
            "Add the cooked pasta, 1 cup of spinach, sliced chicken, 0.5 tbsp chopped basil, 0.5 tbsp chopped parsley, and the remaining 0.5 tbsp olive oil.",
            "Toss all the ingredients together to coat, season with additional salt and pepper.",
            "Garnish with parsley leaves and serve immediately."
        ],
        "processed_ingredients": [
            "1.5 g salt",
            "113 g penne pasta",
            "1 chicken breast",
            "1.5 tbsp olive oil",
            "0.75 clove garlic",
            "0.25 large shallot",
            "2 tbsp lemon juice",
            "57 g sugar snap peas",
            "71 g frozen peas",
            "1 cup spinach",
            "0.5 tbsp basil",
            "0.5 tbsp parsley",
            "0.5 g pepper"
        ],
        "pure_ingredients": [
            "salt",
            "pasta",
            "chicken",
            "olive oil",
            "garlic",
            "shallot",
            "lemon",
            "sugar snap peas",
            "peas",
            "spinach",
            "basil",
            "parsley",
            "pepper"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "large pot",
            "large pan",
            "knife",
            "cutting board",
            "measuring spoons",
            "measuring cups"
        ]
    },
    {
        "recipe_id": "0LtdnqbOVUZegwi1O8wQXnMGyv5KoCG",
        "recipe_title": "Butter Lettuce and Radish Salad with Lemon-Garlic Vinaigrette ",
        "original_instructions": "In 1-cup liquid measuring cup, whisk together lemon juice, vinegar, sugar, and 2 tablespoons water. Using mortar and pestle or food processor, grind or crush garlic, lemon zest, and kosher salt into fine paste. Whisk paste into lemon juice mixture. Gradually whisk in oil. Whisk in table salt and pepper to taste. In large bowl, toss together lettuce, radishes, minced herbs, and dressing. Divide mixture among 6 salad plates. Using vegetable peeler, shave curls of Parmesan atop each salad and serve.\nIn 1-cup liquid measuring cup, whisk together lemon juice, vinegar, sugar, and 2 tablespoons water. Using mortar and pestle or food processor, grind or crush garlic, lemon zest, and kosher salt into fine paste. Whisk paste into lemon juice mixture. Gradually whisk in oil. Whisk in table salt and pepper to taste.\nIn large bowl, toss together lettuce, radishes, minced herbs, and dressing. Divide mixture among 6 salad plates. Using vegetable peeler, shave curls of Parmesan atop each salad and serve.",
        "ingredients": [
            "2 tablespoons fresh lemon juice",
            "1/2 teaspoon sherry vinegar",
            "1/2 teaspoon sugar",
            "1 clove garlic, smashed and peeled",
            "1 teaspoon finely grated lemon zest",
            "1/4 teaspoon kosher salt",
            "1/4 cup canola oil",
            "Table salt and freshly ground black pepper to taste",
            "3 heads butter lettuce, outer leaves discarded, leaves torn",
            "12 radishes, trimmed and thinly sliced",
            "1/4 cup mixed fresh herbs, such as parsley, tarragon, chervil, basil, and chives, minced",
            "1 (3-ounce) piece Parmesan cheese"
        ],
        "step_by_step_instructions": [
            "In a small bowl, whisk together 1 teaspoon fresh lemon juice, a pinch of sherry vinegar, and a small pinch of sugar with 1 teaspoon water.",
            "Using a mortar and pestle or food processor, grind or crush 1/6 clove garlic, a small pinch of lemon zest, and a small pinch of kosher salt into a fine paste.",
            "Whisk the paste into the lemon juice mixture.",
            "Gradually whisk in 2 teaspoons canola oil.",
            "Season with table salt and freshly ground black pepper to taste.",
            "In a large bowl, toss together approximately 1/2 head butter lettuce, 2 thinly sliced radishes, and a small amount of minced fresh herbs with the dressing.",
            "Divide the mixture onto a salad plate.",
            "Using a vegetable peeler, shave curls from 0.5 ounce Parmesan cheese over the salad and serve."
        ],
        "processed_ingredients": [
            "1.00 tsp fresh lemon juice",
            "0.08 tsp sherry vinegar",
            "0.08 tsp sugar",
            "0.17 clove garlic",
            "0.17 tsp finely grated lemon zest",
            "0.04 tsp kosher salt",
            "2.00 tsp canola oil",
            "0.50 head butter lettuce",
            "2.00 radishes",
            "0.67 tbsp mixed fresh herbs",
            "0.50 oz Parmesan cheese"
        ],
        "pure_ingredients": [
            "lemon",
            "vinegar",
            "sugar",
            "garlic",
            "lemon",
            "salt",
            "canola oil",
            "salt",
            "black pepper",
            "butter lettuce",
            "radish",
            "parsley",
            "tarragon",
            "chervil",
            "basil",
            "chives",
            "Parmesan cheese"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "measuring cup",
            "whisk",
            "mortar and pestle",
            "food processor",
            "large bowl",
            "vegetable peeler"
        ]
    },
    {
        "recipe_id": "BwcC42J6AWBXanFdpgUAzsUnWpDCm.i",
        "recipe_title": "Cornish Game Hen with Raspberry-Red Wine Sauce ",
        "original_instructions": "Preheat oven to 500°F. Sprinkle hen halves with thyme, salt and pepper. Heat oil in heavy large skillet over medium-high heat. Add hen halves, skin side down, and cook until brown, about 6 minutes per side. Transfer hen halves to baking sheet (do not clean skillet). Roast until juices run clear when thigh is pierced, about 20 minutes. Meanwhile, pour off all but 2 tablespoons fat from skillet. Add shallots and sauté over medium heat until soft, about 3 minutes. Add broth, wine, raspberries, 2 teaspoons sugar and allspice. Boil until sauce thickens enough to coat spoon, scraping up browned bits and crushing raspberries, about 12 minutes. Strain wine sauce into small bowl. Season sauce to taste with salt and pepper; add more sugar, if desired. Serve hen halves with sauce.\nPreheat oven to 500°F. Sprinkle hen halves with thyme, salt and pepper. Heat oil in heavy large skillet over medium-high heat. Add hen halves, skin side down, and cook until brown, about 6 minutes per side. Transfer hen halves to baking sheet (do not clean skillet). Roast until juices run clear when thigh is pierced, about 20 minutes.\nMeanwhile, pour off all but 2 tablespoons fat from skillet. Add shallots and sauté over medium heat until soft, about 3 minutes. Add broth, wine, raspberries, 2 teaspoons sugar and allspice. Boil until sauce thickens enough to coat spoon, scraping up browned bits and crushing raspberries, about 12 minutes. Strain wine sauce into small bowl. Season sauce to taste with salt and pepper; add more sugar, if desired. Serve hen halves with sauce.",
        "ingredients": [
            "1 1 1/2- to 1 3/4-pound Cornish game hen, halved",
            "1 teaspoon dried thyme",
            "2 tablespoons olive oil",
            "4 shallots, chopped",
            "2 cups canned low-salt chicken broth",
            "2/3 cup dry red wine",
            "2/3 cup frozen raspberries",
            "2 teaspoons (or more) sugar",
            "1/4 teaspoon ground allspice"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 500°F.",
            "Sprinkle hen half with 0.5 teaspoon dried thyme, salt, and pepper.",
            "Heat 1 tablespoon olive oil in heavy large skillet over medium-high heat.",
            "Add hen half, skin side down, and cook until brown, about 6 minutes per side.",
            "Transfer hen half to baking sheet (do not clean skillet).",
            "Roast in oven until juices run clear when thigh is pierced, about 20 minutes.",
            "Meanwhile, pour off all but 1 tablespoon fat from skillet.",
            "Add 2 tablespoons chopped shallots and sauté over medium heat until soft, about 3 minutes.",
            "Add 1 cup canned low-salt chicken broth, 0.33 cup dry red wine, 0.33 cup frozen raspberries, 1 teaspoon sugar, and 0.125 teaspoon ground allspice.",
            "Boil until sauce thickens enough to coat spoon, scraping up browned bits and crushing raspberries, about 12 minutes.",
            "Strain wine sauce into small bowl.",
            "Season sauce to taste with salt and pepper; add more sugar, if desired.",
            "Serve hen half with sauce."
        ],
        "processed_ingredients": [
            "0.75 lb Cornish game hen",
            "0.5 teaspoon dried thyme",
            "1 tablespoon olive oil",
            "2 tablespoons shallots",
            "1 cup chicken broth",
            "0.33 cup red wine",
            "0.33 cup raspberries",
            "1 teaspoon sugar",
            "0.125 teaspoon ground allspice"
        ],
        "pure_ingredients": [
            "Cornish game hen",
            "thyme",
            "olive oil",
            "shallots",
            "chicken broth",
            "red wine",
            "raspberries",
            "sugar",
            "allspice",
            "salt",
            "pepper"
        ],
        "cooking_time": "47 minutes",
        "required_tools": [
            "oven",
            "skillet",
            "baking sheet",
            "small bowl"
        ]
    },
    {
        "recipe_id": "pllQGWypDUlKUyddQpY9RRhUZVghDI6",
        "recipe_title": "Sunchoke Soup with Pumpkin Seeds ",
        "original_instructions": "Mix 8 cups water and vinegar in large bowl. Working with 1 Jerusalem artichoke at a time, peel and place in vinegar water to prevent discoloration. Set aside. Melt butter in heavy large pot over medium heat. Add onion, leek, and garlic; sprinkle with salt and sauté until soft and translucent, stirring often, about 12 minutes. Drain artichokes; rinse well and drain again. Cut into 1-inch pieces. Add to onion mixture and sauté 5 minutes. Add 7 cups vegetable broth, increase heat to high, and bring to boil. Reduce heat to medium-low, cover, and simmer until artichokes are very tender, about 1 hour. Cool slightly. Working in batches, puree soup in blender until very smooth. Return to pot. Rewarm soup, adding more broth by 1/4 cupfuls if needed to thin. Stir in cream and season to taste with salt and white pepper. do ahead Can be made 1 day ahead. Cool, cover, and chill. Rewarm before continuing. Divide soup among bowls and garnish with toasted pumpkin seeds; top with a drizzle of pumpkin seed oil and some sautéed mushrooms, if desired. Tubers of a variety of sunflower; available in the produce section of some supermarkets and at farmers' markets.\nMix 8 cups water and vinegar in large bowl. Working with 1 Jerusalem artichoke at a time, peel and place in vinegar water to prevent discoloration. Set aside.\nMelt butter in heavy large pot over medium heat. Add onion, leek, and garlic; sprinkle with salt and sauté until soft and translucent, stirring often, about 12 minutes. Drain artichokes; rinse well and drain again. Cut into 1-inch pieces. Add to onion mixture and sauté 5 minutes. Add 7 cups vegetable broth, increase heat to high, and bring to boil. Reduce heat to medium-low, cover, and simmer until artichokes are very tender, about 1 hour. Cool slightly.\nWorking in batches, puree soup in blender until very smooth. Return to pot. Rewarm soup, adding more broth by 1/4 cupfuls if needed to thin. Stir in cream and season to taste with salt and white pepper. do ahead Can be made 1 day ahead. Cool, cover, and chill. Rewarm before continuing. Divide soup among bowls and garnish with toasted pumpkin seeds; top with a drizzle of pumpkin seed oil and some sautéed mushrooms, if desired.\nTubers of a variety of sunflower; available in the produce section of some supermarkets and at farmers' markets.\nTubers of a variety of sunflower; available in the produce section of some supermarkets and at farmers' markets.",
        "ingredients": [
            "8 cups water",
            "1 1/2 teaspoons white wine vinegar",
            "2 pounds Jerusalem artichokes (also called sunchokes)*",
            "3 tablespoons butter",
            "1 cup chopped onion",
            "1 cup chopped leek (white and pale green parts only)",
            "2 garlic cloves, chopped",
            "7 cups (or more) vegetable broth",
            "1/2 cup heavy whipping cream",
            "Ground white pepper",
            "Shelled pumpkin seeds, toasted",
            "Pumpkin seed oil (optional)",
            "Sautéed chanterelle mushrooms (optional garnish)"
        ],
        "step_by_step_instructions": [
            "Mix 1 cup water and 0.19 teaspoons white wine vinegar in a large bowl.",
            "Peel 0.25 pounds Jerusalem artichokes and place them in the vinegar water to prevent discoloration. Set aside.",
            "Melt 0.38 tablespoons butter in a heavy large pot over medium heat.",
            "Add 0.12 cups chopped onion, 0.12 cups chopped leek, and 0.25 garlic cloves, chopped. Sprinkle with salt and sauté until soft and translucent, stirring often, about 12 minutes.",
            "Drain the artichokes, rinse well, and drain again. Cut into 1-inch pieces.",
            "Add the artichokes to the onion mixture and sauté for 5 minutes.",
            "Add 0.88 cups vegetable broth, increase heat to high, and bring to a boil. Reduce heat to medium-low, cover, and simmer until artichokes are very tender, about 1 hour.",
            "Cool slightly, then work in batches to puree soup in blender until very smooth.",
            "Return to pot and rewarm soup, adding more broth by 0.03 cupfuls if needed to thin.",
            "Stir in 0.06 cups heavy whipping cream and season to taste with salt and ground white pepper.",
            "Divide soup among bowls and garnish with toasted pumpkin seeds. Optionally, top with a drizzle of pumpkin seed oil and some sautéed chanterelle mushrooms."
        ],
        "processed_ingredients": [
            "1 cup water",
            "0.19 teaspoon white wine vinegar",
            "0.25 lb Jerusalem artichokes",
            "0.38 tablespoon butter",
            "0.12 cup onion",
            "0.12 cup leek",
            "0.25 clove garlic",
            "0.88 cup vegetable broth",
            "0.06 cup heavy whipping cream",
            "0.12 ounce pumpkin seeds",
            "0.12 teaspoon pumpkin seed oil"
        ],
        "pure_ingredients": [
            "water",
            "white wine vinegar",
            "Jerusalem artichokes",
            "butter",
            "onion",
            "leek",
            "garlic",
            "vegetable broth",
            "heavy cream",
            "white pepper",
            "pumpkin seeds",
            "pumpkin seed oil",
            "chanterelle mushrooms"
        ],
        "cooking_time": "87 minutes",
        "required_tools": [
            "large bowl",
            "heavy large pot",
            "blender"
        ]
    },
    {
        "recipe_id": "lP3Q9c/G1B2L.T3Ww.fs6bMr24DW06G",
        "recipe_title": "Mussels with Sausage, Coconut Milk and Lime ",
        "original_instructions": "Heat oil in heavy large saucepan over medium-high heat. Add onion, sausage, lemongrass, ginger and garlic and sauté 5 minutes. Add all remaining ingredients except cilantro and mussels and bring to boil. Reduce heat and simmer 5 minutes. Mix in half of cilantro. Meanwhile, place mussels in large pot. Cover and cook over medium heat until mussels open and release their juices, about 5 minutes (discard any mussels that do not open). Divide mussels among shallow soup bowls. Stir any mussel liquid into coconut-milk mixture; ladle over mussels. Sprinkle with remaining cilantro.\nHeat oil in heavy large saucepan over medium-high heat. Add onion, sausage, lemongrass, ginger and garlic and sauté 5 minutes. Add all remaining ingredients except cilantro and mussels and bring to boil. Reduce heat and simmer 5 minutes. Mix in half of cilantro.\nMeanwhile, place mussels in large pot. Cover and cook over medium heat until mussels open and release their juices, about 5 minutes (discard any mussels that do not open).\nDivide mussels among shallow soup bowls. Stir any mussel liquid into coconut-milk mixture; ladle over mussels. Sprinkle with remaining cilantro.",
        "ingredients": [
            "2 tablespoons oriental sesame oil",
            "2 1/2 cups thinly sliced red onions",
            "8 ounces hot links sausage, cut into 1/2-inch pieces",
            "1/4 cup thinly sliced peeled lemongrass",
            "1 tablespoon minced peeled fresh ginger",
            "1 tablespoon minced garlic",
            "2 cups fish stock or bottled clam juice",
            "1 cup canned unsweetened coconut milk",
            "3 tablespoons fresh lime juice",
            "2 tablespoons rice vinegar",
            "1 tablespoon soy sauce",
            "1 1/2 teaspoons ground coriander",
            "1/4 cup chopped fresh cilantro",
            "3 dozen mussels, scrubbed, debearded"
        ],
        "step_by_step_instructions": [
            "Heat 0.33 tablespoon of sesame oil in a heavy large saucepan over medium-high heat.",
            "Add approximately 0.42 cup of thinly sliced red onions, 1.33 ounces of hot links sausage cut into 1/2-inch pieces, 0.07 cup of thinly sliced peeled lemongrass, 0.08 tablespoon of minced peeled fresh ginger, and 0.08 tablespoon of minced garlic.",
            "Sauté the mixture for 5 minutes.",
            "Add 0.33 cup of fish stock or bottled clam juice, 0.13 cup of canned unsweetened coconut milk, 0.5 tablespoon of fresh lime juice, 0.33 tablespoon of rice vinegar, 0.17 tablespoon of soy sauce, and 0.25 teaspoon of ground coriander to the saucepan.",
            "Bring the mixture to a boil, then reduce the heat and simmer for 5 minutes.",
            "Mix in 0.04 cup of chopped fresh cilantro into the coconut-milk mixture.",
            "Meanwhile, place 6 mussels in a large pot.",
            "Cover and cook over medium heat until the mussels open and release their juices, about 5 minutes. Discard any mussels that do not open.",
            "Divide the mussels among shallow soup bowls.",
            "Stir any mussel liquid into the coconut-milk mixture and ladle it over the mussels.",
            "Sprinkle with the remaining cilantro."
        ],
        "processed_ingredients": [
            "0.33 tablespoon sesame oil",
            "0.42 cup red onions",
            "1.33 ounce hot links sausage",
            "0.07 cup lemongrass",
            "0.08 tablespoon ginger",
            "0.08 tablespoon garlic",
            "0.33 cup fish stock",
            "0.13 cup coconut milk",
            "0.5 tablespoon lime juice",
            "0.33 tablespoon rice vinegar",
            "0.17 tablespoon soy sauce",
            "0.25 teaspoon coriander",
            "0.04 cup cilantro",
            "6 mussels"
        ],
        "pure_ingredients": [
            "sesame oil",
            "red onions",
            "sausage",
            "lemongrass",
            "ginger",
            "garlic",
            "fish stock",
            "coconut milk",
            "lime juice",
            "rice vinegar",
            "soy sauce",
            "coriander",
            "cilantro",
            "mussels"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "saucepan",
            "large pot",
            "knife",
            "cutting board",
            "soup bowls"
        ]
    },
    {
        "recipe_id": "TyKABFNWkCRsGY5dDQRffIQNtPBpCo6",
        "recipe_title": "Fava Bean, Asparagus, and Arugula Salad with Shaved Pecorino ",
        "original_instructions": "Cut asparagus stalks on a long diagonal into 1/8-inch-thick slices, leaving 1-inch-long tips (reserve tips separately). Blanch asparagus tips (but not sliced stalks) in a 4-quart pot of boiling salted water 2 minutes, then immediately transfer with a slotted spoon to a bowl of ice and cold water to stop cooking. Return water to a boil and blanch fava beans 1 minute, then immediately transfer with slotted spoon to ice water to stop cooking. Drain asparagus tips and beans and gently peel skins from beans (it's not necessary to peel edamame, if using). Toss beans and asparagus (blanched tips and raw sliced stalks) in a bowl with 1 tablespoon oil and salt and pepper to taste, then divide among 4 plates. Toss arugula with remaining tablespoon oil and salt and pepper to taste and mound on top of vegetables. Shave thin slices of cheese over salad with a vegetable peeler (use about half of piece), then drizzle with vinegar.\nCut asparagus stalks on a long diagonal into 1/8-inch-thick slices, leaving 1-inch-long tips (reserve tips separately).\nBlanch asparagus tips (but not sliced stalks) in a 4-quart pot of boiling salted water 2 minutes, then immediately transfer with a slotted spoon to a bowl of ice and cold water to stop cooking.\nReturn water to a boil and blanch fava beans 1 minute, then immediately transfer with slotted spoon to ice water to stop cooking. Drain asparagus tips and beans and gently peel skins from beans (it's not necessary to peel edamame, if using).\nToss beans and asparagus (blanched tips and raw sliced stalks) in a bowl with 1 tablespoon oil and salt and pepper to taste, then divide among 4 plates. Toss arugula with remaining tablespoon oil and salt and pepper to taste and mound on top of vegetables. Shave thin slices of cheese over salad with a vegetable peeler (use about half of piece), then drizzle with vinegar.",
        "ingredients": [
            "1/2 lb medium asparagus, trimmed",
            "2 cups shelled fresh fava beans (2 1/2 lb in pods) or shelled edamame (fresh soybeans)",
            "2 tablespoons extra-virgin olive oil",
            "1/4 lb arugula, coarse stems discarded",
            "1 (1/2-lb) piece Pecorino Romano or Parmigiano-Reggiano",
            "2 teaspoons balsamic vinegar"
        ],
        "step_by_step_instructions": [
            "Cut 2 ounces of asparagus stalks on a long diagonal into 1/8-inch-thick slices, leaving 1-inch-long tips and reserve the tips separately.",
            "Blanch the asparagus tips in a pot of boiling salted water for 2 minutes.",
            "Immediately transfer the blanched tips with a slotted spoon to a bowl of ice and cold water to stop cooking.",
            "Return the water to a boil and blanch 1/2 cup of shelled fava beans for 1 minute.",
            "Immediately transfer the blanched beans to ice water to stop cooking.",
            "Drain the asparagus tips and beans, then gently peel the skins from the beans.",
            "Toss the peeled beans and asparagus (both blanched tips and raw sliced stalks) in a bowl with 3/4 tablespoon of olive oil and season with salt and pepper to taste.",
            "Divide the mixture onto a plate.",
            "Toss 1 ounce of arugula with the remaining 3/4 tablespoon of olive oil and season with salt and pepper to taste.",
            "Mound the arugula on top of the vegetables.",
            "Shave thin slices of Pecorino Romano over the salad using a vegetable peeler, using about 1 ounce of cheese.",
            "Drizzle the salad with 1/2 teaspoon of balsamic vinegar."
        ],
        "processed_ingredients": [
            "2.00 ounce asparagus",
            "0.50 cup fava beans",
            "1.50 tablespoon olive oil",
            "1.00 ounce arugula",
            "1.00 ounce Pecorino Romano",
            "0.50 teaspoon balsamic vinegar"
        ],
        "pure_ingredients": [
            "asparagus",
            "fava beans",
            "olive oil",
            "arugula",
            "Pecorino Romano",
            "balsamic vinegar",
            "salt",
            "pepper"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "pot",
            "slotted spoon",
            "bowl",
            "vegetable peeler"
        ]
    },
    {
        "recipe_id": "fOUKB.IEFu6B5pEoIPKgwYuhr1dQ2yS",
        "recipe_title": "Colander Spaetzle ",
        "original_instructions": "1. Boil a large pot of salted water. 2. Meanwhile, in a large bowl, combine all the ingredients except the flour. Blend well, then slowly stir in the flour until the mixture becomes a stiff batter. 3. Place a colander with large holes over the pot and, with a rubber spatula, press small amounts of the batter through the holes directly into the water. 4. As the spaetzle gradually rise to the surface of the boiling water, use a slotted spoon to transfer them to a serving dish. Serve immediately, while still warm.\n1. Boil a large pot of salted water.\n2. Meanwhile, in a large bowl, combine all the ingredients except the flour. Blend well, then slowly stir in the flour until the mixture becomes a stiff batter.\n3. Place a colander with large holes over the pot and, with a rubber spatula, press small amounts of the batter through the holes directly into the water.\n4. As the spaetzle gradually rise to the surface of the boiling water, use a slotted spoon to transfer them to a serving dish. Serve immediately, while still warm.",
        "ingredients": [
            "1 cup ricotta cheese, Greek yogurt, or buttermilk",
            "3 eggs",
            "1 teaspoon salt",
            "1/2 teaspoon white pepper",
            "1/2 teaspoon grated nutmeg",
            "2 1/2 cups all-purpose flour"
        ],
        "step_by_step_instructions": [
            "Boil a pot of salted water.",
            "In a bowl, combine 0.25 cup ricotta cheese, 0.75 egg, 0.25 teaspoon salt, 0.125 teaspoon white pepper, and 0.125 teaspoon grated nutmeg. Blend well.",
            "Slowly stir in 0.625 cup all-purpose flour until the mixture becomes a stiff batter.",
            "Place a colander with large holes over the pot and, with a rubber spatula, press small amounts of the batter through the holes directly into the boiling water.",
            "As the spaetzle rise to the surface, use a slotted spoon to transfer them to a serving dish. Serve immediately, while still warm."
        ],
        "processed_ingredients": [
            "0.25 cup ricotta cheese",
            "0.75 unit egg",
            "0.25 teaspoon salt",
            "0.125 teaspoon white pepper",
            "0.125 teaspoon grated nutmeg",
            "0.625 cup all-purpose flour"
        ],
        "pure_ingredients": [
            "ricotta cheese",
            "egg",
            "salt",
            "white pepper",
            "nutmeg",
            "flour"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "pot",
            "bowl",
            "rubber spatula",
            "colander",
            "slotted spoon"
        ]
    },
    {
        "recipe_id": "QwQkh1l0xznSeiL5WPgRToVwt3NbYhW",
        "recipe_title": "Lamb and Broccoli Stew ",
        "original_instructions": "For lamb: Whisk sugar, 3/4 cup salt, and 10 cups water in a large bowl until salt and sugar dissolve. Add lamb, cover, and chill for at least 12 hours and up to 2 days. Heat oil in a large heavy pot over medium-high heat. Add onions, garlic, rosemary sprig, thyme sprig, and bay leaf. Cook, stirring often, until onions are golden brown and soft, 10-15 minutes. Remove pot from heat and add wine, stirring and scraping up any browned bits from bottom of pan. Return pot to heat and simmer until wine is reduced by half, about 3 minutes. Remove lamb shoulder from brine; add to pot, along with broth. Bring to a boil. Reduce heat; simmer gently, partially covered and skimming fat occasionally, until lamb is fork-tender, 5-6 hours. Transfer lamb to a platter and remove bones. Cut or shred meat into bite-size pieces. If needed, boil cooking liquid in pot until reduced to 6 cups, 15-30 minutes. Season sauce with salt, if needed. Return lamb to pot. DO AHEAD: Lamb can be prepared 3 days ahead. Let cool slightly, then chill until cold. Cover and keep chilled. Discard fat and reheat before serving.\nWhisk sugar, 3/4 cup salt, and 10 cups water in a large bowl until salt and sugar dissolve. Add lamb, cover, and chill for at least 12 hours and up to 2 days.\nHeat oil in a large heavy pot over medium-high heat. Add onions, garlic, rosemary sprig, thyme sprig, and bay leaf. Cook, stirring often, until onions are golden brown and soft, 10-15 minutes. Remove pot from heat and add wine, stirring and scraping up any browned bits from bottom of pan. Return pot to heat and simmer until wine is reduced by half, about 3 minutes.\nRemove lamb shoulder from brine; add to pot, along with broth. Bring to a boil. Reduce heat; simmer gently, partially covered and skimming fat occasionally, until lamb is fork-tender, 5-6 hours.\nTransfer lamb to a platter and remove bones. Cut or shred meat into bite-size pieces. If needed, boil cooking liquid in pot until reduced to 6 cups, 15-30 minutes. Season sauce with salt, if needed. Return lamb to pot. DO AHEAD: Lamb can be prepared 3 days ahead. Let cool slightly, then chill until cold. Cover and keep chilled. Discard fat and reheat before serving.\nFor garlic emulsion and garnish: Place eggs in a small saucepan and add water to cover by 1\". Bring to a boil and remove from heat. Cover and let sit for 3 minutes. Transfer eggs to a bowl of ice water and let cool completely. Peel. Combine eggs, garlic, 3 tablespoons lemon juice, and 1/2 teaspoons salt in a blender. With the motor running, gradually add oil, blending until a creamy sauce forms. Season garlic emulsion with salt and more lemon juice, if desired. Cook broccoli in a large pot of boiling salted water until crisp-tender, about 4 minutes. Drain; rinse under cold water. Divide stew among bowls and garnish with broccoli, parsley, tarragon, and garlic emulsion.\nPlace eggs in a small saucepan and add water to cover by 1\". Bring to a boil and remove from heat. Cover and let sit for 3 minutes. Transfer eggs to a bowl of ice water and let cool completely. Peel.\nCombine eggs, garlic, 3 tablespoons lemon juice, and 1/2 teaspoons salt in a blender. With the motor running, gradually add oil, blending until a creamy sauce forms. Season garlic emulsion with salt and more lemon juice, if desired.\nCook broccoli in a large pot of boiling salted water until crisp-tender, about 4 minutes. Drain; rinse under cold water.\nDivide stew among bowls and garnish with broccoli, parsley, tarragon, and garlic emulsion.",
        "ingredients": [
            "1/4 cup sugar",
            "3/4 cup kosher salt plus more",
            "2 pound bone-in lamb shoulder",
            "2 tablespoons vegetable oil",
            "4 medium onions, coarsely chopped",
            "4 garlic cloves, chopped",
            "1 sprig rosemary",
            "1 sprig thyme",
            "1 bay leaf",
            "1 cup dry white wine",
            "8 cups low-sodium chicken broth",
            "2 large eggs",
            "2 garlic cloves",
            "3 tablespoons (or more) fresh lemon juice",
            "1/2 teaspoons kosher salt plus more",
            "3/4 cup vegetable oil",
            "1 bunch broccoli, stems reserved for another use, cut into small florets",
            "Flat-leaf parsley and fresh tarragon leaves (for garnish)"
        ],
        "step_by_step_instructions": [
            "Whisk 1.04 g sugar, 3.12 g salt, and 41.67 ml water in a large bowl until salt and sugar dissolve.",
            "Add 90.72 g lamb shoulder, cover, and chill for at least 12 hours and up to 2 days.",
            "Heat 2.08 ml oil in a large heavy pot over medium-high heat.",
            "Add 0.33 medium onions, 0.33 garlic cloves, 0.08 rosemary sprig, 0.08 thyme sprig, and 0.08 bay leaf.",
            "Cook, stirring often, until onions are golden brown and soft, about 10-15 minutes.",
            "Remove pot from heat and add 41.67 ml wine, stirring and scraping up any browned bits from bottom of pan.",
            "Return pot to heat and simmer until wine is reduced by half, about 3 minutes.",
            "Remove lamb shoulder from brine; add to pot, along with 333.33 ml broth.",
            "Bring to a boil. Reduce heat; simmer gently, partially covered and skimming fat occasionally, until lamb is fork-tender, about 5-6 hours.",
            "Transfer lamb to a platter and remove bones. Cut or shred meat into bite-size pieces.",
            "If needed, boil cooking liquid in pot until reduced to 250 ml, about 15-30 minutes.",
            "Season sauce with salt, if needed.",
            "Return lamb to pot.",
            "Place 0.17 large eggs in a small saucepan and add water to cover by 1 inch.",
            "Bring to a boil and remove from heat. Cover and let sit for 3 minutes.",
            "Transfer eggs to a bowl of ice water and let cool completely. Peel.",
            "Combine eggs, 0.33 garlic cloves, 3.12 ml lemon juice, and 0.08 teaspoons salt in a blender.",
            "With the motor running, gradually add 12.5 ml oil, blending until a creamy sauce forms.",
            "Season garlic emulsion with salt and more lemon juice, if desired.",
            "Cook 30 g broccoli in a large pot of boiling salted water until crisp-tender, about 4 minutes.",
            "Drain; rinse under cold water.",
            "Divide stew among bowls and garnish with broccoli, parsley, tarragon, and garlic emulsion."
        ],
        "processed_ingredients": [
            "1.04 g sugar",
            "3.12 g kosher salt",
            "90.72 g bone-in lamb shoulder",
            "2.08 ml vegetable oil",
            "0.33 medium onions",
            "0.33 garlic cloves",
            "0.08 rosemary sprig",
            "0.08 thyme sprig",
            "0.08 bay leaf",
            "41.67 ml dry white wine",
            "333.33 ml low-sodium chicken broth",
            "0.17 large eggs",
            "0.33 garlic cloves",
            "3.12 ml fresh lemon juice",
            "0.08 teaspoons kosher salt",
            "12.5 ml vegetable oil",
            "30 g broccoli",
            "parsley",
            "tarragon"
        ],
        "pure_ingredients": [
            "sugar",
            "salt",
            "lamb",
            "vegetable oil",
            "onions",
            "garlic",
            "rosemary",
            "thyme",
            "bay leaf",
            "white wine",
            "chicken broth",
            "eggs",
            "lemon juice",
            "broccoli",
            "parsley",
            "tarragon"
        ],
        "cooking_time": "12 hours 45 minutes",
        "required_tools": [
            "large bowl",
            "large heavy pot",
            "blender",
            "small saucepan",
            "bowl",
            "ice water bowl"
        ]
    },
    {
        "recipe_id": "Wn5Tg113ThzeWPG2hyKvUSQb2no0lJC",
        "recipe_title": "Potato-Onion Cakes ",
        "original_instructions": "Boil potatoes in large pot of water just until centers can be pierced with sharp knife, about 20 minutes. Drain. Cover and refrigerate until well chilled. (Can be prepared 1 day ahead.) Peel potatoes. Using hand grater, coarsely grate potatoes into large bowl. Gently mix in green onions. Season to taste with salt and pepper. Beat eggs with cumin and gently mix into potato mixture. Form potatoes into 2 1/2-inch-diameter cakes (about 1 inch thick). Cover and refrigerate until ready to cook. (Can be prepared 6 hours ahead.) Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add potato cakes in batches and fry until golden brown, about 8 minutes per side, adding more oil as necessary.\nBoil potatoes in large pot of water just until centers can be pierced with sharp knife, about 20 minutes. Drain. Cover and refrigerate until well chilled. (Can be prepared 1 day ahead.)\nPeel potatoes. Using hand grater, coarsely grate potatoes into large bowl. Gently mix in green onions. Season to taste with salt and pepper. Beat eggs with cumin and gently mix into potato mixture. Form potatoes into 2 1/2-inch-diameter cakes (about 1 inch thick). Cover and refrigerate until ready to cook. (Can be prepared 6 hours ahead.)\nHeat 2 tablespoons oil in heavy large skillet over medium-high heat. Add potato cakes in batches and fry until golden brown, about 8 minutes per side, adding more oil as necessary.",
        "ingredients": [
            "3 pounds white potatoes (about 6 large)",
            "12 green onions (white and green parts), chopped",
            "2 eggs",
            "2 teaspoons ground cumin",
            "3 tablespoons (about) olive oil"
        ],
        "step_by_step_instructions": [
            "Boil 0.5 pounds of potatoes in a large pot of water until centers can be pierced with a sharp knife, about 20 minutes.",
            "Drain the potatoes and cover them. Refrigerate until well chilled, which can be done 1 day ahead.",
            "Peel the chilled potatoes.",
            "Coarsely grate the potatoes into a large bowl using a hand grater.",
            "Gently mix in 2 green onions, chopped.",
            "Season to taste with salt and pepper.",
            "Beat 0.33 eggs with 0.33 teaspoons of ground cumin.",
            "Gently mix the egg mixture into the potato mixture.",
            "Form the potato mixture into cakes that are 2.5 inches in diameter and about 1 inch thick.",
            "Cover the potato cakes and refrigerate them until ready to cook, which can be done up to 6 hours ahead.",
            "Heat 0.5 tablespoons of olive oil in a heavy large skillet over medium-high heat.",
            "Add potato cakes in batches and fry until golden brown, about 8 minutes per side, adding more oil as necessary."
        ],
        "processed_ingredients": [
            "0.5 lb white potatoes",
            "2 green onions",
            "0.33 egg",
            "0.33 tsp ground cumin",
            "0.5 tbsp olive oil"
        ],
        "pure_ingredients": [
            "potatoes",
            "green onions",
            "eggs",
            "cumin",
            "olive oil",
            "salt",
            "pepper"
        ],
        "cooking_time": "14 hours",
        "required_tools": [
            "large pot",
            "sharp knife",
            "hand grater",
            "large bowl",
            "skillet"
        ]
    },
    {
        "recipe_id": "KUdXV1cpbHUlgD0C2i6oApotY5VYlCO",
        "recipe_title": "Huevos Rancheros ",
        "original_instructions": "Put oven rack in middle position and preheat oven to 200°F. Stack 4 ovenproof plates on oven rack to warm. Heat 1 tablespoon oil in a 10-inch heavy skillet over moderate heat until hot but not smoking. Stack 2 tortillas in skillet and cook 30 seconds, then flip stack over with tongs and cook 30 seconds more. While second tortilla cooks on bottom, turn top tortilla over with tongs, keeping tortillas stacked. Flip stack again and cook in same manner, turning over top tortilla and flipping stack again so that both tortillas are softened and both sides puff slightly, then deflate (do not let them become browned or crisp). Wrap tortillas loosely in foil and keep warm in oven. Fry remaining tortillas in same manner, adding 1 tablespoon oil to skillet for each batch. (Do not clean skillet.) Purée tomatoes with their juice, onion, cilantro, chipotle, garlic, and salt in a blender until very smooth. Carefully add mixture to hot skillet (it may spatter) and simmer, stirring occasionally, until salsa is slightly thickened, about 10 minutes. Heat 1 tablespoon oil in a 12-inch heavy nonstick skillet over moderately high heat until hot but not smoking, then crack 4 eggs into skillet and cook 3 to 4 minutes for runny yolks, or to desired doneness. Transfer to a plate and keep warm, covered, then cook remaining 4 eggs in remaining tablespoon oil in same manner. Season eggs with salt and pepper. Spoon 1/4 cup salsa onto each plate and top with 2 tortillas, slightly overlapping them. Transfer 2 eggs to tortillas on each plate and top with some of remaining salsa. Sprinkle with cilantro.\nPut oven rack in middle position and preheat oven to 200°F. Stack 4 ovenproof plates on oven rack to warm.\nHeat 1 tablespoon oil in a 10-inch heavy skillet over moderate heat until hot but not smoking. Stack 2 tortillas in skillet and cook 30 seconds, then flip stack over with tongs and cook 30 seconds more. While second tortilla cooks on bottom, turn top tortilla over with tongs, keeping tortillas stacked. Flip stack again and cook in same manner, turning over top tortilla and flipping stack again so that both tortillas are softened and both sides puff slightly, then deflate (do not let them become browned or crisp). Wrap tortillas loosely in foil and keep warm in oven. Fry remaining tortillas in same manner, adding 1 tablespoon oil to skillet for each batch. (Do not clean skillet.)\nPurée tomatoes with their juice, onion, cilantro, chipotle, garlic, and salt in a blender until very smooth. Carefully add mixture to hot skillet (it may spatter) and simmer, stirring occasionally, until salsa is slightly thickened, about 10 minutes.\nHeat 1 tablespoon oil in a 12-inch heavy nonstick skillet over moderately high heat until hot but not smoking, then crack 4 eggs into skillet and cook 3 to 4 minutes for runny yolks, or to desired doneness. Transfer to a plate and keep warm, covered, then cook remaining 4 eggs in remaining tablespoon oil in same manner. Season eggs with salt and pepper.\nSpoon 1/4 cup salsa onto each plate and top with 2 tortillas, slightly overlapping them. Transfer 2 eggs to tortillas on each plate and top with some of remaining salsa. Sprinkle with cilantro.",
        "ingredients": [
            "6 tablespoons vegetable oil",
            "8 (5-inch) corn tortillas",
            "2 (14- to 15-ounce) cans whole tomatoes in juice",
            "1/2 cup chopped white onion",
            "1/4 cup chopped fresh cilantro plus additional for sprinkling",
            "1 tablespoon chopped canned chipotle chiles in adobo",
            "2 garlic cloves, coarsely chopped",
            "1 teaspoon salt",
            "8 large eggs"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 200°F and place one ovenproof plate on the rack to warm.",
            "Heat 0.75 tablespoons of vegetable oil in a 10-inch heavy skillet over moderate heat until hot but not smoking.",
            "Stack 1 tortilla in the skillet and cook for 30 seconds, then flip it over with tongs and cook for another 30 seconds.",
            "Flip the tortilla again, ensuring both sides are softened and puffed slightly, then deflate. Do not let it become browned or crisp.",
            "Wrap the tortilla loosely in foil and keep it warm in the oven.",
            "Purée 3.5 ounces of tomatoes with 1.06 ounces of their juice, 0.06 ounces of chopped white onion, 0.03 ounces of chopped fresh cilantro, 0.003 ounces of chopped canned chipotle chiles in adobo, 0.25 garlic cloves, and 0.13 teaspoons of salt in a blender until very smooth.",
            "Carefully add the mixture to the hot skillet and simmer, stirring occasionally, until the salsa is slightly thickened, about 10 minutes.",
            "Heat 0.25 tablespoons of vegetable oil in a 12-inch heavy nonstick skillet over moderately high heat until hot but not smoking.",
            "Crack 1 egg into the skillet and cook for 3 to 4 minutes for runny yolks, or to desired doneness.",
            "Season the egg with salt and pepper.",
            "Spoon approximately 0.06 cups of salsa onto the warmed plate and top with the warmed tortilla.",
            "Transfer the cooked egg onto the tortilla and top with some of the remaining salsa.",
            "Sprinkle with a bit of cilantro."
        ],
        "processed_ingredients": [
            "0.75 tablespoon vegetable oil",
            "1 tortilla",
            "3.5 ounces tomatoes",
            "1.06 ounces tomato juice",
            "0.06 ounces onion",
            "0.03 ounces cilantro",
            "0.003 ounces chipotle chiles",
            "0.25 garlic cloves",
            "0.13 teaspoon salt",
            "1 egg"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "corn tortillas",
            "tomatoes",
            "onion",
            "cilantro",
            "chipotle chiles",
            "garlic",
            "salt",
            "eggs"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "oven",
            "ovenproof plate",
            "10-inch heavy skillet",
            "tongs",
            "foil",
            "blender",
            "12-inch heavy nonstick skillet"
        ]
    }
]