[
    {
        "recipe_id": "p/9zATUyK4vkEHwIvWo2hAA3.Suw2Ha",
        "recipe_title": "Black Bean, Spinach, and Mushroom Burritos",
        "original_instructions": "In a heavy skillet cook onion and mushrooms in oil over moderate heat, stirring, until golden. Add spinach and garlic and cook, stirring, until spinach is wilted, about 30 seconds. Stir in water, beans, lemon juice, scallions, pepper Jack, salt, to taste, and cook stirring, until cheese is melted.\nIn a small saucepan, heat enchilada sauce.\nHeat a dry skillet (large enough to hold 1 tortilla) over moderately high heat until hot. In skillet heat tortillas, 1 at a time, turning frequently, 30 seconds, or until softened, and transfer to a work surface. Divide filling between tortillas and roll up burritos.\nSpoon sauce over burritos and serve with sour cream.",
        "ingredients": [
            "1 onion, finely chopped",
            "1/2 pound mushrooms, finely chopped",
            "1 tablespoon vegetable oil",
            "1 bunch spinach (about 1 pound), coarse stems discarded, washed well and spun dry",
            "2 garlic cloves",
            "1/4 cup water",
            "1 cup canned black beans, rinsed well and drained",
            "1 teaspoon fresh lemon juice",
            "2 scallions, finely chopped",
            "3/4 cup coarsely grated pepper Jack cheese (about 5 ounces)",
            "Salt",
            "1/2 cup canned mild enchilada sauce",
            "2 (10-inch) or 4 (8-inch) flour tortillas",
            "Accompaniment: Sour cream"
        ],
        "step_by_step_instructions": [
            "In a heavy skillet, cook 0.25 onion and 2 ounces mushrooms in 0.5 tablespoon vegetable oil over moderate heat, stirring, until golden.",
            "Add 4 ounces spinach and 0.5 garlic clove, and cook, stirring, until spinach is wilted, about 30 seconds.",
            "Stir in 1 tablespoon water, 0.25 cup black beans, 0.25 teaspoon lemon juice, 0.5 scallion, 1.25 ounces pepper Jack cheese, salt to taste, and cook stirring, until cheese is melted.",
            "In a small saucepan, heat 2 tablespoons enchilada sauce.",
            "Heat a dry skillet over moderately high heat until hot.",
            "In the skillet, heat 1 tortilla, turning frequently, for 30 seconds, or until softened, and transfer to a work surface.",
            "Divide the filling onto the tortilla and roll up the burrito.",
            "Spoon sauce over the burrito and serve with 1 tablespoon sour cream."
        ],
        "processed_ingredients": [
            "0.25 onion",
            "2 ounce mushrooms",
            "0.5 tablespoon vegetable oil",
            "4 ounce spinach",
            "0.5 garlic clove",
            "1 tablespoon water",
            "0.25 cup black beans",
            "0.25 teaspoon lemon juice",
            "0.5 scallion",
            "1.25 ounce pepper Jack cheese",
            "0.13 teaspoon salt",
            "2 tablespoon enchilada sauce",
            "1 tortilla",
            "1 tablespoon sour cream"
        ],
        "pure_ingredients": [
            "onion",
            "mushrooms",
            "vegetable oil",
            "spinach",
            "garlic",
            "water",
            "black beans",
            "lemon juice",
            "scallions",
            "cheese",
            "salt",
            "tortillas",
            "enchilada sauce",
            "sour cream"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "heavy skillet",
            "small saucepan",
            "dry skillet",
            "work surface"
        ]
    },
    {
        "recipe_id": "ru/JTXOTRwKNnxT01N3sTzqDk2tMjhW",
        "recipe_title": "Parsley, Red Onion, and Pomegranate Salad ",
        "original_instructions": "Toss onion, sugar, and sumac in a medium bowl; season with salt and let sit 30 minutes. Add oil, vinegar, and pomegranate molasses and toss to combine; let sit 5 minutes. Just before serving, toss in parsley and pomegranate seeds; season with salt.\nToss onion, sugar, and sumac in a medium bowl; season with salt and let sit 30 minutes.\nAdd oil, vinegar, and pomegranate molasses and toss to combine; let sit 5 minutes.\nJust before serving, toss in parsley and pomegranate seeds; season with salt.",
        "ingredients": [
            "1 large red onion, thinly sliced",
            "1 1/2 teaspoons sugar",
            "1 teaspoon ground sumac",
            "Kosher salt",
            "3 tablespoons olive oil",
            "1 tablespoon red wine vinegar",
            "1 teaspoon pomegranate molasses or 1/2 teaspoon honey",
            "4 cups (lightly packed) fresh flat-leaf parsley leaves with tender stems",
            "1/4 cup pomegranate seeds"
        ],
        "step_by_step_instructions": [
            "Toss 0.25 of a large red onion, thinly sliced, with 0.38 teaspoon sugar and 0.25 teaspoon ground sumac in a medium bowl; season with salt and let sit for 30 minutes.",
            "Add 0.75 tablespoon olive oil, 0.25 tablespoon red wine vinegar, and 0.25 teaspoon pomegranate molasses and toss to combine; let sit for 5 minutes.",
            "Just before serving, toss in 1 cup fresh flat-leaf parsley leaves with tender stems and 1 tablespoon pomegranate seeds; season with salt."
        ],
        "processed_ingredients": [
            "0.25 large red onion",
            "0.38 teaspoon sugar",
            "0.25 teaspoon ground sumac",
            "0.75 tablespoon olive oil",
            "0.25 tablespoon red wine vinegar",
            "0.25 teaspoon pomegranate molasses",
            "1 cup fresh flat-leaf parsley leaves",
            "1 tablespoon pomegranate seeds"
        ],
        "pure_ingredients": [
            "red onion",
            "sugar",
            "sumac",
            "salt",
            "olive oil",
            "red wine vinegar",
            "pomegranate molasses",
            "parsley",
            "pomegranate seeds"
        ],
        "cooking_time": "35 minutes",
        "required_tools": [
            "bowl",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "L6qnbIVtiqgek2UKeOF15b931lRpmbW",
        "recipe_title": "Grilled Potatoes with Mustard-Garlic Dressing",
        "original_instructions": "Put the potatoes in a pot of generously salted water and bring to a boil. Cook until just tender, 8 to 10 minutes. Drain and cool slightly.\nWhile the potatoes are cooking, whisk together the vinegar, mustard and garlic in a bowl, and season with salt and pepper. Slowly whisk in the oil until emulsified.\nHeat the grill to high. Toss the potatoes with a little canola oil, and season with salt and pepper. Put the potatoes in a grill basket and grill, shaking the basket occasionally and turning the potatoes as needed, until charred in spots and just cooked through, about 5 minutes.\nPut the potatoes in a serving bowl and toss with the dressing while still hot. Add the parsley and toss again. Serve.",
        "ingredients": [
            "2 pounds new potatoes",
            "Kosher salt",
            "3 tablespoons white wine vinegar",
            "2 tablespoons whole-grain mustard",
            "2 cloves garlic, finely chopped",
            "Freshly ground black pepper",
            "1/2 cup extra-virgin olive oil",
            "Canola oil, for tossing",
            "1/4 cup chopped fresh flat-leaf parsley"
        ],
        "step_by_step_instructions": [
            "Put about 0.25 pounds (or 4 ounces) of new potatoes in a pot of generously salted water and bring to a boil.",
            "Cook the potatoes until just tender, around 8 to 10 minutes.",
            "Drain the potatoes and allow them to cool slightly.",
            "While the potatoes are cooking, whisk together 0.38 tablespoons of white wine vinegar, 0.25 tablespoons of whole-grain mustard, and 0.25 cloves of finely chopped garlic in a bowl.",
            "Season the mixture with salt and pepper.",
            "Slowly whisk in about 1 tablespoon of extra-virgin olive oil until emulsified.",
            "Heat a grill to high.",
            "Toss the cooled potatoes with a little canola oil and season with salt and pepper.",
            "Place the potatoes in a grill basket and grill, shaking the basket occasionally and turning the potatoes as needed, until charred in spots and just cooked through, about 5 minutes.",
            "Transfer the grilled potatoes to a serving bowl and toss with the dressing while still hot.",
            "Add approximately 0.03 cups of chopped fresh flat-leaf parsley and toss again.",
            "Serve the potatoes."
        ],
        "processed_ingredients": [
            "4.00 oz new potatoes",
            "0.38 tbsp white wine vinegar",
            "0.25 tbsp whole-grain mustard",
            "0.25 clove garlic",
            "1.00 tbsp extra-virgin olive oil",
            "0.03 cup chopped fresh flat-leaf parsley",
            "varied amount kosher salt",
            "varied amount freshly ground black pepper",
            "varied amount canola oil"
        ],
        "pure_ingredients": [
            "potatoes",
            "salt",
            "vinegar",
            "mustard",
            "garlic",
            "pepper",
            "olive oil",
            "canola oil",
            "parsley"
        ],
        "cooking_time": "23 minutes",
        "required_tools": [
            "pot",
            "bowl",
            "whisk",
            "grill",
            "grill basket",
            "serving bowl"
        ]
    },
    {
        "recipe_id": "wHAvpz3JAXOI/bGMyMbG7NL13ZmGbnq",
        "recipe_title": "Broccoli Soup",
        "original_instructions": "In a medium-size saucepan, over medium heat, add the garlic, shallots, leeks, onion and thyme. Sweat in the butter until fragrant.\nAdd the broccoli stem slices and saute until softened.\nPour in the chicken stock and bay leaf and simmer for about 20 minutes.\nIn the meantime, blanch the broccoli tips in a pot of boiling water over medium heat until bright green. Remove the tips from the water and \"shock\" in a bowl of iced water.\nDrain the green tips and puree in a blender. Set aside.\nPuree the soup in a blender and strain through a fine chinoise into a large serving bowl.\nAdd the green tip puree and season with salt and pepper, to taste.\nServe piping hot.",
        "ingredients": [
            "1 tablespoon butter",
            "6 garlic cloves, sliced",
            "4 shallots, sliced",
            "1 leek, white part only, sliced",
            "1 sprig thyme",
            "1 small onion, sliced",
            "2 heads broccoli, stems sliced, and green tips reserved for puree",
            "8 cups chicken stock",
            "1 bay leaf",
            "Salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "In a medium-size saucepan over medium heat, add 1 sliced garlic clove, 0.67 sliced shallot, 0.17 sliced leek (white part only), 0.17 sliced onion, and 0.17 sprig of thyme. Sweat in about 0.17 tablespoon butter until fragrant.",
            "Add approximately 0.67 cups of sliced broccoli stems and saute until softened.",
            "Pour in approximately 1.33 cups of chicken stock and add 0.17 bay leaf. Simmer for about 20 minutes.",
            "While the soup simmers, blanch about 0.67 cups of broccoli tips in a pot of boiling water over medium heat until bright green, then remove and shock them in a bowl of iced water.",
            "Drain the green tips and puree in a blender. Set aside.",
            "Puree the soup in a blender and strain through a fine chinoise into a large serving bowl.",
            "Add the green tip puree to the strained soup and season with salt and pepper to taste.",
            "Serve the soup piping hot."
        ],
        "processed_ingredients": [
            "0.17 tablespoon butter",
            "1 clove garlic",
            "0.67 shallot",
            "0.17 leek",
            "0.17 sprig thyme",
            "0.17 onion",
            "0.67 cup broccoli stems",
            "1.33 cups chicken stock",
            "0.17 bay leaf",
            "0.67 cup broccoli tips",
            "salt",
            "pepper"
        ],
        "pure_ingredients": [
            "butter",
            "garlic",
            "shallots",
            "leek",
            "thyme",
            "onion",
            "broccoli",
            "chicken stock",
            "bay leaf",
            "salt",
            "pepper"
        ],
        "cooking_time": "35 minutes",
        "required_tools": [
            "medium-size saucepan",
            "blender",
            "fine chinoise",
            "large serving bowl",
            "pot"
        ]
    },
    {
        "recipe_id": "aI6jOd84jETMCEPGUvhst1tmsHI.chC",
        "recipe_title": "Laulau",
        "original_instructions": "Wash and drain lu'au and ti leaves, removing stem and fibrous part of vein. Rub salt over pork chunks and divide into six parts. Cut fish into small chunks and divide into 6 parts.\nPlace 6-8 lu'au at one end of ti leaf. Top with one part of pork and one part of fish, then cover with 6-8 more lu'au until meat and fish are completely wrapped. Roll ti leaf up tightly. Wrap another ti leaf in the opposite direction to form a flat bundle, and tie with string. Repeat with the other five parts of pork and fish until you have six laulaus. Steam 3-4 hours, making sure to add more water when needed.",
        "ingredients": [
            "1 1/4 lb pork butt, cut into large chunks",
            "2 tablespoons Hawaiian or kosher salt",
            "1 lb salted butterfish or salmon, soaked in cold water for 3 hours and drained (see note)",
            "1 lb lu'au or fresh spinach leaves",
            "12 ti leaves (you may substitute corn husks or banana leaves)"
        ],
        "step_by_step_instructions": [
            "Wash and drain about 2.67 ounces of lu'au or fresh spinach leaves, removing stem and fibrous part of the vein.",
            "Take approximately 0.21 pounds of pork butt and rub with 0.33 teaspoons of Hawaiian or kosher salt.",
            "Cut about 0.17 pounds of salted butterfish or salmon into small chunks.",
            "Place 1-1.33 lu'au leaves at one end of a ti leaf.",
            "Top with the 0.21 pounds of salted pork chunks and 0.17 pounds of fish.",
            "Cover with 1-1.33 more lu'au leaves until meat and fish are completely wrapped.",
            "Roll the ti leaf up tightly.",
            "Wrap another ti leaf in the opposite direction to form a flat bundle, and tie with string.",
            "Steam the laulau for 3-4 hours, making sure to add more water when needed."
        ],
        "processed_ingredients": [
            "0.21 lb pork butt",
            "0.33 tbsp Hawaiian or kosher salt",
            "0.17 lb salted butterfish or salmon",
            "2.67 oz lu'au or fresh spinach leaves",
            "2 ti leaves"
        ],
        "pure_ingredients": [
            "pork",
            "salt",
            "butterfish",
            "spinach",
            "ti leaves"
        ],
        "cooking_time": "3 hours",
        "required_tools": [
            "knife",
            "steamer",
            "string"
        ]
    },
    {
        "recipe_id": "ObDuMKk6MBtuN7ivbVMr.r04c4pOMQO",
        "recipe_title": "Grilled Greek Chicken",
        "original_instructions": "Watch how to make this recipe.\nIn a medium bowl, whisk together the oil, oregano leaves, garlic, lemon juice and salt and pepper, to taste. Pat the chicken dry and place in a re-sealable plastic bag. Pour the mixture over the chicken and seal the bag, pressing out any excess air, and then turn the bag over several times to distribute the marinade. Put the chicken bag in a shallow dish and marinate, in the refrigerator, for at least 12 hours and up to 24 hours.\nPreheat the oven to 350 degree F.\nPlace a grill pan over moderately-high heat until very hot. Place the chicken skin-side down and cook until well browned, 10 to 13 minutes. Flip the chicken over and cook for another 8 to 10 minutes. Transfer the chicken to a sheet pan and finish cooking in the oven until golden brown and cooked through, 25 to 30 minutes. Let the chicken rest 10 minutes before serving.",
        "ingredients": [
            "1/2 cup extra-virgin olive oil",
            "1 bunch fresh oregano, leaves picked",
            "4 cloves garlic, finely minced",
            "Juice of 1 to 2 lemons",
            "Kosher salt and freshly cracked black pepper",
            "1 whole organic chicken, quartered"
        ],
        "step_by_step_instructions": [
            "In a medium bowl, whisk together approximately 2 tablespoons of extra-virgin olive oil, a few oregano leaves, about 1 clove of minced garlic, juice from half a lemon, and a pinch of kosher salt and black pepper.",
            "Pat a quarter of the chicken dry and place it in a re-sealable plastic bag.",
            "Pour the marinade mixture over the chicken in the bag and seal it, pressing out any excess air.",
            "Turn the bag over several times to ensure the marinade coats the chicken evenly.",
            "Place the chicken bag in a shallow dish and marinate it in the refrigerator for at least 12 hours and up to 24 hours.",
            "Preheat the oven to 350 degrees F.",
            "Place a grill pan over moderately-high heat until very hot.",
            "Place the chicken skin-side down on the grill pan and cook until well browned, approximately 10 to 13 minutes.",
            "Flip the chicken over and cook for another 8 to 10 minutes.",
            "Transfer the chicken to a sheet pan and finish cooking in the oven until golden brown and cooked through, about 25 to 30 minutes.",
            "Let the chicken rest for 10 minutes before serving."
        ],
        "processed_ingredients": [
            "2 tbsp extra-virgin olive oil",
            "0.25 oz oregano leaves",
            "1 clove garlic",
            "1 tbsp lemon juice",
            "0.25 tsp kosher salt",
            "0.25 tsp black pepper",
            "0.25 whole organic chicken"
        ],
        "pure_ingredients": [
            "olive oil",
            "oregano",
            "garlic",
            "lemon",
            "salt",
            "pepper",
            "chicken"
        ],
        "cooking_time": "13 hours",
        "required_tools": [
            "medium bowl",
            "re-sealable plastic bag",
            "shallow dish",
            "grill pan",
            "sheet pan"
        ]
    },
    {
        "recipe_id": "39EPH4qPD00aR46MaAXpRBbiAfhc6au",
        "recipe_title": "Green Chili Stew",
        "original_instructions": "Sear the meat in a Dutch oven or large heavy saucepan over medium-high heat until it browns and liquid accumulated from the meat mostly evaporates.\nStir in the onions and garlic and cook for several minutes, until the onions become translucent. Pour in stock and scrape the mixture up from the bottom to loosen browned bits.\nSprinkle in the salt, reduce the heat to a low simmer, and cook uncovered for 1 1/2 hours.\nStir in the chile sauce and any of the optional ingredients and continue cooking for another 45 minutes to 1 hour, until the meat is quite tender, the vegetables are soft, and the flavors have blended together.\nLadle into bowls and serve hot.",
        "ingredients": [
            "1 1/2 to 1 3/4 pounds beef chuck or pork butt (shoulder), cut in 1/2-inch cubes",
            "2 medium onions, diced",
            "4 garlic cloves, minced",
            "1 to 1 1/4 pounds red waxy potatoes, peeled or unpeeled, and diced",
            "5 cups beef or chicken stock",
            "1 1/2 tablespoons salt or more to taste",
            "3 cups 505 Southwestern brand Hatch Valley Roasted Green Chile sauce",
            "1 cup corn kernels, fresh or frozen, 1 cup carrot chunks, and/or 1 diced red bell pepper, optional"
        ],
        "step_by_step_instructions": [
            "Sear about 3 ounces of beef chuck or pork butt cubes in a Dutch oven or large saucepan over medium-high heat until it browns and liquid accumulated from the meat mostly evaporates.",
            "Stir in about 1/3 cup of diced onions and 1 minced garlic clove, and cook for several minutes until the onions become translucent.",
            "Pour in about 1 cup of beef or chicken stock and scrape the mixture up from the bottom to loosen browned bits.",
            "Sprinkle in approximately 1/2 teaspoon of salt, reduce the heat to a low simmer, and cook uncovered for 1 1/2 hours.",
            "Stir in about 2/3 cup of Hatch Valley Roasted Green Chile sauce and any optional ingredients if desired, and continue cooking for another 45 minutes to 1 hour, until the meat is quite tender, the vegetables are soft, and the flavors have blended together.",
            "Ladle into a bowl and serve hot."
        ],
        "processed_ingredients": [
            "3.50 oz beef chuck",
            "0.33 cup diced onions",
            "1 clove garlic",
            "1 cup beef stock",
            "0.50 tsp salt",
            "0.67 cup Hatch Valley Roasted Green Chile sauce",
            "0.22 lb potatoes"
        ],
        "pure_ingredients": [
            "beef",
            "onion",
            "garlic",
            "potato",
            "stock",
            "salt",
            "green chile",
            "corn",
            "carrot",
            "bell pepper"
        ],
        "cooking_time": "2 hours 30 minutes",
        "required_tools": [
            "Dutch oven",
            "large saucepan"
        ]
    },
    {
        "recipe_id": "GI41MqS/.yJrxk1PIdDKuA/BzJ2msni",
        "recipe_title": "Mexican Layered Bean Casserole",
        "original_instructions": "Sprinkle the zucchini slices all over with 1/2 teaspoon salt. Set aside. Stir together the beans, pico de gallo and oregano in a medium bowl.\nArrange the following in layers in a 9-inch deep-dish pie pan or 10-inch round microwave-safe dish: 4 of the tortilla halves, one-third of the bean mixture, one-third of the zucchini and 1/4 cup of the cheese. Repeat twice, while packing down the layers. Sprinkle with additional salt and the remaining 1/4 cup cheese.\nMicrowave on high until the zucchini is fully cooked, about 10 minutes. Remove from the microwave and loosely cover with foil to finish the cooking process, about 5 minutes. (Alternatively, preheat the oven to 375 degrees F, cover the baking dish with aluminum foil and cook until heated through and the cheese is melted, 15 to 20 minutes.)\nSprinkle with the cilantro, slice into 4 wedges and serve.",
        "ingredients": [
            "2 medium zucchini (about 8 ounces), thinly sliced on the diagonal",
            "Kosher salt",
            "One 15-ounce can pinto beans, drained and rinsed",
            "1 cup prepared pico de gallo or home-style fresh salsa",
            "1 tablespoon fresh whole oregano leaves",
            "Six 6-inch corn tortillas, halved",
            "1 cup shredded Monterey Jack or Chihuahua cheese",
            "2 tablespoons fresh cilantro leaves"
        ],
        "step_by_step_instructions": [
            "Sprinkle the zucchini slices with 0.13 teaspoon salt and set aside.",
            "In a medium bowl, stir together 3.75 ounces of pinto beans, 0.25 cup of pico de gallo, and 0.25 tablespoon of fresh oregano leaves.",
            "In a 9-inch deep-dish pie pan or 10-inch round microwave-safe dish, arrange 2 tortilla halves, 1.25 ounces of the bean mixture, 1.25 ounces of zucchini, and 0.06 cup of cheese. Repeat twice, packing down the layers.",
            "Sprinkle with additional salt and 0.06 cup cheese.",
            "Microwave on high for about 10 minutes until the zucchini is fully cooked.",
            "Remove from microwave and loosely cover with foil for about 5 minutes to finish the cooking process.",
            "Sprinkle with 0.5 tablespoon cilantro, slice into wedges, and serve."
        ],
        "processed_ingredients": [
            "2.67 ounce zucchini",
            "0.13 teaspoon salt",
            "3.75 ounce pinto beans",
            "0.25 cup pico de gallo",
            "0.25 tablespoon oregano leaves",
            "2 tortilla halves",
            "0.19 cup cheese",
            "0.5 tablespoon cilantro leaves"
        ],
        "pure_ingredients": [
            "zucchini",
            "salt",
            "pinto beans",
            "pico de gallo",
            "oregano",
            "corn tortillas",
            "cheese",
            "cilantro"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "microwave",
            "medium bowl",
            "9-inch deep-dish pie pan or 10-inch round microwave-safe dish",
            "aluminum foil"
        ]
    },
    {
        "recipe_id": "1dYEJkf6bKEIYFCiCLuGMTQzMwqimSW",
        "recipe_title": "Braised Cabbage",
        "original_instructions": "In a large saute pan, melt 2 tablespoons butter over medium heat. Add the cumin, caraway and coriander seeds and toast them slightly for 30 seconds. Do not let them brown.\nImmediately add half of the cabbage and season with the salt. Toss and stir to wilt and to combine with the spices. Add the remaining cabbage and if necessary, reseason with salt and allow it to continue wilting. Stir in the poblano, toss and cook over medium heat, stirring from time to time, about 10 to 15 minutes. Taste for seasoning.\nStir in the vinegar and orange juice and toss to blend. Taste for seasoning.\nLower the heat and add the cilantro. Stir to combine and remove the pan from the heat. Arrange it on a serving platter and serve.",
        "ingredients": [
            "2 tablespoons unsalted butter, plus 1/2 stick",
            "2 teaspoons whole cumin seeds",
            "2 teaspoons whole caraway seeds",
            "2 teaspoons whole coriander seeds",
            "2 small heads savoy cabbage, cored, leaves thinly sliced",
            "1 tablespoon kosher salt, plus more for seasoning",
            "1 poblano pepper, washed and cut into thin rounds, including seeds",
            "2 tablespoons red wine vinegar",
            "4 oranges, juiced",
            "3 tablespoons finely chopped cilantro leaves"
        ],
        "step_by_step_instructions": [
            "In a large saute pan, melt 0.25 tablespoons butter over medium heat.",
            "Add 0.25 teaspoons cumin seeds, 0.25 teaspoons caraway seeds, and 0.25 teaspoons coriander seeds and toast them slightly for 30 seconds without browning.",
            "Immediately add about 60 grams of sliced cabbage and season with 0.12 tablespoons salt. Toss and stir to wilt and to combine with the spices.",
            "Add another 60 grams of cabbage and, if necessary, reseason with salt and allow it to continue wilting.",
            "Stir in about 10 grams of poblano pepper, toss, and cook over medium heat, stirring from time to time, for about 10 to 15 minutes. Taste for seasoning.",
            "Stir in 0.25 tablespoons red wine vinegar and 1 ounce orange juice. Toss to blend. Taste for seasoning.",
            "Lower the heat and add 0.37 tablespoons finely chopped cilantro leaves. Stir to combine and remove the pan from the heat.",
            "Arrange it on a serving platter and serve."
        ],
        "processed_ingredients": [
            "0.25 tablespoon unsalted butter",
            "0.25 teaspoon whole cumin seeds",
            "0.25 teaspoon whole caraway seeds",
            "0.25 teaspoon whole coriander seeds",
            "120 g savoy cabbage",
            "0.12 tablespoon kosher salt",
            "10 g poblano pepper",
            "0.25 tablespoon red wine vinegar",
            "1 oz orange juice",
            "0.37 tablespoon cilantro leaves"
        ],
        "pure_ingredients": [
            "butter",
            "cumin seeds",
            "caraway seeds",
            "coriander seeds",
            "cabbage",
            "salt",
            "poblano pepper",
            "red wine vinegar",
            "oranges",
            "cilantro leaves"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "saute pan",
            "knife",
            "cutting board",
            "spoon",
            "serving platter"
        ]
    },
    {
        "recipe_id": "GRdO82cehholWJURZOgbX06lJioPFLm",
        "recipe_title": "Spinach-Cheese Swirls",
        "original_instructions": "Heat the oven to 400 degrees F. Beat the egg and water in a small bowl with a fork or whisk.\nStir the muenster cheese, parmesan cheese, onion and garlic powder in a medium bowl.\nUnfold the pastry sheet on a lightly floured surface. Brush the pastry sheet with the egg mixture. Top with the cheese mixture and spinach. Starting with a short side, roll up like a jelly roll. Cut into 20 (1/2-inch) slices. Place the slices, cut-side down, onto baking sheets. Brush the slices with the egg mixture.\nBake for 15 minutes or until the pastries are golden brown. Remove the pastries from the baking sheets and let cool on wire racks for 10 minutes.",
        "ingredients": [
            "1 egg",
            "1 tablespoon water",
            "1/2 cup shredded Muenster cheese or mozzarella cheese",
            "1/4 cup grated Parmesan cheese",
            "1 green onion, chopped (about 2 tablespoons)",
            "1/8 teaspoon garlic powder",
            "All-purpose flour",
            "1/2 of a 17.3-ounce package Pepperidge Farm Puff Pastry Sheets (1 sheet), thawed",
            "1 package (about 10 ounces) frozen chopped spinach, thawed and well drained"
        ],
        "step_by_step_instructions": [
            "Heat the oven to 400 degrees F.",
            "Beat about 0.05 egg (approximately 2.5 ml of egg) and 0.05 tablespoon (approximately 0.75 ml) water in a small bowl with a fork or whisk.",
            "Stir 0.03 cup (approximately 7.5 ml) shredded Muenster cheese, 0.015 cup (approximately 3.75 ml) grated Parmesan cheese, 0.05 tablespoon (approximately 0.75 ml) chopped green onion, and 0.00625 teaspoon (approximately 0.03 ml) garlic powder in a medium bowl.",
            "Unfold about 0.05 of the pastry sheet on a lightly floured surface.",
            "Brush the pastry sheet with the egg mixture.",
            "Top with the cheese mixture and about 0.5 ounce (approximately 14 g) of spinach.",
            "Starting with a short side, roll up like a jelly roll.",
            "Cut into about 1 slice (0.5-inch thick).",
            "Place the slice, cut-side down, onto a baking sheet.",
            "Brush the slice with the egg mixture.",
            "Bake for 15 minutes or until the pastry is golden brown.",
            "Remove the pastry from the baking sheet and let cool on a wire rack for 10 minutes."
        ],
        "processed_ingredients": [
            "0.05 egg",
            "0.05 tablespoon water",
            "0.03 cup shredded Muenster cheese",
            "0.015 cup grated Parmesan cheese",
            "0.05 tablespoon green onion",
            "0.00625 teaspoon garlic powder",
            "0.5 ounce frozen chopped spinach",
            "0.05 sheet puff pastry"
        ],
        "pure_ingredients": [
            "egg",
            "water",
            "Muenster cheese",
            "Parmesan cheese",
            "green onion",
            "garlic powder",
            "flour",
            "puff pastry",
            "spinach"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "oven",
            "small bowl",
            "fork",
            "whisk",
            "medium bowl",
            "baking sheet",
            "wire rack",
            "knife"
        ]
    },
    {
        "recipe_id": "O4EiLU2HF8rG0Z5SjiucNOGJp19WjcO",
        "recipe_title": "Creamed Christophene (Caribbean Squash)",
        "original_instructions": "Fill a large pot with water and add a little salt. Bring the water to a boil, then add the cubed squash and cook until tender, about 10 minutes. Drain the cooked squash and set aside in a large, well-greased baking dish.\nPreheat oven to 350 degrees F.\nIn a large saucepan over low heat, melt the butter. Slowly whisk in the flour and cook for 1 to 2 minutes, until the mixture is creamy and thick. Slowly stir in the milk and mix until smooth, about 1 minute. Add the 1/2 cup of grated cheese and stir until melted and well-mixed, about 1 minute. Add the onion, garlic, salt, celery, mustard and sugar to the sauce and mix well. Remove the sauce from heat and pour over the christophene in the baking dish. Stir everything together, then top with the remainig 1 cup grated cheese.\nPlace the mixture in the oven and bake until golden brown, about 20 to 30 minutes. Serve warm.",
        "ingredients": [
            "3 pounds christophene, peeled, seeded and cut into cubes (can substitute chayote or any summer squash)",
            "4 tablespoons butter",
            "4 tablespoons flour",
            "1 1/4 cups milk",
            "1/2 cup grated Monterey jack or Cheddar cheese, plus 1 cup, for topping",
            "1 onion, finely chopped",
            "2 cloves garlic, finely chopped",
            "1 teaspoon salt",
            "1 tablespoon chopped celery",
            "2 teaspoons prepared mustard",
            "2 tablespoons sugar"
        ],
        "step_by_step_instructions": [
            "Fill a large pot with water and add a little salt.",
            "Bring the water to a boil, then add about 340 g of cubed squash.",
            "Cook until tender, about 10 minutes.",
            "Drain the cooked squash and set aside in a greased baking dish.",
            "Preheat oven to 350 degrees F.",
            "In a large saucepan over low heat, melt 0.5 tablespoon of butter.",
            "Slowly whisk in 0.5 tablespoon of flour and cook for 1 to 2 minutes, until creamy and thick.",
            "Slowly stir in about 40 ml of milk and mix until smooth, about 1 minute.",
            "Add about 0.5 tablespoon of grated cheese and stir until melted and well-mixed, about 1 minute.",
            "Add about 0.25 of a finely chopped onion, 0.25 teaspoon of finely chopped garlic, a pinch of salt, 0.25 teaspoon of chopped celery, 0.25 teaspoon of prepared mustard, and 0.5 teaspoon of sugar to the sauce and mix well.",
            "Remove the sauce from heat and pour over the squash in the baking dish.",
            "Stir everything together, then top with 0.25 cup of grated cheese.",
            "Place the mixture in the oven and bake until golden brown, about 20 to 30 minutes.",
            "Serve warm."
        ],
        "processed_ingredients": [
            "340.00 g christophene",
            "0.50 tbsp butter",
            "0.50 tbsp flour",
            "40.00 ml milk",
            "0.50 tbsp grated Monterey jack",
            "0.25 cup grated Monterey jack",
            "0.25 onion",
            "0.25 tsp garlic",
            "0.25 tsp salt",
            "0.25 tsp celery",
            "0.25 tsp prepared mustard",
            "0.50 tsp sugar"
        ],
        "pure_ingredients": [
            "christophene",
            "butter",
            "flour",
            "milk",
            "cheese",
            "onion",
            "garlic",
            "salt",
            "celery",
            "mustard",
            "sugar"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "large pot",
            "saucepan",
            "whisk",
            "baking dish",
            "oven"
        ]
    },
    {
        "recipe_id": "M1AXWuIvugNGEdlfUnO0odmNKxNSNDO",
        "recipe_title": "Baked Beans with Bacon and Red Onions",
        "original_instructions": "Watch how to make this recipe.\nPreheat oven to 425 degrees F.\nPour beans into casserole dish and place in oven.\nIn a small nonstick skillet, cook bacon over medium high heat 2 to 3 minutes. Add onions and cook 3 minutes longer. Slide the beans out of the oven. Scatter the onions and bacon around the beans. Sprinkle the brown sugar and black pepper over the onions.\nBake beans with toppings 10 minutes longer. Garnish the beans with parsley and serve.",
        "ingredients": [
            "6 cups prepared barbecued baked beans, any brand -- the large can",
            "3 slices bacon, chopped, 1/2-inch pieces",
            "1 medium red onion, finely chopped",
            "1/4 cup brown sugar, a couple of handfuls",
            "1 teaspoon coarse black pepper",
            "2 tablespoons chopped parsley leaves, optional"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 425 degrees F.",
            "Pour approximately 1 cup of barbecued baked beans into a casserole dish and place in the oven.",
            "In a small nonstick skillet, cook 0.5 ounce of chopped bacon over medium high heat for 2 to 3 minutes.",
            "Add 0.5 ounce of finely chopped red onion to the skillet and cook for 3 minutes longer.",
            "Slide the beans out of the oven and scatter the cooked onions and bacon around the beans.",
            "Sprinkle approximately 0.5 tablespoon of brown sugar and 0.125 teaspoon of coarse black pepper over the onions.",
            "Bake the beans with toppings for 10 minutes longer.",
            "Garnish the beans with 0.5 tablespoon of chopped parsley and serve."
        ],
        "processed_ingredients": [
            "1 cup baked beans",
            "0.5 oz bacon",
            "0.5 oz red onion",
            "0.5 tbsp brown sugar",
            "0.125 tsp black pepper",
            "0.5 tbsp parsley"
        ],
        "pure_ingredients": [
            "beans",
            "bacon",
            "onion",
            "sugar",
            "pepper",
            "parsley"
        ],
        "cooking_time": "16 minutes",
        "required_tools": [
            "oven",
            "casserole dish",
            "nonstick skillet"
        ]
    },
    {
        "recipe_id": "p4aRo16jozi3G8IrZpflYUy.Fa69C9C",
        "recipe_title": "Roasted Shrimp with Cherry Tomatoes",
        "original_instructions": "Preheat the oven to 400 degrees F.\nPut the shrimp, cherry tomatoes and garlic on a baking sheet, then drizzle with olive oil and toss. Season with salt and pepper.\nRoast until the shrimp are opaque and the tomatoes begin to burst, 10 to 12 minutes. Finish with a squeeze of the lemon half.",
        "ingredients": [
            "1 pound peeled and deveined shrimp, tails on",
            "2 cups cherry tomatoes",
            "2 cloves garlic, thinly sliced",
            "Olive oil, for drizzling",
            "Kosher salt and freshly ground black pepper",
            "1/2 lemon"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Put approximately 0.25 pounds of shrimp, 0.5 cups of cherry tomatoes, and 0.5 cloves of garlic on a baking sheet.",
            "Drizzle with about 1 tablespoon of olive oil and toss.",
            "Season with a pinch of salt and pepper.",
            "Roast in the oven until the shrimp are opaque and the tomatoes begin to burst, about 10 to 12 minutes.",
            "Finish with a squeeze of lemon juice from 0.25 lemon."
        ],
        "processed_ingredients": [
            "0.25 lb shrimp",
            "0.5 cup cherry tomatoes",
            "0.5 clove garlic",
            "1 tbsp olive oil",
            "0.13 tsp salt",
            "0.13 tsp black pepper",
            "0.25 lemon"
        ],
        "pure_ingredients": [
            "shrimp",
            "cherry tomatoes",
            "garlic",
            "olive oil",
            "salt",
            "black pepper",
            "lemon"
        ],
        "cooking_time": "12 minutes",
        "required_tools": [
            "oven",
            "baking sheet"
        ]
    },
    {
        "recipe_id": "6GiDO8Y7gYqlGyhyLoL8XbNuYR11KOe",
        "recipe_title": "Pecan-Raisin Drop Cookies ",
        "original_instructions": "Preheat oven to 350°F. Line 2 baking sheets with parchment. Mix first 3 ingredients in bowl. Whisk sugar and butter in large bowl, 1 minute. Whisk in egg and vanilla. Stir in dry ingredients, then raisins and nuts. Drop dough by rounded teaspoonfuls onto sheets. Bake about 12 minutes. Transfer parchment to racks; cool.\nPreheat oven to 350°F. Line 2 baking sheets with parchment. Mix first 3 ingredients in bowl. Whisk sugar and butter in large bowl, 1 minute. Whisk in egg and vanilla. Stir in dry ingredients, then raisins and nuts. Drop dough by rounded teaspoonfuls onto sheets. Bake about 12 minutes. Transfer parchment to racks; cool.",
        "ingredients": [
            "1 cup all purpose flour",
            "3/4 teaspoon coarse kosher salt",
            "1/4 teaspoon baking soda",
            "3/4 cup (packed) golden brown sugar",
            "1/2 cup unsalted butter, melted",
            "1 large egg",
            "1 teaspoon vanilla extract",
            "3/4 cup raisins",
            "3/4 cup pecans, coarsely chopped"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350°F.",
            "Line 1 baking sheet with parchment paper.",
            "In a small bowl, mix 0.13 cup all-purpose flour, 0.10 teaspoon kosher salt, and 0.03 teaspoon baking soda.",
            "In a large bowl, whisk 0.13 cup golden brown sugar and 0.07 cup melted unsalted butter for 1 minute.",
            "Whisk in 0.17 of a large egg and 0.13 teaspoon vanilla extract.",
            "Stir in the dry ingredients, then add 0.10 cup raisins and 0.10 cup coarsely chopped pecans.",
            "Drop dough by rounded teaspoonfuls onto the prepared baking sheet.",
            "Bake for about 12 minutes.",
            "Transfer the parchment with cookies to a rack to cool."
        ],
        "processed_ingredients": [
            "0.13 cup all-purpose flour",
            "0.10 teaspoon kosher salt",
            "0.03 teaspoon baking soda",
            "0.13 cup golden brown sugar",
            "0.07 cup unsalted butter",
            "0.17 large egg",
            "0.13 teaspoon vanilla extract",
            "0.10 cup raisins",
            "0.10 cup pecans"
        ],
        "pure_ingredients": [
            "flour",
            "salt",
            "baking soda",
            "brown sugar",
            "butter",
            "egg",
            "vanilla extract",
            "raisins",
            "pecans"
        ],
        "cooking_time": "12 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "parchment paper",
            "small bowl",
            "large bowl",
            "whisk",
            "spoon",
            "rack"
        ]
    },
    {
        "recipe_id": "2ySi052B/Zu5vv5DvNfr2ISk2m1Eq9K",
        "recipe_title": "Mediterranean Succotash",
        "original_instructions": "Heat a medium skillet over medium high heat. Add oil, onion, garlic, peppers. Saute peppers, stirring frequently, 5 minutes. Add asparagus and corn, cook 3 to 5 minutes longer. Add beans and heat them through, 1 or 2 minutes. Season dish with salt and pepper, to your taste, then stir in parsley. Transfer to dinner plates or bowls and serve.",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil, 2 turns of the pan",
            "1 red onion, diced",
            "2 cloves garlic, chopped",
            "2 bell peppers, yellow, red, and/or green, seeded and chopped",
            "1 bunch asparagus, sliced on bias, tips 1 1/2 inches long",
            "2 cups frozen corn kernels",
            "1 can butter beans, drained",
            "Salt and pepper",
            "Handful flat-leaf parsley, chopped"
        ],
        "step_by_step_instructions": [
            "Heat a medium skillet over medium high heat.",
            "Add 0.67 tbsp of olive oil, approximately 0.17 of a diced red onion, and 0.33 clove of chopped garlic into the skillet.",
            "Add 0.33 of a chopped bell pepper to the skillet.",
            "Saute the mixture, stirring frequently, for 5 minutes.",
            "Add 0.17 of a bunch of sliced asparagus and 0.5 cup of frozen corn kernels to the skillet.",
            "Cook for an additional 3 to 5 minutes.",
            "Add 0.25 of a can of drained butter beans and heat through for 1 or 2 minutes.",
            "Season the dish with salt and pepper to taste, then stir in 0.33 handful of chopped flat-leaf parsley.",
            "Transfer the succotash to a dinner plate or bowl and serve."
        ],
        "processed_ingredients": [
            "0.67 tbsp extra-virgin olive oil",
            "0.17 red onion",
            "0.33 clove garlic",
            "0.33 bell pepper",
            "0.17 bunch asparagus",
            "0.5 cup frozen corn kernels",
            "0.25 can butter beans",
            "to taste salt",
            "to taste pepper",
            "0.33 handful flat-leaf parsley"
        ],
        "pure_ingredients": [
            "olive oil",
            "onion",
            "garlic",
            "bell pepper",
            "asparagus",
            "corn",
            "butter beans",
            "salt",
            "pepper",
            "parsley"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "medium skillet",
            "knife",
            "cutting board",
            "spoon"
        ]
    },
    {
        "recipe_id": "m2lIAaC0xVDXH45Ncfug2pg7GhStChq",
        "recipe_title": "Corn Off the Cob",
        "original_instructions": "Watch how to make this recipe.\nMelt the butter in a large saute pan over medium heat. Add the onions and saute until softened, about 3 minutes. Add the chicken stock, heavy cream, corn and some salt and pepper and cook, stirring occasionally, until the liquid is mostly evaporated and the corn is soft. If the corn isn¿t done but the liquid is gone, add a little more stock and continue cooking. Stir in the vinegar and serve.",
        "ingredients": [
            "4 tablespoons (1/2 stick) butter",
            "1 small yellow onion, chopped",
            "1 cup chicken stock, plus more if needed",
            "1/2 cup heavy cream",
            "8 ears corn, shucked and kernels cut off",
            "Salt and freshly ground black pepper",
            "2 teaspoons red wine vinegar"
        ],
        "step_by_step_instructions": [
            "Melt 0.5 tablespoon of butter in a large saute pan over medium heat.",
            "Add 0.13 small yellow onion, chopped, and saute until softened, about 3 minutes.",
            "Add 0.13 cup chicken stock, 0.06 cup heavy cream, 1 ear of corn kernels, and some salt and pepper.",
            "Cook, stirring occasionally, until the liquid is mostly evaporated and the corn is soft. If the corn isn't done but the liquid is gone, add a little more stock and continue cooking.",
            "Stir in 0.25 teaspoon red wine vinegar and serve."
        ],
        "processed_ingredients": [
            "0.5 tablespoon butter",
            "0.13 small yellow onion",
            "0.13 cup chicken stock",
            "0.06 cup heavy cream",
            "1 ear corn kernels",
            "0.13 teaspoon salt",
            "0.13 teaspoon black pepper",
            "0.25 teaspoon red wine vinegar"
        ],
        "pure_ingredients": [
            "butter",
            "onion",
            "chicken stock",
            "cream",
            "corn",
            "salt",
            "black pepper",
            "red wine vinegar"
        ],
        "cooking_time": "33 minutes",
        "required_tools": [
            "saute pan",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "KwWNFJjFs2ODYhq8CpQHFVXUercxJzS",
        "recipe_title": "Chicken and Rice Casserole",
        "original_instructions": "Preheat the oven to 425 degrees F. Melt the butter in a large ovenproof skillet over medium heat. Add the garlic and about three-quarters of the scallions and cook, stirring occasionally, until soft, about 2 minutes. Add the broccoli, chicken, rice, tomato, 1 teaspoon salt, and pepper to taste; stir to combine. Whisk the chicken broth and sour cream in a bowl, pour into the skillet and bring to a simmer. Stir in half each of the havarti and parmesan. Cover tightly with a lid or aluminum foil, transfer to the oven and bake until the rice is tender and most of the liquid is absorbed, about 20 minutes. Turn on the broiler. Uncover the skillet and sprinkle with the remaining havarti and parmesan, then broil until golden, about 2 minutes. Sprinkle with the reserved scallions.\nPhotograph by Christopher Testani",
        "ingredients": [
            "2 tablespoons unsalted butter",
            "2 cloves garlic, finely chopped",
            "4 scallions, sliced",
            "2 cups broccoli florets",
            "2 cups shredded rotisserie chicken (skin removed)",
            "1 cup medium-grain white rice",
            "1 plum tomato, chopped",
            "Kosher salt and freshly ground pepper",
            "2 cups low-sodium chicken broth",
            "1/4 cup sour cream",
            "1 cup diced dill havarti cheese (about 4 ounces)",
            "1/4 cup grated parmesan cheese (about 1 ounce)"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 425 degrees F.",
            "Melt 0.33 tablespoon of unsalted butter in a large ovenproof skillet over medium heat.",
            "Add 0.33 clove of finely chopped garlic and 0.67 tablespoon of sliced scallions to the skillet and cook, stirring occasionally, until soft, about 2 minutes.",
            "Add 0.33 cup of broccoli florets, 0.33 cup of shredded rotisserie chicken, 0.17 cup of medium-grain white rice, 0.17 cup of chopped plum tomato, 0.17 teaspoon of kosher salt, and freshly ground pepper to taste; stir to combine.",
            "In a bowl, whisk together 0.33 cup of low-sodium chicken broth and 0.33 tablespoon of sour cream.",
            "Pour the mixture into the skillet and bring to a simmer.",
            "Stir in 0.17 cup of diced dill havarti cheese and 0.08 cup of grated parmesan cheese.",
            "Cover tightly with a lid or aluminum foil and transfer to the oven. Bake until the rice is tender and most of the liquid is absorbed, about 20 minutes.",
            "Turn on the broiler.",
            "Uncover the skillet and sprinkle with 0.17 cup of remaining havarti cheese and 0.08 cup of remaining parmesan cheese, then broil until golden, about 2 minutes.",
            "Sprinkle with the reserved 0.33 tablespoon of scallions."
        ],
        "processed_ingredients": [
            "0.33 tbsp unsalted butter",
            "0.33 clove garlic",
            "0.67 tbsp scallions",
            "0.33 cup broccoli florets",
            "0.33 cup shredded rotisserie chicken",
            "0.17 cup medium-grain white rice",
            "0.17 cup plum tomato",
            "0.17 tsp kosher salt",
            "0.33 cup low-sodium chicken broth",
            "0.33 tbsp sour cream",
            "0.17 cup dill havarti cheese",
            "0.08 cup grated parmesan cheese"
        ],
        "pure_ingredients": [
            "butter",
            "garlic",
            "scallions",
            "broccoli",
            "chicken",
            "rice",
            "tomato",
            "salt",
            "pepper",
            "chicken broth",
            "sour cream",
            "havarti cheese",
            "parmesan cheese"
        ],
        "cooking_time": "24 minutes",
        "required_tools": [
            "oven",
            "skillet",
            "bowl",
            "lid or aluminum foil"
        ]
    },
    {
        "recipe_id": "ZCjku6PxZQnd.BgQBBVBCYIylAnohAu",
        "recipe_title": "Cumin Corn Chowder ",
        "original_instructions": "In a heavy saucepan cook onion in oil over moderately low heat, stirring, until softened. Add corn, water, and cumin and simmer 10 minutes. Chop tofu if not using silken. In a blender purée tofu, garlic, and all but about 1 cup soup in 2 batches, transferring it as puréed to bowl, and stir into remaining soup. Season soup with salt and pepper and heat over moderate heat, stirring, until hot.\nIn a heavy saucepan cook onion in oil over moderately low heat, stirring, until softened. Add corn, water, and cumin and simmer 10 minutes.\nChop tofu if not using silken. In a blender purée tofu, garlic, and all but about 1 cup soup in 2 batches, transferring it as puréed to bowl, and stir into remaining soup.\nSeason soup with salt and pepper and heat over moderate heat, stirring, until hot.",
        "ingredients": [
            "1 onion, chopped",
            "1 tablespoon vegetable oil",
            "2 cups fresh corn (cut from about 4 ears)",
            "3 cups water",
            "1/4 teaspoon ground cumin",
            "1/2 pound tofu (preferably silken)",
            "1 garlic clove, chopped fine"
        ],
        "step_by_step_instructions": [
            "Chop 0.25 onion finely.",
            "In a heavy saucepan, heat 0.33 tablespoon vegetable oil over moderately low heat.",
            "Add the chopped onion to the saucepan and cook, stirring, until softened.",
            "Add 0.5 cup fresh corn, 0.75 cup water, and 0.06 teaspoon ground cumin to the saucepan.",
            "Simmer the mixture for 10 minutes.",
            "If not using silken tofu, chop 0.125 pound tofu.",
            "In a blender, purée the chopped tofu, 0.25 garlic clove, and all but about 0.25 cup of the soup in 2 batches.",
            "Transfer the puréed mixture to a bowl and stir it into the remaining soup.",
            "Season the soup with salt and pepper to taste.",
            "Heat the soup over moderate heat, stirring, until hot."
        ],
        "processed_ingredients": [
            "0.25 onion",
            "0.33 tbsp vegetable oil",
            "0.5 cup fresh corn",
            "0.75 cup water",
            "0.06 tsp ground cumin",
            "0.13 lb tofu",
            "0.25 garlic clove"
        ],
        "pure_ingredients": [
            "onion",
            "vegetable oil",
            "corn",
            "water",
            "cumin",
            "tofu",
            "garlic",
            "salt",
            "pepper"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "saucepan",
            "blender",
            "knife",
            "cutting board",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "IzpOQyY0yyoxJc6WVgio9ck0xMp5cIa",
        "recipe_title": "Fillet of Beef",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 500 degrees F.\nPlace the beef on a sheet pan and pat the outside dry with a paper towel. Spread the butter on with your hands. Sprinkle evenly with the salt and pepper. Roast in the oven for exactly 22 minutes for rare and 25 minutes for medium-rare.\nRemove the beef from the oven, cover it tightly with aluminum foil, and allow it to rest at room temperature for 20 minutes. Remove the strings and slice the fillet thickly.",
        "ingredients": [
            "1 (4 to 5 pound) fillet of beef, trimmed and tied",
            "2 tablespoons unsalted butter, at room temperature",
            "1 tablespoon kosher salt",
            "1 tablespoon coarsely ground black pepper"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 500 degrees F.",
            "Cut a portion of the beef fillet weighing approximately 8 oz.",
            "Place the beef on a sheet pan and pat the outside dry with a paper towel.",
            "Spread approximately 0.25 tbsp of unsalted butter on the beef using your hands.",
            "Sprinkle approximately 0.25 tsp of kosher salt evenly over the beef.",
            "Sprinkle approximately 0.25 tsp of coarsely ground black pepper evenly over the beef.",
            "Roast the beef in the oven for exactly 22 minutes for rare or 25 minutes for medium-rare.",
            "Remove the beef from the oven, cover it tightly with aluminum foil, and allow it to rest at room temperature for 20 minutes.",
            "Remove the strings and slice the fillet thickly."
        ],
        "processed_ingredients": [
            "8.00 oz beef fillet",
            "0.25 tbsp unsalted butter",
            "0.25 tsp kosher salt",
            "0.25 tsp coarsely ground black pepper"
        ],
        "pure_ingredients": [
            "beef",
            "butter",
            "salt",
            "black pepper"
        ],
        "cooking_time": "67 minutes",
        "required_tools": [
            "oven",
            "sheet pan",
            "paper towel",
            "aluminum foil",
            "knife"
        ]
    },
    {
        "recipe_id": "78qlHBEQ3VxJxUACewaWQunT8doMP2e",
        "recipe_title": "Corn Pancakes",
        "original_instructions": "Blend the cup of buttermilk and corn oil together. Add the cornmeal and steep it to soften for 15 minutes while you get all the other ingredients together.\nMeanwhile sift the flour with the baking powder, baking soda and 1/2 teaspoon of salt.\nCombine the bell pepper, with corn kernels, egg yolks and scallion and season with freshly ground black pepper.\nRight before you begin to make the pancakes, combine the buttermilk and cornmeal mixture with the bell pepper, corn and scallion mixture and stir well.\nWhip the egg whites until stiff but not dry. Preheat the griddle. With a few swift strokes fold the dry ingredients into the wet ingredients (add more buttermilk if needed) and fold in the egg whites. Drop about 1/4 cup of batter onto the griddle and cook for about 2 to 3 minutes per side.\nServe with ham steaks.",
        "ingredients": [
            "1 cup buttermilk, plus more if needed",
            "2 tablespoons corn oil",
            "1/2 cup yellow cornmeal",
            "1/2 cup all purpose flour",
            "1 teaspoon baking powder",
            "1/4 teaspoon baking soda",
            "1/2 teaspoon salt",
            "1/4 cup minced red bell pepper",
            "10-ounce package frozen corn kernels, thawed",
            "2 eggs separated",
            "1 scallion, finely sliced",
            "Freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Blend 0.25 cup of buttermilk and 0.5 tablespoon corn oil together.",
            "Add 0.13 cup yellow cornmeal and steep it to soften for 15 minutes.",
            "Sift 0.13 cup all-purpose flour with 0.25 teaspoon baking powder, 0.06 teaspoon baking soda, and 0.13 teaspoon salt.",
            "Combine 1 tablespoon minced red bell pepper with 2.5 ounces corn kernels, 1 egg yolk, and 0.25 scallion finely sliced.",
            "Season with freshly ground black pepper.",
            "Combine the buttermilk and cornmeal mixture with the bell pepper, corn, and scallion mixture and stir well.",
            "Whip 1 egg white until stiff but not dry.",
            "Preheat the griddle.",
            "Fold the dry ingredients into the wet ingredients with a few swift strokes (add more buttermilk if needed) and fold in the egg white.",
            "Drop about 0.06 cup of batter onto the griddle and cook for about 2 to 3 minutes per side."
        ],
        "processed_ingredients": [
            "0.25 cup buttermilk",
            "0.5 tablespoon corn oil",
            "0.13 cup yellow cornmeal",
            "0.13 cup all-purpose flour",
            "0.25 teaspoon baking powder",
            "0.06 teaspoon baking soda",
            "0.13 teaspoon salt",
            "1 tablespoon red bell pepper",
            "2.5 ounce corn kernels",
            "1 egg yolk",
            "0.25 scallion",
            "1 egg white",
            "0.06 cup batter",
            "0.06 tablespoon black pepper"
        ],
        "pure_ingredients": [
            "buttermilk",
            "corn oil",
            "yellow cornmeal",
            "flour",
            "baking powder",
            "baking soda",
            "salt",
            "bell pepper",
            "corn",
            "egg",
            "scallion",
            "black pepper"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "blender",
            "sifter",
            "whisk",
            "griddle",
            "bowl",
            "spatula"
        ]
    },
    {
        "recipe_id": "zUjkTYi4x1yLimU0Ucb0tJDq.bTeFE2",
        "recipe_title": "Coconut Rice and Peas",
        "original_instructions": "In a medium saucepan, heat 1 tablespoon olive oil. Once hot add the minced garlic and the chili flakes, saute until soft, about 2 minutes. Add the rice and stir to coat. Add the white wine and stir. Add the chicken stock and the coconut milk. Give the rice a good stir and bring to a gentle boil. Once the rice just begins to boil, lower the heat and allow to simmer for about 20 minutes, until the rice is cooked and all the liquid has evaporated. Fluff with a fork and stir in the black eyed peas and the cilantro. Season with salt and pepper, to taste.",
        "ingredients": [
            "1 tablespoon olive oil",
            "1 tablespoon garlic, minced",
            "1/2 teaspoon red chili flakes",
            "1 cup basmati rice",
            "1/4 cup white wine",
            "1 cup chicken stock",
            "3/4 cup coconut milk",
            "1 can black eyed peas",
            "2 tablespoons freshly minced cilantro leaves",
            "Salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Heat 0.25 tablespoon olive oil in a medium saucepan.",
            "Add 0.25 tablespoon minced garlic and 0.125 teaspoon red chili flakes; sauté until soft, about 2 minutes.",
            "Add 0.25 cup basmati rice and stir to coat.",
            "Add 0.06 cup white wine and stir.",
            "Add 0.25 cup chicken stock and 0.19 cup coconut milk; stir well.",
            "Bring to a gentle boil, then lower the heat and simmer for about 20 minutes until rice is cooked and liquid evaporates.",
            "Fluff rice with a fork, then stir in 0.25 can black eyed peas and 0.5 tablespoon freshly minced cilantro leaves.",
            "Season with salt and pepper to taste."
        ],
        "processed_ingredients": [
            "0.25 tablespoon olive oil",
            "0.25 tablespoon garlic, minced",
            "0.125 teaspoon red chili flakes",
            "0.25 cup basmati rice",
            "0.06 cup white wine",
            "0.25 cup chicken stock",
            "0.19 cup coconut milk",
            "0.25 can black eyed peas",
            "0.5 tablespoon freshly minced cilantro leaves",
            "1 teaspoon salt",
            "1 teaspoon freshly ground black pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "garlic",
            "chili flakes",
            "basmati rice",
            "white wine",
            "chicken stock",
            "coconut milk",
            "black eyed peas",
            "cilantro",
            "salt",
            "black pepper"
        ],
        "cooking_time": "22 minutes",
        "required_tools": [
            "saucepan",
            "fork",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "ADPfEDXOT8./UHIBlinc30q4fPtgA.K",
        "recipe_title": "Pork Cutlets",
        "original_instructions": "In a mixing bowl, beat the egg white and water until it starts to foam. Stir in a teaspoon of dry mustard. Season cutlet with salt and pepper. Dip the cutlet in flour, then the egg mixture, coating thoroughly, and then in the breadcrumbs. Be sure that both sides are covered well. Set aside, or refrigerate, covered by a piece of waxed paper or plastic wrap.\nHeat the oil in a heavy frying pan until hot. Add the cutlet, lower the heat slightly, and cook for about 2 minutes. Turn with a spatula, and brown the other side. Continue cooking, turning once again if necessary, until the pork is cooked through, about 5 minutes in total. When done, the flesh will be white. Drain on a paper bag. Serve with a squeeze of lime.\nServe with potato and leeks",
        "ingredients": [
            "1 egg white plus 1 tablespoon water",
            "1 teaspoon dry mustard",
            "1 (4-ounce) boneless pork cutlet, pounded thin",
            "1/2 cup flour",
            "1/2 cup dry bread crumbs",
            "1 tablespoon olive oil",
            "1 lime"
        ],
        "step_by_step_instructions": [
            "In a mixing bowl, beat 0.5 egg white and 0.5 tablespoon water until it starts to foam.",
            "Stir in 0.5 teaspoon of dry mustard.",
            "Season the pork cutlet with salt and pepper.",
            "Dip the pork cutlet in 0.25 cup flour, then in the egg mixture, coating thoroughly, and then in 0.25 cup breadcrumbs, ensuring both sides are covered well.",
            "Set aside the cutlet, or refrigerate, covered by a piece of waxed paper or plastic wrap.",
            "Heat 0.5 tablespoon olive oil in a heavy frying pan until hot.",
            "Add the cutlet, lower the heat slightly, and cook for about 2 minutes.",
            "Turn with a spatula, and brown the other side.",
            "Continue cooking, turning once again if necessary, until the pork is cooked through, about 5 minutes in total.",
            "When done, the flesh will be white.",
            "Drain on a paper bag.",
            "Serve with a squeeze of lime."
        ],
        "processed_ingredients": [
            "0.5 egg white",
            "0.5 tablespoon water",
            "0.5 teaspoon dry mustard",
            "1 4-ounce boneless pork cutlet",
            "0.25 cup flour",
            "0.25 cup dry bread crumbs",
            "0.5 tablespoon olive oil",
            "1 lime"
        ],
        "pure_ingredients": [
            "egg white",
            "water",
            "dry mustard",
            "pork",
            "flour",
            "bread crumbs",
            "olive oil",
            "lime",
            "salt",
            "pepper"
        ],
        "cooking_time": "7 minutes",
        "required_tools": [
            "mixing bowl",
            "frying pan",
            "spatula",
            "waxed paper",
            "plastic wrap",
            "paper bag"
        ]
    },
    {
        "recipe_id": "DlG3RILYXIEqc4mfXmZoZeLhwQHG6kC",
        "recipe_title": "Nacho Chicken Drumsticks",
        "original_instructions": "Put the flour in a large bowl. Put the crushed chips in another large bowl and whisk the eggs in a third bowl. Toss the drumsticks in the flour. One at a time, dip each drumstick in the beaten egg and dredge in the crushed chips, turning to coat. Place on a baking sheet until ready to fry.\nPreheat the oven to 425 degrees F. Fill a large pot with 3 inches of vegetable oil and heat over medium-high heat until a deep-fry thermometer registers 350 degrees F. Working in batches, fry the drumsticks until golden and cooked through, about 15 minutes. Drain on paper towels and season with salt. (Let the oil return to 350 degrees F between batches.)\nArrange the drumsticks on a large ovenproof platter and sprinkle with the cheese. Bake until the cheese melts, about 4 minutes. Top with salsa, guacamole and pickled jalapenos.\nPhotograph by Johnny Miller",
        "ingredients": [
            "1 cup all-purpose flour",
            "1 9-ounce bag tortilla chips (about 7 cups), finely crushed",
            "4 large eggs",
            "12 medium chicken drumsticks (about 3 1/2 pounds)",
            "Vegetable oil, for frying",
            "Kosher salt",
            "1 1/2 cups grated cheddar, jack or muenster cheese",
            "Fresh salsa, guacamole and sliced pickled jalapenos, for topping"
        ],
        "step_by_step_instructions": [
            "Put approximately 0.08 cup of all-purpose flour in a large bowl.",
            "Put approximately 0.58 cup of crushed tortilla chips in another large bowl.",
            "Whisk 0.33 of a large egg in a third bowl.",
            "Toss 1 chicken drumstick in the flour.",
            "Dip the drumstick in the beaten egg.",
            "Dredge the drumstick in the crushed chips, turning to coat.",
            "Place the coated drumstick on a baking sheet until ready to fry.",
            "Preheat the oven to 425 degrees F.",
            "Fill a large pot with about 3 inches of vegetable oil and heat over medium-high heat until the oil reaches 350 degrees F.",
            "Fry the drumstick until golden and cooked through, about 15 minutes.",
            "Drain on paper towels and season with a pinch of salt.",
            "Arrange the drumstick on an ovenproof platter and sprinkle with approximately 0.125 cup of cheese.",
            "Bake until the cheese melts, about 4 minutes.",
            "Top with a small amount of salsa, guacamole, and a few slices of pickled jalapenos."
        ],
        "processed_ingredients": [
            "0.08 cup all-purpose flour",
            "0.58 cup tortilla chips",
            "0.33 large egg",
            "1 medium chicken drumstick",
            "3 inch vegetable oil",
            "0.125 cup cheese",
            "1 pinch salt",
            "1 tablespoon salsa",
            "1 tablespoon guacamole",
            "0.25 ounce pickled jalapenos"
        ],
        "pure_ingredients": [
            "flour",
            "tortilla chips",
            "eggs",
            "chicken",
            "vegetable oil",
            "salt",
            "cheese",
            "salsa",
            "guacamole",
            "jalapenos"
        ],
        "cooking_time": "19 minutes",
        "required_tools": [
            "large bowl",
            "baking sheet",
            "oven",
            "large pot",
            "deep-fry thermometer",
            "paper towels",
            "ovenproof platter"
        ]
    },
    {
        "recipe_id": "6UfBXj2agsNcO6YI715sNi3t37gGhL2",
        "recipe_title": "Asian Crab",
        "original_instructions": "In a large wok, heat canola oil over medium-high heat.\nCrack crab shells in multiple areas to allow sauce to enter shell without crab shells falling apart.\nAdd crab to oil and quickly saute for 1 to 3 minutes until crab is hot. Remove crab and drain oil.\nAdd hoisin, chile hot sauce, black bean paste, and white wine and heat until bubbling. Add crab, toss for 30 seconds. Add sesame oil, and toss for 15 seconds.\nRemove to plate and garnish with sesame seeds and green onions.",
        "ingredients": [
            "1/4 cup canola oil",
            "1 pound Dungeness crab, in shell (or king crab, or shell on 1-pound (21/25 count) shrimp for substitute)",
            "3 tablespoons hoisin sauce",
            "1 tablespoon chile hot sauce (recommended: Sriracha)",
            "3 tablespoons black bean garlic paste",
            "1/4 cup white wine",
            "1 teaspoon sesame oil",
            "1 tablespoon sesame seeds, toasted",
            "2 tablespoons green onions, sliced"
        ],
        "step_by_step_instructions": [
            "Heat 1 tablespoon of canola oil in a large wok over medium-high heat.",
            "Crack the crab shells in multiple areas to allow sauce to enter without the shells falling apart.",
            "Add approximately 4 ounces of crab to the oil and quickly sauté for 1 to 3 minutes until the crab is hot. Remove the crab and drain the oil.",
            "Add 0.5 tablespoon of hoisin sauce, 0.17 tablespoon of chile hot sauce, 0.5 tablespoon of black bean garlic paste, and 1 tablespoon of white wine to the wok and heat until bubbling.",
            "Add the crab back to the wok, toss for 30 seconds.",
            "Add 0.17 teaspoon of sesame oil and toss for an additional 15 seconds.",
            "Remove the crab to a plate and garnish with 0.5 teaspoon of sesame seeds and 1 teaspoon of sliced green onions."
        ],
        "processed_ingredients": [
            "1 tbsp canola oil",
            "4 oz Dungeness crab",
            "0.5 tbsp hoisin sauce",
            "0.17 tbsp chile hot sauce",
            "0.5 tbsp black bean garlic paste",
            "1 tbsp white wine",
            "0.17 tsp sesame oil",
            "0.5 tsp sesame seeds",
            "1 tsp green onions"
        ],
        "pure_ingredients": [
            "canola oil",
            "Dungeness crab",
            "hoisin sauce",
            "chile hot sauce",
            "black bean garlic paste",
            "white wine",
            "sesame oil",
            "sesame seeds",
            "green onions"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "wok",
            "plate"
        ]
    },
    {
        "recipe_id": "oodfoX2xMshpnkIlTCmbF4cMMAS8ZYu",
        "recipe_title": "Cilantro-Lime Rice",
        "original_instructions": "In a small saucepan, bring the rice, cilantro, broth, rice, and lime juice to a boil over high heat. Reduce the heat to a simmer, cover and cook for 20 minutes, or until the rice is tender. Remove the cilantro sprigs and serve.;",
        "ingredients": [
            "1/2 cup rice",
            "5 sprigs fresh cilantro",
            "1 cup chicken broth",
            "Juice of 1 lime"
        ],
        "step_by_step_instructions": [
            "In a small saucepan, bring 1/2 cup of rice, 5 sprigs of fresh cilantro, 1 cup of chicken broth, and juice of 1 lime to a boil over high heat.",
            "Reduce the heat to a simmer, cover and cook for 20 minutes, or until the rice is tender.",
            "Remove the cilantro sprigs and serve."
        ],
        "processed_ingredients": [
            "0.50 cup rice",
            "5.00 sprig cilantro",
            "1.00 cup chicken broth",
            "1.00 tbsp lime juice"
        ],
        "pure_ingredients": [
            "rice",
            "cilantro",
            "chicken broth",
            "lime"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "small saucepan",
            "lid"
        ]
    },
    {
        "recipe_id": "RNPOTMND5W/mgE6C6zLp6Ig0KauceIK",
        "recipe_title": "Carrots and Leeks ",
        "original_instructions": "Halve leeks lengthwise, then cut crosswise into 1-inch pieces and wash Sauté leeks in butter with 1 teaspoon salt and 1/2 teaspoon pepper in a 12-inch heavy skillet over medium-high heat until softened, 5 to 6 minutes. Stir in carrots, water, and vinegar. Cook, covered, over medium-high heat until carrots are tender, 20 to 25 minutes. Boil, uncovered, until liquid has evaporated, 3 to 5 minutes.\nHalve leeks lengthwise, then cut crosswise into 1-inch pieces and wash\nSauté leeks in butter with 1 teaspoon salt and 1/2 teaspoon pepper in a 12-inch heavy skillet over medium-high heat until softened, 5 to 6 minutes.\nStir in carrots, water, and vinegar. Cook, covered, over medium-high heat until carrots are tender, 20 to 25 minutes.\nBoil, uncovered, until liquid has evaporated, 3 to 5 minutes.",
        "ingredients": [
            "3 medium leeks (white and pale green parts only)",
            "3 tablespoons unsalted butter",
            "1 lb carrots, cut diagonally into 1 1/4-inch pieces",
            "1 1/4 cups water",
            "1/2 cup red-wine vinegar"
        ],
        "step_by_step_instructions": [
            "Halve 1 leek lengthwise, then cut crosswise into 1-inch pieces and wash.",
            "Sauté the chopped leeks in 0.5 tablespoon butter with a pinch of salt and a pinch of pepper in a skillet over medium-high heat until softened, about 5 to 6 minutes.",
            "Stir in 4 ounces of carrots, 0.3 cups of water, and 0.12 cups of red-wine vinegar.",
            "Cook, covered, over medium-high heat until carrots are tender, about 20 to 25 minutes.",
            "Boil, uncovered, until liquid has evaporated, about 3 to 5 minutes."
        ],
        "processed_ingredients": [
            "1 leek",
            "0.5 tablespoon unsalted butter",
            "4 oz carrots",
            "0.3 cup water",
            "0.12 cup red-wine vinegar",
            "0.17 teaspoon salt",
            "0.08 teaspoon pepper"
        ],
        "pure_ingredients": [
            "leeks",
            "butter",
            "carrots",
            "water",
            "vinegar",
            "salt",
            "pepper"
        ],
        "cooking_time": "34 minutes",
        "required_tools": [
            "skillet",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "UwhaLF0gcMi4S.izGirUuoW4cPjQGqq",
        "recipe_title": "Sweet Butter Toasts",
        "original_instructions": "Mix the sugar and cinnamon in a small bowl, if desired. Melt the butter on a heavy griddle over medium heat. Coat both sides of the bread slices with the melted butter on the grill and arrange on grill. Sprinkle with sugar. Once bread has nice grill marks, about 2 minutes, flip over and grill the sugared side for 2 minutes until caramelized. Transfer the toasts to a plate, sugar side up. Cool slightly, then cut diagonally in half. Eat toasts sugared side down.",
        "ingredients": [
            "3 tablespoons sugar",
            "1 teaspoon ground cinnamon, optional",
            "2 tablespoons butter",
            "8 (1/2-inch thick) slices ciabatta bread"
        ],
        "step_by_step_instructions": [
            "Mix about 0.38 tablespoon sugar and a pinch of cinnamon in a small bowl, if desired.",
            "Melt about 0.25 tablespoon butter on a heavy griddle over medium heat.",
            "Coat both sides of 1 slice of ciabatta bread with the melted butter on the grill and arrange on grill.",
            "Sprinkle with the sugar mixture.",
            "Once the bread has nice grill marks, about 2 minutes, flip over and grill the sugared side for 2 minutes until caramelized.",
            "Transfer the toast to a plate, sugar side up.",
            "Cool slightly, then cut diagonally in half.",
            "Eat toast sugared side down."
        ],
        "processed_ingredients": [
            "0.38 tablespoon sugar",
            "0.13 teaspoon ground cinnamon",
            "0.25 tablespoon butter",
            "1 slice ciabatta bread"
        ],
        "pure_ingredients": [
            "sugar",
            "cinnamon",
            "butter",
            "bread"
        ],
        "cooking_time": "4 minutes",
        "required_tools": [
            "small bowl",
            "heavy griddle",
            "plate",
            "knife"
        ]
    },
    {
        "recipe_id": ".XEPIyyuAoW1H1M2DqQ4CY.bul0hEd6",
        "recipe_title": "Lemon-Glazed Brussels Sprouts ",
        "original_instructions": "Combine first 4 ingredients in large pot; cover and bring to boil over high heat. Reduce heat to medium. Cook until brussels sprouts are crisp-tender, about 10 minutes, stirring occasionally. Stir in lemon juice; cook uncovered until glaze coats brussels sprouts, about 1 minute. Season to taste with salt and pepper. Transfer brussels sprouts to bowl. Sprinkle with lemon peel and serve.\nCombine first 4 ingredients in large pot; cover and bring to boil over high heat. Reduce heat to medium. Cook until brussels sprouts are crisp-tender, about 10 minutes, stirring occasionally. Stir in lemon juice; cook uncovered until glaze coats brussels sprouts, about 1 minute. Season to taste with salt and pepper. Transfer brussels sprouts to bowl. Sprinkle with lemon peel and serve.",
        "ingredients": [
            "2 pounds medium brussels sprouts, trimmed",
            "3/4 cup water",
            "1/4 cup (1/2 stick) butter",
            "2 tablespoons olive oil",
            "2 tablespoons fresh lemon juice",
            "2 teaspoons grated lemon peel"
        ],
        "step_by_step_instructions": [
            "Combine 5 oz brussels sprouts, 3 tbsp water, 0.5 tbsp butter, and 0.5 tbsp olive oil in a large pot; cover and bring to boil over high heat.",
            "Reduce heat to medium. Cook until brussels sprouts are crisp-tender, about 10 minutes, stirring occasionally.",
            "Stir in 0.5 tbsp lemon juice; cook uncovered until glaze coats brussels sprouts, about 1 minute.",
            "Season to taste with salt and pepper.",
            "Transfer brussels sprouts to bowl.",
            "Sprinkle with 0.25 tsp grated lemon peel and serve."
        ],
        "processed_ingredients": [
            "5.00 oz brussels sprouts",
            "3.00 tbsp water",
            "0.50 tbsp butter",
            "0.50 tbsp olive oil",
            "0.50 tbsp lemon juice",
            "0.25 tsp grated lemon peel"
        ],
        "pure_ingredients": [
            "brussels sprouts",
            "water",
            "butter",
            "olive oil",
            "lemon",
            "salt",
            "pepper"
        ],
        "cooking_time": "11 minutes",
        "required_tools": [
            "large pot",
            "stove",
            "spoon",
            "bowl"
        ]
    },
    {
        "recipe_id": "T0BmttBv8pyWikMJka/MLVCjqbagf06",
        "recipe_title": "Tear-Away Cheesy Bread",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 350 degrees F.\nWith a large serrated knife, score the bread in 1-inch intervals; turn the loaf and score again creating 1-inch cubes without cutting all the way through. Stuff the shredded cheese evenly into the cut crevices in the bread, and place the loaf on a baking sheet.\nBake until the cheese is melted and the corners of the bread are turning golden brown and crisp, 12 to 15 minutes. Let cool for about 5 minutes.\nTransfer the loaf to a shallow bowl and serve whole at the table for guests to tear apart with their fingers.",
        "ingredients": [
            "One 1-pound round loaf country or sourdough bread",
            "2 cups shredded pepper Jack or Cheddar"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "With a large serrated knife, score the bread in 1-inch intervals; turn the loaf and score again creating 1-inch cubes without cutting all the way through.",
            "Stuff approximately 0.25 cup of shredded cheese evenly into the cut crevices in the bread, and place the loaf on a baking sheet.",
            "Bake until the cheese is melted and the corners of the bread are turning golden brown and crisp, about 12 to 15 minutes.",
            "Let cool for about 5 minutes.",
            "Transfer the loaf to a shallow bowl and serve whole at the table for guests to tear apart with their fingers."
        ],
        "processed_ingredients": [
            "4.00 oz bread",
            "0.25 cup cheese"
        ],
        "pure_ingredients": [
            "bread",
            "cheese"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "oven",
            "serrated knife",
            "baking sheet",
            "shallow bowl"
        ]
    },
    {
        "recipe_id": "5C30WvQ8lJrI1XAllGAx63AdcdbRLCO",
        "recipe_title": "Vegetable Bundles",
        "original_instructions": "In a medium saucepan over medium heat, melt the butter. Add the thyme and oregano sprigs, along with the garlic, wine, chicken stock, and lemon juice and zest. Allow to boil down, about 5 minutes.\nWhile the broth is cooking, layer 2 zucchini ribbons vertically. Add 2 string beans, 1 squash quarter and 1 asparagus horizontally. Roll the zucchini ribbon up to create a bundle. Do this for the remaining ingredients. Add each bundle gently to the pan with the broth. Sprinkle with salt and pepper. Cook for 3 to 4 minutes, spooning the broth over each bundle.",
        "ingredients": [
            "2 tablespoons unsalted butter",
            "4 long sprigs fresh thyme",
            "4 long sprigs fresh oregano",
            "1 clove garlic, chopped",
            "1 cup white wine",
            "1 cup chicken stock",
            "1 lemon, zested and juiced",
            "1 medium zucchini, cut into ribbons",
            "8 string beans",
            "4 asparagus, ends snapped",
            "1 medium yellow squash, cut into quarters lengthwise",
            "Kosher salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "In a small saucepan over medium heat, melt 0.5 tablespoon of butter.",
            "Add 1 sprig of thyme and 1 sprig of oregano, along with 0.25 clove of chopped garlic, 0.25 cup of white wine, 0.25 cup of chicken stock, and 0.25 of both lemon juice and zest.",
            "Allow the mixture to boil down for about 5 minutes.",
            "While the broth is cooking, layer 0.5 zucchini ribbon vertically.",
            "Add 2 string beans, 0.25 squash quarter, and 1 asparagus horizontally.",
            "Roll the zucchini ribbon up to create a bundle.",
            "Gently add the bundle to the pan with the broth.",
            "Sprinkle with a pinch of salt and pepper.",
            "Cook for 3 to 4 minutes, spooning the broth over the bundle."
        ],
        "processed_ingredients": [
            "0.5 tbsp butter",
            "1 sprig thyme",
            "1 sprig oregano",
            "0.25 clove garlic",
            "0.25 cup white wine",
            "0.25 cup chicken stock",
            "0.25 lemon",
            "0.5 ribbon zucchini",
            "2 string beans",
            "1 asparagus",
            "0.25 medium squash",
            "0.25 tsp salt",
            "0.25 tsp black pepper"
        ],
        "pure_ingredients": [
            "butter",
            "thyme",
            "oregano",
            "garlic",
            "white wine",
            "chicken stock",
            "lemon",
            "zucchini",
            "string beans",
            "asparagus",
            "squash",
            "salt",
            "black pepper"
        ],
        "cooking_time": "9 minutes",
        "required_tools": [
            "saucepan",
            "knife",
            "cutting board",
            "spoon"
        ]
    },
    {
        "recipe_id": "UfXyNbRPo0Us9.sQj/XwSCbpaBvI.PK",
        "recipe_title": "30-Minute Turkey Chili",
        "original_instructions": "1. Heat olive oil in a large, heavy skillet over medium-high heat. Add onion, garlic, 1 tablespoon salt, chili powder, and oregano and cook, stirring, until fragrant, about 3 minutes.\n2. Stir in tomato paste and chipotle chile and sauce; cook 1 minute more. Add turkey, breaking it up with a wooden spoon, and cook until meat begins to brown, about 3 minutes. Add beer and simmer until reduced by about half, about 8 minutes. Add tomatoes-crushing them through your fingers into skillet-along with their juices and beans; bring to a boil. Cook, uncovered and stirring occasionally, until thickened, about 10 minutes.\n3. Ladle chili into bowls and serve with garnishes of your choice.\nCalories: 400\nTotal Fat: 13 grams\nSaturated Fat: 1.5 grams\nTotal Carbohydrate: 34 grams\nProtein: 38 grams\nSodium: 510 milligrams\nCholesterol: 45 milligrams\nFiber: 12 grams",
        "ingredients": [
            "3 tablespoons extra-virgin olive oil",
            "1 medium yellow onion, chopped",
            "5 cloves garlic, chopped",
            "Kosher salt",
            "2 teaspoons chili powder",
            "1 teaspoon dried oregano",
            "1 tablespoon tomato paste",
            "1 chipotle chile en adobo, coarsely chopped, with 1 tablespoon sauce",
            "1 pound ground turkey",
            "1 (12-ounce) Mexican lager-style beer",
            "1 (14 12-ounce) can whole peeled tomatoes, with their juice",
            "1 (15 12-ounce) can kidney beans, rinsed and drained",
            "Sliced scallions, cilantro sprigs, avocado, sour cream, grated Monterey Jack cheese, and/or tortilla chips, for garnish, optional"
        ],
        "step_by_step_instructions": [
            "1. Heat 0.38 tablespoon of olive oil in a large, heavy skillet over medium-high heat.",
            "2. Add 0.13 medium yellow onion, chopped, 1 garlic clove, chopped, 0.13 tablespoon salt, 0.25 teaspoon chili powder, and 0.13 teaspoon dried oregano. Cook, stirring, until fragrant, about 3 minutes.",
            "3. Stir in 0.13 tablespoon tomato paste and 0.13 chipotle chile en adobo with 0.13 tablespoon sauce; cook 1 minute more.",
            "4. Add 0.13 pound ground turkey, breaking it up with a wooden spoon, and cook until meat begins to brown, about 3 minutes.",
            "5. Add 1.5 ounces of Mexican lager-style beer and simmer until reduced by about half, about 8 minutes.",
            "6. Add 1.75 ounces of whole peeled tomatoes, crushing them through your fingers into the skillet, along with their juices, and 1.88 ounces of kidney beans; bring to a boil.",
            "7. Cook, uncovered and stirring occasionally, until thickened, about 10 minutes.",
            "8. Ladle chili into bowls and serve with your choice of garnishes."
        ],
        "processed_ingredients": [
            "0.38 tablespoon olive oil",
            "0.13 medium onion",
            "1 clove garlic",
            "0.13 tablespoon salt",
            "0.25 teaspoon chili powder",
            "0.13 teaspoon oregano",
            "0.13 tablespoon tomato paste",
            "0.13 chipotle chile en adobo",
            "0.13 tablespoon adobo sauce",
            "0.13 pound ground turkey",
            "1.5 ounces beer",
            "1.75 ounces whole peeled tomatoes",
            "1.88 ounces kidney beans"
        ],
        "pure_ingredients": [
            "olive oil",
            "onion",
            "garlic",
            "salt",
            "chili powder",
            "oregano",
            "tomato paste",
            "chipotle chile",
            "adobo sauce",
            "turkey",
            "beer",
            "tomatoes",
            "kidney beans"
        ],
        "cooking_time": "33 minutes",
        "required_tools": [
            "skillet",
            "wooden spoon",
            "bowl"
        ]
    },
    {
        "recipe_id": "g0XBtgIo6SqBRxH24gWtboR/qsJzAIm",
        "recipe_title": "Grilled Pizza",
        "original_instructions": "Watch how to make this recipe.\nRoll the pizza dough into a small disk on a lightly-floured surface; let it rest 10 minutes, then toss, stretch or roll it into a thin, broad crust.\nPrepare a grill for high heat. Brush the pizza dough with some of the oil and place it on the grill. Grill, covered, for 30 seconds, then check: The crust should be slightly stiff but not deeply browned. Flip the crust, top it with a thin layer of the tomato sauce and the mozzarella. Sprinkle with some basil leaves, cover and grill until the cheese has melted and the crust has browned, about 30 seconds more.",
        "ingredients": [
            "1 pound frozen pizza dough, thawed",
            "All-purpose flour, for the work surface",
            "Extra-virgin olive oil, for brushing",
            "1/4 cup prepared tomato sauce",
            "One to two 8-ounce balls fresh mozzarella, sliced, or packaged grated mozzarella",
            "Fresh basil leaves, for sprinkling"
        ],
        "step_by_step_instructions": [
            "Thaw approximately 0.25 pounds of frozen pizza dough.",
            "Lightly flour a work surface and roll the pizza dough into a small disk.",
            "Let the dough rest for 10 minutes.",
            "Toss, stretch, or roll the dough into a thin, broad crust.",
            "Prepare a grill for high heat.",
            "Brush the pizza dough with a little olive oil.",
            "Place the pizza dough on the grill and cover it.",
            "Grill for 30 seconds and then check the crust. It should be slightly stiff but not deeply browned.",
            "Flip the crust over.",
            "Top the flipped crust with about 1 tablespoon of tomato sauce.",
            "Add approximately 2 ounces of sliced fresh mozzarella on top of the sauce.",
            "Sprinkle a few basil leaves over the mozzarella.",
            "Cover and grill until the cheese has melted and the crust has browned, about 30 more seconds."
        ],
        "processed_ingredients": [
            "0.25 lb frozen pizza dough",
            "1 tbsp all-purpose flour",
            "1 tsp extra-virgin olive oil",
            "1 tbsp tomato sauce",
            "2 oz fresh mozzarella",
            "0.1 oz fresh basil leaves"
        ],
        "pure_ingredients": [
            "pizza dough",
            "flour",
            "olive oil",
            "tomato sauce",
            "mozzarella",
            "basil"
        ],
        "cooking_time": "11 minutes",
        "required_tools": [
            "grill",
            "brush",
            "rolling pin"
        ]
    },
    {
        "recipe_id": "QcpS23ODsPjAbr9aHGIe7rJcveaW4w.",
        "recipe_title": "Garlic Mashed Potatoes",
        "original_instructions": "Cook the potatoes in 4 cups water for 30 minutes or until soft. Drain. Pass the potatoes through a food mill and add the garlic, butter, heavy cream, bacon bits, and salt and pepper to taste. Stir until thoroughly combined. Serve warm.;",
        "ingredients": [
            "6 Yukon Gold Potatoes, peeled and quartered",
            "4 cups water",
            "1 head garlic roasted",
            "4 tablespoons butter",
            "4 to 5 heavy cream, heated",
            "2 tablespoons fresh bacon bits",
            "Salt and freshly ground black pepper, to taste"
        ],
        "step_by_step_instructions": [
            "Peel and quarter approximately 1 Yukon Gold Potato.",
            "Cook the potato in 0.67 cups of water for about 30 minutes until soft.",
            "Drain the potato.",
            "Pass the potato through a food mill.",
            "Add approximately 0.17 heads of roasted garlic.",
            "Add 0.67 tablespoons of butter.",
            "Add 0.67 to 0.83 tablespoons of heated heavy cream.",
            "Add 0.33 tablespoons of fresh bacon bits.",
            "Season with salt and freshly ground black pepper to taste.",
            "Stir until thoroughly combined.",
            "Serve warm."
        ],
        "processed_ingredients": [
            "1 Yukon Gold Potato",
            "0.67 cup water",
            "0.17 head garlic roasted",
            "0.67 tablespoon butter",
            "0.67 to 0.83 tablespoon heavy cream",
            "0.33 tablespoon fresh bacon bits",
            "0.08 teaspoon salt",
            "0.08 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "potato",
            "water",
            "garlic",
            "butter",
            "cream",
            "bacon",
            "salt",
            "pepper"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "peeler",
            "knife",
            "pot",
            "food mill",
            "spoon"
        ]
    },
    {
        "recipe_id": "lTBs652KtKT/GN/SD2mKhAJhd0kZd2.",
        "recipe_title": "Cream of Peanut Soup",
        "original_instructions": "MELT butter in medium saucepan. Cook celery and onion until onion is tender, but not browned. Stir in flour and cook about one minute. Whisk in chicken broth, cooking until thickened and bubbly.\nREMOVE from heat. Puree mixture in batches, in a blender, until smooth. Return to saucepan.\nADD the peanut butter and milk, stirring to blend thoroughly. Heat through, but do not boil. Serve hot or cold. Garnish with snipped chives and chopped peanuts, if desired.",
        "ingredients": [
            "2 tbsps. butter",
            "1 stalk celery, chopped",
            "1/2 medium onion, chopped",
            "1 1/2 tbsps. Pillsbury BEST All Purpose Flour",
            "4 cups chicken or vegetable broth",
            "1 cup Jif Creamy Peanut Butter",
            "1 cup milk",
            "Snipped chives",
            "Chopped peanuts for garnish"
        ],
        "step_by_step_instructions": [
            "Melt 0.33 tbsp butter in a medium saucepan.",
            "Cook 0.17 medium onion and 0.17 stalk celery in the butter until the onion is tender, but not browned.",
            "Stir in 0.25 tbsp flour and cook about one minute.",
            "Whisk in 0.67 cup chicken broth, cooking until thickened and bubbly.",
            "Remove from heat and puree the mixture in batches in a blender until smooth.",
            "Return the pureed mixture to the saucepan.",
            "Add 0.17 cup peanut butter and 0.17 cup milk to the saucepan, stirring to blend thoroughly.",
            "Heat through, but do not boil.",
            "Serve hot or cold, garnishing with optional snipped chives and chopped peanuts if desired."
        ],
        "processed_ingredients": [
            "0.33 tbsp butter",
            "0.17 stalk celery",
            "0.17 medium onion",
            "0.25 tbsp flour",
            "0.67 cup chicken broth",
            "0.17 cup peanut butter",
            "0.17 cup milk",
            "0.08 tbsp chives",
            "0.08 tbsp peanuts"
        ],
        "pure_ingredients": [
            "butter",
            "celery",
            "onion",
            "flour",
            "chicken broth",
            "peanut butter",
            "milk",
            "chives",
            "peanuts"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "saucepan",
            "blender",
            "whisk",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "0yshuU5G/p/nc2MJJm4N/cGxbBajMRS",
        "recipe_title": "Green Beans Slow-Cooked with Bacon and Onions",
        "original_instructions": "Heat a heavy bottomed pot over medium high heat. Add the olive oil, bacon, and onions and cook until the onion is soft, about 5 to 10 minutes. Stir in the green beans and chicken stock; season with salt and pepper. Reduce the heat to low, and cook the green beans until they are soft but not mushy, about 30 to 45 minutes. Taste and adjust seasoning.",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil",
            "4 to 6 slices bacon, chopped",
            "1 large onion, chopped",
            "3 pounds fresh green beans",
            "2 quarts chicken stock or water",
            "Kosher salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Heat a heavy bottomed pot over medium high heat.",
            "Add 0.33 tbsp of olive oil, 1 slice of bacon (chopped), and 0.17 of a large onion (chopped) to the pot.",
            "Cook until the onion is soft, about 5 to 10 minutes.",
            "Stir in 0.5 lb of green beans and 2 cups of chicken stock.",
            "Season with salt and pepper to taste.",
            "Reduce the heat to low, and cook the green beans until they are soft but not mushy, about 30 to 45 minutes.",
            "Taste and adjust seasoning if necessary."
        ],
        "processed_ingredients": [
            "0.33 tbsp olive oil",
            "1 slice bacon",
            "0.17 large onion",
            "0.5 lb green beans",
            "2 cup chicken stock",
            "0.5 tsp salt",
            "0.25 tsp pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "bacon",
            "onion",
            "green beans",
            "chicken stock",
            "salt",
            "pepper"
        ],
        "cooking_time": "55 minutes",
        "required_tools": [
            "heavy bottomed pot",
            "knife",
            "cutting board",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "aPag5O/wQfO8okSO/uvwFxIUujV4jRS",
        "recipe_title": "Potato Hash",
        "original_instructions": "Watch how to make this recipe.\nPierce both potatoes a few times, put in the microwave and cook on high until cooked through, 5 to 10 minutes. Carefully remove the skin from the sweet potato. Dice both potatoes and set aside.\nIn a medium skillet, melt 2 tablespoons of the butter over medium heat. Add the bell peppers, squash, zucchini and onions and cook for a few minutes. Add the diced potatoes to the veggies and cook until golden brown. Season with salt and pepper.\nIn a separate pan, melt the remaining tablespoon of butter over medium heat and crack in the eggs. Cook until the whites have set, 3 to 4 minutes.\nServe up the hash with a fried egg on top of each portion.",
        "ingredients": [
            "1 russet potato, scrubbed",
            "1 sweet potato, scrubbed",
            "3 tablespoons salted butter",
            "1 cup chopped red bell peppers",
            "1 cup chopped yellow squash",
            "1 cup chopped zucchini",
            "1/2 red onion, chopped",
            "Salt and freshly ground black pepper",
            "4 large eggs"
        ],
        "step_by_step_instructions": [
            "Pierce the russet potato and sweet potato a few times and place them in the microwave.",
            "Cook on high until cooked through, about 7.5 minutes on average.",
            "Carefully remove the skin from the sweet potato.",
            "Dice both potatoes and set aside.",
            "In a medium skillet, melt 0.5 tablespoon of butter over medium heat.",
            "Add 0.25 cup of chopped red bell peppers, 0.25 cup of chopped yellow squash, 0.25 cup of chopped zucchini, and 0.125 cup of chopped red onion.",
            "Cook the vegetables for a few minutes.",
            "Add the diced potatoes to the skillet and cook until golden brown.",
            "Season the mixture with salt and pepper to taste.",
            "In a separate pan, melt 0.25 tablespoon of butter over medium heat.",
            "Crack 1 egg into the pan and cook until the white has set, about 3 to 4 minutes.",
            "Serve the hash with the fried egg on top."
        ],
        "processed_ingredients": [
            "0.25 lb russet potato",
            "0.25 lb sweet potato",
            "0.75 tablespoon salted butter",
            "0.25 cup red bell pepper",
            "0.25 cup yellow squash",
            "0.25 cup zucchini",
            "0.125 cup red onion",
            "1 egg"
        ],
        "pure_ingredients": [
            "potato",
            "butter",
            "red bell pepper",
            "yellow squash",
            "zucchini",
            "onion",
            "salt",
            "black pepper",
            "egg"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "microwave",
            "medium skillet",
            "pan",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "kizLUarAE7F.l5OvEz3RVS8x8NGkRWK",
        "recipe_title": "Sausage Stuffing",
        "original_instructions": "Watch how to make this recipe.\nIn a large frying pan, melt the butter over medium-high heat. Saute the onions and celery for 5 minutes. Next, add the sausage and cook until browned, about 10 more minutes, stirring frequently. Meanwhile, break up the bread slices by hand into medium-small pieces into a large bowl. Add the seasonings and mix well. Then add the cooked vegetables and sausage and mix again. Finally, add the turkey stock and mix well. There will be enough stuffing for a 10- to 15-pound bird and an 8- by 8-inch pan.",
        "ingredients": [
            "1 stick butter",
            "3 cups diced onions",
            "3 cups diced celery",
            "3 cups sliced breakfast sausage",
            "25 slices white and wheat bread",
            "1 1/2 teaspoons poultry seasoning (recommended: Bell's)",
            "1 1/2 teaspoons black pepper",
            "1 teaspoon salt",
            "3 1/2 cups turkey stock"
        ],
        "step_by_step_instructions": [
            "Melt 0.5 tablespoon butter in a large frying pan over medium-high heat.",
            "Saute 0.19 cup diced onions and 0.19 cup diced celery for 5 minutes.",
            "Add 0.19 cup sliced breakfast sausage and cook until browned, about 10 more minutes, stirring frequently.",
            "Meanwhile, break up 1 slice of bread by hand into medium-small pieces into a large bowl.",
            "Add 0.09 teaspoon poultry seasoning, 0.09 teaspoon black pepper, and 0.06 teaspoon salt to the bread and mix well.",
            "Add the cooked vegetables and sausage to the bread mixture and mix again.",
            "Finally, add 0.22 cup turkey stock and mix well."
        ],
        "processed_ingredients": [
            "0.5 tablespoon butter",
            "0.19 cup diced onions",
            "0.19 cup diced celery",
            "0.19 cup sliced breakfast sausage",
            "1 slice bread",
            "0.09 teaspoon poultry seasoning",
            "0.09 teaspoon black pepper",
            "0.06 teaspoon salt",
            "0.22 cup turkey stock"
        ],
        "pure_ingredients": [
            "butter",
            "onions",
            "celery",
            "sausage",
            "bread",
            "poultry seasoning",
            "black pepper",
            "salt",
            "turkey stock"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "frying pan",
            "large bowl"
        ]
    },
    {
        "recipe_id": "ZTYcshVypLKzC770UHWvaE3hgTgm/1W",
        "recipe_title": "Touchdown Turkey Salad",
        "original_instructions": "Bring rice in chicken broth to a boil, reduce heat, cover pan tightly and simmer 15 minutes without peeking. Remove pan from heat and let stand, still covered, 5 minutes. Cool to room temperature or chill. When ready to transport or serve the salad, combine in a medium bowl the cooked rice with turkey strips, apple, celery and walnuts (toast nuts in a small, ungreased skillet over medium heat until nuts are fragrant). Using a fork, toss with salad dressing and scoop salad into lettuce cups.;",
        "ingredients": [
            "3/4 cup uncooked rice",
            "1-1/2 cups salted chicken broth",
            "2 cups cooked turkey breast strips",
            "1-1/2 cups diced unpeeled apple",
            "1 cup sliced celery",
            "1/4 cup chopped walnuts, toasted",
            "1/3 cup bottled poppy seed salad dressing",
            "Lettuce leaves"
        ],
        "step_by_step_instructions": [
            "Bring 0.19 cup uncooked rice in 0.38 cup chicken broth to a boil, reduce heat, cover pan tightly and simmer for 15 minutes without peeking.",
            "Remove pan from heat and let stand, still covered, for 5 minutes.",
            "Cool rice to room temperature or chill.",
            "Combine in a medium bowl: the cooked rice, 0.5 cup turkey strips, 0.38 cup diced apple, 0.25 cup sliced celery, and 1 tablespoon toasted chopped walnuts.",
            "Toast walnuts in a small, ungreased skillet over medium heat until nuts are fragrant.",
            "Using a fork, toss salad with 0.08 cup poppy seed salad dressing.",
            "Scoop salad into lettuce cups for serving."
        ],
        "processed_ingredients": [
            "0.19 cup uncooked rice",
            "0.38 cup chicken broth",
            "0.5 cup turkey breast strips",
            "0.38 cup apple",
            "0.25 cup celery",
            "1 tablespoon walnuts",
            "0.08 cup poppy seed salad dressing",
            "1 lettuce leaf"
        ],
        "pure_ingredients": [
            "rice",
            "chicken broth",
            "turkey",
            "apple",
            "celery",
            "walnuts",
            "poppy seed salad dressing",
            "lettuce"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "pan",
            "medium bowl",
            "skillet",
            "fork"
        ]
    },
    {
        "recipe_id": "iWn4B5O2.8qlrxk47TVSkscs6ylpAry",
        "recipe_title": "Broiled Filet Mignon",
        "original_instructions": "Brush top with oil and butter and broil 4 minutes a side for rare; turn over, brush other side with butter or oil and broil 4 minutes a side (cook 5 to 7 minutes a side for medium rare; never cook until well done).",
        "ingredients": [
            "2 tenderloin or fillet steaks, each 1 1/4-inch thick, (8 ounce weight), at room temperature",
            "1 tablespoon melted butter mixed with 1 teaspoon vegetable oil"
        ],
        "step_by_step_instructions": [
            "Brush one side of the steak with approximately 0.25 tablespoon of the butter and oil mixture.",
            "Broil the steak for 4 minutes for rare.",
            "Turn the steak over.",
            "Brush the other side with approximately 0.25 tablespoon of the butter and oil mixture.",
            "Broil the steak for another 4 minutes for rare."
        ],
        "processed_ingredients": [
            "4.00 ounce tenderloin steak",
            "0.25 tablespoon melted butter",
            "0.08 teaspoon vegetable oil"
        ],
        "pure_ingredients": [
            "tenderloin steak",
            "butter",
            "vegetable oil"
        ],
        "cooking_time": "8 minutes",
        "required_tools": [
            "broiler",
            "brush",
            "tongs"
        ]
    },
    {
        "recipe_id": "VOJQtA.Kjv5mfCZ06v19J/jwoPQG4ey",
        "recipe_title": "Greens 'n' Beans",
        "original_instructions": "Warm 1 teaspoon of olive oil in a large skillet over medium heat until shimmering.\nMeanwhile, wash the kale but don't dry the leaves too much. Rip the leaves into smaller pieces if you wish, but I like leaving them whole. Add the kale to the skillet - watch out, it will splutter. Toss with tongs and immediately cover and lower the heat.\nMeanwhile, make the cilantro pesto. In a small food processor, whizz up the garlic, almonds, cilantro, salt, pepper, remaining 1/2 cup olive oil, and water until smooth.\nRemove the lid and check the kale; the leaves should be tender. Add the beans and cilantro pesto and toss. Taste and adjust seasonings, and then cook another 5 minutes until warmed through. Serve and feel good about all the greens you're eating!",
        "ingredients": [
            "1/2 cup plus 1 teaspoon extra-virgin olive oil",
            "1 large bunch kale, leaves stripped off stems",
            "1 clove garlic, smashed",
            "1/4 cup whole, skinned almonds",
            "2 cups loosely packed fresh cilantro leaves and soft stems",
            "1/4 teaspoon kosher salt",
            "Freshly ground black pepper",
            "2 tablespoons water",
            "1 (15-ounce) can great Northern beans, drained and rinsed"
        ],
        "step_by_step_instructions": [
            "Warm 0.17 teaspoon of olive oil in a large skillet over medium heat until shimmering.",
            "Meanwhile, wash approximately 0.10 pound of kale but don't dry the leaves too much. Rip the leaves into smaller pieces if you wish. Add the kale to the skillet - watch out, it will splutter. Toss with tongs and immediately cover and lower the heat.",
            "Meanwhile, make the cilantro pesto. In a small food processor, whizz up 0.17 clove of garlic, 0.67 tablespoon almonds, 0.33 cup fresh cilantro leaves and soft stems, 0.04 teaspoon salt, a pinch of pepper, 1.33 tablespoon olive oil, and 0.33 tablespoon water until smooth.",
            "Remove the lid and check the kale; the leaves should be tender.",
            "Add 0.33 cup of beans and cilantro pesto to the skillet and toss.",
            "Taste and adjust seasonings, and then cook another 5 minutes until warmed through.",
            "Serve."
        ],
        "processed_ingredients": [
            "0.17 teaspoon olive oil",
            "0.10 pound kale",
            "0.17 clove garlic",
            "0.67 tablespoon almonds",
            "0.33 cup cilantro",
            "0.04 teaspoon salt",
            "0.33 tablespoon water",
            "1.33 tablespoon olive oil",
            "0.33 cup beans",
            "0.01 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "kale",
            "garlic",
            "almonds",
            "cilantro",
            "salt",
            "pepper",
            "water",
            "beans"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "large skillet",
            "tongs",
            "food processor"
        ]
    },
    {
        "recipe_id": "kkuZjXL36IQGq5ItVWOQf7pRqins0g.",
        "recipe_title": "Portuguese Steamed Clams",
        "original_instructions": "In a kettle cook the ham, the shallot, the garlic and the red pepper flakes in the oil over moderately low heat, stirring, for 3 minutes, add the wine, the bell pepper and the clams, and steam the mixture, covered, for 5 minutes, or until the clams begin to open. Transfer the clams as they open with tongs to 2 heated bowls, cover them, and continue to steam the unopened clams, shaking the kettle and transferring the clams as they open, for up to 10 minutes more (discard any unopened clams). Remove the kettle from the heat, stir the lemon juice and the coriander into the broth, and pour the broth over the clams.;",
        "ingredients": [
            "2 ounces boiled ham, chopped fine",
            "1/4 cup finely chopped shallot",
            "2 garlic cloves, minced",
            "1/2 teaspoon dried hot red pepper flakes",
            "3 tablespoons olive oil",
            "1/2 cup dry white wine",
            "1/2 red bell pepper, chopped fine",
            "18 small hard-shelled clams, scrubbed well",
            "1 tablespoon plus 2 teaspoons fresh lemon juice, or to taste",
            "1/3 cup finely chopped fresh coriander leaves"
        ],
        "step_by_step_instructions": [
            "In a kettle, cook 0.33 ounces of ham, 1 teaspoon of shallot, 0.33 garlic cloves, and 0.08 teaspoon of dried hot red pepper flakes in 0.5 tablespoons of olive oil over moderately low heat, stirring, for 3 minutes.",
            "Add 0.08 cup of dry white wine, 0.08 cup of red bell pepper, and 3 clams, and steam the mixture, covered, for 5 minutes, or until the clams begin to open.",
            "Transfer the clams as they open with tongs to a heated bowl, cover them, and continue to steam the unopened clams, shaking the kettle and transferring the clams as they open, for up to 10 minutes more (discard any unopened clams).",
            "Remove the kettle from the heat, stir 1 teaspoon of lemon juice and 0.05 cup of coriander into the broth, and pour the broth over the clams."
        ],
        "processed_ingredients": [
            "0.33 ounce boiled ham",
            "1 teaspoon shallot",
            "0.33 garlic cloves",
            "0.08 teaspoon dried hot red pepper flakes",
            "0.5 tablespoon olive oil",
            "0.08 cup dry white wine",
            "0.08 cup red bell pepper",
            "3 clams",
            "1 teaspoon fresh lemon juice",
            "0.05 cup fresh coriander leaves"
        ],
        "pure_ingredients": [
            "ham",
            "shallot",
            "garlic",
            "red pepper flakes",
            "olive oil",
            "white wine",
            "red bell pepper",
            "clams",
            "lemon juice",
            "coriander"
        ],
        "cooking_time": "18 minutes",
        "required_tools": [
            "kettle",
            "tongs",
            "bowl"
        ]
    },
    {
        "recipe_id": "kLS7YPuVqKQo73wB87nCTywIcwGQ89a",
        "recipe_title": "Fried Sage Leaves ",
        "original_instructions": "In a heavy saucepan heat 1 inch oil to 365°F. on a deep-fat thermometer. Working quickly, fry sage leaves, 5 at a time, 2 seconds, transferring with a slotted spoon to paper towels to drain. Immediately sprinkle sage leaves with coarse salt.\nIn a heavy saucepan heat 1 inch oil to 365°F. on a deep-fat thermometer. Working quickly, fry sage leaves, 5 at a time, 2 seconds, transferring with a slotted spoon to paper towels to drain. Immediately sprinkle sage leaves with coarse salt.",
        "ingredients": [
            "about 3 cups vegetable oil",
            "1/2 cup loosely packed fresh sage leaves",
            "coarse salt to taste"
        ],
        "step_by_step_instructions": [
            "Heat 0.5 cup of vegetable oil in a heavy saucepan to 365°F using a deep-fat thermometer.",
            "Fry about 4-5 fresh sage leaves for 2 seconds, working quickly.",
            "Transfer the fried sage leaves with a slotted spoon to paper towels to drain.",
            "Immediately sprinkle the fried sage leaves with coarse salt to taste."
        ],
        "processed_ingredients": [
            "0.50 cup vegetable oil",
            "0.13 cup fresh sage leaves",
            "1 tsp coarse salt"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "sage leaves",
            "salt"
        ],
        "cooking_time": "2 minutes",
        "required_tools": [
            "heavy saucepan",
            "deep-fat thermometer",
            "slotted spoon",
            "paper towels"
        ]
    },
    {
        "recipe_id": "2kG3z4FrxYQcMXXvAbQyjf8B/S/ldwO",
        "recipe_title": "Lambcarre Provencale",
        "original_instructions": "Preheat oven to 400 degrees F. Combine herbs and mustard. Spread on scored skin of lamb, pressing down well into cuts. Dust lightly with flour. Insert garlic slivers into meat in between ribs. Season well with salt and pepper and set aside.\nDrain potatoes well and cut into 1/2-inch slices. Lightly coat large ovenproof frying pan with clarified butter and heat well. Add potatoes and cook until golden brown, about 9 minutes. Place lamb on top of potatoes and place entire pan into oven. Roast for 30 minutes. Dust lamb with bread crumbs and roast another 30 minutes.\nRemove meat from oven, drain off fat and place meat on heated serving platter. Turn oven to broil and broil potatoes for 2 minutes until crusty and golden brown. Arrange potatoes around meat to serve.",
        "ingredients": [
            "1/2 teaspoon rosemary",
            "1/2 teaspoon basil",
            "1/2 teaspoon thyme",
            "4 teaspoons dry mustard",
            "2 (2-pound) racks lamb, trimmed, outer skin scored diagonally, meat cut out from between ribs",
            "Flour, to dust",
            "1 clove garlic, slivered",
            "Freshly ground salt, to taste",
            "Freshly ground pepper, to taste",
            "1 pound large potatoes, peeled and placed in cold water to cover",
            "Clarified butter",
            "1/8 cup white bread crumbs"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 400 degrees F.",
            "Combine 0.06 teaspoon rosemary, 0.06 teaspoon basil, 0.06 teaspoon thyme, and 0.5 teaspoon dry mustard.",
            "Spread the mixture on scored skin of 0.25 (2-pound) rack of lamb, pressing down well into cuts.",
            "Dust lightly with flour.",
            "Insert a portion of garlic slivers into meat in between ribs.",
            "Season well with salt and pepper and set aside.",
            "Drain about 0.25 pound of potatoes well and cut into 0.5-inch slices.",
            "Lightly coat large ovenproof frying pan with clarified butter and heat well.",
            "Add potatoes and cook until golden brown, about 9 minutes.",
            "Place the lamb on top of potatoes and place the entire pan into the oven.",
            "Roast for 30 minutes.",
            "Dust the lamb with a portion of bread crumbs and roast another 30 minutes.",
            "Remove meat from oven, drain off fat and place meat on heated serving platter.",
            "Turn oven to broil and broil potatoes for 2 minutes until crusty and golden brown.",
            "Arrange potatoes around meat to serve."
        ],
        "processed_ingredients": [
            "0.06 teaspoon rosemary",
            "0.06 teaspoon basil",
            "0.06 teaspoon thyme",
            "0.5 teaspoon dry mustard",
            "0.25 lb rack of lamb",
            "0.5 tablespoon flour",
            "0.25 clove garlic",
            "0.25 pound potatoes",
            "0.5 teaspoon clarified butter",
            "0.02 cup white bread crumbs",
            "0.06 teaspoon salt",
            "0.06 teaspoon pepper"
        ],
        "pure_ingredients": [
            "rosemary",
            "basil",
            "thyme",
            "mustard",
            "lamb",
            "flour",
            "garlic",
            "salt",
            "pepper",
            "potato",
            "butter",
            "bread crumbs"
        ],
        "cooking_time": "71 minutes",
        "required_tools": [
            "oven",
            "frying pan",
            "serving platter"
        ]
    },
    {
        "recipe_id": "VpgVPDDf1it3IQJZbEItYEvN5AP5cSO",
        "recipe_title": "Veal Stew with Potatoes, Tomatoes and Oregano ",
        "original_instructions": "Preheat oven to 350°F. Heat oil in heavy large pot over medium-high heat. Sprinkle veal generously with salt and pepper. Add veal and onions to pot. Sauté until veal is no longer pink, about 8 minutes. Mix in potatoes and oregano, then tomatoes. Bring stew to simmer. Cover pot; transfer to oven. Bake until veal and vegetables are tender, about 2 hours. Season stew to taste with salt and pepper. Ladle stew into shallow soup bowls and serve.\nPreheat oven to 350°F. Heat oil in heavy large pot over medium-high heat. Sprinkle veal generously with salt and pepper. Add veal and onions to pot. Sauté until veal is no longer pink, about 8 minutes. Mix in potatoes and oregano, then tomatoes. Bring stew to simmer. Cover pot; transfer to oven. Bake until veal and vegetables are tender, about 2 hours. Season stew to taste with salt and pepper. Ladle stew into shallow soup bowls and serve.",
        "ingredients": [
            "1/4 cup olive oil",
            "2 pounds veal stew meat, cut into 1- to 1 1/2-inch pieces",
            "16 boiling onions, peeled",
            "1 1/4 pounds large red-skinned potatoes, peeled, cut into 1 1/2-inch pieces",
            "2 tablespoons chopped fresh oregano or 1 tablespoon dried",
            "1 1/2 12-ounce baskets cherry tomatoes, stemmed, halved"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350°F.",
            "Heat 0.50 tbsp olive oil in a heavy large pot over medium-high heat.",
            "Sprinkle approximately 4 oz veal stew meat generously with salt and pepper.",
            "Add the veal and 2 onions to the pot.",
            "Sauté until the veal is no longer pink, about 8 minutes.",
            "Mix in 5 oz potatoes and 0.25 tbsp chopped fresh oregano, then add 3.50 oz cherry tomatoes.",
            "Bring the stew to a simmer.",
            "Cover the pot and transfer it to the oven.",
            "Bake until veal and vegetables are tender, about 2 hours.",
            "Season the stew to taste with salt and pepper.",
            "Ladle stew into a shallow soup bowl and serve."
        ],
        "processed_ingredients": [
            "0.50 tbsp olive oil",
            "4 oz veal stew meat",
            "2 onions",
            "5 oz potatoes",
            "0.25 tbsp chopped fresh oregano",
            "3.50 oz cherry tomatoes",
            "0.13 tsp salt",
            "0.13 tsp pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "veal",
            "onions",
            "potatoes",
            "oregano",
            "tomatoes",
            "salt",
            "pepper"
        ],
        "cooking_time": "2 hours 8 minutes",
        "required_tools": [
            "oven",
            "pot",
            "stove"
        ]
    },
    {
        "recipe_id": "8dVrosv07QNjCVOOjfTwzSbytzuHJxC",
        "recipe_title": "Sauteed Broccolini and Garlic",
        "original_instructions": "In a large pot, bring 8 cups of water and the salt to a boil. Remove and discard the bottom third of the broccolini stems. If some stems are very thick, cut them in half lengthwise.\nWhen the water comes to a full boil, add the broccolini, return to a boil, and cook over high heat for 2 minutes, until the stalks are crisp tender. Drain and immediately immerse the broccolini in a large bowl filled with ice water to stop the cooking. Drain in a colander and set aside.\nHeat the oil in a saute pan. Add the garlic and cook over low heat, stirring occasionally, for 1 to 2 minutes. Add the broccolini and stir until heated through.",
        "ingredients": [
            "2 tablespoons kosher salt",
            "4 bunches broccolini (1 1/2 pounds)",
            "3 tablespoons good olive oil",
            "6 garlic cloves, minced"
        ],
        "step_by_step_instructions": [
            "In a large pot, bring 2 cups of water and 0.5 tablespoon of salt to a boil.",
            "Remove and discard the bottom third of the broccolini stems. If some stems are very thick, cut them in half lengthwise.",
            "When the water comes to a full boil, add a small bunch of broccolini (about 6 ounces), return to a boil, and cook over high heat for 2 minutes, until the stalks are crisp tender.",
            "Drain and immediately immerse the broccolini in a large bowl filled with ice water to stop the cooking.",
            "Drain in a colander and set aside.",
            "Heat 0.75 tablespoons of olive oil in a saute pan.",
            "Add 1.5 minced garlic cloves and cook over low heat, stirring occasionally, for 1 to 2 minutes.",
            "Add the broccolini and stir until heated through."
        ],
        "processed_ingredients": [
            "0.5 tablespoon salt",
            "6 ounce broccolini",
            "0.75 tablespoon olive oil",
            "1.5 clove garlic"
        ],
        "pure_ingredients": [
            "salt",
            "broccolini",
            "olive oil",
            "garlic"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "large pot",
            "bowl",
            "colander",
            "saute pan"
        ]
    },
    {
        "recipe_id": ".L2RjRQh2h3zRXtWn0WGUk3c0RbX/j2",
        "recipe_title": "Tortilla Chips",
        "original_instructions": "Preheat oven to 375 degrees F.\nCut the tortillas into 1-inch wide strips; discard the leftover rounded end pieces. Alternatively, cut the tortillas into 8 wedges as in a pizza. Place the prepared tortillas on a baking sheet, and spray lightly with olive oil. Season with salt, and bake until crisp, 5 to 7 minutes.",
        "ingredients": [
            "12 (6 to 8-inch) flour or corn tortillas",
            "Olive oil, for spraying",
            "Coarse salt"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 375 degrees F.",
            "Cut 1 tortilla into 1-inch wide strips, discarding the leftover rounded end pieces.",
            "Alternatively, cut the tortilla into 8 wedges as in a pizza.",
            "Place the prepared tortilla pieces on a baking sheet.",
            "Spray the tortilla pieces lightly with olive oil.",
            "Season the tortilla pieces with salt.",
            "Bake the tortilla pieces until crisp, about 5 to 7 minutes."
        ],
        "processed_ingredients": [
            "1 ounce tortilla",
            "0.5 tablespoon olive oil",
            "0.25 teaspoon salt"
        ],
        "pure_ingredients": [
            "tortilla",
            "olive oil",
            "salt"
        ],
        "cooking_time": "7 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "knife",
            "spray bottle"
        ]
    },
    {
        "recipe_id": "qSfCgYjoJvXTcxP/S.KEoGV2RNF3RCq",
        "recipe_title": "Chili Lime Spice Mix for Chips",
        "original_instructions": "Preheat oven to 350 degrees F.\nCombine spice ingredients in a spice grinder and grind until you have a fine powder.\nTake 2 large cookie sheets and spread chips out evenly. Place in the oven for about 5 to 7 minutes, until they are just warmed through and release some of their oil (this will help the spice mixture stick). Sprinkle spice mix over the warm chips - or toss chips and spice mixture together in a very large mixing bowl. Grate fresh lime zest over the top and serve.",
        "ingredients": [
            "1/2 dried ancho chile, seeded and hand-torn into pieces",
            "1 teaspoon whole coriander seeds",
            "1/2 teaspoon chili powder",
            "1/2 teaspoon ground cumin",
            "1 teaspoon sweet paprika",
            "1/2 teaspoon dried oregano",
            "Pinch ground cinnamon",
            "1 teaspoon sugar",
            "1 tablespoons kosher salt",
            "1/8 teaspoon freshly ground black pepper",
            "2 bags of your favorite potato chips (recommended: Terra brand mixed root chips, kettle cooked potato chips)",
            "2 limes, grated on a microplane"
        ],
        "step_by_step_instructions": [
            "Preheat your oven to 350 degrees F.",
            "Combine 0.03 dried ancho chile, 0.05 teaspoon whole coriander seeds, 0.03 teaspoon chili powder, 0.03 teaspoon ground cumin, 0.05 teaspoon sweet paprika, 0.03 teaspoon dried oregano, a small pinch of ground cinnamon, 0.05 teaspoon sugar, 0.3 teaspoons kosher salt, and 0.01 teaspoon freshly ground black pepper in a spice grinder and grind until you have a fine powder.",
            "Spread approximately one-third of a bag of your favorite potato chips on a large cookie sheet.",
            "Place the cookie sheet in the oven for about 5 to 7 minutes, until the chips are just warmed through and release some of their oil.",
            "Sprinkle the spice mix over the warm chips evenly.",
            "Grate some fresh lime zest over the chips using a microplane.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "0.03 dried ancho chile",
            "0.05 teaspoon whole coriander seeds",
            "0.03 teaspoon chili powder",
            "0.03 teaspoon ground cumin",
            "0.05 teaspoon sweet paprika",
            "0.03 teaspoon dried oregano",
            "0.01 teaspoon ground cinnamon",
            "0.05 teaspoon sugar",
            "0.3 teaspoons kosher salt",
            "0.01 teaspoon freshly ground black pepper",
            "0.33 bags potato chips",
            "0.33 limes"
        ],
        "pure_ingredients": [
            "ancho chile",
            "coriander seeds",
            "chili powder",
            "cumin",
            "paprika",
            "oregano",
            "cinnamon",
            "sugar",
            "salt",
            "black pepper",
            "potato chips",
            "limes"
        ],
        "cooking_time": "12 minutes",
        "required_tools": [
            "oven",
            "spice grinder",
            "cookie sheet",
            "microplane",
            "mixing bowl"
        ]
    },
    {
        "recipe_id": "jG6slAt./ZQVwDAiYsPXEcwzECP7cfC",
        "recipe_title": "Salt and Pepper Seasoning Mix ",
        "original_instructions": "Put all of the ingredients in a bowl and mix together well.\nPut all of the ingredients in a bowl and mix together well.",
        "ingredients": [
            "1 tablespoon salt",
            "1 teaspoon sugar",
            "1 teaspoon fine white pepper",
            "1 teaspoon ground ginger",
            "1/2 teaspoon five-spice powder"
        ],
        "step_by_step_instructions": [
            "Put all of the ingredients in a bowl.",
            "Mix together well."
        ],
        "processed_ingredients": [
            "0.25 tablespoon salt",
            "0.08 teaspoon sugar",
            "0.08 teaspoon fine white pepper",
            "0.08 teaspoon ground ginger",
            "0.04 teaspoon five-spice powder"
        ],
        "pure_ingredients": [
            "salt",
            "sugar",
            "white pepper",
            "ginger",
            "five-spice powder"
        ],
        "cooking_time": "1 minute",
        "required_tools": [
            "bowl",
            "spoon"
        ]
    },
    {
        "recipe_id": "tUENsUhe0p7EstvYgX48Jvf.bI4xahy",
        "recipe_title": "Sweet Potato Steak Fries",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 450 degrees F and line a rimmed sheet pan with foil. Cut the ends off the potatoes, then cut the potatoes in half lengthwise. Cut into thick wedges, keeping all of the fries evenly sized. Spread the fries on the lined sheet pan and drizzle with a few tablespoons of olive oil, a big pinch of kosher salt and lots of freshly ground pepper. Sprinkle to taste with paprika and garlic powder and toss everything to evenly coat. Roast until brown and crispy on the bottoms, 10 to 15 minutes.\nFlip all the fries, and return them to the oven to roast until they are brown and crispy, another 10 to 15 minutes. Allow to cool slightly before serving",
        "ingredients": [
            "3 pounds sweet potatoes, scrubbed clean",
            "Olive oil, for drizzling",
            "Kosher salt and freshly ground black pepper, for sprinkling",
            "Paprika, for sprinkling",
            "Garlic powder, for sprinkling"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450 degrees F and line a rimmed sheet pan with foil.",
            "Cut the ends off one sweet potato, then cut it in half lengthwise.",
            "Cut into thick wedges, keeping all of the fries evenly sized.",
            "Spread the fries on the lined sheet pan and drizzle with 1 tablespoon of olive oil.",
            "Add a pinch of kosher salt and a pinch of freshly ground black pepper.",
            "Sprinkle to taste with paprika and garlic powder and toss everything to evenly coat.",
            "Roast until brown and crispy on the bottoms, about 10 to 15 minutes.",
            "Flip all the fries, and return them to the oven to roast until they are brown and crispy, another 10 to 15 minutes.",
            "Allow to cool slightly before serving."
        ],
        "processed_ingredients": [
            "450.00 g sweet potatoes",
            "1.00 tbsp olive oil",
            "0.50 tsp kosher salt",
            "0.50 tsp black pepper",
            "0.50 tsp paprika",
            "0.50 tsp garlic powder"
        ],
        "pure_ingredients": [
            "sweet potatoes",
            "olive oil",
            "salt",
            "pepper",
            "paprika",
            "garlic"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "oven",
            "rimmed sheet pan",
            "foil",
            "knife"
        ]
    },
    {
        "recipe_id": "XNWTNHkqMLHu/4JdiiILrVHN0i.F4Qi",
        "recipe_title": "Chicken Alla Padulese",
        "original_instructions": "Preheat the oven to 350 degrees F. Coat chicken in flour, shaking off any excess. Saute in olive oil until golden brown. Set aside to drain.\nSaute garlic in same olive oil. Add the remaining ingredients for the sauce, except the Parmesan. Add salt and pepper, to taste. Bring to a boil and remove from heat.\nPlace the chicken breasts in a baking dish and cover with the sauce. Bake for about 10 minutes, or until cooked through. Serve with favorite pasta and garnish with Parmesan.",
        "ingredients": [
            "4 boneless chicken breasts",
            "1 cup flour",
            "2 tablespoons olive oil",
            "1 clove garlic, chopped",
            "1 cup tomato sauce",
            "1/2 cup heavy cream",
            "1 tablespoon chopped fresh oregano leaves",
            "20 fresh basil leaves",
            "Salt and pepper",
            "Parmesan, for garnish"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Coat 1 chicken breast in approximately 0.25 cup flour, shaking off any excess.",
            "Saute the coated chicken breast in 0.5 tablespoon olive oil until golden brown. Set aside to drain.",
            "Saute 0.25 clove garlic, chopped, in the same olive oil.",
            "Add 0.25 cup tomato sauce, 0.125 cup heavy cream, 0.25 tablespoon chopped fresh oregano leaves, and 5 fresh basil leaves to the garlic. Add salt and pepper to taste.",
            "Bring the sauce to a boil and then remove it from heat.",
            "Place the chicken breast in a baking dish and cover with the sauce.",
            "Bake the chicken for about 10 minutes, or until cooked through.",
            "Serve with favorite pasta and garnish with Parmesan."
        ],
        "processed_ingredients": [
            "1 chicken breast",
            "0.25 cup flour",
            "0.5 tablespoon olive oil",
            "0.25 clove garlic",
            "0.25 cup tomato sauce",
            "0.125 cup heavy cream",
            "0.25 tablespoon oregano leaves",
            "5 basil leaves",
            "2 tablespoon Parmesan"
        ],
        "pure_ingredients": [
            "chicken",
            "flour",
            "olive oil",
            "garlic",
            "tomato",
            "cream",
            "oregano",
            "basil",
            "salt",
            "pepper",
            "Parmesan"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "oven",
            "frying pan",
            "baking dish"
        ]
    }
]