[
    {
        "recipe_id": "yGYp8y3SMiu49Uvm3bMVHHa86K.0yIW",
        "recipe_title": "White Bean Salad",
        "original_instructions": "Place beans, celery, red pepper, vinegar, and oil in a medium bowl. Toss until well combined. Adjust seasonings with salt and pepper. Add basil and serve immediately.\nMorph: For a super quick white bean dip: puree the salad in a food processor or blender, add 1 or 2 dashes of hot sauce and serve on crackers or grilled bread.",
        "ingredients": [
            "1 (19-ounce) can cannellini beans, rinsed and drained (use any canned bean you like)",
            "1 large rib celery, thinly sliced",
            "1/2 roasted red pepper, peeled, seeded, and chopped",
            "2 tablespoons red wine vinegar",
            "1 tablespoon extra-virgin olive oil",
            "Coarse grained salt",
            "Freshly ground black pepper",
            "1/2 cup basil leaves, hand torn"
        ],
        "step_by_step_instructions": [
            "Rinse and drain the cannellini beans.",
            "Thinly slice the celery.",
            "Peel, seed, and chop the roasted red pepper.",
            "Place the beans, celery, and red pepper in a medium bowl.",
            "Add the red wine vinegar and extra-virgin olive oil to the bowl.",
            "Toss all the ingredients until well combined.",
            "Season with salt and pepper to taste.",
            "Hand tear the basil leaves and add them to the mixture.",
            "Serve immediately."
        ],
        "pure_ingredients": [
            "beans",
            "celery",
            "pepper",
            "vinegar",
            "oil",
            "salt",
            "pepper",
            "basil"
        ],
        "cooking_time": {
            "preparation": "10 minutes",
            "cooking": "0 minutes",
            "plating": "2 minutes"
        },
        "required_tools": [
            "medium bowl",
            "knife",
            "cutting board",
            "spoon",
            "food processor"
        ],
        "total_health_score": 4
    },
    {
        "recipe_id": "udw8I73c8cD0Hk0tIQr2cnuYPo8n9eO",
        "recipe_title": "Red Coleslaw With Grapes",
        "original_instructions": "Make the dressing: Whisk the vinegar, mustard, sugar, 1 teaspoon salt and 1/2 teaspoon pepper in a large bowl. Gradually whisk in the olive oil until well blended.\nAdd the cabbage, parsley, scallions and grapes to the bowl and toss to coat with the dressing. Cover and refrigerate 1 to 4 hours before serving.\nPhotograph by Yunhee Kim",
        "ingredients": [
            "2 tablespoons apple cider vinegar",
            "1 tablespoon dijon mustard",
            "2 teaspoons sugar",
            "Kosher salt and freshly ground pepper",
            "1/4 cup extra-virgin olive oil",
            "1 small or 1/2 large head red cabbage, finely shredded",
            "1/3 cup chopped fresh parsley",
            "6 scallions, chopped",
            "2 cups seedless red grapes, chopped"
        ],
        "step_by_step_instructions": [
            "Whisk the vinegar, mustard, sugar, 1 teaspoon salt and 1/2 teaspoon pepper in a large bowl.",
            "Gradually whisk in the olive oil until well blended.",
            "Add the cabbage, parsley, scallions and grapes to the bowl.",
            "Toss to coat with the dressing.",
            "Cover and refrigerate 1 to 4 hours before serving."
        ],
        "pure_ingredients": [
            "vinegar",
            "mustard",
            "sugar",
            "salt",
            "pepper",
            "olive oil",
            "cabbage",
            "parsley",
            "scallions",
            "grapes"
        ],
        "cooking_time": {
            "preparation": "20 minutes",
            "cooking": "0 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "bowl",
            "whisk",
            "refrigerator"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "Ngjg7yEAF5daXZDoo9mwbRvZZVJ2l8m",
        "recipe_title": "Raspberry Lemonade",
        "original_instructions": "Reserve 4 raspberries and cut off 4 slices of lemon for the garnish. Mash the raspberries and sugar in a small bowl and let sit at room temperature to thaw and bring out their juices, about 15 minutes. Set a sieve over a pitcher and juice the lemons. Rinse the sieve and add the raspberries. Push the raspberry mixture through the sieve with a rubber spatula, leaving the seeds in the sieve. Pour 1 quart of cold water through the sieve to get remove the remaining juices. Stir the lemonade and check for sweetness. Serve in ice-filled glasses and garnish with raspberry and a lemon slice. For the adults, add 1 1/2 ounces vodka to each glass.",
        "ingredients": [
            "1/2 cup frozen raspberries",
            "4 lemons",
            "3/4 cup sugar",
            "6 ounces raspberry or citrus vodka, divided, optional"
        ],
        "step_by_step_instructions": [
            "Reserve 4 raspberries and cut off 4 slices of lemon for the garnish.",
            "Mash the raspberries and sugar in a small bowl and let sit at room temperature to thaw and bring out their juices, about 15 minutes.",
            "Set a sieve over a pitcher and juice the lemons.",
            "Rinse the sieve and add the raspberries.",
            "Push the raspberry mixture through the sieve with a rubber spatula, leaving the seeds in the sieve.",
            "Pour 1 quart of cold water through the sieve to get remove the remaining juices.",
            "Stir the lemonade and check for sweetness.",
            "Serve in ice-filled glasses and garnish with raspberry and a lemon slice.",
            "For the adults, add 1 1/2 ounces vodka to each glass."
        ],
        "pure_ingredients": [
            "raspberries",
            "lemons",
            "sugar",
            "water",
            "vodka"
        ],
        "cooking_time": {
            "preparation": "20 minutes",
            "cooking": "0 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "small bowl",
            "sieve",
            "pitcher",
            "rubber spatula",
            "knife"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "5oVIDq2FKGFqmm13PE8AuY5PtOabiCK",
        "recipe_title": "Shrimp Pad Thai",
        "original_instructions": "Heat 1 tablespoon of the oil in a wok or a large frying pan. Add the garlic and ginger, and saute until golden brown. Add the shrimp and cook for 1 to 2 minutes until pink, tossing from time to time. Remove and set aside in a bowl.\nHeat 1/2 tablespoon of oil in the same pan and add the eggs. Stir to scramble the egg into small pieces, remove and set aside with the shrimp.\nHeat the remaining oil in the pan and add the soy sauce, fish sauce, rice wine, red pepper flakes, and brown sugar. Stir briefly, add the drained noodles, and cook for 5 minutes.\nAdd the bean sprouts, chopped scallions, and cilantro. Mix well and continue to cook until noodles are heated through. Season, if necessary, with a little more soy sauce or fish sauce, sprinkle in lime zest and juice, and serve while hot!",
        "ingredients": [
            "1 1/2 tablespoons vegetable oil, divided",
            "1 tablespoon garlic, minced",
            "1 tablespoon ginger, minced",
            "16 large shrimp, peeled and deveined",
            "1 egg, lightly beaten",
            "2 tablespoons soy sauce",
            "1 tablespoon fish sauce",
            "1 tablespoon rice wine vinegar",
            "1/2 teaspoon red crushed pepper flakes",
            "1 teaspoon brown sugar",
            "7 ounces rice noodles, soaked in warm water for 10 to 15 minutes then drained",
            "1/2 cup bean sprouts",
            "3 scallions, sliced",
            "1 cup freshly chopped cilantro leaves",
            "1 lime, zested and juiced"
        ],
        "step_by_step_instructions": [
            "Heat 1 tablespoon of vegetable oil in a wok or a large frying pan.",
            "Add the garlic and ginger, and sauté until golden brown.",
            "Add the shrimp and cook for 1 to 2 minutes until pink, tossing from time to time.",
            "Remove the shrimp and set aside in a bowl.",
            "Heat 1/2 tablespoon of vegetable oil in the same pan and add the eggs.",
            "Stir to scramble the egg into small pieces, remove and set aside with the shrimp.",
            "Heat the remaining vegetable oil in the pan and add the soy sauce, fish sauce, rice wine vinegar, red pepper flakes, and brown sugar.",
            "Stir briefly, add the drained noodles, and cook for 5 minutes.",
            "Add the bean sprouts, chopped scallions, and cilantro.",
            "Mix well and continue to cook until noodles are heated through.",
            "Season, if necessary, with a little more soy sauce or fish sauce, sprinkle in lime zest and juice, and serve while hot."
        ],
        "pure_ingredients": [
            "vegetable oil",
            "garlic",
            "ginger",
            "shrimp",
            "egg",
            "soy sauce",
            "fish sauce",
            "vinegar",
            "red pepper flakes",
            "sugar",
            "rice noodles",
            "bean sprouts",
            "scallions",
            "cilantro",
            "lime"
        ],
        "cooking_time": {
            "preparation": "10 minutes",
            "cooking": "20 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "wok",
            "frying pan",
            "bowl",
            "spatula",
            "knife",
            "cutting board"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "g3S3WKCYs3HPvbKcGqn4K6EEaYlOf/W",
        "recipe_title": "Asian Pear Slaw",
        "original_instructions": "Peel strings from celery with a Y-shaped vegetable peeler and cut celery into 1/4-inch-thick matchsticks.\nWhisk together juice, vinegar, and ginger and stir in celery and remaining ingredients with salt and pepper, to taste. Let stand at room temperature 15 minutes before serving.",
        "ingredients": [
            "2 celery ribs",
            "3 tablespoons fresh lime juice",
            "2 tablespoons seasoned rice vinegar",
            "1 teaspoon finely grated peeled fresh ginger",
            "2 firm Asian pears, cut into 1/4-inch-thick matchsticks",
            "2 scallions, thinly sliced diagonally",
            "1/4 cup fresh cilantro leaves",
            "1/2 teaspoon finely chopped fresh hot red chile, or to taste"
        ],
        "step_by_step_instructions": [
            "Peel strings from celery with a Y-shaped vegetable peeler.",
            "Cut celery into 1/4-inch-thick matchsticks.",
            "Whisk together juice, vinegar, and ginger.",
            "Stir in celery, pears, scallions, cilantro, and chile.",
            "Season with salt and pepper to taste.",
            "Let stand at room temperature for 15 minutes before serving."
        ],
        "pure_ingredients": [
            "celery",
            "lime",
            "rice vinegar",
            "ginger",
            "pears",
            "scallions",
            "cilantro",
            "chile",
            "salt",
            "pepper"
        ],
        "cooking_time": {
            "preparation": "10 minutes",
            "cooking": "0 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "Y-shaped vegetable peeler",
            "knife",
            "whisk",
            "bowl"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "swoMd/KUZTOr/iwd1nRWZeRHtGi071a",
        "recipe_title": "Creamy Polenta ",
        "original_instructions": "Bring water to a boil with salt in a 4-quart heavy pot, then add polenta in a thin stream, whisking. Cook over moderate heat, whisking, 2 minutes. Reduce heat to low and simmer polenta, covered, stirring for 1 minute after every 10 minutes of cooking, 45 minutes total. Remove from heat and serve warm.\nBring water to a boil with salt in a 4-quart heavy pot, then add polenta in a thin stream, whisking. Cook over moderate heat, whisking, 2 minutes. Reduce heat to low and simmer polenta, covered, stirring for 1 minute after every 10 minutes of cooking, 45 minutes total. Remove from heat and serve warm.",
        "ingredients": [
            "8 cups water",
            "2 teaspoons salt",
            "2 cups polenta (not quick-cooking) or yellow cornmeal (10 ounces)"
        ],
        "step_by_step_instructions": [
            "Bring 8 cups of water to a boil in a 4-quart heavy pot and add 2 teaspoons of salt.",
            "Add 2 cups of polenta in a thin stream while whisking continuously.",
            "Cook over moderate heat, whisking for 2 minutes.",
            "Reduce heat to low and cover the pot.",
            "Simmer the polenta for a total of 45 minutes, stirring for 1 minute after every 10 minutes.",
            "Remove from heat and serve warm."
        ],
        "pure_ingredients": [
            "water",
            "salt",
            "polenta"
        ],
        "cooking_time": {
            "preparation": "2 minutes",
            "cooking": "45 minutes",
            "plating": "1 minute"
        },
        "required_tools": [
            "4-quart heavy pot",
            "whisk",
            "measuring cups",
            "measuring spoons"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "jGeeLeXea12ByuwgWOZEAT8x8Grvr46",
        "recipe_title": "Quail Eggs with Toasted-Sesame Salt",
        "original_instructions": "Preheat oven to 350 degrees.\nIn a baking pan, spread seeds evenly and toast, stirring once halfway through toasting, until seeds are deep golden, about 12 minutes. Cool seeds, and in a food processor, pulse with salt until coarsely ground. Sesame salt may be made 2 weeks ahead and kept, covered, at room temperature.\nIn a saucepan, cover eggs with cold water by 1 inch and bring just to a boil. Remove pan from heat and let eggs stand, covered, 7 minutes for quail eggs or 17 minutes for chicken eggs. Drain water from pan and run cold water over eggs, cracking shells against side of pan. Peel eggs, and quarter chicken eggs if using. Serve eggs with sesame salt.",
        "ingredients": [
            "3/4 cup sesame seeds",
            "1 teaspoon coarse salt",
            "16 quail eggs, or 4 chicken eggs"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees.",
            "In a baking pan, spread the sesame seeds evenly.",
            "Toast the seeds in the oven, stirring once halfway through, until the seeds are deep golden, about 12 minutes.",
            "Cool the seeds.",
            "In a food processor, pulse the seeds with salt until coarsely ground.",
            "In a saucepan, cover eggs with cold water by 1 inch and bring just to a boil.",
            "Remove the pan from heat and let the eggs stand, covered, for 17 minutes for chicken eggs.",
            "Drain the water from the pan and run cold water over the eggs.",
            "Crack the eggshells against the side of the pan.",
            "Peel the eggs.",
            "Quarter the chicken eggs if using.",
            "Serve the eggs with sesame salt."
        ],
        "pure_ingredients": [
            "sesame seeds",
            "salt",
            "eggs"
        ],
        "cooking_time": {
            "preparation": "5 minutes",
            "cooking": "29 minutes",
            "plating": "3 minutes"
        },
        "required_tools": [
            "oven",
            "baking pan",
            "food processor",
            "saucepan",
            "knife"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "0MorCRCIkDPevEXSjvCuMD6QIfU2vVe",
        "recipe_title": "A Bowl of Gluten-Free Oatmeal",
        "original_instructions": "Set a saucepan over high heat. Pour in the milk and water. Add the salt and vanilla extract. Bring the liquids to a boil.\nWhen the milky water is boiling, pour in the oats. Stir quite vigorously. When the water returns to a boil, turn down the heat to low. Simmer the oats, stirring every few minutes, until the oats are creamy and plump, the liquid fully absorbed, about 15 minutes.\nTurn off the heat and cover the pan. Let the oatmeal sit for five minutes to fully absorb the liquid.\nTop with your favorite sweetener and fruit. (This one is maple syrup, peaches, and blackberries.)\nVariations: If you cannot eat dairy, almond milk or hemp milk work well here too.\nIf you have a fresh vanilla bean, scrape the insides of it into the pot instead of vanilla extract. This will be the best oatmeal you have ever eaten.",
        "ingredients": [
            "1 cup whole milk",
            "1 cup water",
            "1/2 teaspoon kosher salt",
            "1 teaspoon vanilla extract",
            "1 cup whole rolled gluten-free oats"
        ],
        "step_by_step_instructions": [
            "Set a saucepan over high heat.",
            "Pour in the milk and water.",
            "Add the salt and vanilla extract.",
            "Bring the liquids to a boil.",
            "When the milky water is boiling, pour in the oats.",
            "Stir quite vigorously.",
            "When the water returns to a boil, turn down the heat to low.",
            "Simmer the oats, stirring every few minutes, until the oats are creamy and plump, the liquid fully absorbed, about 15 minutes.",
            "Turn off the heat and cover the pan.",
            "Let the oatmeal sit for five minutes to fully absorb the liquid.",
            "Top with your favorite sweetener and fruit."
        ],
        "pure_ingredients": [
            "milk",
            "water",
            "salt",
            "vanilla",
            "oats"
        ],
        "cooking_time": {
            "preparation": "2 minutes",
            "cooking": "20 minutes",
            "plating": "3 minutes"
        },
        "required_tools": [
            "saucepan",
            "stirring spoon",
            "measuring cups",
            "lid"
        ],
        "total_health_score": 4
    },
    {
        "recipe_id": "2drTWa2AH69DHskFfm7rBbf.Am1THg6",
        "recipe_title": "Tres Leches",
        "original_instructions": "Preheat oven to 350 degrees. Whip eggs, sugar and salt until tripled in volume. Fold in flour. Pour mixture into parchment lined 9 by 11-inch baking pan and bake for 25 to 30 minutes. Set aside to cool.\nRemove parchment paper and return cake to pan. With a fork, poke holes all over the top of the cake. Combine remaining ingredients and pour over cake. Allow liquid to soak in for 2 hours. Serve with fresh fruit and whipped cream.",
        "ingredients": [
            "6 eggs",
            "1 cup sugar",
            "1/8 teaspoon salt",
            "1 cup flour",
            "1 can sweetened condensed milk",
            "1 can evaporated milk",
            "2 cups whole milk, scalded",
            "1 teaspoon almond extract",
            "2 teaspoons vanilla extract"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350 degrees.",
            "Whip eggs, sugar, and salt until tripled in volume.",
            "Fold in flour.",
            "Pour mixture into parchment-lined 9 by 11-inch baking pan.",
            "Bake for 25 to 30 minutes.",
            "Set aside to cool.",
            "Remove parchment paper and return cake to pan.",
            "With a fork, poke holes all over the top of the cake.",
            "Combine the remaining ingredients.",
            "Pour the liquid over the cake.",
            "Allow the liquid to soak in for 2 hours.",
            "Serve with fresh fruit and whipped cream."
        ],
        "pure_ingredients": [
            "eggs",
            "sugar",
            "salt",
            "flour",
            "milk",
            "almond",
            "vanilla"
        ],
        "cooking_time": {
            "preparation": "15 minutes",
            "cooking": "25 to 30 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "oven",
            "mixer",
            "baking pan",
            "fork",
            "parchment paper",
            "mixing bowl"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "6bgIr8uUoogBnFgcJgTwexH4lfWd51W",
        "recipe_title": "Spicy Greens with Garlic",
        "original_instructions": "Cook the garlic in olive oil in a large skillet over medium-high heat, stirring occasionally, until golden brown and crispy, about 3 minutes; take care that the garlic doesn't get too brown or it will be bitter. Using a slotted spoon, transfer the garlic chips to a paper towel. Add the onions and red pepper (add a little more if you like things spicy) to the skillet and cook, stirring, until light brown, about 10 minutes. When the onions are almost done, add the greens in batches and cook, uncovered, just until tender, about 2 minutes. Cover and cook, stirring occasionally, until tender, about 5 minutes. Transfer to a serving dish. Top with the reserved garlic chips and garnish with cheese.",
        "ingredients": [
            "8 cloves peeled garlic, thinly sliced",
            "1/4 cup extra-virgin olive oil",
            "2 medium yellow onions, halved and sliced (3 to 4 cups)",
            "1/8 teaspoon crushed red pepper",
            "Kosher salt",
            "18 cups torn greens, such as mustard, kale, chard, escarole, or a mix (about 3 large bunches)",
            "Grated pecorino Romano or Parmesan"
        ],
        "step_by_step_instructions": [
            "Cook the garlic in olive oil in a large skillet over medium-high heat, stirring occasionally, until golden brown and crispy, about 3 minutes.",
            "Using a slotted spoon, transfer the garlic chips to a paper towel.",
            "Add the onions and red pepper to the skillet and cook, stirring, until light brown, about 10 minutes.",
            "When the onions are almost done, add the greens in batches and cook, uncovered, just until tender, about 2 minutes.",
            "Cover and cook, stirring occasionally, until tender, about 5 minutes.",
            "Transfer to a serving dish.",
            "Top with the reserved garlic chips and garnish with cheese."
        ],
        "pure_ingredients": [
            "garlic",
            "olive oil",
            "onions",
            "red pepper",
            "salt",
            "greens",
            "cheese"
        ],
        "cooking_time": {
            "preparation": "10 minutes",
            "cooking": "20 minutes",
            "plating": "3 minutes"
        },
        "required_tools": [
            "skillet",
            "slotted spoon",
            "paper towel"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "V3/Zwl0rqsryvoD6cO.kmPG/vhCaBVq",
        "recipe_title": "Sugar Snap Pea and Cabbage Slaw ",
        "original_instructions": "Toss together cabbage and peas in a large bowl. Whisk together remaining ingredients and pour over slaw, stirring to combine well. Add salt to taste, then chill, covered, at least 2 hours.\nToss together cabbage and peas in a large bowl. Whisk together remaining ingredients and pour over slaw, stirring to combine well. Add salt to taste, then chill, covered, at least 2 hours.",
        "ingredients": [
            "2 1/2 pounds green cabbage (preferably Savoy), quartered, cored, and thinly sliced (14 cups)",
            "3/4 pound sugar snap peas, trimmed and thinly sliced diagonally (4 cups)",
            "3/4 cup well-shaken buttermilk",
            "1/2 cup sour cream",
            "1/4 cup chopped fresh dill",
            "2 garlic cloves, minced",
            "1 3/4 teaspoons salt",
            "1/2 teaspoon black pepper",
            "1 tablespoon white distilled vinegar"
        ],
        "step_by_step_instructions": [
            "Toss together cabbage and peas in a large bowl.",
            "Whisk together buttermilk, sour cream, dill, garlic, salt, and black pepper.",
            "Pour the dressing over the cabbage and peas, stirring to combine well.",
            "Add salt to taste.",
            "Cover the slaw and chill for at least 2 hours."
        ],
        "pure_ingredients": [
            "cabbage",
            "peas",
            "buttermilk",
            "sour cream",
            "dill",
            "garlic",
            "salt",
            "black pepper",
            "vinegar"
        ],
        "cooking_time": {
            "preparation": "20 minutes",
            "cooking": "0 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "large bowl",
            "whisk",
            "knife",
            "cutting board",
            "measuring cups",
            "measuring spoons",
            "cover or plastic wrap",
            "refrigerator"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "dBZRzO3P0Cgm0jGcJB55Ru3YN1ftVH6",
        "recipe_title": "Peruvian Fish and Shrimp Ceviche",
        "original_instructions": "Boil salted water. Have ice water ready on the side. Poach shrimp for just 30 seconds and cool in ice water and drain. Combine with fish and toss with onion, ginger, garlic, hot pepper, celery, salt, and black pepper. Allow to cool in the refrigerator at least 30 minutes up to 2 hours.\nAdd juices and refrigerate 1 hour. Finish with cilantro and corn, check seasoning and serve in a martini glass.",
        "ingredients": [
            "1 pound medium shrimp (16/20 per pound), peeled and cleaned",
            "2 pounds meaty white fish, like sea bass, boned, and cut into large dice",
            "1 red onion, minced",
            "1 piece ginger, peeled, minced",
            "1 clove garlic, minced",
            "1/4 habanero or Scotch bonnet, minced (no seeds or ribs)",
            "1 celery rib, minced",
            "Salt and black pepper",
            "5 lemons, juiced",
            "5 limes, juiced",
            "1 bunch cilantro, chopped",
            "2 ears of corn, grill with husk on"
        ],
        "step_by_step_instructions": [
            "Boil salted water.",
            "Have ice water ready on the side.",
            "Poach shrimp for just 30 seconds.",
            "Cool shrimp in ice water and drain.",
            "Combine shrimp with fish.",
            "Toss with onion, ginger, garlic, hot pepper, celery, salt, and black pepper.",
            "Allow to cool in the refrigerator for at least 30 minutes up to 2 hours.",
            "Add lemon and lime juices and refrigerate for 1 hour.",
            "Finish with cilantro and grilled corn.",
            "Check seasoning and serve in a martini glass."
        ],
        "pure_ingredients": [
            "shrimp",
            "fish",
            "onion",
            "ginger",
            "garlic",
            "habanero",
            "celery",
            "salt",
            "black pepper",
            "lemon",
            "lime",
            "cilantro",
            "corn"
        ],
        "cooking_time": {
            "preparation": "25 minutes",
            "cooking": "1 hour",
            "plating": "5 minutes"
        },
        "required_tools": [
            "pot",
            "bowl",
            "refrigerator",
            "knife",
            "cutting board"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "VGqUohOSPqQz4gbbCpyb0bj9zZtKwFS",
        "recipe_title": "Seared Coriander and Fenugreek Crusted Tuna with Onion Chutney and Pita Crisps",
        "original_instructions": "Cut tuna into strips 1-inch high by 1-inch wide. Chill tuna in the fridge to air dry a bit.\nToast coriander seeds and fenugreek in a dry skillet. Grind with peppercorns in a coffee grinder or spice grinder. Place mix in a pie plate.\nMeanwhile make the garnishes. For the chutney: in a food processor combine onion, cilantro, ginger, chili peppers, lemon juice and season with salt and fresh pepper. Blend til well combined. Cut pita bread into triangles and fry in hot oil. Drain on paper towel.\nHeat a skillet til very hot. Roll tuna in the spice mix. Add a little oil to the pan. Sear the tuna on all 4 sides. Slice thin and serve with pita triangles and chutney. Sprinkle with more chopped cilantro.",
        "ingredients": [
            "Center cut, sushi quality tuna, (you'll need about 3 pounds to yield some choice pieces)",
            "3 tablespoons each coriander and fenugreek seeds",
            "2 tablespoons pepper corns",
            "1 onion, chopped",
            "1/2 cup cilantro, chopped",
            "2 tablespoons chopped ginger",
            "2 green chili peppers",
            "3 tablespoons lemon juice",
            "Salt and Pepper",
            "1 package pita bread",
            "Oil for frying"
        ],
        "step_by_step_instructions": [
            "Cut tuna into strips 1-inch high by 1-inch wide.",
            "Chill tuna in the fridge to air dry a bit.",
            "Toast coriander seeds and fenugreek in a dry skillet.",
            "Grind with peppercorns in a coffee grinder or spice grinder.",
            "Place spice mix in a pie plate.",
            "In a food processor, combine onion, cilantro, ginger, chili peppers, lemon juice and season with salt and fresh pepper.",
            "Blend until well combined to make the chutney.",
            "Cut pita bread into triangles.",
            "Fry pita triangles in hot oil and drain on paper towel.",
            "Heat a skillet until very hot.",
            "Roll tuna in the spice mix.",
            "Add a little oil to the skillet.",
            "Sear the tuna on all 4 sides.",
            "Slice tuna thinly.",
            "Serve tuna with pita triangles and chutney.",
            "Sprinkle with more chopped cilantro."
        ],
        "pure_ingredients": [
            "tuna",
            "coriander",
            "fenugreek",
            "peppercorns",
            "onion",
            "cilantro",
            "ginger",
            "chili",
            "lemon juice",
            "salt",
            "pepper",
            "pita bread",
            "oil"
        ],
        "cooking_time": {
            "preparation": "30 minutes",
            "cooking": "20 minutes",
            "plating": "10 minutes"
        },
        "required_tools": [
            "knife",
            "skillet",
            "coffee grinder",
            "spice grinder",
            "pie plate",
            "food processor",
            "fryer or frying pan",
            "paper towel"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "MyVs644WGiLkQNKL28htiDca9jzvZr6",
        "recipe_title": "Crabcakes",
        "original_instructions": "In a bowl, combine 1-ounce bread crumbs, hot pepper sauce, Worcestershire, mayonnaise, parsley, peppers, egg white, scallion, lemon juice, old bay, dry mustard, onion powder, and Dijon mustard. Once combined, gently fold in crabmeat. Once fully incorporated, form into 2 to 3 inch cakes. Dredge in remaining bread crumbs. Pan fry in hot oil until golden brown on both sides.;",
        "ingredients": [
            "4 ounces bread crumbs, unseasoned",
            "3 dashes hot pepper sauce",
            "3 dashes Worcestershire sauce",
            "2 ounces mayonnaise",
            "4 sprigs parsley, roughly chopped",
            "1/4 green pepper, fine dice",
            "1/4 red pepper, fine dice",
            "1 egg white",
            "1 scallion, thinly sliced",
            "4 tablespoons freshly squeezed lemon juice",
            "1/4 teaspoon crab boil seasoning",
            "1/4 teaspoon dry mustard",
            "1/4 teaspoon onion powder",
            "2 ounces Dijon mustard",
            "1 pound jumbo lump Maryland crabmeat",
            "Oil, for pan frying"
        ],
        "step_by_step_instructions": [
            "In a bowl, combine 1-ounce bread crumbs, hot pepper sauce, Worcestershire sauce, mayonnaise, parsley, green pepper, red pepper, egg white, scallion, lemon juice, crab boil seasoning, dry mustard, onion powder, and Dijon mustard.",
            "Gently fold in crabmeat.",
            "Once fully incorporated, form mixture into 2 to 3 inch cakes.",
            "Dredge each cake in the remaining bread crumbs.",
            "Pan fry the cakes in hot oil until they are golden brown on both sides."
        ],
        "pure_ingredients": [
            "bread crumbs",
            "hot pepper sauce",
            "Worcestershire sauce",
            "mayonnaise",
            "parsley",
            "green pepper",
            "red pepper",
            "egg white",
            "scallion",
            "lemon",
            "crab boil seasoning",
            "dry mustard",
            "onion powder",
            "mustard",
            "crabmeat",
            "oil"
        ],
        "cooking_time": {
            "preparation": "20 minutes",
            "cooking": "10 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "bowl",
            "pan",
            "spatula",
            "knife",
            "cutting board"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "DRbWCRa7L7.Aw5evinPeJjqu2DHun16",
        "recipe_title": "Popovers",
        "original_instructions": "Heat oven to 450 degrees F. Lightly grease and flour a popover tin. In a large bowl, whisk together flour and salt. In a separate, medium bowl, whisk together the eggs, milk, and 1 tablespoon warm butter. Pour over flour mixture, and fold until just blended. Fill the popover cups 2/3 to 3/4 full. Transfer cups to oven, and bake for 15 minutes. Reduce the temperature to 350 degrees F, and bake 20 minutes more, until well browned and crusty. Remove popovers from the oven, and unmold onto a rack. Puncture the sides with a sharp knife to let steam escape, and serve immediately.;",
        "ingredients": [
            "1 tablespoon unsalted butter, melted, plus more for greasing tin",
            "1 cup all-purpose flour",
            "1/2 teaspoon salt",
            "2 large eggs",
            "1 1/4 cups milk"
        ],
        "step_by_step_instructions": [
            "Heat oven to 450 degrees F.",
            "Lightly grease and flour a popover tin.",
            "In a large bowl, whisk together flour and salt.",
            "In a separate, medium bowl, whisk together the eggs, milk, and 1 tablespoon warm butter.",
            "Pour over flour mixture, and fold until just blended.",
            "Fill the popover cups 2/3 to 3/4 full.",
            "Transfer cups to oven, and bake for 15 minutes.",
            "Reduce the temperature to 350 degrees F, and bake 20 minutes more, until well browned and crusty.",
            "Remove popovers from the oven, and unmold onto a rack.",
            "Puncture the sides with a sharp knife to let steam escape, and serve immediately."
        ],
        "pure_ingredients": [
            "butter",
            "flour",
            "salt",
            "eggs",
            "milk"
        ],
        "cooking_time": {
            "preparation": "10 minutes",
            "cooking": "35 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "oven",
            "popover tin",
            "large bowl",
            "medium bowl",
            "whisk",
            "sharp knife",
            "rack"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "ojC9xfgZJRPJLaPr2vstydyCLcFb8ye",
        "recipe_title": "Cafe au Lait",
        "original_instructions": "Into 6 large mugs pour equal amounts of coffee and milk and garnish each serving with cinnamon sticks.;",
        "ingredients": [
            "4 cups hot coffee",
            "4 cups scalded milk",
            "6 cinnamon sticks"
        ],
        "step_by_step_instructions": [
            "Pour equal amounts of coffee and milk into 6 large mugs.",
            "Garnish each serving with a cinnamon stick."
        ],
        "pure_ingredients": [
            "coffee",
            "milk",
            "cinnamon"
        ],
        "cooking_time": {
            "preparation": "3 minutes",
            "cooking": "0 minutes",
            "plating": "2 minutes"
        },
        "required_tools": [
            "mugs",
            "measuring cup",
            "cinnamon sticks"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "PpDntrQucYDjjU.SC6p/Hu7FvubqdpG",
        "recipe_title": "Asiago Roasted Broccoli",
        "original_instructions": "Set a rimmed baking sheet on an oven rack and preheat to 425 degrees F.\nAdd the broccoli, oil, garlic, shallots, 3/4 teaspoon salt and red pepper flakes to a large bowl and toss to coat. Transfer to the preheated baking sheet and spread out in a single layer. Roast until the broccoli florets are browned on the ends, the stalks are crisp-tender and the shallots are caramelized, about 20 minutes, tossing about halfway through. Immediately sprinkle with the Asiago and lemon zest. Season with some salt if needed. Transfer to a serving platter.",
        "ingredients": [
            "8 cups broccoli florets (2 to 3 large heads)",
            "5 tablespoons extra-virgin olive oil",
            "4 large cloves garlic, roughly chopped",
            "2 large shallots, roughly chopped",
            "Kosher salt",
            "1/8 to 1/4 teaspoon crushed red pepper flakes",
            "1/4 cup finely shredded aged Asiago cheese",
            "Zest of 1 lemon (about 2 teaspoons)"
        ],
        "step_by_step_instructions": [
            "Set a rimmed baking sheet on an oven rack and preheat to 425 degrees F.",
            "Add the broccoli, oil, garlic, shallots, 3/4 teaspoon salt and red pepper flakes to a large bowl and toss to coat.",
            "Transfer to the preheated baking sheet and spread out in a single layer.",
            "Roast until the broccoli florets are browned on the ends, the stalks are crisp-tender, and the shallots are caramelized, about 20 minutes, tossing about halfway through.",
            "Immediately sprinkle with the Asiago and lemon zest.",
            "Season with some salt if needed.",
            "Transfer to a serving platter."
        ],
        "pure_ingredients": [
            "broccoli",
            "olive oil",
            "garlic",
            "shallots",
            "salt",
            "red pepper flakes",
            "Asiago cheese",
            "lemon"
        ],
        "cooking_time": {
            "preparation": "10 minutes",
            "cooking": "20 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "rimmed baking sheet",
            "oven",
            "large bowl",
            "serving platter"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "TB9yG4OFm/mZmeiXFs211e3us7vQ.0e",
        "recipe_title": "Stracciatella Soup ",
        "original_instructions": "Stir together cornstarch and 1/4 cup water until smooth. Bring broth and remaining 3/4 cup water to a boil in a 2- to 3-quart heavy saucepan over high heat, then reduce heat to moderately high and add zest and salt. Stir cornstarch mixture and add to soup, whisking until smooth. Simmer, whisking, 2 minutes, then add egg in a slow stream, stirring with a spoon. Stir in spinach and return to a boil, then remove from heat. Season with salt.\nStir together cornstarch and 1/4 cup water until smooth.\nBring broth and remaining 3/4 cup water to a boil in a 2- to 3-quart heavy saucepan over high heat, then reduce heat to moderately high and add zest and salt.\nStir cornstarch mixture and add to soup, whisking until smooth. Simmer, whisking, 2 minutes, then add egg in a slow stream, stirring with a spoon. Stir in spinach and return to a boil, then remove from heat. Season with salt.",
        "ingredients": [
            "2 tablespoons cornstarch",
            "1 cup water",
            "3 cups low-sodium low-fat chicken broth (24 fl oz)",
            "2 teaspoons finely grated fresh lemon zest",
            "1/2 teaspoon salt",
            "1 large egg, lightly beaten",
            "1 cup firmly packed shredded spinach leaves"
        ],
        "step_by_step_instructions": [
            "Stir together cornstarch and 1/4 cup water until smooth.",
            "Bring broth and remaining 3/4 cup water to a boil in a 2- to 3-quart heavy saucepan over high heat.",
            "Reduce heat to moderately high and add zest and salt.",
            "Stir cornstarch mixture and add to soup, whisking until smooth.",
            "Simmer, whisking, 2 minutes.",
            "Add egg in a slow stream, stirring with a spoon.",
            "Stir in spinach and return to a boil.",
            "Remove from heat.",
            "Season with salt."
        ],
        "pure_ingredients": [
            "cornstarch",
            "water",
            "chicken broth",
            "lemon zest",
            "salt",
            "egg",
            "spinach"
        ],
        "cooking_time": {
            "preparation": "5 minutes",
            "cooking": "10 minutes",
            "plating": "2 minutes"
        },
        "required_tools": [
            "saucepan",
            "whisk",
            "spoon",
            "grater",
            "measuring cup"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "HXNUexZT7DRfBxc39bp3rsLTchSQq5m",
        "recipe_title": "Grilled Red Onions with Balsamic Vinegar",
        "original_instructions": "Heat a clean griddle and brush with 1/2 of the oil. Brush onion slices lightly with remaining oil on both sides, season with salt and pepper and place on griddle. Grill for 3 to 5 minutes on each side, or until softened and lightly charred. Transfer onions to a bowl, drizzle with vinegar and sprinkle with rosemary. Toss to separate rings and season with more salt and pepper as needed.",
        "ingredients": [
            "1 tablespoon olive oil",
            "2 pounds red onions, cut crosswise into 1/2inch thick slices",
            "Coarse salt",
            "Freshly ground black pepper",
            "2 tablespoons balsamic vinegar",
            "1 teaspoon chopped fresh rosemary"
        ],
        "step_by_step_instructions": [
            "Heat a clean griddle and brush with 1/2 of the olive oil.",
            "Brush onion slices lightly with the remaining olive oil on both sides.",
            "Season onion slices with salt and pepper.",
            "Place onion slices on the griddle.",
            "Grill for 3 to 5 minutes on each side, or until softened and lightly charred.",
            "Transfer onions to a bowl.",
            "Drizzle onions with balsamic vinegar.",
            "Sprinkle onions with chopped rosemary.",
            "Toss to separate onion rings.",
            "Season with more salt and pepper as needed."
        ],
        "pure_ingredients": [
            "oil",
            "onions",
            "salt",
            "pepper",
            "vinegar",
            "rosemary"
        ],
        "cooking_time": {
            "preparation": "5 minutes",
            "cooking": "10 minutes",
            "plating": "3 minutes"
        },
        "required_tools": [
            "griddle",
            "brush",
            "bowl"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "K5WZMZMugK/7qMOprijnP/clbWXNsbC",
        "recipe_title": "Yorkshire Pudding with Roast",
        "original_instructions": "*Cooks note: A 3-bone-in standing rib roast cooked in a 13 by 9-inch roasting pan will give you enough drippings for the pudding. Prepare the pudding while the roast is resting.\nPreheat oven to 400 degrees F.\nLeave 2 tablespoons of drippings in the roasting pan and place in the oven.\nPlace the flour, salt, eggs, milk and remaining 2 tablespoons of drippings into the bowl of a food processor or blender and process for 30 seconds. Pour the batter into the hot roasting pan and bake for 35 to 40 minutes or until puffed and golden brown. While the pudding is cooking, carve the roast. Serve the pudding with the roast.",
        "ingredients": [
            "9 ounces all-purpose flour, approximately 2 cups",
            "1 1/2 teaspoons kosher salt",
            "4 large eggs, room temperature",
            "2 cups whole milk, room temperature",
            "1/4 cup beef drippings, divided*"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 400 degrees F.",
            "Leave 2 tablespoons of drippings in the roasting pan and place in the oven.",
            "Place the flour, salt, eggs, milk, and remaining 2 tablespoons of drippings into the bowl of a food processor or blender.",
            "Process the mixture for 30 seconds.",
            "Pour the batter into the hot roasting pan.",
            "Bake for 35 to 40 minutes or until puffed and golden brown.",
            "While the pudding is cooking, carve the roast.",
            "Serve the pudding with the roast."
        ],
        "pure_ingredients": [
            "flour",
            "salt",
            "eggs",
            "milk",
            "beef drippings"
        ],
        "cooking_time": {
            "preparation": "10 minutes",
            "cooking": "35 to 40 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "oven",
            "roasting pan",
            "food processor",
            "blender"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "RGsWiBaieb4z0d5.95sYb0o1WtWLqOa",
        "recipe_title": "Turkey Burger",
        "original_instructions": "In a pan over high heat add 2 tablespoons vegetable oil. Heat until oil starts to lightly smoke. Add the mushrooms. Cook until lightly brown, stirring frequently. Add 4 tablespoons shallots and season with salt and pepper to taste. Let cool and reserve. In a mixing bowl, add the mushrooms, 2 cups of cooked turkey, tomatoes, chives, bread crumbs, 4 remaining tablespoons shallots, thyme and eggs. Mix well to incorporate. Divide mixture into 4 portions and shape into burgers. Lightly coat burgers with fresh bread crumbs. Heat 2 tablespoons vegetable oil, add burgers and cook until golden brown (approximately 2 minutes on each side.) Serve with a bun and French fries.;",
        "ingredients": [
            "6 tablespoons vegetable oil",
            "1 cup mushrooms, diced",
            "8 tablespoons shallots",
            "2 cups cooked turkey, diced",
            "4 tablespoons tomatoes, diced, seeded",
            "4 tablespoons chives",
            "1 cup fresh bread crumbs",
            "4 teaspoons fresh thyme",
            "3 whole eggs",
            "Salt and pepper"
        ],
        "step_by_step_instructions": [
            "Heat 2 tablespoons of vegetable oil in a pan over high heat until it starts to lightly smoke.",
            "Add the diced mushrooms to the pan.",
            "Cook the mushrooms until they are lightly browned, stirring frequently.",
            "Add 4 tablespoons of diced shallots to the mushrooms.",
            "Season with salt and pepper to taste.",
            "Let the mushroom mixture cool and reserve it.",
            "In a mixing bowl, combine the cooled mushrooms, cooked turkey, diced tomatoes, chives, bread crumbs, remaining 4 tablespoons of shallots, thyme, and eggs.",
            "Mix well to incorporate all ingredients.",
            "Divide the mixture into 4 portions and shape them into burgers.",
            "Lightly coat the burgers with additional fresh bread crumbs.",
            "Heat 2 tablespoons of vegetable oil in a pan.",
            "Add the burgers to the pan and cook until golden brown, approximately 2 minutes on each side.",
            "Serve the burgers with a bun and French fries."
        ],
        "pure_ingredients": [
            "vegetable oil",
            "mushrooms",
            "shallots",
            "turkey",
            "tomatoes",
            "chives",
            "bread crumbs",
            "thyme",
            "eggs",
            "salt",
            "pepper",
            "bun",
            "fries"
        ],
        "cooking_time": {
            "preparation": "15 minutes",
            "cooking": "10 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "pan",
            "mixing bowl",
            "spoon",
            "spatula"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "grVBhkcsFk0BkpIj2den1TbJSnHk966",
        "recipe_title": "Penne with Salad Stuff",
        "original_instructions": "Bring water to a boil for pasta. Salt water and boil pasta for 10 minutes or until \"al dente.\" Meanwhile in the bottom of a mixing bowl combine about 1/3 cup extra virgin olive oil, rind and juice of a lemon, mustard to taste and season with salt and crushed red pepper.\nMince some garlic, halve or quarter cherry tomatoes and add to bottom of mixing bowl. Cut arugula into chiffonade ( not necessary with watercress). When pasta is done, drain it and return to pasta pot and toss with chiffonade of arugula; add dressing and toss until well combined.",
        "ingredients": [
            "8 ounces penne or short fusilli pasta",
            "1 juicy lemon",
            "1/3 cup extra virgin olive oil",
            "Grated rind and puree of a lemon",
            "Dijon Mustard",
            "Garlic",
            "10 yellow or red cherry tomatoes, halved or quartered (depending upon how large they are)",
            "Nice bunch arugula or watercress; well washed, stemmed",
            "Salt and crushed red pepper"
        ],
        "step_by_step_instructions": [
            "Bring a pot of water to a boil for the pasta.",
            "Salt the boiling water and cook pasta for 10 minutes or until al dente.",
            "In the bottom of a mixing bowl, combine about 1/3 cup of olive oil, grated rind and juice from a lemon.",
            "Add mustard to taste and season with salt and crushed red pepper to the mixture in the bowl.",
            "Mince some garlic and add to the bowl.",
            "Halve or quarter the cherry tomatoes and add them to the bowl.",
            "Cut the arugula into chiffonade and set aside.",
            "When pasta is done, drain it and return it to the pot.",
            "Toss the pasta with the chiffonade of arugula.",
            "Add the dressing from the mixing bowl and toss until well combined."
        ],
        "pure_ingredients": [
            "pasta",
            "lemon",
            "olive oil",
            "mustard",
            "garlic",
            "tomato",
            "arugula",
            "salt",
            "pepper"
        ],
        "cooking_time": {
            "preparation": "10 minutes",
            "cooking": "10 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "pot",
            "mixing bowl",
            "knife",
            "cutting board",
            "colander",
            "tongs"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "V0To8Yd8.mzUavhJSOwnx1o1CrmkgM.",
        "recipe_title": "Tuna Ceviche Cone",
        "original_instructions": "Dice the tuna, against grain, into 1/4-inch cubes. In a bowl combine the lemon juice, lime juice and sugar. Stir in the vinegar and whisk until incorporated. Add the diced tuna, the ginger, red onion, green onion and herbs. Allow the tuna to marinate* for up to 1 hour.\nDrain the excess liquid from the tuna, scoop into cones and serve.\n*The marinating of the tuna with the fresh juices and sugar will be the cooking or curing process for the tuna",
        "ingredients": [
            "8 to 10 ounces fresh sushi grade tuna",
            "1 lemon, juiced",
            "1 lime, juiced",
            "1 tablespoon sugar",
            "2 teaspoons rice wine vinegar",
            "1 teaspoon minced ginger",
            "3 teaspoons red onion, minced",
            "1 green onion, minced",
            "2 sprigs each, cilantro and parsley, leaves chopped",
            "6 waffle cones, store-bought"
        ],
        "step_by_step_instructions": [
            "Dice the tuna, against grain, into 1/4-inch cubes.",
            "In a bowl, combine the lemon juice, lime juice, and sugar.",
            "Stir in the vinegar and whisk until incorporated.",
            "Add the diced tuna, ginger, red onion, green onion, and herbs.",
            "Allow the tuna to marinate for up to 1 hour.",
            "Drain the excess liquid from the tuna.",
            "Scoop into cones and serve."
        ],
        "pure_ingredients": [
            "tuna",
            "lemon",
            "lime",
            "sugar",
            "vinegar",
            "ginger",
            "onion",
            "herbs",
            "waffle cones"
        ],
        "cooking_time": {
            "preparation": "20 minutes",
            "cooking": "0 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "bowl",
            "whisk",
            "knife",
            "cutting board",
            "spoon",
            "scoop"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "Tka.D27fAdMoG.EnVenzdVo9JnOPhte",
        "recipe_title": "4-Ingredient Blueberry Pie",
        "original_instructions": "Special equipment: A small star cookie cutter\nAdjust 2 racks to the top and bottom thirds of the oven and preheat to 425 degrees F. Put a baking sheet or pizza stone on the bottom rack.\nCombine the sugar with 4 cups of the blueberries in a medium saucepan. Bring to a simmer over medium heat, crushing up the berries with a wooden spoon to release their juices, and cook, stirring occasionally, until thick and reduced by half, 15 to 20 minutes. Remove from the heat and stir in the flour and the remaining 2 cups blueberries. Transfer to a bowl and cool completely, about 45 minutes.\nMeanwhile, fit one of the pie crusts into a 9-inch pie plate and fold and crimp the edges as desired. Refrigerate while you wait for the filling to cool.\nLine a baking sheet with parchment. Cut out as many stars as you can from the second pie crust. Arrange on the baking sheet. Bake on the upper rack until golden, about 10 minutes. Set aside to cool.\nStir the cooled filling once and pour into the dough-lined pie plate; spread it out into an even layer. Place the pie on the preheated baking sheet, turn the oven down to 375 degrees F and bake until the crust in golden and the edge of the filling is bubbly, 55 to 60 minutes. Remove to a rack to cool. Press the stars into the filling, standing them up slightly. Let cool at least 2 hours before serving.",
        "ingredients": [
            "2 refrigerated rolled pie crusts (homemade or store-bought)",
            "3/4 cup sugar",
            "6 cups blueberries",
            "3 tablespoons all-purpose flour"
        ],
        "step_by_step_instructions": [
            "Adjust 2 racks to the top and bottom thirds of the oven and preheat to 425 degrees F.",
            "Put a baking sheet or pizza stone on the bottom rack.",
            "Combine the sugar with 4 cups of the blueberries in a medium saucepan.",
            "Bring to a simmer over medium heat, crushing up the berries with a wooden spoon to release their juices.",
            "Cook, stirring occasionally, until thick and reduced by half, 15 to 20 minutes.",
            "Remove from the heat and stir in the flour and the remaining 2 cups blueberries.",
            "Transfer to a bowl and cool completely, about 45 minutes.",
            "Meanwhile, fit one of the pie crusts into a 9-inch pie plate and fold and crimp the edges as desired.",
            "Refrigerate while you wait for the filling to cool.",
            "Line a baking sheet with parchment.",
            "Cut out as many stars as you can from the second pie crust.",
            "Arrange on the baking sheet.",
            "Bake on the upper rack until golden, about 10 minutes. Set aside to cool.",
            "Stir the cooled filling once and pour into the dough-lined pie plate; spread it out into an even layer.",
            "Place the pie on the preheated baking sheet.",
            "Turn the oven down to 375 degrees F and bake until the crust is golden and the edge of the filling is bubbly, 55 to 60 minutes.",
            "Remove to a rack to cool.",
            "Press the stars into the filling, standing them up slightly.",
            "Let cool at least 2 hours before serving."
        ],
        "pure_ingredients": [
            "pie crusts",
            "sugar",
            "blueberries",
            "flour"
        ],
        "cooking_time": {
            "preparation": "30 minutes",
            "cooking": "90 minutes",
            "plating": "2 hours"
        },
        "required_tools": [
            "oven",
            "baking sheet",
            "pizza stone",
            "medium saucepan",
            "wooden spoon",
            "bowl",
            "9-inch pie plate",
            "small star cookie cutter",
            "parchment"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "PTplxKMy5c1b6l94nOILpNU10XKRYUq",
        "recipe_title": "Nutmeg-Scented Sorrel Salad with Roasted Shallots and Monkfish",
        "original_instructions": "Preheat oven to 400 degrees F. Peel the shallots, keeping the root ends intact. Place them in a bowl, and mix well with 1/4 teaspoon of nutmeg and 2 teaspoons of olive oil. Make a bed of coarse salt in a roasting pan, and spread the shallots out in a single layer over the salt. Roast in the oven for about 20 minutes, basting with additional olive oil to prevent the outer layer of the shallots from toughening. The shallots are done when they're browned outside and just soft inside. Keep warm.\nRinse the sorrel and the greens. Dry well, and keep cool. Prepare the vinaigrette: Place the mustard in a bowl. Whisk in the vinegar. Add 1/2 cup of the olive oil slowly, in a thin stream. Add 1/2 teaspoon nutmeg, and season with salt and pepper to taste.\nLay out the monkfish fillets. Cut 1/4-inch notches all around the perimeter of each fillet. (This prevents the fillets from curling up in the pan.) Dredge the fillets well in flour, seasoned with salt and pepper. Place the remaining 1/4 cup of olive oil in a saute pan over medium-high heat. When the oil is very hot, saute the monkfish quickly, about 1 minute per side, until golden brown and just cooked. Remove from pan, and brush each fillet very lightly with a bit of the vinaigrette.\nAssemble the salad: Place the dried greens in a large bowl. Cut the warm shallots in half, lengthwise, and toss with the salad. Add the vinaigrette, and mix well. Divide the salad among four plates, and nestle two monkfish fillets into the salad on each plate. Grate about 1/8 teaspoon of nutmeg over each salad.\nSuggested wines: '93 Chablis; Sancerre Rouge; and/or an Alsatian Pinot Noir",
        "ingredients": [
            "20 medium-sized shallots",
            "1 1/4 teaspoons freshly grated nutmeg",
            "2 teaspoons plus 1/4 cup olive oil",
            "6 tablespoons coarse salt",
            "2 cups sorrel leaves, thick ribs removed",
            "6 cups assorted greens, such as mache, Italian chicory, Bibb lettuce",
            "1 tablespoon Dijon mustard",
            "8 teaspoons white wine vinegar",
            "Salt and freshly ground black pepper, to taste",
            "10 ounces monkfish, cut into 8 thin fillets",
            "Flour for dredging"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 400 degrees F.",
            "Peel the shallots, keeping the root ends intact.",
            "Place the peeled shallots in a bowl.",
            "Mix the shallots well with 1/4 teaspoon of nutmeg and 2 teaspoons of olive oil.",
            "Make a bed of coarse salt in a roasting pan.",
            "Spread the seasoned shallots out in a single layer over the salt in the roasting pan.",
            "Roast the shallots in the oven for about 20 minutes.",
            "Baste the shallots with additional olive oil during roasting to prevent the outer layer from toughening.",
            "The shallots are done when they're browned outside and soft inside. Keep them warm.",
            "Rinse the sorrel and assorted greens.",
            "Dry the sorrel and greens well, and keep them cool.",
            "Prepare the vinaigrette: Place the mustard in a bowl.",
            "Whisk in the vinegar into the mustard.",
            "Add 1/2 cup of olive oil slowly in a thin stream while whisking.",
            "Add 1/2 teaspoon of nutmeg to the vinaigrette and season with salt and pepper to taste.",
            "Lay out the monkfish fillets on a clean surface.",
            "Cut 1/4-inch notches all around the perimeter of each monkfish fillet.",
            "Dredge the monkfish fillets well in flour seasoned with salt and pepper.",
            "Heat the remaining 1/4 cup of olive oil in a sauté pan over medium-high heat.",
            "Once the oil is very hot, sauté the monkfish quickly, about 1 minute per side, until golden brown and just cooked.",
            "Remove the cooked monkfish fillets from the pan.",
            "Brush each fillet very lightly with a bit of the prepared vinaigrette.",
            "Assemble the salad: Place the dried greens in a large bowl.",
            "Cut the warm roasted shallots in half, lengthwise, and add them to the bowl with the greens.",
            "Add the vinaigrette to the salad and mix well.",
            "Divide the salad among four plates.",
            "Nestle two monkfish fillets onto the salad on each plate.",
            "Grate about 1/8 teaspoon of nutmeg over each salad."
        ],
        "pure_ingredients": [
            "shallots",
            "nutmeg",
            "olive oil",
            "salt",
            "sorrel",
            "greens",
            "mustard",
            "vinegar",
            "pepper",
            "monkfish",
            "flour"
        ],
        "cooking_time": {
            "preparation": "20 minutes",
            "cooking": "20 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "oven",
            "bowl",
            "roasting pan",
            "saute pan",
            "whisk"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "XRxBUvpIEssgvUmAP3apO4Snb1ewasq",
        "recipe_title": "Orecchiette with Broccoli Rabe and Sausage",
        "original_instructions": "1. Heat oil in a large skillet over medium heat. Add sausage, and cook, turning occasionally until browned, about 10 minutes. Remove sausage to a plate and reserve pan and sausage drippings.\n2. Meanwhile, bring a large pot of cold water to a boil over high heat. Add a large pinch of salt and broccoli rabe and cook, uncovered, until broccoli rabe is bright green and tender but still slightly crisp, about 5 minutes. Immediately transfer broccoli rabe using tongs to a colander (reserve boiling water) and rinse under cold running water. Chop into bite-sized pieces and set aside.\n3. Add pasta to reserved boiling water and cook, stirring occasionally, until al dente (tender but not mushy), about 12 minutes. Meanwhile, heat reserved pan and drippings over medium heat. Add garlic and cook, stirring frequently, until it is golden brown, about 5 minutes. Add broccoli rabe, pepper flakes, and 1 1/2 teaspoons of salt; increase heat to medium-high, and cook, continually stirring, until broccoli rabe is hot and tender, about 5 minutes. Slice sausage into 1/4-inch thick coins and add to pan and mix well cook until sausage is warmed through, about 5 more minutes.\n4. Drain pasta in a colander in sink, reserving 1/4 cup of cooking liquid. Toss pasta and liquid with broccoli rabe mixture. Transfer pasta to a serving dish or individual bowls, garnish with Parmesean and serve.",
        "ingredients": [
            "1/2 teaspoon crushed red pepper flakes, or to taste",
            "Shaved Parmesan, for garnish",
            "3 tablespoons extra-virgin olive oil",
            "1 pound sweet Italian sausage",
            "Kosher salt to taste, plus 1 1/2 teaspoons",
            "2 pounds broccoli rabe, stems trimmed",
            "1 pound orecchiette pasta",
            "4 cloves garlic, sliced"
        ],
        "step_by_step_instructions": [
            "Heat oil in a large skillet over medium heat.",
            "Add sausage and cook, turning occasionally until browned, about 10 minutes.",
            "Remove sausage to a plate and reserve pan and sausage drippings.",
            "Meanwhile, bring a large pot of cold water to a boil over high heat.",
            "Add a large pinch of salt and broccoli rabe and cook, uncovered, until bright green and tender but still slightly crisp, about 5 minutes.",
            "Immediately transfer broccoli rabe using tongs to a colander (reserve boiling water) and rinse under cold running water.",
            "Chop broccoli rabe into bite-sized pieces and set aside.",
            "Add pasta to reserved boiling water and cook, stirring occasionally, until al dente, about 12 minutes.",
            "Meanwhile, heat reserved pan and drippings over medium heat.",
            "Add garlic and cook, stirring frequently, until golden brown, about 5 minutes.",
            "Add broccoli rabe, pepper flakes, and 1 1/2 teaspoons of salt; increase heat to medium-high, and cook, stirring until hot and tender, about 5 minutes.",
            "Slice sausage into 1/4-inch thick coins and add to pan; mix well and cook until sausage is warmed through, about 5 more minutes.",
            "Drain pasta in a colander, reserving 1/4 cup of cooking liquid.",
            "Toss pasta and reserved liquid with broccoli rabe mixture.",
            "Transfer pasta to a serving dish or bowls, garnish with Parmesan and serve."
        ],
        "pure_ingredients": [
            "olive oil",
            "sausage",
            "salt",
            "broccoli rabe",
            "pasta",
            "garlic",
            "pepper flakes",
            "parmesan"
        ],
        "cooking_time": {
            "preparation": "15 minutes",
            "cooking": "45 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "large skillet",
            "large pot",
            "tongs",
            "colander",
            "knife",
            "serving dish"
        ],
        "total_health_score": 3
    },
    {
        "recipe_id": "J0F3JMH82MlVrnOPyaCrdkbN7WqZt.2",
        "recipe_title": "Hard Boiled Eggs",
        "original_instructions": "Bring a pot of water to a boil over high heat. Reduce the heat to low, then add your eggs and cook 4 to 5 minutes. Drain, cool in ice water and peel.\nBring a pot of water to a boil over high heat. Reduce the heat to low, then add your eggs and cook 7 to 8 minutes. Drain, cool in ice water and peel.\nPlace your eggs in a pot and cover with cold water by 1 inch. Bring to a boil over medium-high heat, then cover, remove from the heat and set aside 8 to 10 minutes. Drain, cool in ice water and peel.\nTransfer hard-boiled eggs to a bowl of ice water with a slotted spoon and let cool.\nDrain the ice water. One at a time, crack the bottom, wider end of each egg against the bowl, then hold the egg under cold running water and peel.\nSlice the eggs in half lengthwise. Scoop the yolks into a bowl and make your filling.\nFill the egg-white halves with the yolk mixture using a spoon, piping bag or resealable plastic bag with a corner snipped.\nPhotograph by Levi Brown",
        "ingredients": [
            "Eggs"
        ],
        "step_by_step_instructions": [
            "Bring a pot of water to a boil over high heat.",
            "Reduce the heat to low, then add your eggs and cook for 4 to 5 minutes.",
            "Drain the eggs and cool them in ice water.",
            "Peel the eggs.",
            "Bring a separate pot of water to a boil over high heat.",
            "Reduce the heat to low, then add your eggs and cook for 7 to 8 minutes.",
            "Drain the eggs and cool them in ice water.",
            "Peel the eggs.",
            "Place your eggs in a pot and cover with cold water by 1 inch.",
            "Bring to a boil over medium-high heat.",
            "Cover the pot, remove from the heat, and set aside for 8 to 10 minutes.",
            "Drain the eggs and cool them in ice water.",
            "Peel the eggs.",
            "Transfer hard-boiled eggs to a bowl of ice water with a slotted spoon and let cool.",
            "Drain the ice water.",
            "Crack the bottom, wider end of each egg against the bowl.",
            "Hold the egg under cold running water and peel.",
            "Slice the eggs in half lengthwise.",
            "Scoop the yolks into a bowl.",
            "Make your filling.",
            "Fill the egg-white halves with the yolk mixture using a spoon, piping bag or resealable plastic bag with a corner snipped."
        ],
        "pure_ingredients": [
            "eggs",
            "water"
        ],
        "cooking_time": {
            "preparation": "5 minutes",
            "cooking": "20 minutes",
            "plating": "5 minutes"
        },
        "required_tools": [
            "pot",
            "slotted spoon",
            "bowl",
            "knife",
            "spoon",
            "piping bag or resealable plastic bag"
        ],
        "total_health_score": 6
    },
    {
        "recipe_id": "r6FJrv1Jk211EvHNACr8K.uTxXorj5e",
        "recipe_title": "Brown Veal Stock ",
        "original_instructions": "Preheat oven to 450°F and lightly oil 2 large shallow roasting pans. Remove meat from bones where possible and cut into 1-inch pieces. If using breast bones, cut apart. In roasting pans arrange bones and meat in one layer and roast in upper and lower thirds of oven, switching pans halfway through roasting, until bones are golden brown, 30 to 45 minutes. Into a 14-quart stockpot put bones, meat, and 8 quarts water. (Alternatively, divide bones, meat, and 8 quarts water between two 7- to 8-quart kettles.) Discard fat from roasting pans. Immediately add 1/2 cup water to each pan, scraping up brown bits, and add to stockpot or kettles. Bring liquid to a tremble, about 190°F., and cook at 190°F. (skim froth frequently during first hour of cooking) 12 to 14 hours. While stock is cooking, separately cut carrots, onions, and white and pale green parts of leeks into 1-inch pieces. In a bowl of cold water wash leeks well and lift from water into a colander to drain. In an oiled large shallow roasting pan arrange carrots, onions, and leeks in one layer and roast in middle of oven until golden brown, 20 to 30 minutes. Cool vegetables and chill, covered. Add roasted vegetables and remaining ingredients to stock during last 2 hours of cooking. Pour stock in batches through a large fine sieve into an 8-quart kettle and discard solids. Skim off fat. (Alternatively, cool stock, uncovered, and chill, covered. Scrape congealed fat from chilled stock.) Gently simmer stock, skimming froth occasionally, until reduced to about 2 quarts, about 1 hour. Cool stock, uncovered, and chill, covered. Stock keeps, covered and chilled, 1 week or, frozen in airtight containers, 3 months. If desired, pour cooled stock into ice-cube trays with 1-ounce cups and freeze. Frozen cubes keep in heavy-duty sealable plastic bags 3 months.\nPreheat oven to 450°F and lightly oil 2 large shallow roasting pans.\nRemove meat from bones where possible and cut into 1-inch pieces. If using breast bones, cut apart. In roasting pans arrange bones and meat in one layer and roast in upper and lower thirds of oven, switching pans halfway through roasting, until bones are golden brown, 30 to 45 minutes.\nInto a 14-quart stockpot put bones, meat, and 8 quarts water. (Alternatively, divide bones, meat, and 8 quarts water between two 7- to 8-quart kettles.) Discard fat from roasting pans. Immediately add 1/2 cup water to each pan, scraping up brown bits, and add to stockpot or kettles. Bring liquid to a tremble, about 190°F., and cook at 190°F. (skim froth frequently during first hour of cooking) 12 to 14 hours.\nWhile stock is cooking, separately cut carrots, onions, and white and pale green parts of leeks into 1-inch pieces. In a bowl of cold water wash leeks well and lift from water into a colander to drain. In an oiled large shallow roasting pan arrange carrots, onions, and leeks in one layer and roast in middle of oven until golden brown, 20 to 30 minutes. Cool vegetables and chill, covered.\nAdd roasted vegetables and remaining ingredients to stock during last 2 hours of cooking.\nPour stock in batches through a large fine sieve into an 8-quart kettle and discard solids. Skim off fat. (Alternatively, cool stock, uncovered, and chill, covered. Scrape congealed fat from chilled stock.) Gently simmer stock, skimming froth occasionally, until reduced to about 2 quarts, about 1 hour. Cool stock, uncovered, and chill, covered. Stock keeps, covered and chilled, 1 week or, frozen in airtight containers, 3 months. If desired, pour cooled stock into ice-cube trays with 1-ounce cups and freeze. Frozen cubes keep in heavy-duty sealable plastic bags 3 months.",
        "ingredients": [
            "10 pounds meaty veal bones",
            "8 quarts plus 1 cup water",
            "1 pound carrots",
            "1 pound onions",
            "4 large leeks",
            "4 fresh thyme sprigs (optional)",
            "4 large fresh flat-leafed parsley sprigs (optional)",
            "2 Turkish bay leaves or 1/2 California bay leaf",
            "1 tablespoon black peppercorns (optional)",
            "1 tablespoon tomato paste (optional)"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 450°F and lightly oil 2 large shallow roasting pans.",
            "Remove meat from bones where possible and cut into 1-inch pieces.",
            "Arrange bones and meat in one layer in roasting pans.",
            "Roast in upper and lower thirds of the oven, switching pans halfway through, until bones are golden brown, 30 to 45 minutes.",
            "In a 14-quart stockpot, put bones, meat, and 8 quarts of water. Alternatively, divide between two 7- to 8-quart kettles.",
            "Discard fat from roasting pans and add 1/2 cup water to each pan, scraping up brown bits and add to stockpot or kettles.",
            "Bring liquid to about 190°F and cook at 190°F, skimming froth frequently during the first hour of cooking, for 12 to 14 hours.",
            "Separately cut carrots, onions, and leeks into 1-inch pieces.",
            "Wash leeks well in a bowl of cold water and lift from water into a colander to drain.",
            "In an oiled large shallow roasting pan, arrange carrots, onions, and leeks in one layer.",
            "Roast vegetables in the middle of the oven until golden brown, 20 to 30 minutes.",
            "Cool vegetables and chill, covered.",
            "Add roasted vegetables and remaining ingredients to stock during the last 2 hours of cooking.",
            "Pour stock through a large fine sieve into an 8-quart kettle and discard solids.",
            "Skim off fat or cool stock uncovered, and chill covered, then scrape congealed fat.",
            "Gently simmer stock, skimming froth occasionally, until reduced to about 2 quarts, about 1 hour.",
            "Cool stock uncovered and chill covered.",
            "Store stock covered and chilled for up to 1 week or freeze in airtight containers for up to 3 months."
        ],
        "pure_ingredients": [
            "veal bones",
            "water",
            "carrots",
            "onions",
            "leeks",
            "thyme",
            "parsley",
            "bay leaf",
            "peppercorns",
            "tomato"
        ],
        "cooking_time": {
            "preparation": "45 minutes",
            "cooking": "14 hours 30 minutes",
            "plating": "10 minutes"
        },
        "required_tools": [
            "oven",
            "large shallow roasting pans",
            "14-quart stockpot",
            "kettles",
            "colander",
            "large fine sieve"
        ],
        "total_health_score": 3
    }
]