[
  {
    "recipe_id": "jQz1aYn3ByYEgSVYsSqI2G2YzG2ovMS",
    "recipe_title": "Tuscan-Style Peppered Chicken ",
    "original_instructions": "Rub each chicken half all over with 2 tablespoons oil, then 1 1/2 teaspoons pepper. Sprinkle generously with salt. Let stand at room temperature 1 hour. Preheat broiler. Arrange chicken, skin side down, on broiler pan. Watching closely to avoid burning, broil chicken 5 to 6 inches from heat source until golden brown, about 12 minutes. Remove broiler pan from oven. Using tongs, transfer chicken to plate. Pour off any pan drippings. Return chicken, skin side up, to broiler pan. Broil until skin is crisp and golden brown, about 5 minutes. Turn chicken over, skin side down again, and broil until cooked through, about 8 minutes longer. Transfer chicken to platter; let stand 5 minutes. Serve with lemon wedges to squeeze over\nRub each chicken half all over with 2 tablespoons oil, then 1 1/2 teaspoons pepper. Sprinkle generously with salt. Let stand at room temperature 1 hour.\nPreheat broiler. Arrange chicken, skin side down, on broiler pan. Watching closely to avoid burning, broil chicken 5 to 6 inches from heat source until golden brown, about 12 minutes. Remove broiler pan from oven. Using tongs, transfer chicken to plate. Pour off any pan drippings. Return chicken, skin side up, to broiler pan. Broil until skin is crisp and golden brown, about 5 minutes. Turn chicken over, skin side down again, and broil until cooked through, about 8 minutes longer. Transfer chicken to platter; let stand 5 minutes. Serve with lemon wedges to squeeze over",
    "ingredients": [
      "2 3 1/2-pound chickens, halved, backbones removed, excess fat trimmed",
      "8 tablespoons olive oil (preferably extra-virgin)",
      "2 tablespoons coarsely ground black pepper",
      "Lemon wedges"
    ],
    "step_by_step_instructions": [
      "Rub each chicken half all over with 1 tablespoon of oil and 0.38 teaspoon of pepper.",
      "Sprinkle generously with salt.",
      "Let stand at room temperature for 1 hour.",
      "Preheat broiler.",
      "Arrange chicken, skin side down, on broiler pan.",
      "Broil chicken 5 to 6 inches from heat source until golden brown, about 12 minutes.",
      "Remove broiler pan from oven.",
      "Using tongs, transfer chicken to plate.",
      "Pour off any pan drippings.",
      "Return chicken, skin side up, to broiler pan.",
      "Broil until skin is crisp and golden brown, about 5 minutes.",
      "Turn chicken over, skin side down again, and broil until cooked through, about 8 minutes longer.",
      "Transfer chicken to platter; let stand 5 minutes.",
      "Serve with lemon wedges to squeeze over."
    ],
    "processed_ingredients": [
      "0.88 lb chicken",
      "1 tablespoon olive oil",
      "0.38 teaspoon black pepper",
      "1 lemon wedge"
    ],
    "pure_ingredients": [
      "chicken",
      "olive oil",
      "black pepper",
      "lemon",
      "salt"
    ],
    "cooking_time": "86 minutes",
    "required_tools": [
      "broiler",
      "broiler pan",
      "tongs",
      "plate",
      "platter"
    ],
    "total_health_score": 4,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 1,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "NTq0m53xDjMmqTvF8j2atHs//EpwzFi",
    "recipe_title": "Toasted Orzo with Peas, Onion and Bacon ",
    "original_instructions": "Heat large nonstick skillet over medium heat. Add orzo and stir until beginning to color, about 10 minutes. Transfer orzo to small bowl. Add onion and bacon to same skillet. Sauté until bacon browns and onion is tender, about 15 minutes. Add 3 1/4 cups broth and orzo and bring to boil. Reduce heat to medium-low, cover and simmer until broth is absorbed and orzo is tender, about 18 minutes. Mix in peas. Add more broth if mixture is dry. Cover and cook until peas are just warmed through, about 2 minutes. Season to taste with salt and pepper and serve.\nHeat large nonstick skillet over medium heat. Add orzo and stir until beginning to color, about 10 minutes. Transfer orzo to small bowl. Add onion and bacon to same skillet. Sauté until bacon browns and onion is tender, about 15 minutes. Add 3 1/4 cups broth and orzo and bring to boil. Reduce heat to medium-low, cover and simmer until broth is absorbed and orzo is tender, about 18 minutes. Mix in peas. Add more broth if mixture is dry. Cover and cook until peas are just warmed through, about 2 minutes. Season to taste with salt and pepper and serve.",
    "ingredients": [
      "1 1/2 cups orzo (rice-shaped pasta)",
      "1 1/4 cups chopped onion",
      "5 bacon slices, chopped",
      "3 1/4 cups (or more) canned low-salt chicken broth",
      "1 1/2 cups frozen peas, thawed"
    ],
    "step_by_step_instructions": [
      "Heat a nonstick skillet over medium heat.",
      "Add approximately 0.25 cups of orzo and stir until beginning to color, about 10 minutes.",
      "Transfer orzo to a small bowl.",
      "Add about 0.31 cups of chopped onion and 1 slice of chopped bacon to the same skillet.",
      "Sauté until bacon browns and onion is tender, about 15 minutes.",
      "Add 0.54 cups of chicken broth and the orzo to the skillet and bring to a boil.",
      "Reduce heat to medium-low, cover, and simmer until broth is absorbed and orzo is tender, about 18 minutes.",
      "Mix in approximately 0.25 cups of thawed peas.",
      "Add more broth if mixture is dry.",
      "Cover and cook until peas are just warmed through, about 2 minutes.",
      "Season to taste with salt and pepper, then serve."
    ],
    "processed_ingredients": [
      "0.25 cups orzo",
      "0.31 cups onion",
      "1 slice bacon",
      "0.54 cups chicken broth",
      "0.25 cups peas"
    ],
    "pure_ingredients": [
      "orzo",
      "onion",
      "bacon",
      "chicken broth",
      "peas",
      "salt",
      "pepper"
    ],
    "cooking_time": "45 minutes",
    "required_tools": [
      "nonstick skillet",
      "small bowl",
      "spoon"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "Sxckw6IydQ/yO3Eu8iXMEwIAgcQ8Gyu",
    "recipe_title": "Cheddar Buttermilk Biscuits ",
    "original_instructions": "Put oven rack in middle position and preheat oven to 450°F. Butter 1 large baking sheet. Whisk together flour, cornmeal, baking powder, baking soda, and salt in a bowl, then blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal. Stir in cheeses and scallions with a wooden spoon, then add buttermilk and stir until just combined. Drop dough in 8 equal mounds about 2 inches apart on baking sheet. Bake until golden, about 15 minutes. Transfer to a rack and cool to warm, about 10 minutes, then cut in half horizontally.\nPut oven rack in middle position and preheat oven to 450°F. Butter 1 large baking sheet.\nWhisk together flour, cornmeal, baking powder, baking soda, and salt in a bowl, then blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal. Stir in cheeses and scallions with a wooden spoon, then add buttermilk and stir until just combined.\nDrop dough in 8 equal mounds about 2 inches apart on baking sheet. Bake until golden, about 15 minutes. Transfer to a rack and cool to warm, about 10 minutes, then cut in half horizontally.",
    "ingredients": [
      "1 3/4 cups all-purpose flour",
      "3/4 cup cornmeal (preferably stone-ground; not coarse)",
      "4 teaspoons baking powder",
      "1 teaspoon baking soda",
      "1 teaspoon salt",
      "1/2 stick (1/4 cup) cold unsalted butter, cut into 1/2-inch cubes",
      "6 oz extra-sharp Cheddar, coarsely grated (2 cups)",
      "3 tablespoons finely grated Parmigiano-Reggiano",
      "3 scallions, finely chopped",
      "1 1/3 cups well-shaken buttermilk"
    ],
    "step_by_step_instructions": [
      "Preheat the oven to 450°F and butter a large baking sheet.",
      "In a bowl, whisk together 0.22 cups of all-purpose flour, 0.09 cups of cornmeal, 0.5 teaspoons of baking powder, 0.12 teaspoons of baking soda, and 0.12 teaspoons of salt.",
      "Blend in 0.5 tablespoons of cold unsalted butter with your fingertips or a pastry blender until the mixture resembles coarse meal.",
      "Stir in 0.75 ounces of coarsely grated extra-sharp Cheddar, 0.38 tablespoons of finely grated Parmigiano-Reggiano, and 0.38 scallions, finely chopped.",
      "Add 0.17 cups of well-shaken buttermilk and stir until just combined.",
      "Drop the dough in 1 equal mound on the baking sheet.",
      "Bake until golden, about 15 minutes.",
      "Transfer to a rack and cool to warm, about 10 minutes.",
      "Cut in half horizontally."
    ],
    "processed_ingredients": [
      "0.22 cup all-purpose flour",
      "0.09 cup cornmeal",
      "0.5 teaspoon baking powder",
      "0.12 teaspoon baking soda",
      "0.12 teaspoon salt",
      "0.5 tablespoon unsalted butter",
      "0.75 ounce extra-sharp Cheddar",
      "0.38 tablespoon Parmigiano-Reggiano",
      "0.38 scallion",
      "0.17 cup buttermilk"
    ],
    "pure_ingredients": [
      "all-purpose flour",
      "cornmeal",
      "baking powder",
      "baking soda",
      "salt",
      "butter",
      "Cheddar",
      "Parmigiano-Reggiano",
      "scallions",
      "buttermilk"
    ],
    "cooking_time": "25 minutes",
    "required_tools": [
      "oven",
      "baking sheet",
      "bowl",
      "whisk",
      "pastry blender",
      "wooden spoon",
      "rack"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 1,
      "Saturated Fats": 0,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "b7D2NhCHvPETFzJA2bCB2N.0gspLl5W",
    "recipe_title": "Roasted Rainbow Trout with Rock Shrimp and Sage Butter Stuffing",
    "original_instructions": "Preheat the oven to 425 degrees.\nWell in advance of cooking the fish, prepare the stuffing. Combine the sage, softened butter, lemon juice, spice and seasonings, bread crumbs, pine nuts, jalapenos, garlic and coriander in the bowl of a food processor, pulsing to combine well. Remove and place in a bowl. Keep refrigerated until ready to use.\nSeason the trout with salt and pepper and rub the trout with olive oil.\nDivide the stuffing between the 4 fish evenly and spread an even layer inside the cavity of the fish. Divide the shrimp in the same way and add the shrimp in a layer in top of the herb butter. Close the fish to seal in the stuffing.\nLay the fish on an oiled rack and set in a roasting pan.\nPlace the fish in the oven and roast for 12 minutes on each side. Remove and serve immediately.",
    "ingredients": [
      "3 tablespoons chopped fresh sage",
      "1/4 cup unsalted butter, softened to room temperature",
      "Juice of 1 lemon",
      "1/2 teaspoon salt",
      "1/2 teaspoon freshly ground black pepper",
      "1/2 teaspoon paprika",
      "3 scallions, finely chopped",
      "1/2 cup dry bread crumbs",
      "1/4 cup pine nuts",
      "2 fresh jalapeno peppers, seeded and diced",
      "1 clove garlic, finely chopped",
      "1 tablespoon toasted, ground coriander seed",
      "Salt and freshly ground black pepper to taste",
      "4 butterflied rainbow trout, whole, skin on, bones removed (ask your fish dealer to do this for you)",
      "Olive oil",
      "1/2 pound cleaned and shelled rock shrimp"
    ],
    "step_by_step_instructions": [
      "Preheat the oven to 425 degrees.",
      "Prepare the stuffing by combining 0.75 tablespoons chopped fresh sage, 1 tablespoon unsalted butter, 0.25 tablespoon lemon juice, 0.13 teaspoon salt, 0.13 teaspoon freshly ground black pepper, 0.13 teaspoon paprika, 0.75 chopped scallion, 2 tablespoons dry bread crumbs, 1 tablespoon pine nuts, 0.5 diced jalapeno pepper, 0.25 clove finely chopped garlic, and 0.25 tablespoon toasted, ground coriander seed in a food processor. Pulse to combine well.",
      "Remove the stuffing from the processor, place in a bowl, and refrigerate until ready to use.",
      "Season 1 rainbow trout with salt and pepper and rub with olive oil.",
      "Divide the stuffing into 1 portion and spread an even layer inside the cavity of the trout.",
      "Add 2 ounces of rock shrimp in a layer on top of the stuffing.",
      "Close the trout to seal in the stuffing.",
      "Lay the trout on an oiled rack and set in a roasting pan.",
      "Place the trout in the oven and roast for 12 minutes on one side.",
      "Flip the trout and roast for another 12 minutes on the other side.",
      "Remove the trout from the oven and serve immediately."
    ],
    "processed_ingredients": [
      "0.75 tablespoon chopped fresh sage",
      "1 tablespoon unsalted butter",
      "0.25 tablespoon lemon juice",
      "0.13 teaspoon salt",
      "0.13 teaspoon freshly ground black pepper",
      "0.13 teaspoon paprika",
      "0.75 scallion",
      "2 tablespoon dry bread crumbs",
      "1 tablespoon pine nuts",
      "0.5 jalapeno pepper",
      "0.25 clove garlic",
      "0.25 tablespoon toasted, ground coriander seed",
      "1 rainbow trout",
      "2 ounce rock shrimp",
      "1 tablespoon olive oil"
    ],
    "pure_ingredients": [
      "sage",
      "butter",
      "lemon",
      "salt",
      "black pepper",
      "paprika",
      "scallions",
      "bread crumbs",
      "pine nuts",
      "jalapeno peppers",
      "garlic",
      "coriander seed",
      "trout",
      "olive oil",
      "rock shrimp"
    ],
    "cooking_time": "24 minutes",
    "required_tools": [
      "oven",
      "food processor",
      "bowl",
      "roasting pan",
      "rack"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "j2uDUfy8YABwmUDO8.YIYdcJaGuBBne",
    "recipe_title": "Toby's Fish and Chips",
    "original_instructions": "Pour buttermilk into a bowl.\nIn a separate bowl, mix flour, salt, and garlic powder. Dip each fish portion into buttermilk then roll in flour until evenly covered, set aside on plate.\nHeat deep-fat fryer to 360 degrees F and cook fish for 6-8 minutes, or until golden brown and done. To check for doneness, cut into one portion and check to see if fish is flaky and looks milky white. Serve with french fries, coleslaw, and garlic bread.",
    "ingredients": [
      "2 cups buttermilk",
      "1 cup flour",
      "1/2 teaspoon seasoned salt",
      "1 teaspoon garlic powder",
      "2 pounds cod or halibut, cut into 2 ounce portions",
      "Serving suggestions: french fries, coleslaw, and garlic bread"
    ],
    "step_by_step_instructions": [
      "Pour 0.25 cups buttermilk into a bowl.",
      "In a separate bowl, mix 0.13 cups flour, 0.06 teaspoons seasoned salt, and 0.13 teaspoons garlic powder.",
      "Dip one 2-ounce portion of fish into the buttermilk, then roll in the flour mixture until evenly covered, and set aside on a plate.",
      "Heat a deep-fat fryer to 360 degrees F.",
      "Cook the fish for 6-8 minutes, or until golden brown and done.",
      "To check for doneness, cut into the fish portion and check to see if it is flaky and looks milky white.",
      "Serve the fish with a side of french fries, coleslaw, and garlic bread."
    ],
    "processed_ingredients": [
      "0.25 cup buttermilk",
      "0.13 cup flour",
      "0.06 teaspoon seasoned salt",
      "0.13 teaspoon garlic powder",
      "2 ounce cod"
    ],
    "pure_ingredients": [
      "buttermilk",
      "flour",
      "salt",
      "garlic powder",
      "cod"
    ],
    "cooking_time": "8 minutes",
    "required_tools": [
      "bowl",
      "deep-fat fryer",
      "plate"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "rtPpWjYBQBuNXsFtAuSuo2YzQdbSpWu",
    "recipe_title": "Individual Yorkshire Puddings",
    "original_instructions": "Make batter: In a blender blend batter ingredients until smooth and transfer to a bowl. Let batter stand, covered, 1 hour.\nPreheat oven to 425 degrees. Spoon 1 teaspoon roast drippings into each cup of 3 mini muffin pans. Put 2 mini-muffin pans on 1 baking sheet and put remaining pan on another baking sheet. Put first baking sheet with the two mini muffin pans in middle of oven for 3 minutes to heat drippings in cups. Working quickly, pour 2 teaspoons of batter into hot drippings in each cup and bake in middle of oven 18 minutes, or until pudding shells are golden and puffed. Remove shells from cups with tongs and cool on racks. Repeat procedure with other baking sheet. Shells may be made 3 days ahead and chilled, covered, or 1 month ahead and frozen in airtight containers. Bring shells to room temperature and re-crisp in a 300 degree oven 10 minutes.",
    "ingredients": [
      "1 cup plus 2 tablespoons milk",
      "2 large eggs",
      "1 large egg yolk",
      "1 cup all-purpose flour",
      "1 teaspoon salt",
      "Freshly ground black pepper, to taste",
      "3/4 cup roast drippings or vegetable oil",
      "Garnish: 36 small fresh flat-leafed parsley leaves"
    ],
    "step_by_step_instructions": [
      "Blend all batter ingredients until smooth and pour into a bowl. Cover and let stand for 1 hour.",
      "Preheat oven to 425 degrees Fahrenheit.",
      "Spoon 1 teaspoon of roast drippings into a cup of a mini muffin pan.",
      "Place the mini muffin pan in the oven to heat the drippings for 3 minutes.",
      "Quickly pour approximately 1.5 teaspoons of batter into the hot drippings.",
      "Bake for 18 minutes until the pudding is golden and puffed.",
      "Remove pudding from the muffin pan, using tongs, and cool on a rack."
    ],
    "processed_ingredients": [
      "0.25 cup milk",
      "0.50 large egg",
      "0.25 large egg yolk",
      "0.25 cup all-purpose flour",
      "0.25 teaspoon salt",
      "0.13 teaspoon black pepper",
      "0.06 cup roast drippings",
      "0.75 small parsley leaf"
    ],
    "pure_ingredients": [
      "milk",
      "egg",
      "flour",
      "salt",
      "pepper",
      "roast drippings",
      "parsley"
    ],
    "cooking_time": "82 minutes",
    "required_tools": [
      "blender",
      "bowl",
      "mini muffin pan",
      "oven",
      "tongs",
      "rack"
    ],
    "total_health_score": 4,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 1,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "LytXopbMHzcnvSlXl.8huFZWEc7JXF.",
    "recipe_title": "Ginger Scallion Soy Sauce",
    "original_instructions": "Peel ginger and cut into small pieces. Press about 1/2-inch piece of ginger in a garlic presser and squeeze ginger juice and small bits into a medium size bowl. Grate another 1/2-inch piece into same bowl. Finely chop the scallions and place in the same bowl. Add all other ingredients and mix well. Adjust by tasting and enjoy this fantastic Chinese dumpling dipping sauce.",
    "ingredients": [
      "1 small piece ginger, about 2 ounces",
      "2 scallions (green onion)",
      "1/2 cup soy sauce",
      "2 tablespoons white vinegar",
      "1 1/2 teaspoons sugar",
      "2 tablespoons water",
      "1 teaspoon spicy Chinese chili red paste (optional)"
    ],
    "step_by_step_instructions": [
      "Peel approximately 0.7 ounces of ginger.",
      "Cut ginger into small pieces.",
      "Press about 0.15-ounce piece of ginger in a garlic presser and squeeze ginger juice and small bits into a medium size bowl.",
      "Grate another 0.15-ounce piece of ginger into the same bowl.",
      "Finely chop 0.67 scallion (green onion) and place it in the same bowl.",
      "Add 0.17 cup soy sauce to the bowl.",
      "Add 0.67 tablespoon white vinegar to the bowl.",
      "Add 0.5 teaspoon sugar to the bowl.",
      "Add 0.67 tablespoon water to the bowl.",
      "Add 0.33 teaspoon spicy Chinese chili red paste (optional) to the bowl.",
      "Mix all ingredients well.",
      "Taste and adjust if necessary."
    ],
    "processed_ingredients": [
      "0.7 oz ginger",
      "0.67 scallion",
      "0.17 cup soy sauce",
      "0.67 tbsp white vinegar",
      "0.5 tsp sugar",
      "0.67 tbsp water",
      "0.33 tsp spicy Chinese chili red paste"
    ],
    "pure_ingredients": [
      "ginger",
      "scallion",
      "soy sauce",
      "vinegar",
      "sugar",
      "water",
      "chili paste"
    ],
    "cooking_time": "10 minutes",
    "required_tools": [
      "peeler",
      "knife",
      "garlic presser",
      "grater",
      "bowl",
      "spoon"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 0,
      "Sodium": 0,
      "Fats": 1,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "hugz4qNPzg6Xr06DYTdDCHqEEh54vZa",
    "recipe_title": "Creamy Lamb's-Quarters Gratin ",
    "original_instructions": "Make Filling: Preheat the oven to 350° F with the rack in the middle. Butter a 2-quart shallow baking dish. Bring 1-inch salted water to a boil in a large saucepan. Meanwhile, wash lamb's-quarters in a large bowl of cold water and drain well. Trim any coarse, woody stems at bottom (don't go crazy with trimming; young lamb's-quarter stems cook up tender and delicious). Add lamb's-quarters to pot and cook over medium heat, covered, until leaves are wilted and stems are tender, 2 to 3 minutes. Drain the greens in a large sieve or colander and rinse well under cold running water. Drain again, pressing out excess liquid with the back of a large spoon. Coarsely chop greens and transfer to a bowl. Dry saucepan and reserve. Cook scallions in olive oil with 1/4 teaspoon salt in reserved saucepan over medium heat, stirring, until softened, 3 to 4 minutes. Combine scallion mixture with greens in bowl. Reserve saucepan again. Melt butter in reserved saucepan over medium-low heat and stir in flour. Cook, stirring, 2 minutes, then whisk in milk and bring to a boil, whisking. Reduce heat and simmer sauce, whisking, 2 minutes (it will be thick). Remove from heat and whisk in nutmeg, zest, and salt and pepper to taste. Mix sauce into greens mixture. If the mixture is too thick, thin with a little additional milk; season with salt and pepper. Spread out mixture in baking dish.\nPreheat the oven to 350° F with the rack in the middle. Butter a 2-quart shallow baking dish.\nBring 1-inch salted water to a boil in a large saucepan. Meanwhile, wash lamb's-quarters in a large bowl of cold water and drain well. Trim any coarse, woody stems at bottom (don't go crazy with trimming; young lamb's-quarter stems cook up tender and delicious).\nAdd lamb's-quarters to pot and cook over medium heat, covered, until leaves are wilted and stems are tender, 2 to 3 minutes. Drain the greens in a large sieve or colander and rinse well under cold running water. Drain again, pressing out excess liquid with the back of a large spoon. Coarsely chop greens and transfer to a bowl. Dry saucepan and reserve.\nCook scallions in olive oil with 1/4 teaspoon salt in reserved saucepan over medium heat, stirring, until softened, 3 to 4 minutes. Combine scallion mixture with greens in bowl. Reserve saucepan again.\nMelt butter in reserved saucepan over medium-low heat and stir in flour. Cook, stirring, 2 minutes, then whisk in milk and bring to a boil, whisking. Reduce heat and simmer sauce, whisking, 2 minutes (it will be thick). Remove from heat and whisk in nutmeg, zest, and salt and pepper to taste.\nMix sauce into greens mixture. If the mixture is too thick, thin with a little additional milk; season with salt and pepper. Spread out mixture in baking dish.\nMake Topping: Toss together crumbs, cheeses, and oil until combined well. Sprinkle topping evenly over greens mixture and bake in oven until crumbs are golden and mixture is bubbling, about 30 minutes.\nToss together crumbs, cheeses, and oil until combined well. Sprinkle topping evenly over greens mixture and bake in oven until crumbs are golden and mixture is bubbling, about 30 minutes.\nCooks' Notes: The best way to make coarse fresh breadcrumbs is to cube fresh bread, then grind it in small batches in a blender (a food processor is not as good at grinding crusty bread into breadcrumbs because the crusts get stuck in the blade). Creamy lamb's-quarters mixture and crumb mixture can be made 1 day ahead and kept separately in airtight containers, chilled.\nThe best way to make coarse fresh breadcrumbs is to cube fresh bread, then grind it in small batches in a blender (a food processor is not as good at grinding crusty bread into breadcrumbs because the crusts get stuck in the blade).\nCreamy lamb's-quarters mixture and crumb mixture can be made 1 day ahead and kept separately in airtight containers, chilled.",
    "ingredients": [
      "1 1/2 pounds lambs-quarters",
      "1 bunch scallions, chopped (1 1/2 cups)",
      "1 tablespoon olive oil",
      "Salt",
      "freshly ground black pepper",
      "3 tablespoons unsalted butter",
      "3 tablespoons all-purpose flour",
      "1 cup milk, plus additional, if necessary",
      "1/4 teaspoon nutmeg (preferably freshly grated)",
      "1 teaspoon finely grated lemon zest",
      "1 cup coarse fresh breadcrumbs (coarsely ground from a baguette; see Cooks' Notes)",
      "1/2 cup packaged pre-grated mozzarella",
      "1/4 cup finely grated Parmesan",
      "4 teaspoons olive oil"
    ],
    "step_by_step_instructions": [
      "Preheat the oven to 350° F with the rack in the middle.",
      "Butter a 2-quart shallow baking dish.",
      "Bring 1-inch salted water to a boil in a large saucepan.",
      "Wash approximately 120 g of lamb's-quarters in cold water and drain well.",
      "Trim any coarse, woody stems from the lamb's-quarters.",
      "Add lamb's-quarters to the boiling water and cook over medium heat, covered, until leaves are wilted and stems are tender, about 2 to 3 minutes.",
      "Drain the greens in a sieve or colander and rinse under cold running water.",
      "Drain again, pressing out excess liquid with the back of a spoon.",
      "Coarsely chop the greens and transfer to a bowl.",
      "In the reserved saucepan, cook 30 g of chopped scallions in 0.20 tbsp of olive oil with a pinch of salt over medium heat, stirring, until softened, about 3 to 4 minutes.",
      "Combine scallion mixture with greens in the bowl.",
      "Melt 0.20 oz of butter in the reserved saucepan over medium-low heat and stir in 0.20 oz of flour.",
      "Cook, stirring, for 2 minutes, then whisk in 0.07 cup of milk and bring to a boil, whisking.",
      "Reduce heat and simmer the sauce, whisking, for 2 minutes until thick.",
      "Remove from heat and whisk in a pinch of nutmeg, 0.20 tsp of lemon zest, and salt and pepper to taste.",
      "Mix the sauce into the greens mixture.",
      "If the mixture is too thick, thin with a little additional milk; season with salt and pepper.",
      "Spread out the mixture in the baking dish.",
      "Toss together 0.20 cup of breadcrumbs, 0.10 cup of mozzarella, and 0.05 cup of Parmesan with 0.27 tbsp of olive oil until combined well.",
      "Sprinkle topping evenly over the greens mixture.",
      "Bake in the oven until crumbs are golden and mixture is bubbling, about 30 minutes."
    ],
    "processed_ingredients": [
      "120.00 g lamb's-quarters",
      "30.00 g scallions",
      "0.20 tbsp olive oil",
      "0.20 oz butter",
      "0.20 oz all-purpose flour",
      "0.07 cup milk",
      "0.20 tsp lemon zest",
      "0.20 cup breadcrumbs",
      "0.10 cup mozzarella",
      "0.05 cup Parmesan",
      "0.27 tbsp olive oil",
      "0.05 tsp salt",
      "0.05 tsp black pepper",
      "0.01 tsp nutmeg"
    ],
    "pure_ingredients": [
      "lamb's-quarters",
      "scallions",
      "olive oil",
      "salt",
      "black pepper",
      "butter",
      "flour",
      "milk",
      "nutmeg",
      "lemon zest",
      "breadcrumbs",
      "mozzarella",
      "Parmesan"
    ],
    "cooking_time": "40 minutes",
    "required_tools": [
      "oven",
      "saucepan",
      "baking dish",
      "sieve",
      "colander",
      "spoon",
      "whisk",
      "bowl"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "ASGIgDxKpL6ejcF6r4t8X8ltmtrqhvC",
    "recipe_title": "Fried Zucchini",
    "original_instructions": "Pour the oil into a deep, heavy bottomed pot and heat to 350 degrees F.\nMake the breading mixture by combining the breadcrumbs, and Parmesan in a medium bowl. Mix to blend. In another bowl, whisk together the eggs and the splash of water.\nPlace the zucchini in a large bowl and season with salt. Toss to blend. Sprinkle lightly with flour (use a sieve) to dredge then toss to coat evenly - this will help the breading to stick. Submerge the zucchini in the eggs. Remove the pieces, 1 by 1, shaking off excess egg and them roll them in the breadcrumb mixture until they are coated on all sides. Transfer to a platter or baking sheet.\nWhen the oil comes up to temperature, test the oil by dropping in one piece of zucchini. It should rise to the surface fairly quickly, begin the bubble and fry gradually. Prepare a baking sheet fitted with a kitchen towel and a slotted spoon (or, alternatively, a spider) to remove the zucchini from the oil. Drop a few pieces of zucchini into the oil and gently swirl the oil as they fry. This swirling will allow the zucchini to move around a lot, assuring they fry more evenly on all sides. When they are light to medium brown, remove them with the spoon and lay them out on the kitchen towel to cool. Sprinkle with a touch of salt and paprika. Repeat.\nServe immediately with lemon wedges.",
    "ingredients": [
      "4 cups canola oil",
      "1 cup toasted Italian breadcrumbs",
      "3 tablespoons grated Parmesan",
      "3 eggs",
      "1 splash cold water",
      "4 medium zucchini, washed, dried, ends trimmed, cut, lengthwise, into 10 wedges like pickles",
      "2 cups flour, for dredging",
      "Kosher salt",
      "1 tablespoon paprika, for dusting",
      "1 lemon, cut into wedges"
    ],
    "step_by_step_instructions": [
      "Pour about 0.5 cups of canola oil into a deep, heavy bottomed pot and heat to 350 degrees F.",
      "Make the breading mixture by combining about 0.125 cups of toasted Italian breadcrumbs and about 0.375 tablespoons of grated Parmesan in a medium bowl. Mix to blend.",
      "In another bowl, whisk together 1 egg and a small splash of water.",
      "Take 1 medium zucchini, wash, dry, trim the ends, and cut it lengthwise into 2 or 3 wedges like pickles.",
      "Place the zucchini wedges in a large bowl and season with a pinch of salt. Toss to blend.",
      "Sprinkle lightly about 0.5 cups of flour over the zucchini using a sieve to dredge, then toss to coat evenly.",
      "Submerge the zucchini in the egg mixture.",
      "Remove the zucchini pieces one by one, shaking off excess egg, then roll them in the breadcrumb mixture until they are coated on all sides.",
      "Transfer the coated zucchini to a platter or baking sheet.",
      "When the oil comes up to temperature, test the oil by dropping in one piece of zucchini. It should rise to the surface fairly quickly, begin to bubble, and fry gradually.",
      "Prepare a baking sheet fitted with a kitchen towel and a slotted spoon to remove the zucchini from the oil.",
      "Drop a few pieces of zucchini into the oil and gently swirl the oil as they fry.",
      "When they are light to medium brown, remove them with the spoon and lay them out on the kitchen towel to cool.",
      "Sprinkle with a touch of salt and about 0.125 tablespoons of paprika.",
      "Serve immediately with a wedge of lemon."
    ],
    "processed_ingredients": [
      "0.5 cup canola oil",
      "0.125 cup toasted Italian breadcrumbs",
      "0.375 tablespoon grated Parmesan",
      "1 egg",
      "0.5 medium zucchini",
      "0.5 cup flour",
      "0.125 tablespoon paprika",
      "1 lemon wedge"
    ],
    "pure_ingredients": [
      "canola oil",
      "breadcrumbs",
      "Parmesan",
      "egg",
      "water",
      "zucchini",
      "flour",
      "salt",
      "paprika",
      "lemon"
    ],
    "cooking_time": "45 minutes",
    "required_tools": [
      "deep heavy bottomed pot",
      "medium bowl",
      "whisk",
      "large bowl",
      "sieve",
      "platter or baking sheet",
      "kitchen towel",
      "slotted spoon"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "XE9oXJD0.kVGJaB02u8Vves0lb.kNVa",
    "recipe_title": "Pizza Popcorn",
    "original_instructions": "In a food processor, puree the butter, tomatoes and garlic until it forms a smooth paste. Heat a small saute pan over medium heat and add the butter mixture. Heat the butter until melted down and fragrant, about 3 minutes. Keep warm.\nHeat a large saucepan over high heat. Once hot, add the popcorn kernels and oil, and shake the pan to coat the kernels in the oil. Cover and continue to cook over high heat until the kernels begin to pop. Shake the pan once again and reduce the heat to medium-high. Continue to cook until the popping slows dramatically, 1 to 2 minutes.\nPour the popped popcorn into a large bowl. While still warm, add the flavored butter, cheese, oregano and salt. Toss to coat, and then serve.",
    "ingredients": [
      "4 tablespoons unsalted butter, at room temperature",
      "1/4 cup sun-dried tomatoes in oil, drained well",
      "1 clove garlic, smashed",
      "1/3 cup popcorn kernels",
      "1 tablespoon grapeseed oil",
      "2 tablespoons grated Parmigiano-Reggiano",
      "3/4 teaspoon dried oregano",
      "1/2 teaspoon kosher salt"
    ],
    "step_by_step_instructions": [
      "In a food processor, puree 1 tablespoon of butter, 0.06 cup of sun-dried tomatoes, and 0.25 clove of garlic until it forms a smooth paste.",
      "Heat a small saute pan over medium heat and add the butter mixture.",
      "Heat the butter until melted down and fragrant, about 3 minutes. Keep warm.",
      "Heat a large saucepan over high heat.",
      "Once hot, add 0.08 cup of popcorn kernels and 0.25 tablespoon of grapeseed oil, and shake the pan to coat the kernels in the oil.",
      "Cover and continue to cook over high heat until the kernels begin to pop.",
      "Shake the pan once again and reduce the heat to medium-high.",
      "Continue to cook until the popping slows dramatically, 1 to 2 minutes.",
      "Pour the popped popcorn into a large bowl.",
      "While still warm, add the flavored butter, 0.5 tablespoon of Parmigiano-Reggiano, 0.19 teaspoon of oregano, and 0.13 teaspoon of kosher salt.",
      "Toss to coat, and then serve."
    ],
    "processed_ingredients": [
      "1 tablespoon unsalted butter",
      "0.06 cup sun-dried tomatoes",
      "0.25 clove garlic",
      "0.08 cup popcorn kernels",
      "0.25 tablespoon grapeseed oil",
      "0.5 tablespoon Parmigiano-Reggiano",
      "0.19 teaspoon dried oregano",
      "0.13 teaspoon kosher salt"
    ],
    "pure_ingredients": [
      "butter",
      "sun-dried tomatoes",
      "garlic",
      "popcorn",
      "grapeseed oil",
      "Parmigiano-Reggiano",
      "oregano",
      "salt"
    ],
    "cooking_time": "10 minutes",
    "required_tools": [
      "food processor",
      "small saute pan",
      "large saucepan",
      "large bowl"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "Tg6WfsgcuO2GaUzpJxCgNqABxhl6gB6",
    "recipe_title": "Lobster Rolls",
    "original_instructions": "Remove the meat from the lobsters, chopping any large chunks into bite-size pieces. In a bowl, combine the lobster meat, mayonnaise, lemon juice, celery, parsley, and salt and pepper to taste.\nBrush cut sides of the rolls with melted butter and fill with the lobster salad.",
    "ingredients": [
      "4 (1 1/2-pound) cooked lobsters or 4 lobster tails or 1 1/2 pounds lobster meat",
      "1/2 cup mayonnaise",
      "3 tablespoons freshly squeezed lemon juice",
      "2 inner celery stalks and leaves, finely chopped",
      "2 tablespoons chopped fresh parsley leaves",
      "Salt and freshly ground black pepper",
      "4 rolls, split and lightly toasted",
      "Melted butter, for brushing"
    ],
    "step_by_step_instructions": [
      "Remove the meat from 1 cooked lobster, chopping any large chunks into bite-size pieces.",
      "In a bowl, combine approximately 6 ounces of the lobster meat, 2 tablespoons of mayonnaise, 1 tablespoon of freshly squeezed lemon juice, 1/2 stalk of celery (finely chopped), 1/2 tablespoon of chopped fresh parsley leaves, and salt and freshly ground black pepper to taste.",
      "Brush the cut sides of one roll with melted butter.",
      "Fill the roll with the lobster salad."
    ],
    "processed_ingredients": [
      "6.00 oz lobster meat",
      "2.00 tbsp mayonnaise",
      "1.00 tbsp lemon juice",
      "0.50 stalk celery",
      "0.50 tbsp parsley leaves",
      "1.00 roll",
      "0.25 tbsp butter",
      "0.13 tsp salt",
      "0.13 tsp black pepper"
    ],
    "pure_ingredients": [
      "lobster",
      "mayonnaise",
      "lemon juice",
      "celery",
      "parsley leaves",
      "salt",
      "black pepper",
      "rolls",
      "butter"
    ],
    "cooking_time": "15 minutes",
    "required_tools": [
      "bowl",
      "knife",
      "spoon",
      "brush"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "trOdrH9Ovv5pDgopYWbMyknxbLawp/W",
    "recipe_title": "Pork Cutlets Parmigiana",
    "original_instructions": "Preheat oven to 425degrees.\nCombine bread crumbs and 1 tablespoon Parmesan cheese in large bowl. Dip pork in egg, then bread crumb mixture, coating well. Arrange pork on greased baking sheet. Bake, turning once, 18 minutes or until pork is done.\nMeanwhile, heat Sauce in 2-quart saucepan. To serve, spoon sauce over hot penne. Top with pork, then sprinkle with remaining 2 tablespoons cheese.",
    "ingredients": [
      "1/3 cup plain dry bread crumbs",
      "3 Tbsp. grated Parmesan cheese",
      "3/4 lb. boneless pork or pork tenderloin, thinly sliced and pounded 1/4 inch thick",
      "1 egg, slightly beaten",
      "1 jar Bertolli Tomato & Basil Sauce",
      "8 ounces penne pasta, cooked and drained"
    ],
    "step_by_step_instructions": [
      "Preheat the oven to 425 degrees.",
      "Combine 1.5 tablespoons of bread crumbs and 0.5 tablespoon of Parmesan cheese in a large bowl.",
      "Dip 0.25 lb. of pork in 0.25 beaten egg, then coat well with the bread crumb mixture.",
      "Arrange the coated pork on a greased baking sheet.",
      "Bake, turning once, for 18 minutes or until the pork is done.",
      "Meanwhile, heat 0.33 cup of tomato and basil sauce in a 2-quart saucepan.",
      "Serve by spooning the sauce over 3 ounces of hot penne pasta.",
      "Top the pasta with the baked pork, then sprinkle with 1 tablespoon of remaining Parmesan cheese."
    ],
    "processed_ingredients": [
      "1.50 tbsp plain dry bread crumbs",
      "1.50 tbsp grated Parmesan cheese",
      "0.25 lb boneless pork",
      "0.25 large egg",
      "0.33 cup tomato and basil sauce",
      "3.00 oz penne pasta"
    ],
    "pure_ingredients": [
      "bread crumbs",
      "Parmesan cheese",
      "pork",
      "egg",
      "tomato",
      "basil",
      "penne pasta"
    ],
    "cooking_time": "18 minutes",
    "required_tools": [
      "oven",
      "large bowl",
      "baking sheet",
      "saucepan"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "ih3qoOj.Vy8EZvOMAhJRCsUqk5mX/Yu",
    "recipe_title": "Oven Baked Steak Fries",
    "original_instructions": "In a large skillet heat oil over medium high heat. Add butter and stir until melted. Add potatoes and toss to coat. Cook the potatoes for 10 minutes, occasionally tossing and stirring them. Transfer potatoes to a baking sheet and roast in oven at 400 degrees for another 20 minutes. Bake until potatoes are golden brown and crispy. Season with salt and pepper.",
    "ingredients": [
      "4 Idaho potatoes, scrubbed clean and sliced into 1/2-inch thick slices",
      "3 tablespoons vegetable oil",
      "2 tablespoons butter",
      "Salt and pepper"
    ],
    "step_by_step_instructions": [
      "Heat 0.75 tablespoons of vegetable oil in a large skillet over medium high heat.",
      "Add 0.5 tablespoons of butter and stir until melted.",
      "Add 1 Idaho potato, scrubbed clean and sliced into 0.5-inch thick slices, and toss to coat.",
      "Cook the potatoes for 10 minutes, occasionally tossing and stirring them.",
      "Transfer the potatoes to a baking sheet.",
      "Roast potatoes in the oven at 400 degrees for another 20 minutes.",
      "Bake until potatoes are golden brown and crispy.",
      "Season with salt and pepper to taste."
    ],
    "processed_ingredients": [
      "1 Idaho potato",
      "0.75 tablespoon vegetable oil",
      "0.5 tablespoon butter",
      "0.25 teaspoon salt",
      "0.25 teaspoon pepper"
    ],
    "pure_ingredients": [
      "potato",
      "vegetable oil",
      "butter",
      "salt",
      "pepper"
    ],
    "cooking_time": "30 minutes",
    "required_tools": [
      "skillet",
      "baking sheet",
      "oven"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "MYgtL/xSustcQz0Bt9bpdTNaT9s7/1G",
    "recipe_title": "Cajun Rub for Deep Fried Turkey",
    "original_instructions": "Blend above and then rub over the entire turkey. This is enough for 1 (10 to 12) pound turkey.;",
    "ingredients": [
      "4 tablespoons kosher salt",
      "4 teaspoons garlic powder",
      "4 teaspoons white pepper",
      "2 teaspoon cayenne pepper",
      "1 teaspoon onion powder"
    ],
    "step_by_step_instructions": [
      "Blend the spices together thoroughly.",
      "Rub the blended spices over the entire turkey, ensuring an even coating."
    ],
    "processed_ingredients": [
      "0.67 tablespoon kosher salt",
      "0.67 teaspoon garlic powder",
      "0.67 teaspoon white pepper",
      "0.33 teaspoon cayenne pepper",
      "0.17 teaspoon onion powder"
    ],
    "pure_ingredients": [
      "salt",
      "garlic powder",
      "white pepper",
      "cayenne pepper",
      "onion powder",
      "turkey"
    ],
    "cooking_time": "10 minutes",
    "required_tools": [
      "blender",
      "rubber gloves"
    ],
    "total_health_score": 4,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 1,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "HG4Bbcr8LJQF5TSyyG6l9KFWL3ex5MK",
    "recipe_title": "Pea Soup East African Style",
    "original_instructions": "In a large saucepan heat oil and saute onions and garlic until onions are translucent. Add ginger, salt, pepper, red pepper flakes, curry powder and saute for about 3 minutes, stirring constantly. Add tomatoes, squash, chicken or vegetable stock and deglaze pan. Bring to a boil, reduce heat and simmer, covered for 20 minutes. Add 2 cups of the peas and simmer, covered, for another 10 minutes or until peas and squash are tender. Using an immersion blender puree soup in pot. Add remaining peas and reheat. Stir in cilantro. Adjust seasoning. Serve hot.",
    "ingredients": [
      "2 tablespoons vegetable oil",
      "2 medium onions, chopped",
      "2 garlic cloves, minced",
      "1 teaspoon grated fresh ginger",
      "Salt and pepper to taste",
      "Hot red pepper flakes to taste, crumbled",
      "2 1/2 teaspoons mild curry powder",
      "4 plum tomatoes, chopped",
      "1/2 butternut squash, peeled, seeded, roughly chopped",
      "4 cups vegetable stock",
      "3 cups fresh green peas (or 1 pound frozen)",
      "1/4 cup cilantro leaves, chopped"
    ],
    "step_by_step_instructions": [
      "Heat 0.25 tablespoon of vegetable oil in a large saucepan.",
      "Saute 0.33 medium onion (chopped) and 0.33 garlic clove (minced) until the onion is translucent.",
      "Add 0.17 teaspoon of grated fresh ginger, salt, pepper, and red pepper flakes to taste, and 0.42 teaspoon of mild curry powder.",
      "Saute the mixture for about 3 minutes, stirring constantly.",
      "Add 0.67 plum tomato (chopped), 0.17 butternut squash (peeled, seeded, roughly chopped), and 1 cup of vegetable stock.",
      "Deglaze the pan by stirring to release any browned bits.",
      "Bring the mixture to a boil, then reduce the heat and simmer, covered, for 20 minutes.",
      "Add 0.67 cup of fresh green peas and simmer, covered, for another 10 minutes, or until the peas and squash are tender.",
      "Use an immersion blender to puree the soup in the pot.",
      "Add the remaining 0.33 cup of peas and reheat the soup.",
      "Stir in 0.03 cup of chopped cilantro.",
      "Adjust seasoning to taste and serve hot."
    ],
    "processed_ingredients": [
      "0.25 tablespoon vegetable oil",
      "0.33 medium onion",
      "0.33 clove garlic",
      "0.17 teaspoon ginger",
      "0.42 teaspoon curry powder",
      "0.67 plum tomato",
      "0.17 butternut squash",
      "1 cup vegetable stock",
      "1 cup fresh green peas",
      "0.03 cup cilantro leaves"
    ],
    "pure_ingredients": [
      "vegetable oil",
      "onion",
      "garlic",
      "ginger",
      "salt",
      "pepper",
      "red pepper flakes",
      "curry powder",
      "tomato",
      "butternut squash",
      "vegetable stock",
      "green peas",
      "cilantro"
    ],
    "cooking_time": "33 minutes",
    "required_tools": [
      "saucepan",
      "immersion blender"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "FDd60pzPX0okh8RO9DZ4y3o7qucRcaq",
    "recipe_title": "Ivan's Oysters",
    "original_instructions": "Reserve the oysters refrigerated until ready to open. Make the sauce by stirring together the vinegar, soy sauce, mirin, and leek. Open the oysters and arrange on a platter. Spoon about half a teaspoon of the sauce onto each oyster, and serve immediately.",
    "ingredients": [
      "24 oysters, refrigerated",
      "3 tablespoons rice vinegar",
      "1 tablespoon soy sauce",
      "2 teaspoons mirin",
      "2 tablespoons minced leek, pale green portion only"
    ],
    "step_by_step_instructions": [
      "Reserve 3 oysters refrigerated until ready to open.",
      "Make the sauce by stirring together 0.38 tablespoon rice vinegar, 0.13 tablespoon soy sauce, 0.08 teaspoon mirin, and 0.25 teaspoon minced leek.",
      "Open the oysters and arrange on a small platter.",
      "Spoon about 0.5 teaspoon of the sauce onto each oyster, and serve immediately."
    ],
    "processed_ingredients": [
      "3 oysters",
      "0.38 tablespoon rice vinegar",
      "0.13 tablespoon soy sauce",
      "0.08 teaspoon mirin",
      "0.25 teaspoon leek"
    ],
    "pure_ingredients": [
      "oysters",
      "rice vinegar",
      "soy sauce",
      "mirin",
      "leek"
    ],
    "cooking_time": "10 minutes",
    "required_tools": [
      "spoon",
      "platter"
    ],
    "total_health_score": 4,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 1,
      "Fats": 1,
      "Saturated Fats": 1,
      "Fibers": 0
    }
  },
  {
    "recipe_id": "6GGyu1nV43eFwWzETVkF93qrKtlGfpG",
    "recipe_title": "White Fish Fillets Amandine",
    "original_instructions": "Cut fillets into 6 portions. Combine flour, seasoned salt, and paprika; mix well. Roll fish in flour mixture. Place fish in a single layer, skin side down, in a well greased 15 by 10 by 1 inche baking pan. Drizzle 2 tablespoons melted butter over fish. Broil about 4 inches from source of heat about 10 minutes or until fish flakes easily when tested with a fork. While fish is broiling, saute almonds in remaining butter in a fry pan and allow to turn a golden brown, stirring constantly. Remove from heat. Add lemon juice, hot pepper sauce, parsley; mix. Pour over fish. Serve at once.",
    "ingredients": [
      "2 pounds skinless pollock fillets",
      "1/4 cup all-purpose flour",
      "1 teaspoon seasoned salt",
      "1 teaspoon paprika",
      "1/4 cup melted butter",
      "1/2 cup sliced almonds",
      "2 tablespoons fresly squeezed lemon juice",
      "4 to 5 drops liquid hot pepper sauce",
      "1 tablespoon chopped parsley leaves"
    ],
    "step_by_step_instructions": [
      "Cut approximately 0.33 pounds of pollock fillet into a single portion.",
      "Combine 0.02 cups of all-purpose flour, 0.15 teaspoons of seasoned salt, and 0.15 teaspoons of paprika; mix well.",
      "Roll the fish in the flour mixture.",
      "Place the fish in a single layer, skin side down, in a well-greased baking pan.",
      "Drizzle 0.03 cups of melted butter over the fish.",
      "Broil about 4 inches from the heat source for approximately 10 minutes or until the fish flakes easily when tested with a fork.",
      "While the fish is broiling, sauté 0.08 cups of sliced almonds in the remaining butter in a frying pan until golden brown, stirring constantly.",
      "Remove from heat and add 0.33 tablespoons of freshly squeezed lemon juice, 0.67 drops of liquid hot pepper sauce, and 0.17 tablespoons of chopped parsley; mix well.",
      "Pour the almond mixture over the fish.",
      "Serve immediately."
    ],
    "processed_ingredients": [
      "0.33 lb pollock fillet",
      "0.02 cup all-purpose flour",
      "0.15 tsp seasoned salt",
      "0.15 tsp paprika",
      "0.03 cup melted butter",
      "0.08 cup sliced almonds",
      "0.33 tbsp lemon juice",
      "0.67 drop hot pepper sauce",
      "0.17 tbsp chopped parsley"
    ],
    "pure_ingredients": [
      "pollock",
      "flour",
      "salt",
      "paprika",
      "butter",
      "almonds",
      "lemon",
      "hot pepper sauce",
      "parsley"
    ],
    "cooking_time": "10 minutes",
    "required_tools": [
      "baking pan",
      "frying pan",
      "fork"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 0,
      "Sodium": 0,
      "Fats": 1,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "Laqhhl3lAP7HipbLb4/BJfDFq4AK8Uu",
    "recipe_title": "Cajun Spice Mix ",
    "original_instructions": "Stir all ingredients in a small bowl to blend. DO AHEAD: Can be made 1 month ahead. Store airtight at room temperature.\nStir all ingredients in a small bowl to blend. DO AHEAD: Can be made 1 month ahead. Store airtight at room temperature.",
    "ingredients": [
      "5 tablespoons kosher salt",
      "2 tablespoons cayenne pepper",
      "2 tablespoons garlic powder",
      "2 tablespoons sweet paprika",
      "1 tablespoon dried oregano",
      "1 tablespoon dried thyme",
      "1 tablespoon freshly ground black pepper",
      "1 tablespoon onion powder"
    ],
    "step_by_step_instructions": [
      "Stir all ingredients in a small bowl to blend.",
      "Store airtight at room temperature."
    ],
    "processed_ingredients": [
      "0.83 tbsp kosher salt",
      "0.33 tbsp cayenne pepper",
      "0.33 tbsp garlic powder",
      "0.33 tbsp sweet paprika",
      "0.17 tbsp dried oregano",
      "0.17 tbsp dried thyme",
      "0.17 tbsp freshly ground black pepper",
      "0.17 tbsp onion powder"
    ],
    "pure_ingredients": [
      "salt",
      "cayenne pepper",
      "garlic powder",
      "paprika",
      "oregano",
      "thyme",
      "black pepper",
      "onion powder"
    ],
    "cooking_time": "5 minutes",
    "required_tools": [
      "small bowl",
      "airtight container"
    ],
    "total_health_score": 4,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 1,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "pmuvBYp8iLlHqFBx5kgRNmyfmyBLSUK",
    "recipe_title": "Cheeseburger Pasta",
    "original_instructions": "Cook the beef in a 10-inch skillet over medium-high heat until well browned, stirring often to separate meat. Pour off any fat.\nStir the soups, water and pasta in the skillet and heat to a boil. Reduce the heat to medium. Cook for 10 minutes or until the pasta is tender, stirring often.\nServing Suggestion: Serve with carrot & celery sticks with ranch dressing for dipping. For dessert serve store-bought brownies topped with vanilla ice cream.\nCost per recipe: $7.23",
    "ingredients": [
      "1 pound ground beef",
      "1 can (10 3/4 ounces) Campbell's Condensed Cheddar Cheese Soup",
      "1 can (10 3/4 ounces) Campbell's Condensed Tomato Soup (Regular or Healthy Request)",
      "1 1/2 cups water",
      "2 cups uncooked medium shell-shaped pasta"
    ],
    "step_by_step_instructions": [
      "Cook approximately 0.25 pound of ground beef in a skillet over medium-high heat until well browned, stirring often to separate meat.",
      "Pour off any fat from the beef.",
      "Stir approximately 0.25 can (2.69 ounces) of condensed cheddar cheese soup, 0.25 can (2.69 ounces) of condensed tomato soup, 0.375 cups of water, and 0.5 cups of uncooked pasta into the skillet.",
      "Heat the mixture to a boil.",
      "Reduce the heat to medium and cook for about 10 minutes or until the pasta is tender, stirring often."
    ],
    "processed_ingredients": [
      "0.25 lb ground beef",
      "2.69 oz condensed cheddar cheese soup",
      "2.69 oz condensed tomato soup",
      "0.38 cup water",
      "0.50 cup uncooked shell-shaped pasta"
    ],
    "pure_ingredients": [
      "beef",
      "cheddar cheese",
      "tomato",
      "water",
      "pasta"
    ],
    "cooking_time": "20 minutes",
    "required_tools": [
      "skillet",
      "stirring spoon"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 0,
      "Sodium": 1,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  },
  {
    "recipe_id": "kZrPKvwCHEqKJuaK8hwtugCZrN0NleK",
    "recipe_title": "Brown Rice with Hazelnuts",
    "original_instructions": "Toast nuts in a small pan over low heat then remove from heat and reserve.\nBring 3 cups stock and 2 tablespoons butter to a boil. Add rice, stir, then return to boil, cover and reduce heat. Simmer rice 17 to18 minutes, until tender and liquid is absorbed. Remove from heat. Add nuts and parsley as you fluff rice with fork. Transfer to serving dish.",
    "ingredients": [
      "1 cup chopped hazelnuts (recommended: Diamond) available on baking aisle",
      "3 cups chicken stock",
      "2 tablespoons butter or extra-virgin olive oil",
      "1 1/2 cups brown rice (recommended: Uncle Ben?s or Near East)",
      "2 tablespoons chopped flat-leaf parsley"
    ],
    "step_by_step_instructions": [
      "Toast 0.25 cup chopped hazelnuts in a small pan over low heat, then remove from heat and reserve.",
      "Bring 0.75 cup chicken stock and 0.5 tablespoon butter to a boil.",
      "Add 0.375 cup brown rice, stir, then return to a boil.",
      "Cover and reduce heat, then simmer rice for 17 to 18 minutes, until tender and liquid is absorbed.",
      "Remove from heat and add the toasted nuts and 0.5 tablespoon chopped flat-leaf parsley as you fluff the rice with a fork.",
      "Transfer to a serving dish."
    ],
    "processed_ingredients": [
      "0.25 cup chopped hazelnuts",
      "0.75 cup chicken stock",
      "0.5 tablespoon butter",
      "0.375 cup brown rice",
      "0.5 tablespoon chopped flat-leaf parsley"
    ],
    "pure_ingredients": [
      "hazelnuts",
      "chicken stock",
      "butter",
      "brown rice",
      "flat-leaf parsley"
    ],
    "cooking_time": "18 minutes",
    "required_tools": [
      "small pan",
      "pot with lid",
      "fork",
      "serving dish"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 1,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 0
    }
  },
  {
    "recipe_id": "VR6RdW6c9t.1Zf16cob2Dr66YLp4fmm",
    "recipe_title": "Not-Just-For-Breakfast Smashbrowns",
    "original_instructions": "Boil potatoes. Drain water. In a bowl, add the potatoes and garlic cloves and mash. Keep potatoes a little chunky to add texture. Season with salt and pepper. Heat the vegetable oil on medium heat in a frying pan. Cook the shallots until translucent, about 5 minutes. Add the shallots to the smashed potatoes. Add the smashed potatoes to a pan, sprinkle with salt and pepper and fry. Using a spatula flip the potatoes constantly to allow them to crisp up and turn golden brown, about 5 minutes.",
    "ingredients": [
      "2 to 3 Yukon gold potatoes",
      "4 cloves garlic",
      "2 shallots, thinly sliced",
      "2 tablespoons vegetable oil",
      "Salt and freshly ground black pepper"
    ],
    "step_by_step_instructions": [
      "Boil approximately 1 potato until tender.",
      "Drain the water from the pot.",
      "In a bowl, add the boiled potato and 1 to 2 cloves of garlic, then mash together while keeping the potatoes a bit chunky.",
      "Season the mashed mixture with salt and pepper.",
      "Heat 2 teaspoons of vegetable oil on medium heat in a frying pan.",
      "Cook 1 shallot, thinly sliced, in the pan until translucent, about 5 minutes.",
      "Add the cooked shallots to the bowl with the mashed potatoes.",
      "Add the mashed potato mixture back to the frying pan, sprinkle with more salt and pepper if desired, and fry.",
      "Using a spatula, flip the potatoes constantly to allow them to crisp up and turn golden brown, about 5 minutes."
    ],
    "processed_ingredients": [
      "0.75 lb potato",
      "1.50 cloves garlic",
      "1 shallot",
      "2.00 tsp vegetable oil",
      "0.25 tsp salt",
      "0.25 tsp black pepper"
    ],
    "pure_ingredients": [
      "potato",
      "garlic",
      "shallot",
      "vegetable oil",
      "salt",
      "black pepper"
    ],
    "cooking_time": "25 minutes",
    "required_tools": [
      "pot",
      "bowl",
      "frying pan",
      "spatula"
    ],
    "total_health_score": 3,
    "summary_of_points": {
      "Proteins": 0,
      "Carbohydrates": 0,
      "Sugars": 1,
      "Sodium": 0,
      "Fats": 0,
      "Saturated Fats": 1,
      "Fibers": 1
    }
  }
]