[
    {
        "recipe_id": "o9BQwwhMUJp8kuYr/PGnSDp9QRLf5CK",
        "recipe_title": "Zucchini Muffins ",
        "original_instructions": "1. Preheat oven to 350°F. 2. In a large bowl, whisk together the eggs, brown sugar, and vanilla. Stir in the grated zucchini, canola oil, baking soda, and salt. 3. In a separate bowl, whisk the flour with the cinnamon and nutmeg. Add the dry ingredients to the zucchini mix and stir well. Finally, stir in the pecans and raisins. 4. Grease a 12-cup muffin tin with canola oil. Spoon the batter into the cups to fill them about 3/4 of the way. Bake for 25 to 30 minutes or until a toothpick or small knife inserted in a muffin comes out clean. (Alternatively, spoon the batter into a 8 x 5 x 3-inch loaf pan. Bake for 50 to 55 minutes or until the top of the loaf cracks and a toothpick or small knife inserted in the center of the loaf comes out clean.) 5. Transfer the pan to a wire rack to cool for about 20 minutes. Then run a small paring knife around each muffin and remove them from the muffin tin.\n1. Preheat oven to 350°F.\n2. In a large bowl, whisk together the eggs, brown sugar, and vanilla. Stir in the grated zucchini, canola oil, baking soda, and salt.\n3. In a separate bowl, whisk the flour with the cinnamon and nutmeg. Add the dry ingredients to the zucchini mix and stir well. Finally, stir in the pecans and raisins.\n4. Grease a 12-cup muffin tin with canola oil. Spoon the batter into the cups to fill them about 3/4 of the way. Bake for 25 to 30 minutes or until a toothpick or small knife inserted in a muffin comes out clean. (Alternatively, spoon the batter into a 8 x 5 x 3-inch loaf pan. Bake for 50 to 55 minutes or until the top of the loaf cracks and a toothpick or small knife inserted in the center of the loaf comes out clean.)\n5. Transfer the pan to a wire rack to cool for about 20 minutes. Then run a small paring knife around each muffin and remove them from the muffin tin.",
        "ingredients": [
            "2 large eggs, preferably omega-3 eggs, beaten",
            "1/3 cup packed light brown sugar",
            "2 teaspoons pure vanilla extract",
            "3 cups grated fresh zucchini",
            "2/3 cup canola oil, preferably expeller-pressed, plus more for greasing the muffin tins",
            "2 teaspoons baking soda",
            "1/2 teaspoon salt",
            "3 cups unbleached all-purpose flour",
            "2 teaspoons ground cinnamon",
            "1/2 teaspoon ground nutmeg",
            "1 cup chopped pecans",
            "1 cup golden raisins"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350°F.",
            "In a large bowl, whisk together approximately 0.33 of an egg, 0.06 cup of light brown sugar, and 0.33 teaspoon of vanilla.",
            "Stir in about 0.5 cup of grated zucchini, 0.11 cup of canola oil, 0.33 teaspoon of baking soda, and 0.08 teaspoon of salt.",
            "In a separate bowl, whisk 0.5 cup of flour with 0.33 teaspoon of cinnamon and 0.08 teaspoon of nutmeg.",
            "Add the dry ingredients to the zucchini mixture and stir well.",
            "Finally, stir in 0.17 cup of chopped pecans and 0.17 cup of golden raisins.",
            "Grease one muffin cup with canola oil.",
            "Spoon the batter into the cup to fill it about 3/4 of the way.",
            "Bake for about 25 to 30 minutes or until a toothpick inserted in the muffin comes out clean.",
            "Transfer the muffin tin to a wire rack to cool for about 20 minutes.",
            "Run a small paring knife around the muffin and remove it from the tin."
        ],
        "processed_ingredients": [
            "0.33 egg",
            "0.06 cup light brown sugar",
            "0.33 teaspoon vanilla extract",
            "0.5 cup grated zucchini",
            "0.11 cup canola oil",
            "0.33 teaspoon baking soda",
            "0.08 teaspoon salt",
            "0.5 cup all-purpose flour",
            "0.33 teaspoon ground cinnamon",
            "0.08 teaspoon ground nutmeg",
            "0.17 cup chopped pecans",
            "0.17 cup golden raisins"
        ],
        "pure_ingredients": [
            "eggs",
            "brown sugar",
            "vanilla",
            "zucchini",
            "canola oil",
            "baking soda",
            "salt",
            "flour",
            "cinnamon",
            "nutmeg",
            "pecans",
            "raisins"
        ],
        "cooking_time": "50 minutes",
        "required_tools": [
            "oven",
            "large bowl",
            "whisk",
            "separate bowl",
            "muffin tin",
            "wire rack",
            "paring knife"
        ]
    },
    {
        "recipe_id": "8w5X0Vlrd9b5RZ716pw2GmmQzWbqTpi",
        "recipe_title": "New England Clam Chowder ",
        "original_instructions": "Bring clams and 4 cups water to a boil in a large pot over high heat. Cook until clams just open, 8-10 minutes (discard any that do not open). Using a large slotted spoon, transfer clams to a large rimmed baking sheet; set broth aside. Let clams cool slightly, then pull meat from shells; discard shells. Chop clams into bite-size pieces. Strain broth through a fine-mesh sieve set over a large bowl. Add water if needed to measure 6 cups. DO AHEAD: Clams and broth can be made 1 day ahead. Cover separately and chill. Melt butter in a large heavy pot over medium heat. Add bacon and cook, stirring occasionally, until fat is rendered and bacon begins to brown, about 8 minutes. Add celery, onion, and garlic and cook, stirring often, until onion is translucent, about 10 minutes. Add reserved broth (or 6 cups bottled clam juice), potatoes, thyme, and bay leaf. Bring chowder base to a simmer; cook until potatoes are tender, 20-25 minutes. Stir cornstarch and 2 Tbsp. water in a small bowl to form a slurry. Stir slurry into chowder base; return to a boil to thicken. DO AHEAD: Base can be made 1 day ahead. Let cool; cover and chill. Keep clams chilled. Bring base to a simmer before continuing. Remove base from heat. Discard bay leaf. Stir in reserved clams (or two 10-ounce cans baby clams) and cream. Season with salt, if needed (clams' brininess varies), and pepper. Divide chowder among bowls. Garnish with chives and oyster crackers.\nBring clams and 4 cups water to a boil in a large pot over high heat. Cook until clams just open, 8-10 minutes (discard any that do not open). Using a large slotted spoon, transfer clams to a large rimmed baking sheet; set broth aside. Let clams cool slightly, then pull meat from shells; discard shells.\nChop clams into bite-size pieces. Strain broth through a fine-mesh sieve set over a large bowl. Add water if needed to measure 6 cups. DO AHEAD: Clams and broth can be made 1 day ahead. Cover separately and chill.\nMelt butter in a large heavy pot over medium heat. Add bacon and cook, stirring occasionally, until fat is rendered and bacon begins to brown, about 8 minutes. Add celery, onion, and garlic and cook, stirring often, until onion is translucent, about 10 minutes. Add reserved broth (or 6 cups bottled clam juice), potatoes, thyme, and bay leaf. Bring chowder base to a simmer; cook until potatoes are tender, 20-25 minutes. Stir cornstarch and 2 Tbsp. water in a small bowl to form a slurry. Stir slurry into chowder base; return to a boil to thicken. DO AHEAD: Base can be made 1 day ahead. Let cool; cover and chill. Keep clams chilled. Bring base to a simmer before continuing.\nRemove base from heat. Discard bay leaf. Stir in reserved clams (or two 10-ounce cans baby clams) and cream. Season with salt, if needed (clams' brininess varies), and pepper.\nDivide chowder among bowls. Garnish with chives and oyster crackers.",
        "ingredients": [
            "8 pounds cherrystone clams, scrubbed",
            "1 tablespoon unsalted butter",
            "8 ounces bacon, cut into 1/2\" pieces",
            "2 celery stalks, minced",
            "1 large onion, minced",
            "1 garlic clove, minced",
            "2 1/2 pound Yukon Gold potatoes, peeled, cut into 1/2\" pieces",
            "1 tablespoon chopped fresh thyme",
            "1 bay leaf",
            "2 tablespoons cornstarch",
            "2 cups heavy cream",
            "Kosher salt, freshly ground pepper",
            "1 freshly ground pepper",
            "Chopped fresh chives",
            "Oyster crackers or Vermont Common Crackers"
        ],
        "step_by_step_instructions": [
            "Bring 0.5 pounds of cherrystone clams and 0.5 cups of water to a boil in a large pot over high heat.",
            "Cook until clams just open, about 8-10 minutes, discarding any that do not open.",
            "Using a large slotted spoon, transfer clams to a large rimmed baking sheet; set broth aside.",
            "Let clams cool slightly, then pull meat from shells and discard shells.",
            "Chop clams into bite-size pieces.",
            "Strain broth through a fine-mesh sieve set over a large bowl. Add water if needed to measure 0.75 cups.",
            "Melt 0.06 tablespoons of unsalted butter in a large heavy pot over medium heat.",
            "Add 0.5 ounces of bacon, cut into 1/2\" pieces, and cook, stirring occasionally, until fat is rendered and bacon begins to brown, about 8 minutes.",
            "Add 0.25 minced celery stalks, 0.125 minced large onion, and 0.125 minced garlic clove and cook, stirring often, until onion is translucent, about 10 minutes.",
            "Add reserved broth, 0.31 pounds of Yukon Gold potatoes, peeled, cut into 1/2\" pieces, 0.06 tablespoons of chopped fresh thyme, and 0.125 bay leaf.",
            "Bring chowder base to a simmer and cook until potatoes are tender, 20-25 minutes.",
            "Stir 0.13 tablespoons of cornstarch and 0.13 tablespoons of water in a small bowl to form a slurry.",
            "Stir slurry into chowder base; return to a boil to thicken.",
            "Remove base from heat and discard bay leaf.",
            "Stir in reserved clams and 0.25 cups of heavy cream.",
            "Season with kosher salt and freshly ground pepper to taste.",
            "Divide chowder among bowls.",
            "Garnish with chopped fresh chives and oyster crackers."
        ],
        "processed_ingredients": [
            "0.5 pounds cherrystone clams",
            "0.06 tablespoons unsalted butter",
            "0.5 ounces bacon",
            "0.25 stalks celery",
            "0.125 large onion",
            "0.125 clove garlic",
            "0.31 pounds Yukon Gold potatoes",
            "0.06 tablespoons fresh thyme",
            "0.125 bay leaf",
            "0.13 tablespoons cornstarch",
            "0.25 cups heavy cream",
            "0.13 tablespoons kosher salt",
            "0.13 tablespoons freshly ground pepper",
            "0.13 tablespoons chopped fresh chives",
            "0.13 cups oyster crackers"
        ],
        "pure_ingredients": [
            "cherrystone clams",
            "butter",
            "bacon",
            "celery",
            "onion",
            "garlic",
            "potatoes",
            "thyme",
            "bay leaf",
            "cornstarch",
            "heavy cream",
            "salt",
            "pepper",
            "chives",
            "water",
            "crackers"
        ],
        "cooking_time": "85 minutes",
        "required_tools": [
            "large pot",
            "large slotted spoon",
            "large rimmed baking sheet",
            "fine-mesh sieve",
            "large bowl",
            "small bowl"
        ]
    },
    {
        "recipe_id": "jQz1aYn3ByYEgSVYsSqI2G2YzG2ovMS",
        "recipe_title": "Tuscan-Style Peppered Chicken ",
        "original_instructions": "Rub each chicken half all over with 2 tablespoons oil, then 1 1/2 teaspoons pepper. Sprinkle generously with salt. Let stand at room temperature 1 hour. Preheat broiler. Arrange chicken, skin side down, on broiler pan. Watching closely to avoid burning, broil chicken 5 to 6 inches from heat source until golden brown, about 12 minutes. Remove broiler pan from oven. Using tongs, transfer chicken to plate. Pour off any pan drippings. Return chicken, skin side up, to broiler pan. Broil until skin is crisp and golden brown, about 5 minutes. Turn chicken over, skin side down again, and broil until cooked through, about 8 minutes longer. Transfer chicken to platter; let stand 5 minutes. Serve with lemon wedges to squeeze over\nRub each chicken half all over with 2 tablespoons oil, then 1 1/2 teaspoons pepper. Sprinkle generously with salt. Let stand at room temperature 1 hour.\nPreheat broiler. Arrange chicken, skin side down, on broiler pan. Watching closely to avoid burning, broil chicken 5 to 6 inches from heat source until golden brown, about 12 minutes. Remove broiler pan from oven. Using tongs, transfer chicken to plate. Pour off any pan drippings. Return chicken, skin side up, to broiler pan. Broil until skin is crisp and golden brown, about 5 minutes. Turn chicken over, skin side down again, and broil until cooked through, about 8 minutes longer. Transfer chicken to platter; let stand 5 minutes. Serve with lemon wedges to squeeze over",
        "ingredients": [
            "2 3 1/2-pound chickens, halved, backbones removed, excess fat trimmed",
            "8 tablespoons olive oil (preferably extra-virgin)",
            "2 tablespoons coarsely ground black pepper",
            "Lemon wedges"
        ],
        "step_by_step_instructions": [
            "Rub each chicken half all over with 1 tablespoon of oil and 0.38 teaspoon of pepper.",
            "Sprinkle generously with salt.",
            "Let stand at room temperature for 1 hour.",
            "Preheat broiler.",
            "Arrange chicken, skin side down, on broiler pan.",
            "Broil chicken 5 to 6 inches from heat source until golden brown, about 12 minutes.",
            "Remove broiler pan from oven.",
            "Using tongs, transfer chicken to plate.",
            "Pour off any pan drippings.",
            "Return chicken, skin side up, to broiler pan.",
            "Broil until skin is crisp and golden brown, about 5 minutes.",
            "Turn chicken over, skin side down again, and broil until cooked through, about 8 minutes longer.",
            "Transfer chicken to platter; let stand 5 minutes.",
            "Serve with lemon wedges to squeeze over."
        ],
        "processed_ingredients": [
            "0.88 lb chicken",
            "1 tablespoon olive oil",
            "0.38 teaspoon black pepper",
            "1 lemon wedge"
        ],
        "pure_ingredients": [
            "chicken",
            "olive oil",
            "black pepper",
            "lemon",
            "salt"
        ],
        "cooking_time": "86 minutes",
        "required_tools": [
            "broiler",
            "broiler pan",
            "tongs",
            "plate",
            "platter"
        ]
    },
    {
        "recipe_id": "P0klvbgNaGkCrHA1cU/Qr0P4.ep8fWa",
        "recipe_title": "Fettuccine With Shiitakes and Asparagus ",
        "original_instructions": "Heat 2 tablespoons oil in a large skillet over medium-high heat. Add asparagus, season with salt and pepper, and cook, stirring occasionally, until just tender, about 4 minutes. Transfer to a plate. Heat butter and remaining 1 tablespoon oil in same skillet over medium-high heat. Add mushrooms, season with salt and pepper, and cook, tossing often, until tender, about 5 minutes. Add shallot and cook, tossing occasionally, until softened, about 2 minutes. Toss in oregano, thyme, and asparagus. Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid. Add pasta, 1/2 cup pasta cooking liquid, and 3 ounces Parmesan to skillet. Cook, tossing and adding more pasta cooking liquid as needed, until sauce coats pasta, about 2 minutes; season with salt and pepper. Divide pasta among plates and top each with a yolk and more Parmesan.\nHeat 2 tablespoons oil in a large skillet over medium-high heat. Add asparagus, season with salt and pepper, and cook, stirring occasionally, until just tender, about 4 minutes. Transfer to a plate.\nHeat butter and remaining 1 tablespoon oil in same skillet over medium-high heat. Add mushrooms, season with salt and pepper, and cook, tossing often, until tender, about 5 minutes. Add shallot and cook, tossing occasionally, until softened, about 2 minutes. Toss in oregano, thyme, and asparagus.\nMeanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.\nAdd pasta, 1/2 cup pasta cooking liquid, and 3 ounces Parmesan to skillet. Cook, tossing and adding more pasta cooking liquid as needed, until sauce coats pasta, about 2 minutes; season with salt and pepper.\nDivide pasta among plates and top each with a yolk and more Parmesan.",
        "ingredients": [
            "3 tablespoons olive oil, divided",
            "1 bunch asparagus, trimmed, cut into 2\" pieces",
            "Kosher salt, freshly ground pepper",
            "2 tablespoons unsalted butter",
            "8 ounces shiitake mushrooms, stems removed, caps sliced",
            "1 small shallot, finely chopped",
            "1 teaspoon chopped fresh oregano",
            "1 teaspoon chopped fresh thyme",
            "12 ounces dried or 1 pound fresh fettuccine",
            "3 ounces Parmesan, grated (about 3/4 cup), plus more for serving",
            "4 large egg yolks*"
        ],
        "step_by_step_instructions": [
            "Heat 0.67 tablespoon olive oil in a large skillet over medium-high heat.",
            "Add 2 ounces asparagus, season with salt and pepper, and cook, stirring occasionally, until just tender, about 4 minutes.",
            "Transfer asparagus to a plate.",
            "Heat 0.67 tablespoon butter and 0.33 tablespoon olive oil in the same skillet over medium-high heat.",
            "Add 2 ounces shiitake mushrooms, season with salt and pepper, and cook, tossing often, until tender, about 5 minutes.",
            "Add 0.25 small shallot and cook, tossing occasionally, until softened, about 2 minutes.",
            "Toss in 0.33 teaspoon fresh oregano, 0.33 teaspoon fresh thyme, and the cooked asparagus.",
            "Meanwhile, cook 3 ounces fettuccine in a large pot of boiling salted water, stirring occasionally, until al dente.",
            "Drain the pasta, reserving 0.25 cup pasta cooking liquid.",
            "Add pasta, 0.17 cup pasta cooking liquid, and 1 ounce Parmesan to the skillet.",
            "Cook, tossing and adding more pasta cooking liquid as needed, until sauce coats pasta, about 2 minutes; season with salt and pepper.",
            "Divide pasta among plates and top each with 1 egg yolk and more Parmesan."
        ],
        "processed_ingredients": [
            "0.67 tablespoon olive oil",
            "2 ounces asparagus",
            "0.67 tablespoon unsalted butter",
            "2 ounces shiitake mushrooms",
            "0.25 small shallot",
            "0.33 teaspoon fresh oregano",
            "0.33 teaspoon fresh thyme",
            "3 ounces fettuccine",
            "1 ounce Parmesan",
            "1 egg yolk"
        ],
        "pure_ingredients": [
            "olive oil",
            "asparagus",
            "salt",
            "pepper",
            "butter",
            "shiitake mushrooms",
            "shallot",
            "oregano",
            "thyme",
            "fettuccine",
            "Parmesan",
            "egg yolks"
        ],
        "cooking_time": "21 minutes",
        "required_tools": [
            "large skillet",
            "plate",
            "large pot",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "NTq0m53xDjMmqTvF8j2atHs//EpwzFi",
        "recipe_title": "Toasted Orzo with Peas, Onion and Bacon ",
        "original_instructions": "Heat large nonstick skillet over medium heat. Add orzo and stir until beginning to color, about 10 minutes. Transfer orzo to small bowl. Add onion and bacon to same skillet. Sauté until bacon browns and onion is tender, about 15 minutes. Add 3 1/4 cups broth and orzo and bring to boil. Reduce heat to medium-low, cover and simmer until broth is absorbed and orzo is tender, about 18 minutes. Mix in peas. Add more broth if mixture is dry. Cover and cook until peas are just warmed through, about 2 minutes. Season to taste with salt and pepper and serve.\nHeat large nonstick skillet over medium heat. Add orzo and stir until beginning to color, about 10 minutes. Transfer orzo to small bowl. Add onion and bacon to same skillet. Sauté until bacon browns and onion is tender, about 15 minutes. Add 3 1/4 cups broth and orzo and bring to boil. Reduce heat to medium-low, cover and simmer until broth is absorbed and orzo is tender, about 18 minutes. Mix in peas. Add more broth if mixture is dry. Cover and cook until peas are just warmed through, about 2 minutes. Season to taste with salt and pepper and serve.",
        "ingredients": [
            "1 1/2 cups orzo (rice-shaped pasta)",
            "1 1/4 cups chopped onion",
            "5 bacon slices, chopped",
            "3 1/4 cups (or more) canned low-salt chicken broth",
            "1 1/2 cups frozen peas, thawed"
        ],
        "step_by_step_instructions": [
            "Heat a nonstick skillet over medium heat.",
            "Add approximately 0.25 cups of orzo and stir until beginning to color, about 10 minutes.",
            "Transfer orzo to a small bowl.",
            "Add about 0.31 cups of chopped onion and 1 slice of chopped bacon to the same skillet.",
            "Sauté until bacon browns and onion is tender, about 15 minutes.",
            "Add 0.54 cups of chicken broth and the orzo to the skillet and bring to a boil.",
            "Reduce heat to medium-low, cover, and simmer until broth is absorbed and orzo is tender, about 18 minutes.",
            "Mix in approximately 0.25 cups of thawed peas.",
            "Add more broth if mixture is dry.",
            "Cover and cook until peas are just warmed through, about 2 minutes.",
            "Season to taste with salt and pepper, then serve."
        ],
        "processed_ingredients": [
            "0.25 cups orzo",
            "0.31 cups onion",
            "1 slice bacon",
            "0.54 cups chicken broth",
            "0.25 cups peas"
        ],
        "pure_ingredients": [
            "orzo",
            "onion",
            "bacon",
            "chicken broth",
            "peas",
            "salt",
            "pepper"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "nonstick skillet",
            "small bowl",
            "spoon"
        ]
    },
    {
        "recipe_id": "kXna3zeOyzBBKAUdLZZP5F5ST3PA1pS",
        "recipe_title": "Coconut Shrimp with Tropical Rice",
        "original_instructions": "Preheat the oven to 425 degrees F. Line a rimmed baking sheet with foil and set a wire rack on top; coat with cooking spray. Combine 1 cup water, the coconut water, rice and lime zest in a medium saucepan and bring to a boil. Reduce the heat to medium low; cover and simmer 8 minutes. Remove from the heat; add the carrots, red onion, 1/4 teaspoon salt and a few grinds of pepper (do not stir). Cover and let sit 10 minutes, then fluff with a fork to combine. Discard the lime zest.\nMeanwhile, season the shrimp with salt and pepper. Beat the egg and 2 tablespoons water in a bowl. Combine the coconut and panko in another bowl. Dip the shrimp in the egg mixture, then the coconut-panko mixture, gently pressing to adhere; transfer to the prepared rack. Bake until the shrimp are cooked through, about 10 minutes.\nTurn on the broiler. Broil the shrimp until golden brown, 1 to 2 minutes. Add the cilantro to the rice mixture and toss. Serve with the shrimp and lime wedges.\nPhotograph by Charles Masters",
        "ingredients": [
            "Cooking spray",
            "3/4 cup coconut water",
            "3/4 cup jasmati or other long-grain rice",
            "Zest of 1 lime (removed with a vegetable peeler), plus wedges for serving",
            "1/2 cup shredded carrots",
            "2 tablespoons finely chopped red onion or scallions",
            "Kosher salt and freshly ground pepper",
            "1 pound large shrimp, peeled and deveined",
            "1 large egg",
            "1 cup sweetened shredded coconut",
            "3/4 cup panko breadcrumbs",
            "2 tablespoons chopped fresh cilantro"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 425 degrees F.",
            "Line a rimmed baking sheet with foil and set a wire rack on top; coat with cooking spray.",
            "Combine 0.13 cups water, 0.13 cups coconut water, 0.13 cups rice, and zest from a small piece of lime in a medium saucepan and bring to a boil.",
            "Reduce the heat to medium low; cover and simmer for 8 minutes.",
            "Remove from the heat; add 0.08 cups shredded carrots, 0.03 cups finely chopped red onion, 0.04 tsp salt, and a few grinds of pepper without stirring.",
            "Cover and let sit for 10 minutes, then fluff with a fork to combine. Discard the lime zest.",
            "Meanwhile, season 0.17 pounds of shrimp with salt and pepper.",
            "Beat 0.25 large egg and 0.33 tablespoons water in a bowl.",
            "Combine 0.17 cups sweetened shredded coconut and 0.13 cups panko breadcrumbs in another bowl.",
            "Dip the shrimp in the egg mixture, then the coconut-panko mixture, gently pressing to adhere; transfer to the prepared rack.",
            "Bake until the shrimp are cooked through, about 10 minutes.",
            "Turn on the broiler. Broil the shrimp until golden brown, 1 to 2 minutes.",
            "Add 0.33 tablespoons chopped cilantro to the rice mixture and toss.",
            "Serve with the shrimp and a lime wedge."
        ],
        "processed_ingredients": [
            "0.08 cup coconut water",
            "0.13 cup rice",
            "0.08 piece lime",
            "0.08 cup shredded carrots",
            "0.03 cup red onion",
            "0.04 tsp salt",
            "0.17 lb shrimp",
            "0.25 large egg",
            "0.17 cup sweetened shredded coconut",
            "0.13 cup panko breadcrumbs",
            "0.33 tbsp chopped fresh cilantro",
            "0.33 tbsp water",
            "0.04 tsp pepper"
        ],
        "pure_ingredients": [
            "cooking spray",
            "water",
            "coconut water",
            "rice",
            "lime",
            "carrots",
            "red onion",
            "salt",
            "pepper",
            "shrimp",
            "egg",
            "sweetened shredded coconut",
            "panko breadcrumbs",
            "cilantro"
        ],
        "cooking_time": "32 minutes",
        "required_tools": [
            "oven",
            "rimmed baking sheet",
            "foil",
            "wire rack",
            "cooking spray",
            "medium saucepan",
            "fork",
            "bowls",
            "broiler"
        ]
    },
    {
        "recipe_id": "QrafNk9WSR6R9DONkk3tY0JDW06uMSW",
        "recipe_title": "Rosemary, Lemon, and Garlic Leg of Lamb with Roasted Potatoes ",
        "original_instructions": "Preheat oven to 350°F. Cut off and discard pith from zested lemon and cut off and discard zest and pith from other lemon. In a saucepan of boiling water blanch zest 1 minute and drain in a colander. Cut each lemon crosswise into 6 slices. In a small food processor blend rosemary, garlic, zest, 1 tablespoon oil, lemon juice, and salt until mixture is chopped fine. With tip of a small sharp knife cut small slits all over lamb and rub rosemary mixture over lamb, rubbing into slits. Arrange lemon slices in middle of a large roasting pan and arrange lamb on them. Roast lamb in middle of oven 45 minutes. Quarter potatoes and in a saucepan cover with salted cold water by 1 inch. Bring water to a boil and cook potatoes, covered, 5 minutes. Drain potatoes in colander and in a bowl toss with remaining tablespoon oil. Arrange potatoes around lamb and sprinkle with salt and pepper to taste. Roast lamb and potatoes, stirring potatoes occasionally, 55 minutes, or until a meat thermometer registers 140°F. for medium-rare. Transfer lamb to a cutting board and let stand 15 minutes. Increase temperature to 500°F. and roast potatoes and lemons in one layer 5 to 10 minutes more, or until golden. Transfer potatoes and lemons with a slotted spoon to bowl and toss with chives. Transfer potato mixture to a platter. Serve lamb, sliced thin across grain, with potatoes, garnished with rosemary and lemon wedges.\nPreheat oven to 350°F.\nCut off and discard pith from zested lemon and cut off and discard zest and pith from other lemon. In a saucepan of boiling water blanch zest 1 minute and drain in a colander. Cut each lemon crosswise into 6 slices.\nIn a small food processor blend rosemary, garlic, zest, 1 tablespoon oil, lemon juice, and salt until mixture is chopped fine.\nWith tip of a small sharp knife cut small slits all over lamb and rub rosemary mixture over lamb, rubbing into slits. Arrange lemon slices in middle of a large roasting pan and arrange lamb on them. Roast lamb in middle of oven 45 minutes.\nQuarter potatoes and in a saucepan cover with salted cold water by 1 inch. Bring water to a boil and cook potatoes, covered, 5 minutes. Drain potatoes in colander and in a bowl toss with remaining tablespoon oil. Arrange potatoes around lamb and sprinkle with salt and pepper to taste.\nRoast lamb and potatoes, stirring potatoes occasionally, 55 minutes, or until a meat thermometer registers 140°F. for medium-rare. Transfer lamb to a cutting board and let stand 15 minutes. Increase temperature to 500°F. and roast potatoes and lemons in one layer 5 to 10 minutes more, or until golden. Transfer potatoes and lemons with a slotted spoon to bowl and toss with chives. Transfer potato mixture to a platter.\nServe lamb, sliced thin across grain, with potatoes, garnished with rosemary and lemon wedges.",
        "ingredients": [
            "2 large lemons, zest of 1 removed in strips with a vegetable peeler",
            "1/4 cup fresh rosemary leaves",
            "3 large garlic cloves",
            "2 tablespoons olive oil",
            "2 teaspoons fresh lemon juice",
            "1/2 teaspoon salt",
            "a 7-pound leg of lamb (ask butcher to remove pelvic bone and tie lamb for easier carving)",
            "2 1/2 pounds small red potatoes",
            "3 tablespoons minced fresh chives",
            "Garnish: fresh rosemary sprigs and lemon wedges"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350°F.",
            "Cut off and discard pith from zested lemon and cut off and discard zest and pith from other lemon.",
            "In a saucepan of boiling water, blanch zest 1 minute and drain in a colander.",
            "Cut each lemon crosswise into 6 slices.",
            "In a small food processor, blend rosemary, garlic, zest, 0.17 tablespoon oil, lemon juice, and salt until mixture is chopped fine.",
            "With the tip of a small sharp knife, cut small slits all over 1 pound of lamb.",
            "Rub rosemary mixture over lamb, rubbing into slits.",
            "Arrange 2 lemon slices in the middle of a large roasting pan and arrange lamb on them.",
            "Roast lamb in the middle of the oven for 45 minutes.",
            "Quarter 0.36 pounds of potatoes and in a saucepan cover with salted cold water by 1 inch.",
            "Bring water to a boil and cook potatoes, covered, for 5 minutes.",
            "Drain potatoes in a colander and in a bowl toss with 0.17 tablespoon oil.",
            "Arrange potatoes around lamb and sprinkle with salt and pepper to taste.",
            "Roast lamb and potatoes, stirring potatoes occasionally, for 55 minutes, or until a meat thermometer registers 140°F for medium-rare.",
            "Transfer lamb to a cutting board and let stand for 15 minutes.",
            "Increase oven temperature to 500°F and roast potatoes and lemons in one layer for 5 to 10 minutes more, or until golden.",
            "Transfer potatoes and lemons with a slotted spoon to a bowl and toss with 0.5 tablespoons chives.",
            "Transfer potato mixture to a platter.",
            "Serve lamb, sliced thin across grain, with potatoes, garnished with rosemary and lemon wedges."
        ],
        "processed_ingredients": [
            "0.33 lemons",
            "0.04 cup rosemary leaves",
            "0.5 garlic cloves",
            "0.34 tablespoon olive oil",
            "0.34 teaspoon lemon juice",
            "0.08 teaspoon salt",
            "1 lb lamb",
            "0.36 lb potatoes",
            "0.5 tablespoon chives",
            "0.08 teaspoon pepper"
        ],
        "pure_ingredients": [
            "lemon",
            "rosemary",
            "garlic",
            "olive oil",
            "lemon juice",
            "salt",
            "lamb",
            "potato",
            "chives",
            "pepper"
        ],
        "cooking_time": "2 hours 10 minutes",
        "required_tools": [
            "oven",
            "vegetable peeler",
            "saucepan",
            "colander",
            "small food processor",
            "small sharp knife",
            "large roasting pan",
            "slotted spoon",
            "cutting board",
            "bowl"
        ]
    },
    {
        "recipe_id": "f18RY/nAA.9oW1DHnT6g1cRkBPakZC.",
        "recipe_title": "Mushroom and Cheddar Fritatta and Arugula Side Salad",
        "original_instructions": "Preheat the broiler and set the rack about 4 to 5 inches from the heat source.\nHeat oil in large ovenproof nonstick skillet over medium-high heat. Saute mushrooms until browned, seasoning with salt and pepper. Add onion and saute until tender.\nWhisk eggs, egg whites, salt, and pepper in a medium bowl. Pour over vegetables in skillet and mix gently. Reduce heat to medium-low, cover skillet, and cook until eggs are set around edges, about 4 to 5 minutes. Sprinkle with cheese and then place skillet under broiler and cook until cheese is melted and just browned, about 2 minutes. Let frittata stand 1 minute before cutting into 8 wedges. Serve with salad on the side.\nArugula Salad:\n1 large bunch arugula leaves, washed and dried\n1/4 cup olive oil\n1 lemon, juiced\n10 grinds black pepper\nCouple pinches salt\nCombine all ingredients in a large bowl. Toss to coat leaves with dressing and serve with the frittata.",
        "ingredients": [
            "3 tablespoons vegetable oil",
            "1 (10-ounce) package mushrooms, chopped",
            "Salt and freshly ground black pepper",
            "1 medium onion, chopped",
            "8 eggs",
            "4 egg whites",
            "1 cup grated sharp Cheddar",
            "Arugula Salad, recipe follows"
        ],
        "step_by_step_instructions": [
            "Preheat the broiler and set the rack about 4 to 5 inches from the heat source.",
            "Heat 0.38 tablespoon vegetable oil in a large ovenproof nonstick skillet over medium-high heat.",
            "Saute 1.25 ounces mushrooms until browned, seasoning with salt and pepper.",
            "Add 0.13 medium onion, chopped, and saute until tender.",
            "Whisk 1 egg, 0.5 egg whites with a pinch of salt and pepper in a medium bowl.",
            "Pour the egg mixture over the vegetables in the skillet and mix gently.",
            "Reduce heat to medium-low, cover the skillet, and cook until eggs are set around the edges, about 4 to 5 minutes.",
            "Sprinkle 0.13 cup grated sharp Cheddar over the eggs.",
            "Place the skillet under the broiler and cook until the cheese is melted and just browned, about 2 minutes.",
            "Let the frittata stand 1 minute before cutting into 1 wedge.",
            "For the salad, combine 0.13 large bunch arugula leaves, 0.03 cup olive oil, juice of 0.13 lemon, 1 grind black pepper, and a pinch of salt in a large bowl.",
            "Toss to coat leaves with dressing and serve with the frittata."
        ],
        "processed_ingredients": [
            "0.38 tablespoon vegetable oil",
            "1.25 ounces mushrooms",
            "0.13 medium onion",
            "1 egg",
            "0.5 egg whites",
            "0.13 cup grated sharp Cheddar",
            "0.13 large bunch arugula leaves",
            "0.03 cup olive oil",
            "0.13 lemon",
            "1 grind black pepper",
            "1 pinch salt"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "mushrooms",
            "salt",
            "black pepper",
            "onion",
            "eggs",
            "egg whites",
            "cheddar",
            "arugula",
            "olive oil",
            "lemon"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "oven",
            "skillet",
            "broiler",
            "bowl",
            "whisk",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "OJu6G3JA9gaVGxJydBMVmBgEVWWHLxO",
        "recipe_title": "Wedge Salad Burgers",
        "original_instructions": "Cook the bacon in a medium cast-iron skillet over medium heat, flipping about halfway through, until crisp and the fat has rendered, about 8 minutes; transfer to a plate. Pour off and reserve the bacon drippings, leaving enough in the skillet to coat it nicely.\nSlice 4 rounded chunks of lettuce (4 to 5 inches across) from the top and 3 sides of the head to make \"bun\" halves; set on a platter.\nShape the ground beef into 2 burgers, each about 4 inches wide and 3/4 inch thick, and sprinkle both sides with salt and pepper. Put the bacon skillet over high heat, add the burgers and cook for 3 minutes; flip and cook for 3 minutes more for medium rare.\nLay 1 lettuce \"bun\" half cut-side up on each of 2 plates and top with a burger. Spoon 1 tablespoon of the dressing over each burger and top with 1 tablespoon of the onion. Crumble 1 piece of bacon over each burger and top with the remaining lettuce \"bun\" tops.",
        "ingredients": [
            "2 slices bacon",
            "1 head iceberg lettuce (2 to 2 1/2 pounds)",
            "10 ounces 80percent lean ground beef",
            "Kosher salt and freshly ground black pepper",
            "2 tablespoons chunky blue cheese dressing",
            "2 tablespoons diced red onion"
        ],
        "step_by_step_instructions": [
            "Cook 1 slice of bacon in a medium cast-iron skillet over medium heat, flipping halfway through, until crisp and the fat has rendered, about 4 minutes; transfer to a plate.",
            "Pour off and reserve the bacon drippings, leaving enough in the skillet to coat it nicely.",
            "Slice 2 rounded chunks of lettuce (4 to 5 inches across) from the head to make \"bun\" halves; set on a platter.",
            "Shape 5 ounces of ground beef into a burger, about 4 inches wide and 3/4 inch thick, and sprinkle both sides with salt and pepper.",
            "Put the bacon skillet over high heat, add the burger and cook for 3 minutes; flip and cook for 3 minutes more for medium rare.",
            "Lay 1 lettuce \"bun\" half cut-side up on a plate and top with the burger.",
            "Spoon 1 tablespoon of the dressing over the burger and top with 1 tablespoon of the onion.",
            "Crumble the bacon over the burger and top with the remaining lettuce \"bun\" top."
        ],
        "processed_ingredients": [
            "1 slice bacon",
            "0.25 head iceberg lettuce",
            "5 ounces ground beef",
            "0.5 teaspoon salt",
            "0.5 teaspoon black pepper",
            "1 tablespoon blue cheese dressing",
            "1 tablespoon red onion"
        ],
        "pure_ingredients": [
            "bacon",
            "lettuce",
            "ground beef",
            "salt",
            "black pepper",
            "blue cheese dressing",
            "red onion"
        ],
        "cooking_time": "16 minutes",
        "required_tools": [
            "cast-iron skillet",
            "plate",
            "platter"
        ]
    },
    {
        "recipe_id": "SFD/xU6XNkCBFhWTNv.hwCTJwRv07oq",
        "recipe_title": "Chicken, Black Bean and Goat Cheese Toastadas ",
        "original_instructions": "Make beans: Heat olive oil in heavy medium saucepan over medium-low heat. Add onion and chilies; cook until onion is translucent, stirring occasionally, about 8 minutes. Add chili powder and cumin; stir 30 seconds. Add beans and lime juice. Cook until heat through, stirring and mashing beans slightly with spoon, about 4 minutes. (Can be prepared 1 day ahead. Cover and chill.)\nHeat olive oil in heavy medium saucepan over medium-low heat. Add onion and chilies; cook until onion is translucent, stirring occasionally, about 8 minutes. Add chili powder and cumin; stir 30 seconds. Add beans and lime juice. Cook until heat through, stirring and mashing beans slightly with spoon, about 4 minutes. (Can be prepared 1 day ahead. Cover and chill.)\nMake chicken: Heat oil in heavy large skillet over high heat. Add chicken and sprinkle with salt and pepper. Stir until almost cooked through, about 3 minutes. Add chili powder and cumin and stir until cooked through, about 30 seconds. Remove from heat.\nHeat oil in heavy large skillet over high heat. Add chicken and sprinkle with salt and pepper. Stir until almost cooked through, about 3 minutes. Add chili powder and cumin and stir until cooked through, about 30 seconds. Remove from heat.\nMake Salad: Combine first 3 ingredients in large bowl. Add oil to depth of 1/4 inch to heavy medium skillet. Heat over medium-high heat until just beginning to smoke. Add tortilla and cook until crisp, abut 30 seconds per side. Drain on paper towels. Repeat with remaining tortillas. Add 1/4 cup olive oil to salad; toss Season with salt and pepper. Add 1 tablespoon lime juice; toss. Rewarm beans over medium-low heat, stirring and thinning slightly with water. Place 1 tortilla on each plate. Spread with beans. Sprinkle with cheese. Top with salad, then chicken, salsa and cilantro.\nCombine first 3 ingredients in large bowl.\nAdd oil to depth of 1/4 inch to heavy medium skillet. Heat over medium-high heat until just beginning to smoke. Add tortilla and cook until crisp, abut 30 seconds per side. Drain on paper towels. Repeat with remaining tortillas.\nAdd 1/4 cup olive oil to salad; toss Season with salt and pepper. Add 1 tablespoon lime juice; toss. Rewarm beans over medium-low heat, stirring and thinning slightly with water. Place 1 tortilla on each plate. Spread with beans. Sprinkle with cheese. Top with salad, then chicken, salsa and cilantro.",
        "ingredients": [
            "2 tablespoons olive oil",
            "1 red onion, chopped",
            "2 large jalapeño chilies, seeded but not deveined, minced",
            "1 teaspoon chili powder",
            "1/2 teaspoon ground cumin",
            "2 16-ounce cans black beans, rinsed, drained",
            "2 tablespoons fresh lime juice",
            "2 tablespoons olive oil",
            "1 1/2 pounds boneless chicken breasts, skinned, cut into 3/4-inch pieces",
            "1 1/2 teaspoon chili powder",
            "3/4 teaspoon ground cumin",
            "4 cups sliced romaine lettuce",
            "1 medium head radicchio, sliced",
            "1/2 cup fresh cilantro leaves",
            "Vegetable oil",
            "6 corn tortillas",
            "1/4 cup olive oil",
            "1 tablespoon fresh lime juice",
            "2 tablespoons (about) water",
            "1/2 pound goat cheese, crumbled",
            "Avocado Salsa",
            "6 fresh cilantro springs"
        ],
        "step_by_step_instructions": [
            "Heat 0.33 tablespoon olive oil in a heavy medium saucepan over medium-low heat.",
            "Add 0.17 red onion (chopped) and 0.33 jalapeño chili (minced) and cook until the onion is translucent, stirring occasionally, about 8 minutes.",
            "Add 0.17 teaspoon chili powder and 0.08 teaspoon ground cumin and stir for 30 seconds.",
            "Add 5.33 ounces black beans and 1 teaspoon fresh lime juice. Cook until heated through, stirring and mashing beans slightly with a spoon, about 4 minutes. Set aside.",
            "Heat 0.33 tablespoon olive oil in a heavy large skillet over high heat.",
            "Add 0.25 pound boneless chicken breast (cut into 3/4-inch pieces), sprinkle with salt and pepper, and stir until almost cooked through, about 3 minutes.",
            "Add 0.25 teaspoon chili powder and 0.13 teaspoon ground cumin and stir until cooked through, about 30 seconds. Remove from heat.",
            "In a large bowl, combine 0.67 cup sliced romaine lettuce, 0.17 medium head radicchio (sliced), and 0.08 cup fresh cilantro leaves.",
            "Add oil to a depth of 1/4 inch to a heavy medium skillet. Heat over medium-high heat until just beginning to smoke.",
            "Add 1 corn tortilla and cook until crisp, about 30 seconds per side. Drain on paper towels.",
            "Add 1 tablespoon olive oil to the salad, toss, then season with salt and pepper.",
            "Add 0.17 tablespoon fresh lime juice to the salad and toss.",
            "Rewarm the beans over medium-low heat, stirring and thinning slightly with water if necessary.",
            "Place 1 tortilla on a plate. Spread with beans, sprinkle with 1.33 ounces goat cheese, top with salad, then chicken, avocado salsa, and a sprig of fresh cilantro."
        ],
        "processed_ingredients": [
            "0.33 tablespoon olive oil",
            "0.17 red onion",
            "0.33 jalapeño chili",
            "0.17 teaspoon chili powder",
            "0.08 teaspoon ground cumin",
            "5.33 ounces black beans",
            "1 teaspoon fresh lime juice",
            "0.33 tablespoon olive oil",
            "0.25 pound boneless chicken breast",
            "0.25 teaspoon chili powder",
            "0.13 teaspoon ground cumin",
            "0.67 cup romaine lettuce",
            "0.17 medium head radicchio",
            "0.08 cup fresh cilantro leaves",
            "1 corn tortilla",
            "1 tablespoon olive oil",
            "0.17 tablespoon fresh lime juice",
            "1.33 ounces goat cheese"
        ],
        "pure_ingredients": [
            "olive oil",
            "red onion",
            "jalapeño chili",
            "chili powder",
            "ground cumin",
            "black beans",
            "lime juice",
            "chicken breast",
            "romaine lettuce",
            "radicchio",
            "cilantro",
            "corn tortilla",
            "goat cheese",
            "avocado",
            "salt",
            "pepper"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "saucepan",
            "skillet",
            "large bowl",
            "spoon",
            "paper towels",
            "plate"
        ]
    },
    {
        "recipe_id": "Irvv.n.H7ROlpKkQKjNPR3pAaKz.fWW",
        "recipe_title": "Mushroom Parmentier",
        "original_instructions": "For the potatoes: Steam the potatoes in a covered saucepan with about 1 inch/2.5 cm water in the bottom, until very tender, about 30 minutes.\nFor the mushrooms: Clean and quarter the mushrooms. Heat just 2 tablespoons of the butter with 1 tablespoon of the olive oil and saute the mushrooms until cooked and golden. Remove from the pan. Heat the other spoonful of olive oil (adding more if you need it) and saute the onion until soft. Add the garlic for 1 minute. Deglaze with the wine and reduce to no more than a spoonful. Add the stock, thyme and mushrooms, season with salt and pepper and cook until the stock has reduced by half. Knead together the flour with the last tablespoon of butter and stir it in. Cook until the liquid has thickened to a sauce, a matter of minutes. Stir in the parsley. Spoon the mixture into a gratin dish.\nFor the cheese potato top: Heat the oven to 425 degrees F/220 degrees C. Mash the potatoes with the milk and butter until smooth, adding more milk if needed. Season with salt and pepper. Stir in the diced cheese. Distribute evenly over the mushroom mixture, and smooth with the back of the spoon (if you want to be very retro-housewife, make patterns with the tines of a fork or make waves with a spoon). Sprinkle over the Parmesan. Bake the gratin until bubbling hot and golden on top, about 15 minutes.",
        "ingredients": [
            "6 medium floury potatoes, such as Yukon gold",
            "2 pounds/ 1 kg mushrooms",
            "3 tablespoons butter",
            "2 tablespoons olive oil, more as needed",
            "1 large red onion, chopped",
            "3 cloves garlic",
            "1/2 cup/125 ml red wine",
            "1/2 cup/125 ml vegetable stock or water",
            "Handful fresh thyme leaves, chopped",
            "Kosher salt and freshly ground black pepper",
            "1 tablespoon flour",
            "1 handful fresh parsley, chopped",
            "1/4 cup/60 ml milk",
            "2 to 4 tablespoons butter",
            "Kosher salt and freshly ground pepper",
            "4 ounces/110 g Comte or Gruyere cheese, cut into very fine dice",
            "2 tablespoons grated Parmesan"
        ],
        "step_by_step_instructions": [
            "Steam 1 medium potato in a covered saucepan with about 0.16 cup water in the bottom until very tender, about 30 minutes.",
            "Clean and quarter 0.33 pound mushrooms.",
            "Heat 0.5 tablespoon butter with 0.16 tablespoon olive oil in a pan and sauté the mushrooms until cooked and golden. Remove from the pan.",
            "Heat an additional 0.16 tablespoon olive oil in the pan (adding more if needed) and sauté 0.16 of a large red onion until soft.",
            "Add 0.5 minced garlic clove and cook for 1 minute.",
            "Deglaze the pan with 0.08 cup red wine and reduce it to no more than a spoonful.",
            "Add 0.08 cup vegetable stock, a pinch of thyme, and the mushrooms back into the pan. Season with salt and pepper and cook until the stock has reduced by half.",
            "Knead 0.16 tablespoon flour with 0.16 tablespoon butter and stir it into the pan. Cook until the liquid has thickened to a sauce.",
            "Stir in a small pinch of parsley and spoon the mixture into a small gratin dish.",
            "Preheat the oven to 425 degrees F/220 degrees C.",
            "Mash the steamed potato with 0.04 cup milk and 0.5 tablespoon butter until smooth, adding more milk if needed. Season with salt and pepper.",
            "Stir in 0.66 ounce diced Comte or Gruyere cheese.",
            "Distribute the mashed potato evenly over the mushroom mixture in the gratin dish and smooth the top with the back of a spoon.",
            "Sprinkle 0.33 tablespoon grated Parmesan over the top.",
            "Bake the gratin until bubbling hot and golden on top, about 15 minutes."
        ],
        "processed_ingredients": [
            "1 medium potato",
            "0.33 pound mushrooms",
            "1 tablespoon butter",
            "0.32 tablespoon olive oil",
            "0.16 large red onion",
            "0.5 clove garlic",
            "0.08 cup red wine",
            "0.08 cup vegetable stock",
            "0.16 tablespoon flour",
            "0.04 cup milk",
            "0.5 tablespoon butter",
            "0.66 ounce Comte cheese",
            "0.33 tablespoon grated Parmesan",
            "0.5 teaspoon thyme",
            "0.5 teaspoon parsley",
            "0.5 teaspoon kosher salt",
            "0.5 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "potatoes",
            "mushrooms",
            "butter",
            "olive oil",
            "red onion",
            "garlic",
            "red wine",
            "vegetable stock",
            "thyme",
            "salt",
            "black pepper",
            "flour",
            "parsley",
            "milk",
            "Comte cheese",
            "Parmesan"
        ],
        "cooking_time": "75 minutes",
        "required_tools": [
            "saucepan",
            "pan",
            "gratin dish",
            "oven"
        ]
    },
    {
        "recipe_id": "DCBIlHUE8jD32M0vnghQkQTAijcYqim",
        "recipe_title": "Treacle Farls ",
        "original_instructions": "Preheat oven to 425°F. Flour heavy large baking sheet. Combine first 5 ingredients in large bowl. Add butter and rub in with fingertips until mixture resembles fine meal. Whisk 1 cup buttermilk and dark molasses in medium bowl to blend. Mix buttermilk mixture into dry ingredients. Gradually mix in enough remaining buttermilk to form soft dough. Knead on lightly floured surface just until dough holds together. Shape into 8-inch round, about 1 1/2 inches high. Cut into 4-wedges. Transfer wedges to prepared sheet, spacing apart. Bake until deep golden brown, about 30 minutes. Cool on racks.\nPreheat oven to 425°F. Flour heavy large baking sheet. Combine first 5 ingredients in large bowl. Add butter and rub in with fingertips until mixture resembles fine meal. Whisk 1 cup buttermilk and dark molasses in medium bowl to blend. Mix buttermilk mixture into dry ingredients. Gradually mix in enough remaining buttermilk to form soft dough. Knead on lightly floured surface just until dough holds together. Shape into 8-inch round, about 1 1/2 inches high. Cut into 4-wedges. Transfer wedges to prepared sheet, spacing apart. Bake until deep golden brown, about 30 minutes. Cool on racks.",
        "ingredients": [
            "4 cups all purpose flour",
            "1/4 cup sugar",
            "1 teaspoon baking soda",
            "1/2 teaspoon ground ginger",
            "1/4 teaspoon salt",
            "1/4 cup (1/2 stick) chilled unsalted butter, cut into pieces",
            "1 3/4 cups (about) buttermilk",
            "2 tablespoons dark molasses"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 425°F.",
            "Flour a heavy large baking sheet.",
            "Combine 0.5 cups flour, 0.03 cups sugar, 0.13 teaspoons baking soda, 0.06 teaspoons ground ginger, and 0.03 teaspoons salt in a large bowl.",
            "Add 0.03 cups (0.5 tablespoons) chilled unsalted butter, cut into pieces, and rub in with fingertips until mixture resembles fine meal.",
            "Whisk 0.13 cups buttermilk and 0.25 tablespoons dark molasses in a medium bowl to blend.",
            "Mix buttermilk mixture into dry ingredients.",
            "Gradually mix in enough remaining buttermilk to form soft dough.",
            "Knead on lightly floured surface just until dough holds together.",
            "Shape into a 2-inch round, about 0.19 inches high.",
            "Cut into 1-wedge.",
            "Transfer wedge to prepared sheet, spacing apart.",
            "Bake until deep golden brown, about 30 minutes.",
            "Cool on racks."
        ],
        "processed_ingredients": [
            "0.5 cup all purpose flour",
            "0.03 cup sugar",
            "0.13 teaspoon baking soda",
            "0.06 teaspoon ground ginger",
            "0.03 teaspoon salt",
            "0.03 cup chilled unsalted butter",
            "0.13 cup buttermilk",
            "0.25 tablespoon dark molasses"
        ],
        "pure_ingredients": [
            "flour",
            "sugar",
            "baking soda",
            "ginger",
            "salt",
            "butter",
            "buttermilk",
            "molasses"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "bowl",
            "whisk",
            "racks"
        ]
    },
    {
        "recipe_id": "4rsd0lqH26ZX3ePkTyuCZYaAI8o5H8a",
        "recipe_title": "Simple Roast Chicken with Gravy",
        "original_instructions": "Special equipment: A small roasting pan and rack, butcher's twine\nPat the chicken dry inside and out with paper towels, and let sit at room temperature to take the chill off, about 30 minutes. Meanwhile, position an oven rack in the center of the oven, and preheat to 450 degrees F. Put a rack in a small roasting pan.\nSeason the cavity of the chicken generously with salt and pepper, and stuff it with the thyme and garlic. Tie the legs together with butcher's twine. Season the outside with salt (generously) and a few grinds of pepper, and place the chicken breast-side up on the rack. (Seasoning the chicken when on the rack could result in gravy that's too salty.)\nRoast the chicken until the skin is golden brown and crispy and a thermometer inserted in the deepest part of the thigh registers 165 to 170 degrees F, depending on how you like your dark meat, 50 minutes to 1 hour. Let the chicken rest on the rack for a few minutes, then carefully tip it forward to drain all the collected juices into the roasting pan. Discard the thyme and garlic. Let the chicken rest on a cutting board while you make the gravy. (To transfer the chicken easily, hold a wooden spoon handle in the cavity with one hand and use the other hand to lift the chicken with tongs.)\nRemove the rack from the pan, and pour the pan drippings into a small bowl. Skim off 2 tablespoons of the fat, and stir them into the flour and 2 tablespoons water in another small bowl. Heat the roasting pan over medium-high heat, add the wine, scrape up any browned bits and simmer until the wine reduces by half, 3 to 4 minutes. Add the chicken stock and any remaining pan drippings, bring to a simmer, add the flour mixture and whisk constantly until the liquid thickens into a gravy, 2 to 3 minutes. Season the gravy with salt and pepper.\nRemove the butcher's twine from the chicken. Snip off the wingtips using kitchen shears; reserve to make stock. Remove the leg quarters by slicing between the thigh and the body, then finding the hip joints near the backbone and slicing through them. Separate the drumsticks and thighs, and transfer to a platter. Sit the carcass upright; snip out the backbone and reserve it to make stock. Lay the breast skin-side up and slice in half through the breastbone. Separate the wings and breast, and transfer to the platter. Serve the chicken with the warm gravy. Reserve the carcass to make stock.",
        "ingredients": [
            "One 4- to 5-pound chicken, giblets removed and reserved for another use",
            "Kosher salt and freshly ground black pepper",
            "3 sprigs thyme",
            "3 cloves garlic, unpeeled",
            "2 tablespoons all-purpose flour",
            "1/2 cup dry white wine",
            "2 cups homemade chicken stock or low-sodium chicken broth"
        ],
        "step_by_step_instructions": [
            "Pat the chicken dry inside and out with paper towels.",
            "Let the chicken sit at room temperature for 30 minutes to take the chill off.",
            "Preheat the oven to 450 degrees F and position the rack in the center.",
            "Season the cavity of the chicken with salt and pepper.",
            "Stuff the chicken with 1 sprig of thyme and 1 clove of garlic.",
            "Tie the legs together with butcher's twine.",
            "Season the outside of the chicken with salt and pepper.",
            "Place the chicken breast-side up on a rack in a small roasting pan.",
            "Roast the chicken for 50 minutes to 1 hour, until the skin is golden brown and crispy and a thermometer inserted in the deepest part of the thigh registers 165 to 170 degrees F.",
            "Let the chicken rest on the rack for a few minutes.",
            "Carefully tip the chicken forward to drain the juices into the roasting pan.",
            "Discard the thyme and garlic.",
            "Let the chicken rest on a cutting board while making the gravy.",
            "Remove the rack from the pan and pour the pan drippings into a small bowl.",
            "Skim off 2 tablespoons of the fat.",
            "Stir the fat into 2 teaspoons of flour and 2 teaspoons of water in another small bowl.",
            "Heat the roasting pan over medium-high heat and add 1/4 cup of wine.",
            "Scrape up any browned bits and simmer until the wine reduces by half, about 3 minutes.",
            "Add 1/2 cup of chicken stock and any remaining pan drippings.",
            "Bring to a simmer and add the flour mixture.",
            "Whisk constantly until the liquid thickens into a gravy, about 2 minutes.",
            "Season the gravy with salt and pepper.",
            "Remove the butcher's twine from the chicken.",
            "Snip off the wingtips and reserve.",
            "Remove the leg quarters by slicing between the thigh and the body, then find the hip joints near the backbone and slice through them.",
            "Separate the drumsticks and thighs and transfer to a platter.",
            "Sit the carcass upright and snip out the backbone to reserve.",
            "Lay the breast skin-side up and slice in half through the breastbone.",
            "Separate the wings and breast and transfer to the platter.",
            "Serve the chicken with the warm gravy."
        ],
        "processed_ingredients": [
            "1.25 lb chicken",
            "1.5 tsp kosher salt",
            "0.75 tsp black pepper",
            "1 sprig thyme",
            "1 clove garlic",
            "2 tsp all-purpose flour",
            "0.25 cup dry white wine",
            "0.5 cup chicken stock"
        ],
        "pure_ingredients": [
            "chicken",
            "salt",
            "pepper",
            "thyme",
            "garlic",
            "flour",
            "white wine",
            "chicken stock"
        ],
        "cooking_time": "90 minutes",
        "required_tools": [
            "oven",
            "roasting pan",
            "rack",
            "butcher's twine",
            "paper towels",
            "thermometer",
            "cutting board",
            "wooden spoon",
            "tongs",
            "small bowl",
            "kitchen shears"
        ]
    },
    {
        "recipe_id": "Sxckw6IydQ/yO3Eu8iXMEwIAgcQ8Gyu",
        "recipe_title": "Cheddar Buttermilk Biscuits ",
        "original_instructions": "Put oven rack in middle position and preheat oven to 450°F. Butter 1 large baking sheet. Whisk together flour, cornmeal, baking powder, baking soda, and salt in a bowl, then blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal. Stir in cheeses and scallions with a wooden spoon, then add buttermilk and stir until just combined. Drop dough in 8 equal mounds about 2 inches apart on baking sheet. Bake until golden, about 15 minutes. Transfer to a rack and cool to warm, about 10 minutes, then cut in half horizontally.\nPut oven rack in middle position and preheat oven to 450°F. Butter 1 large baking sheet.\nWhisk together flour, cornmeal, baking powder, baking soda, and salt in a bowl, then blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal. Stir in cheeses and scallions with a wooden spoon, then add buttermilk and stir until just combined.\nDrop dough in 8 equal mounds about 2 inches apart on baking sheet. Bake until golden, about 15 minutes. Transfer to a rack and cool to warm, about 10 minutes, then cut in half horizontally.",
        "ingredients": [
            "1 3/4 cups all-purpose flour",
            "3/4 cup cornmeal (preferably stone-ground; not coarse)",
            "4 teaspoons baking powder",
            "1 teaspoon baking soda",
            "1 teaspoon salt",
            "1/2 stick (1/4 cup) cold unsalted butter, cut into 1/2-inch cubes",
            "6 oz extra-sharp Cheddar, coarsely grated (2 cups)",
            "3 tablespoons finely grated Parmigiano-Reggiano",
            "3 scallions, finely chopped",
            "1 1/3 cups well-shaken buttermilk"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450°F and butter a large baking sheet.",
            "In a bowl, whisk together 0.22 cups of all-purpose flour, 0.09 cups of cornmeal, 0.5 teaspoons of baking powder, 0.12 teaspoons of baking soda, and 0.12 teaspoons of salt.",
            "Blend in 0.5 tablespoons of cold unsalted butter with your fingertips or a pastry blender until the mixture resembles coarse meal.",
            "Stir in 0.75 ounces of coarsely grated extra-sharp Cheddar, 0.38 tablespoons of finely grated Parmigiano-Reggiano, and 0.38 scallions, finely chopped.",
            "Add 0.17 cups of well-shaken buttermilk and stir until just combined.",
            "Drop the dough in 1 equal mound on the baking sheet.",
            "Bake until golden, about 15 minutes.",
            "Transfer to a rack and cool to warm, about 10 minutes.",
            "Cut in half horizontally."
        ],
        "processed_ingredients": [
            "0.22 cup all-purpose flour",
            "0.09 cup cornmeal",
            "0.5 teaspoon baking powder",
            "0.12 teaspoon baking soda",
            "0.12 teaspoon salt",
            "0.5 tablespoon unsalted butter",
            "0.75 ounce extra-sharp Cheddar",
            "0.38 tablespoon Parmigiano-Reggiano",
            "0.38 scallion",
            "0.17 cup buttermilk"
        ],
        "pure_ingredients": [
            "all-purpose flour",
            "cornmeal",
            "baking powder",
            "baking soda",
            "salt",
            "butter",
            "Cheddar",
            "Parmigiano-Reggiano",
            "scallions",
            "buttermilk"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "bowl",
            "whisk",
            "pastry blender",
            "wooden spoon",
            "rack"
        ]
    },
    {
        "recipe_id": "1p2SvjVDAIg.ht3g4bg3mYs7ix4Kv9C",
        "recipe_title": "Salmon with Peas, Pea Tendrils, and Dill-Cucumber Sauce ",
        "original_instructions": "Brush small rimmed baking sheet with 1 tablespoon oil. Place salmon on prepared baking sheet. Mix orange juice and lemon juice in small bowl; pour over salmon. Drizzle remaining 1 tablespoon oil over salmon; sprinkle with coarse kosher salt and pepper. Let stand 15 minutes. Preheat broiler. Broil salmon, without turning fish over, until just opaque in center, watching closely and turning baking sheet once for even broiling, about 12 minutes. Using 2 wide spatulas, transfer salmon to platter. Surround with Peas and Pea Tendrils with Lemon Dressing. Serve with Dill-Cucumber Sauce.\nBrush small rimmed baking sheet with 1 tablespoon oil. Place salmon on prepared baking sheet. Mix orange juice and lemon juice in small bowl; pour over salmon. Drizzle remaining 1 tablespoon oil over salmon; sprinkle with coarse kosher salt and pepper. Let stand 15 minutes.\nPreheat broiler. Broil salmon, without turning fish over, until just opaque in center, watching closely and turning baking sheet once for even broiling, about 12 minutes. Using 2 wide spatulas, transfer salmon to platter. Surround with Peas and Pea Tendrils with Lemon Dressing. Serve with Dill-Cucumber Sauce.",
        "ingredients": [
            "2 tablespoons olive oil, divided",
            "1 2 1/2-pound center-cut wild salmon fillet, skin and pinbones removed",
            "1/2 cup fresh orange juice",
            "1/4 cup fresh lemon juice",
            "1 teaspoon coarse kosher salt",
            "Peas and Pea Tendrils with Lemon Dressing",
            "Dill-Cucumber Sauce"
        ],
        "step_by_step_instructions": [
            "Brush a small rimmed baking sheet with 0.5 tablespoon of olive oil.",
            "Place a portion of salmon, approximately 6 ounces, on the prepared baking sheet.",
            "Mix 1 tablespoon of orange juice and 0.5 tablespoon of lemon juice in a small bowl; pour over the salmon.",
            "Drizzle remaining 0.5 tablespoon of olive oil over the salmon and sprinkle with 0.25 teaspoon of coarse kosher salt and a pinch of pepper.",
            "Let the salmon stand for 15 minutes.",
            "Preheat the broiler.",
            "Broil the salmon, without turning it over, until just opaque in the center, watching closely and turning the baking sheet once for even broiling, about 12 minutes.",
            "Using 2 wide spatulas, transfer the salmon to a platter.",
            "Surround the salmon with Peas and Pea Tendrils with Lemon Dressing.",
            "Serve the salmon with Dill-Cucumber Sauce."
        ],
        "processed_ingredients": [
            "0.5 tablespoon olive oil",
            "6 ounce salmon fillet",
            "1 tablespoon fresh orange juice",
            "0.5 tablespoon fresh lemon juice",
            "0.25 teaspoon coarse kosher salt"
        ],
        "pure_ingredients": [
            "olive oil",
            "salmon",
            "orange juice",
            "lemon juice",
            "salt",
            "pepper",
            "peas",
            "pea tendrils",
            "dill",
            "cucumber"
        ],
        "cooking_time": "27 minutes",
        "required_tools": [
            "baking sheet",
            "small bowl",
            "broiler",
            "spatula"
        ]
    },
    {
        "recipe_id": "FCn.9oFZr5w5abLoVVW24DTtF7ogBEu",
        "recipe_title": "Artichokes with Parmesan–Black Pepper Yogurt ",
        "original_instructions": "Place a metal steamer basket in a large saucepan and pour in water to a depth of 2\". Add 2 tablespoons lemon juice. Bring water to a boil, then add artichokes. Cover, reduce heat, and simmer artichokes until stems and hearts are easily pierced with a paring knife, 30–40 minutes. Meanwhile, blend Parmesan, yogurt, oil, lemon zest, remaining 1 tablespoon lemon juice, and 3 tablespoons water in a blender until smooth; season with salt and a generous amount of pepper. Serve artichokes with yogurt sauce for dipping.\nPlace a metal steamer basket in a large saucepan and pour in water to a depth of 2\". Add 2 tablespoons lemon juice. Bring water to a boil, then add artichokes. Cover, reduce heat, and simmer artichokes until stems and hearts are easily pierced with a paring knife, 30–40 minutes.\nMeanwhile, blend Parmesan, yogurt, oil, lemon zest, remaining 1 tablespoon lemon juice, and 3 tablespoons water in a blender until smooth; season with salt and a generous amount of pepper. Serve artichokes with yogurt sauce for dipping.",
        "ingredients": [
            "1 tablespoon finely grated lemon zest",
            "3 tablespoons fresh lemon juice, divided",
            "4 large artichokes, trimmed (see method, below)",
            "1/2 cup finely grated Parmesan",
            "1/2 cup plain yogurt",
            "2 tablespoons olive oil",
            "Kosher salt, freshly ground pepper"
        ],
        "step_by_step_instructions": [
            "Place a metal steamer basket in a large saucepan and pour in water to a depth of 2 inches.",
            "Add 0.5 tablespoon lemon juice to the water.",
            "Bring the water to a boil, then add 1 artichoke (approximately 290g).",
            "Cover the saucepan, reduce heat, and simmer the artichoke until the stem and heart are easily pierced with a paring knife, about 30–40 minutes.",
            "Meanwhile, blend 2 tablespoons Parmesan, 2 tablespoons yogurt, 0.5 tablespoon olive oil, 0.25 tablespoon lemon zest, 0.25 tablespoon lemon juice, and 0.75 tablespoon water in a blender until smooth.",
            "Season the yogurt sauce with salt and a generous amount of pepper.",
            "Serve the artichoke with the yogurt sauce for dipping."
        ],
        "processed_ingredients": [
            "0.25 tablespoon lemon zest",
            "1 tablespoon lemon juice",
            "290 g artichoke",
            "2 tablespoon Parmesan",
            "2 tablespoon yogurt",
            "0.5 tablespoon olive oil",
            "0.25 teaspoon salt",
            "0.25 teaspoon pepper"
        ],
        "pure_ingredients": [
            "lemon zest",
            "lemon juice",
            "artichoke",
            "Parmesan",
            "yogurt",
            "olive oil",
            "salt",
            "pepper"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "metal steamer basket",
            "large saucepan",
            "paring knife",
            "blender"
        ]
    }
]