[
    {
        "recipe_id": "UhHAg0JIM.Lh8N8YITXrQCVu38kem.W",
        "recipe_title": "Crunchy Chinese Salad",
        "original_instructions": "First mix cabbage and onions in a large bowl, set aside.\nMelt butter in a frying pan over medium heat. Break noodles in small pieces and brown along with sesame seeds and almonds. Cool and drain on paper towels.\nTo make dressing, mix together all ingredients and microwave to dissolve the sugar. Let cool (about 20 minutes) before serving. Dressing can be made a day ahead of time.\nToss together all salad ingredients and add dressing, just before serving.",
        "ingredients": [
            "1 large head Napa cabbage, chopped",
            "5 green onions, diced",
            "1/2 cup butter",
            "2 packages ramen noodles (discard soup flavoring)",
            "1/2 cup sesame seeds",
            "1 small package sliced almonds",
            "1 cup vegetable oil",
            "1 teaspoon soy sauce",
            "1/2 cup white vinegar",
            "1 cup sugar"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Mix cabbage and onions in a large bowl, set aside.",
                "Melt butter in a frying pan over medium heat.",
                "Break noodles in small pieces and brown along with sesame seeds and almonds.",
                "Cool and drain the browned mixture on paper towels.",
                "To make dressing, mix together vegetable oil, soy sauce, white vinegar, and sugar.",
                "Microwave the dressing to dissolve the sugar and let it cool for about 20 minutes.",
                "Toss together all salad ingredients and add the dressing just before serving."
            ],
            "pure_ingredients": [
                "cabbage",
                "onions",
                "butter",
                "noodles",
                "sesame seeds",
                "almonds",
                "vegetable oil",
                "soy sauce",
                "vinegar",
                "sugar"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "10 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "large bowl",
                "frying pan",
                "paper towels",
                "microwave"
            ],
            "dietary_labels": [
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "tnFOoY6Yyv9ZvU2sJ1Rm6Qhel1Nz4xy",
        "recipe_title": "Cilantro Pesto Pasta",
        "original_instructions": "Place first 8 ingredients in food processor or blender and blend until smooth, then add the pasta water. Toss with hot pasta, adjust seasonings, then serve immediately.",
        "ingredients": [
            "1 clove garlic, cracked away from the skin",
            "2 inches fresh ginger root, chopped",
            "1 teaspoon crushed red pepper flakes",
            "3 ounces, about 1/2 cup, macadamia nuts",
            "1 lime, juiced",
            "1 cup cilantro leaves",
            "1/2 cup evoo -- extra-virgin olive oil, eyeball it",
            "1 teaspoon coarse salt, eyeball it in palm of your hand",
            "1 pound spaghetti, cooked to al dente, 1/2 cup pasta water reserved"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Place garlic, ginger root, crushed red pepper flakes, macadamia nuts, lime juice, cilantro leaves, extra-virgin olive oil, and coarse salt in a food processor or blender.",
                "Blend until the mixture is smooth.",
                "Add the reserved pasta water to the blended mixture.",
                "Toss the mixture with hot cooked spaghetti.",
                "Adjust the seasonings to taste.",
                "Serve the dish immediately."
            ],
            "pure_ingredients": [
                "garlic",
                "ginger",
                "red pepper flakes",
                "macadamia nuts",
                "lime",
                "cilantro",
                "olive oil",
                "salt",
                "spaghetti",
                "water"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "10 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "food processor",
                "blender",
                "pot",
                "colander",
                "serving bowls"
            ],
            "dietary_labels": [
                "vegan"
            ]
        }
    },
    {
        "recipe_id": "ciqpmytjbR6N4QfsoXPBfKdEPXiltsW",
        "recipe_title": "Lemon Cake",
        "original_instructions": "In a cake pan or Dutch oven, melt the butter and sugar together over medium heat until they begin to caramelize. Reduce heat and arrange the quartered peaches in the caramel mix at the bottom of the pan to create a decorative top to the cake and remove from the heat. Mix the cake batter according to package directions. Pour the batter slowly over the peaches and bake according to package directions. Let the cake cool about 30 minutes before unmolding, slicing and serving.",
        "ingredients": [
            "1/2 cup butter (1 stick)",
            "1/4 cup firmly packed light brown sugar",
            "2 peaches, peeled and quartered",
            "1 box your favorite lemon cake mix"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In a cake pan or Dutch oven, melt the butter and sugar together over medium heat until they begin to caramelize.",
                "Reduce heat and arrange the quartered peaches in the caramel mix at the bottom of the pan to create a decorative top to the cake and remove from the heat.",
                "Mix the cake batter according to package directions.",
                "Pour the batter slowly over the peaches.",
                "Bake according to package directions.",
                "Let the cake cool about 30 minutes before unmolding, slicing and serving."
            ],
            "pure_ingredients": [
                "butter",
                "sugar",
                "peaches",
                "lemon cake mix"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "30 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "cake pan",
                "oven",
                "mixing bowl"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "FMXDavk4dWOdmsUMwtbxdKJl43.M8Gy",
        "recipe_title": "Bacon-Braised Mustard Greens",
        "original_instructions": "Heat a large skillet over medium-high heat. Add the bacon and cook until the fat has rendered and the bacon is browned. Add the garlic and cook just until fragrant, about 30 seconds. Add the mustard greens and stir to wilt. Season with salt and pepper. Stir in the chicken broth and bring to a simmer. Cover and let cook until the greens are tender, about 10 minutes. Stir in the lemon juice and serve immediately.",
        "ingredients": [
            "2 slices thick-cut bacon, cut into lardons",
            "1 clove garlic, minced",
            "1 pound mustard greens (about 1 bunch), tough stems discarded, roughly chopped",
            "Heavy pinch of kosher salt",
            "Freshly ground black pepper",
            "1/2 cup chicken broth or stock",
            "1 tablespoon lemon juice"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Heat a large skillet over medium-high heat.",
                "Add the bacon and cook until the fat has rendered and the bacon is browned.",
                "Add the garlic and cook just until fragrant, about 30 seconds.",
                "Add the mustard greens and stir to wilt.",
                "Season with salt and pepper.",
                "Stir in the chicken broth and bring to a simmer.",
                "Cover and let cook until the greens are tender, about 10 minutes.",
                "Stir in the lemon juice and serve immediately."
            ],
            "pure_ingredients": [
                "bacon",
                "garlic",
                "mustard greens",
                "salt",
                "pepper",
                "chicken broth",
                "lemon"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "15 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "large skillet",
                "knife",
                "cutting board",
                "stirring spoon"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "FxPYooja7kG9D8Jp.b2gYyI6yTAfgfC",
        "recipe_title": "Winter Squash Soup",
        "original_instructions": "Melt the butter in a large stockpot over moderate heat. Add the onion and saute until soft, about 5 minutes. Add the tomato, garlic, jalapeno and salt and cook 1 to 2 minutes longer. Add the squash and stock and simmer, covered, for about 20 minutes, or until the squash is falling apart and soup is thickened slightly. Puree soup with an immersion blender, or use a blender and return soup to a clean pan. Add the milk and heat gently. Stir in the cheese and adjust the seasonings.",
        "ingredients": [
            "4 tablespoons (1/2 stick) unsalted butter",
            "1 onion, chopped",
            "1 medium tomato, cored, seeded and diced",
            "2 garlic cloves, minced",
            "2 jalapeno chiles, stemmed, seeded and chopped",
            "1 1/2 pounds winter squash, such as West Indian pumpkin, peeled and cut into 1/2-inch cubes",
            "3 cups stock or water",
            "1 teaspoon coarse salt",
            "2 cups whole milk",
            "1/4 cup grated Manchego cheese"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Melt the butter in a large stockpot over moderate heat.",
                "Add the onion and saute until soft, about 5 minutes.",
                "Add the tomato, garlic, jalapeno and salt and cook 1 to 2 minutes longer.",
                "Add the squash and stock and simmer, covered, for about 20 minutes, or until the squash is falling apart and soup is thickened slightly.",
                "Puree soup with an immersion blender, or use a blender and return soup to a clean pan.",
                "Add the milk and heat gently.",
                "Stir in the cheese and adjust the seasonings."
            ],
            "pure_ingredients": [
                "butter",
                "onion",
                "tomato",
                "garlic",
                "jalapeno chiles",
                "salt",
                "squash",
                "stock",
                "milk",
                "cheese"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "25 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "stockpot",
                "immersion blender",
                "blender"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "FRROKq2.1tRyH4FVyCMgYZBx2d7VKmu",
        "recipe_title": "Cheesesteak Soup",
        "original_instructions": "In a large stockpot or Dutch oven, heat oil. Add onions and saute for 2 to 3 minutes on high until fragrant and tender.\nIn a large bowl, mix salt, pepper, flour, onion powder, and garlic powder together. Add meat to seasoned flour. Dredge to coat and add flour and meat to pot with onions. Cook until meat is lightly browned, stirring frequently for about 8 to 10 minutes.\nAdd water and beef bouillon to pot and continue to cook and stir on high until soup begins to thicken. Bring to a boil. Turn heat off and add cheese. Cover the pot with a lid and allow the cheese to sit and melt.\nPour into bread bowls and garnish with chives and parsley.",
        "ingredients": [
            "1/4 cup canola oil",
            "1 1/2 large onions, diced small",
            "2 tablespoons kosher salt",
            "2 teaspoons freshly ground black pepper",
            "2 to 3 cups all-purpose flour",
            "1 tablespoon granulated onion powder",
            "2 tablespoons garlic powder",
            "2 1/2 pounds beef tenderloin, sliced lengthwise and cubed",
            "6 cups water",
            "1/4 cup beef bouillon cube powder",
            "8 ounces sliced American cheese",
            "Bread bowls, hollowed out, for serving",
            "Sliced chives, to garnish",
            "Chopped parsley leaves, to garnish"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Heat oil in a large stockpot or Dutch oven.",
                "Add diced onions and saute on high for 2 to 3 minutes until fragrant and tender.",
                "In a large bowl, mix salt, pepper, flour, onion powder, and garlic powder together.",
                "Add beef to the seasoned flour and dredge to coat.",
                "Add flour and beef to the pot with onions and cook until the beef is lightly browned, stirring frequently for 8 to 10 minutes.",
                "Add water and beef bouillon to the pot and continue to cook and stir on high.",
                "Bring the soup to a boil.",
                "Turn off the heat and add cheese, cover the pot with a lid and allow the cheese to melt.",
                "Pour the soup into hollowed-out bread bowls.",
                "Garnish with chives and parsley."
            ],
            "pure_ingredients": [
                "oil",
                "onions",
                "salt",
                "pepper",
                "flour",
                "onion powder",
                "garlic powder",
                "beef",
                "water",
                "beef bouillon",
                "cheese",
                "bread",
                "chives",
                "parsley"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "20 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "large stockpot or Dutch oven",
                "large bowl",
                "stirring spoon",
                "lid for pot"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "IrmsKwFegj/qjj5rUE1hceY6oJfrduO",
        "recipe_title": "Fish Dipping Sauce: Nuoc Cham",
        "original_instructions": "Whisk together the sugar, water, fish sauce, and lime juice in a bowl until the sugar is completely dissolved. Add the garlic, chile, and shallot, and let stand for 30 minutes before serving.",
        "ingredients": [
            "5 tablespoons sugar",
            "3 tablespoons water",
            "1/3 cup fish sauce",
            "1/2 cup lime or lemon juice",
            "1 large clove garlic, minced",
            "1 or more bird's eye or Thai chiles, seeded and minced",
            "1 shallot, peeled, thinly sliced, and rinsed (optional)"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Whisk together the sugar, water, fish sauce, and lime juice in a bowl until the sugar is completely dissolved.",
                "Add the minced garlic, minced chile, and thinly sliced shallot to the bowl.",
                "Let the mixture stand for 30 minutes before serving."
            ],
            "pure_ingredients": [
                "sugar",
                "water",
                "fish sauce",
                "lime juice",
                "garlic",
                "chile",
                "shallot"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "0 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "whisk",
                "bowl"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "ZuuGj0..JypCwEClWbbO0zsIUgfOCr6",
        "recipe_title": "Chocolate Ice Cream",
        "original_instructions": "Combine whipping cream, chocolate milk, syrup, evaporated and sweetened condensed milk in a large bowl. Mix well. Chill for 4 to 6 hours. Pour into ice cream freezer. Follow your freezer directions. When ice cream begins to set, add shavings if desired. Serve immediately.",
        "ingredients": [
            "2 cups heavy whipping cream",
            "2 cups chocolate milk (recommended: Promised Land)",
            "1 1/2 cups chocolate syrup",
            "2 cans evaporated milk",
            "1 can sweetened condensed milk",
            "1 cup bittersweet chocolate shavings, chopped fine (optional)"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Combine the heavy whipping cream, chocolate milk, chocolate syrup, evaporated milk, and sweetened condensed milk in a large bowl.",
                "Mix the ingredients well.",
                "Chill the mixture for 4 to 6 hours.",
                "Pour the chilled mixture into an ice cream freezer.",
                "Follow your freezer's directions to churn the ice cream.",
                "When the ice cream begins to set, add chocolate shavings if desired.",
                "Serve the ice cream immediately."
            ],
            "pure_ingredients": [
                "whipping cream",
                "milk",
                "syrup",
                "evaporated milk",
                "condensed milk",
                "chocolate"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "4 to 6 hours",
                "plating": "5 minutes"
            },
            "required_tools": [
                "large bowl",
                "ice cream freezer"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "f3RnTxJN/Vufnfo23xfl0TQR4HUITGK",
        "recipe_title": "Sauteed Crimini Mushrooms",
        "original_instructions": "Heat a large skillet over medium high heat. Add extra-virgin olive oil and butter. Add mushrooms and season with salt, pepper and thyme then cook 15 minutes until evenly browned and tender. Add wine and deglaze the pan. Add parsley and transfer mushrooms to a serving dish.",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil, 1 turn of the pan",
            "2 tablespoons butter",
            "1 1/2 pounds crimini mushrooms, brushed clean with damp towel",
            "Salt and pepper",
            "3 tablespoons fresh thyme leaves, chopped",
            "1/2 cup dry red wine",
            "2 tablespoons chopped fresh parsley leaves"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Heat a large skillet over medium high heat.",
                "Add extra-virgin olive oil and butter to the skillet.",
                "Add mushrooms to the skillet and season with salt, pepper, and thyme.",
                "Cook the mushrooms for 15 minutes until they are evenly browned and tender.",
                "Add wine to the skillet and deglaze the pan.",
                "Add parsley and transfer mushrooms to a serving dish."
            ],
            "pure_ingredients": [
                "olive oil",
                "butter",
                "mushrooms",
                "salt",
                "pepper",
                "thyme",
                "wine",
                "parsley"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "15 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "large skillet",
                "damp towel",
                "serving dish"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "xRYlJmsasqobhgiGQLli52uKEQLmby2",
        "recipe_title": "Shrimp Cakes with Peach Jalapeno Relish",
        "original_instructions": "In a food processor, pulse shrimp. Place into a large bowl. Pulse corn, pepper, onion and jalapeno. Remove and drain through a sieve to get rid of extra water that the vegetables may release. Add to bowl along with 1 cup bread crumbs, hot sauce, chili powder and eggs. Stir well together. Form into cakes about 1-inch thick. Place in the refrigerator for 15 minutes to firm up.\nHeat a large skillet with vegetable oil over medium heat.\nIn a shallow dish, add the remaining 1 cup of panko; add salt and pepper. Bread the cakes in the panko. Add the cakes in batches to the oil, cooking about 4 minutes per side. Remove to a paper towel lined sheet tray. Serve with relish.\nCombine all ingredients in a small bowl. Chill until ready to serve.",
        "ingredients": [
            "1 pound large peeled, deveined cooked shrimp, diced",
            "2 cups corn",
            "1/2 red bell pepper, finely diced",
            "1 small onion",
            "1 jalapeno, seeded",
            "1 cup panko bread crumbs",
            "Dash hot sauce",
            "1/2 teaspoon chili powder",
            "2 eggs, beaten",
            "Salt and freshly ground black pepper",
            "2 tablespoons vegetable oil",
            "Peach Jalepeno Relish, recipe follows",
            "3 ripe peaches, diced",
            "1/2 red onion, diced",
            "1 jalapeno (about 1 1/2 teaspoons), seeded and diced",
            "1/2 lime, juiced",
            "1 tablespoon sugar",
            "1/2 teaspoon salt",
            "1/4 teaspoon freshly ground black pepper"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In a food processor, pulse shrimp.",
                "Place shrimp into a large bowl.",
                "Pulse corn, pepper, onion and jalapeno.",
                "Remove vegetables and drain through a sieve to get rid of extra water.",
                "Add vegetables to the bowl with shrimp.",
                "Add 1 cup bread crumbs, hot sauce, chili powder, and eggs to the bowl.",
                "Stir the mixture well.",
                "Form the mixture into cakes about 1-inch thick.",
                "Place the cakes in the refrigerator for 15 minutes to firm up.",
                "Heat a large skillet with vegetable oil over medium heat.",
                "In a shallow dish, add the remaining 1 cup of panko, salt, and pepper.",
                "Bread the cakes in the panko mixture.",
                "Add the cakes in batches to the skillet, cooking about 4 minutes per side.",
                "Remove cakes to a paper towel-lined sheet tray.",
                "Serve the cakes with peach jalapeno relish.",
                "Combine peaches, red onion, jalapeno, lime juice, sugar, salt, and black pepper in a small bowl.",
                "Chill the relish until ready to serve."
            ],
            "pure_ingredients": [
                "shrimp",
                "corn",
                "pepper",
                "onion",
                "jalapeno",
                "bread crumbs",
                "hot sauce",
                "chili powder",
                "eggs",
                "salt",
                "black pepper",
                "vegetable oil",
                "peaches",
                "lime",
                "sugar"
            ],
            "cooking_time": {
                "preparation": "25 minutes",
                "cooking": "8 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "food processor",
                "large bowl",
                "sieve",
                "skillet",
                "shallow dish",
                "small bowl",
                "spatula",
                "paper towel"
            ],
            "dietary_labels": [
                "gluten-free",
                "dairy-free"
            ]
        }
    },
    {
        "recipe_id": "x0hPSRP8PtjYTkq95V1OZsc4HCEj13y",
        "recipe_title": "Arugula Salad with Carrot and Yellow Pepper ",
        "original_instructions": "In a small bowl whisk together the vinegar and salt and black pepper to taste, add the oil in a stream, whisking, and whisk the dressing until it is emulsified. In a large bowl combine the lettuce, the arugula, the carrot, and the bell pepper, drizzle the dressing over the salad, and toss the salad until it is combined well.\nIn a small bowl whisk together the vinegar and salt and black pepper to taste, add the oil in a stream, whisking, and whisk the dressing until it is emulsified. In a large bowl combine the lettuce, the arugula, the carrot, and the bell pepper, drizzle the dressing over the salad, and toss the salad until it is combined well.",
        "ingredients": [
            "4 teaspoons white-wine vinegar",
            "1/2 cup olive oil",
            "10 cups loosely packed bite-size pieces of leaf lettuce, rinsed and spun dry",
            "3 cups arugula, course stems discarded and the leaves rinsed and spun dry",
            "1/2 cup grated carrot",
            "1/2 cup julienne strips of yellow bell pepper"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In a small bowl, whisk together the vinegar, salt, and black pepper to taste.",
                "Add the olive oil in a stream while whisking, and continue to whisk until the dressing is emulsified.",
                "In a large bowl, combine the leaf lettuce, arugula, carrot, and yellow bell pepper.",
                "Drizzle the dressing over the salad.",
                "Toss the salad until it is well combined."
            ],
            "pure_ingredients": [
                "vinegar",
                "salt",
                "black pepper",
                "olive oil",
                "lettuce",
                "arugula",
                "carrot",
                "bell pepper"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "0 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "small bowl",
                "whisk",
                "large bowl"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "BLz7AlqOMJrs76yctiEwgztRVQW.5/K",
        "recipe_title": "Cosmopolitan Snow Cone",
        "original_instructions": "Place about 10 ice cubes in a plastic bag with a zipper-like closure. With a mallet, a rolling pin or the handle of a large knife, crack the ice into coarse pieces. Transfer them to the bowl of a food processor. Pulse until ice is finely shaved, but not powdery. Transfer it to a chilled bowl. Working with your hands, gently gather ice shavings and shape into a 2 to 4-inch ball, depending on size of serving glass. Do not pack the ice too tightly. Place ball in a chilled glass.\nFill a cocktail shaker one-third of the way up with crushed ice. Add vodka, orange liqueur, lime juice and cranberry juice. Shake well and strain liquid over the snowball. Garnish with the lemon or lime twist and serve with a small cocktail straw.",
        "ingredients": [
            "2 ounces mandarin-orange-flavored vodka",
            "1/2-ounce orange liqueur",
            "1-ounce Rose's lime juice",
            "2 ounces cranberry juice",
            "Lemon or lime twist for garnish"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Place about 10 ice cubes in a plastic bag with a zipper-like closure.",
                "With a mallet, a rolling pin or the handle of a large knife, crack the ice into coarse pieces.",
                "Transfer them to the bowl of a food processor.",
                "Pulse until ice is finely shaved, but not powdery.",
                "Transfer it to a chilled bowl.",
                "Working with your hands, gently gather ice shavings and shape into a 2 to 4-inch ball, depending on size of serving glass.",
                "Do not pack the ice too tightly.",
                "Place ball in a chilled glass.",
                "Fill a cocktail shaker one-third of the way up with crushed ice.",
                "Add vodka, orange liqueur, lime juice and cranberry juice.",
                "Shake well and strain liquid over the snowball.",
                "Garnish with the lemon twist and serve with a small cocktail straw."
            ],
            "pure_ingredients": [
                "ice cubes",
                "vodka",
                "orange liqueur",
                "lime juice",
                "cranberry juice",
                "lemon"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "0 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "plastic bag with zipper-like closure",
                "mallet",
                "rolling pin",
                "large knife",
                "food processor",
                "chilled bowl",
                "cocktail shaker",
                "serving glass",
                "small cocktail straw"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "F3jQzh/zmZtW2wZpgCmOUeB.mZh.f8O",
        "recipe_title": "Trippa Alla Fiorentina: Florentine Tripe",
        "original_instructions": "In a saucepan, heat the extra-virgin olive oil. Add the garlic, celery, carrot, and onion and saute until they are soft. Add the tripe, and cook together on medium heat, for about 5 minutes. Add the tomatoes including the juices. Break up the whole plum tomatoes with a fork.\nLet the mixture cook together until the sauce has reduced and thickened, about 15 minutes. Remove the pan from the heat, season with salt and pepper, to taste, and add the freshly grated Parmigiano cheese. Stir well and serve warm.",
        "ingredients": [
            "6 tablespoons extra-virgin olive oil",
            "2 cloves garlic, chopped",
            "1 large celery, chopped",
            "1 large carrot, chopped",
            "1 large onion, chopped",
            "2 pounds tripe, cleaned, boiled* and cut into strips",
            "1 (10 ounce) can peeled plum tomatoes, with juices",
            "Salt and freshly ground black pepper",
            "1/2 cup freshly grated Parmigiano Reggiano cheese"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Heat the extra-virgin olive oil in a saucepan.",
                "Add the garlic, celery, carrot, and onion and saute until they are soft.",
                "Add the tripe and cook together on medium heat for about 5 minutes.",
                "Add the tomatoes including the juices.",
                "Break up the whole plum tomatoes with a fork.",
                "Let the mixture cook together until the sauce has reduced and thickened, about 15 minutes.",
                "Remove the pan from the heat, season with salt and pepper to taste.",
                "Add the freshly grated Parmigiano cheese, stir well.",
                "Serve warm."
            ],
            "pure_ingredients": [
                "olive oil",
                "garlic",
                "celery",
                "carrot",
                "onion",
                "tripe",
                "tomatoes",
                "salt",
                "pepper",
                "cheese"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "20 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "saucepan",
                "fork"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "yCEFUaOan7R1/q3KAePa3WgXnNomfBm",
        "recipe_title": "Date Orange Filling for Hamantaschen ",
        "original_instructions": "In a food processor blend together all filling ingredients except water until an almost smooth, jamlike consistency. If date mixture is very dry blend in water, 1 tablespoon at a time. Filling may be made 2 days ahead and chilled, covered.\nIn a food processor blend together all filling ingredients except water until an almost smooth, jamlike consistency. If date mixture is very dry blend in water, 1 tablespoon at a time. Filling may be made 2 days ahead and chilled, covered.",
        "ingredients": [
            "1 1/4 cups packed pitted dates (about 10 ounces)",
            "1 teaspoon packed finely grated fresh orange zest",
            "1/3 cup fresh orange juice",
            "3/4 teaspoon cinnamon",
            "1/4 teaspoon almond extract",
            "1 to 2 tablespoons water if necessary"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Place all filling ingredients except water into a food processor.",
                "Blend the mixture until it reaches an almost smooth, jamlike consistency.",
                "If the mixture is very dry, blend in water, adding 1 tablespoon at a time.",
                "Filling can be made 2 days ahead and stored in the refrigerator, covered."
            ],
            "pure_ingredients": [
                "dates",
                "orange zest",
                "orange juice",
                "cinnamon",
                "almond extract",
                "water"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "0 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "food processor",
                "grater",
                "measuring cups",
                "measuring spoons"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "ekrOPV4PIIayRhBubqFJc6qtNE0lTse",
        "recipe_title": "Shortcakes with Chantilly Cream and Passion Fruit Basil Syrup",
        "original_instructions": "Place the sugar and 1/2 cup water in a small pot and bring to a boil. Once the sugar has dissolved, remove from the heat and add the basil stems. Allow the basil to infuse the simple syrup for approximately half an hour.\nRemove the basil stems and strain the basil syrup into a bowl. Add the passion fruit pulp to the syrup, stir to incorporate and set aside.\nIn a chilled metal bowl, place the whipping cream, cream cheese, vanilla and sugar. Whip until medium-soft peaks form.\nTo assemble, place a shortcake on a serving plate. Spoon the passion fruit basil syrup over and around the cake. Dollop the chantilly cream on the cake and garnish with a reserved basil leaf.",
        "ingredients": [
            "1/2 cup sugar",
            "1/2 cup basil stems with leaves, plus 4 leaves for garnish",
            "2 passion fruits",
            "1 cup 35-percent whipping cream",
            "1/4 cup cream cheese",
            "1 tablespoon sugar",
            "1 teaspoon vanilla extract",
            "4 store-bought mini shortcakes or sponge cakes"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Place the sugar and 1/2 cup water in a small pot and bring to a boil.",
                "Once the sugar has dissolved, remove from the heat and add the basil stems.",
                "Allow the basil to infuse the simple syrup for approximately half an hour.",
                "Remove the basil stems and strain the basil syrup into a bowl.",
                "Add the passion fruit pulp to the syrup, stir to incorporate and set aside.",
                "In a chilled metal bowl, place the whipping cream, cream cheese, vanilla and sugar.",
                "Whip until medium-soft peaks form.",
                "To assemble, place a shortcake on a serving plate.",
                "Spoon the passion fruit basil syrup over and around the cake.",
                "Dollop the chantilly cream on the cake and garnish with a reserved basil leaf."
            ],
            "pure_ingredients": [
                "sugar",
                "basil",
                "passion fruit",
                "cream",
                "cheese",
                "vanilla",
                "water",
                "cake"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "5 minutes",
                "plating": "10 minutes"
            },
            "required_tools": [
                "small pot",
                "bowl",
                "whisk",
                "serving plate",
                "strainer"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "NXFA09eYvi1F7EFclNhtPGiBShnqCkm",
        "recipe_title": "Leg of Lamb Poached in White Wine Court Bouillon ",
        "original_instructions": "Pique the boned and tied leg of lamb with slivers of garlic (cut small gashes and insert garlic) and rub it will with dried rosemary. Put wine, and equal amount of water, vegetables, and seasonings in a large kettle, bring to a boil and simmer for 25 minutes. Add lamb and bring liquid to a boil again. Cover the pan, reduce heat and simmer, allowing 15 minutes per pound of meat. Serve with Sauce Soubise. With this, drink chilled Pouilly Fuissé.\nPique the boned and tied leg of lamb with slivers of garlic (cut small gashes and insert garlic) and rub it will with dried rosemary. Put wine, and equal amount of water, vegetables, and seasonings in a large kettle, bring to a boil and simmer for 25 minutes. Add lamb and bring liquid to a boil again. Cover the pan, reduce heat and simmer, allowing 15 minutes per pound of meat. Serve with Sauce Soubise. With this, drink chilled Pouilly Fuissé.",
        "ingredients": [
            "1 small leg of lamb, boned and tied",
            "Garlic cloves, dried rosemary",
            "1 bottle white wine (Pouilly Fuissé)",
            "2 onions, stuck with cloves",
            "1 carrot",
            "1 stalk celery",
            "1 tablespoon salt",
            "1 teaspoon freshly ground black pepper",
            "Sauce Soubise"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Pique the boned and tied leg of lamb with slivers of garlic by cutting small gashes and inserting garlic.",
                "Rub the lamb well with dried rosemary.",
                "Put white wine, an equal amount of water, onions stuck with cloves, carrot, celery, salt, and black pepper in a large kettle.",
                "Bring the mixture to a boil and simmer for 25 minutes.",
                "Add the lamb to the kettle and bring the liquid to a boil again.",
                "Cover the pan, reduce the heat, and simmer, allowing 15 minutes per pound of meat.",
                "Serve with Sauce Soubise."
            ],
            "pure_ingredients": [
                "lamb",
                "garlic",
                "rosemary",
                "wine",
                "onions",
                "cloves",
                "carrot",
                "celery",
                "salt",
                "black pepper"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "60 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "knife",
                "large kettle",
                "lid for the kettle"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "bIX1xNeU2F2KvVNek.RExyJyeuRsXMi",
        "recipe_title": "Orange Butter ",
        "original_instructions": "Pulse butter and marmalade in a food processor until combined well. Transfer to a small crock or serving bowl.\nPulse butter and marmalade in a food processor until combined well. Transfer to a small crock or serving bowl.",
        "ingredients": [
            "1 stick (1/2 cup) salted or unsalted butter, softened",
            "1/3 cup orange marmalade"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Pulse butter and marmalade in a food processor until combined well.",
                "Transfer to a small crock or serving bowl."
            ],
            "pure_ingredients": [
                "butter",
                "orange"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "0 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "food processor",
                "small crock or serving bowl"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "F0Mz2SS4fsBctbaLnRYEb7oW6TTJFtS",
        "recipe_title": "Chipotle Chile Rub",
        "original_instructions": "Combine ingredients in a large bowl and mix well. Transfer mixture to a sealed container. This rub can be stored in the freezer for several months.",
        "ingredients": [
            "1/2 cup brown sugar, packed",
            "1/2 cup chili pepper",
            "1/2 cup coarse salt",
            "2 tablespoons onion salt",
            "2 tablespoons garlic salt",
            "2 tablespoons celery salt",
            "2 tablespoons black pepper",
            "2 tablespoons mustard powder",
            "1 tablespoon chipotle chili powder (can substitute with 2 teaspoons cayenne pepper and 1 teaspoon hickory smoke salt)"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Combine all the ingredients in a large bowl.",
                "Mix the ingredients well until evenly combined.",
                "Transfer the mixture to a sealed container for storage."
            ],
            "pure_ingredients": [
                "sugar",
                "chili pepper",
                "salt",
                "onion",
                "garlic",
                "celery",
                "black pepper",
                "mustard",
                "chipotle chili"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "0 minutes",
                "plating": "0 minutes"
            },
            "required_tools": [
                "large bowl",
                "spoon",
                "sealed container"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "my1NspWzSdF8kJT/oMuJbXw8Cmxlnzi",
        "recipe_title": "Grilled Asparagus with Feta",
        "original_instructions": "Slice about 1-inch from the bottom of the asparagus stalks. Place stalks in a jar of water to rehydrate for several hours.\nCover an outdoor grill with aluminum foil. Preheat grill to high heat.\nIn a large bowl, toss asparagus with thyme and olive oil until all the asparagus is coated. Season with salt and pepper.\nPlace asparagus on the foil-covered grill and cook until tender, rotating frequently to avoid scorching, about 6 to 7 minutes. Place asparagus on a platter and sprinkle with the feta.",
        "ingredients": [
            "1 pound asparagus",
            "3 tablespoons chopped fresh thyme leaves",
            "3 tablespoons extra-virgin olive oil",
            "Kosher salt and freshly ground black pepper",
            "1/2 cup crumbled feta"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Slice about 1-inch from the bottom of the asparagus stalks.",
                "Place stalks in a jar of water to rehydrate for several hours.",
                "Cover an outdoor grill with aluminum foil.",
                "Preheat grill to high heat.",
                "In a large bowl, toss asparagus with thyme and olive oil until all the asparagus is coated.",
                "Season the asparagus with salt and pepper.",
                "Place asparagus on the foil-covered grill and cook until tender, rotating frequently to avoid scorching, about 6 to 7 minutes.",
                "Place asparagus on a platter and sprinkle with the feta."
            ],
            "pure_ingredients": [
                "asparagus",
                "thyme",
                "olive oil",
                "salt",
                "pepper",
                "feta"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "7 minutes",
                "plating": "3 minutes"
            },
            "required_tools": [
                "knife",
                "jar",
                "outdoor grill",
                "aluminum foil",
                "large bowl",
                "platter"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "jvivcuZj3HIzAlhFeAoxJUMYuo9D1pi",
        "recipe_title": "Roasted Duck in Fermented Bean Curd: Vit Nuong Chao",
        "original_instructions": "For the marinade: Combine the white bean curd, sugar, red fermented bean curd, ginger, bean curd water, and oil and mix well. Coat the duck with marinade and marinate in the refrigerator for 2 hours or overnight. Heat a charcoal grill to medium heat. Roast and rotate the duck over charcoal for 20 minutes.",
        "ingredients": [
            "1 small duck",
            "4 tablespoons white bean curd",
            "3 tablespoons sugar",
            "2 tablespoons red fermented bean curd",
            "2 tablespoons pounded ginger",
            "2 tablespoons bean curd water",
            "2 teaspoons sesame oil"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Combine white bean curd, sugar, red fermented bean curd, ginger, bean curd water, and sesame oil in a bowl and mix well.",
                "Coat the duck with the marinade.",
                "Marinate the duck in the refrigerator for 2 hours or overnight.",
                "Heat a charcoal grill to medium heat.",
                "Roast and rotate the duck over charcoal for 20 minutes."
            ],
            "pure_ingredients": [
                "duck",
                "bean curd",
                "sugar",
                "ginger",
                "oil"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "20 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "bowl",
                "charcoal grill",
                "refrigerator",
                "spatula"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "lQmkkWguzWBamSol.Kk8xQxu0TzTMv2",
        "recipe_title": "Andrew's Brownies",
        "original_instructions": "Preheat oven to 350 degrees and butter and flour a 9-inch square baking pan, knocking out excess flour.\nIn a metal bowl set over a pan of barely simmering water melt chocolates and butter, stirring, and remove bowl from heat. Cool chocolate mixture.\nIn a large bowl whisk together sugar, eggs, and vanilla until smooth and whisk in chocolate mixture. Add flour and salt and stir until combined well. Stir in walnuts and spread batter in prepared pan. Smooth top and bake in middle of oven 30 to 40 minutes, or until a tester comes out with crumbs adhering. Cool brownies in pan on a rack and cut into 3-inch squares.",
        "ingredients": [
            "2 ounces unsweetened chocolate, chopped",
            "1/2 cup semisweet chocolate chips",
            "3/4 stick (6 tablespoons) unsalted butter",
            "1 1/3 cups sugar",
            "3 large eggs",
            "1 teaspoon vanilla",
            "3/4 cup all-purpose flour",
            "1/4 teaspoon salt",
            "3/4 cup walnuts, coarsely chopped"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat oven to 350 degrees.",
                "Butter and flour a 9-inch square baking pan, knocking out the excess flour.",
                "In a metal bowl set over a pan of barely simmering water, melt the chocolates and butter, stirring occasionally.",
                "Remove the bowl from heat and cool the chocolate mixture.",
                "In a large bowl, whisk together sugar, eggs, and vanilla until smooth.",
                "Whisk in the cooled chocolate mixture.",
                "Add flour and salt and stir until combined well.",
                "Stir in walnuts.",
                "Spread batter in the prepared pan and smooth the top.",
                "Bake in the middle of the oven for 30 to 40 minutes, or until a tester comes out with crumbs adhering.",
                "Cool brownies in pan on a rack.",
                "Cut into 3-inch squares."
            ],
            "pure_ingredients": [
                "chocolate",
                "chocolate chips",
                "butter",
                "sugar",
                "eggs",
                "vanilla",
                "flour",
                "salt",
                "walnuts"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "40 minutes",
                "plating": "10 minutes"
            },
            "required_tools": [
                "oven",
                "9-inch square baking pan",
                "metal bowl",
                "pan",
                "whisk",
                "tester",
                "cooling rack"
            ],
            "dietary_labels": [
                "contains nuts",
                "contains eggs",
                "contains dairy",
                "contains gluten"
            ]
        }
    },
    {
        "recipe_id": "5eKW46QOi7fKTLDBN70JeLAESGMFHMu",
        "recipe_title": "Hot Wings",
        "original_instructions": "Preheat a grill to medium-high.\nSeason the wings with Cajun pepper. In a medium bowl, combine the chipotle pepper sauce with 1 tablespoon Cajun pepper, and honey, to taste. Place the wings on the grill and as you cook them, turn them and brush each time with the pepper sauce mixture. Make sure the wings cook long enough on each side so they get crispy around the edges.\nRemove the wings from the grill and brush again with the pepper sauce mixture before serving.",
        "ingredients": [
            "10 to 12 chicken drumettes",
            "1 tablespoon Cajun pepper, plus more for seasoning wings",
            "1 bottle chipotle pepper sauce",
            "Honey"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat a grill to medium-high.",
                "Season the wings with Cajun pepper.",
                "In a medium bowl, combine the chipotle pepper sauce with 1 tablespoon Cajun pepper, and honey, to taste.",
                "Place the wings on the grill and as you cook them, turn them and brush each time with the pepper sauce mixture.",
                "Make sure the wings cook long enough on each side so they get crispy around the edges.",
                "Remove the wings from the grill and brush again with the pepper sauce mixture before serving."
            ],
            "pure_ingredients": [
                "chicken",
                "cajun pepper",
                "chipotle sauce",
                "honey"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "20 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "grill",
                "bowl",
                "brush"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "NXsJqmwWrOb3hmP1Py.4pfB8cppwAie",
        "recipe_title": "Beef Tartare (Bocconcino di Tartara)",
        "original_instructions": "Heat a griddle over high heat. Sear the lemon slices on each side until they become slightly caramelized. Set aside. When ready to serve, chop the beef filet as finely as possible by hand using a sharp knife. Form the chopped meat into loose balls, about 1 ounce each.\nPlace the seared lemons on a plate and top with the filet tartare balls. Serve immediately with lemon zest and sea salt as accompaniments.",
        "ingredients": [
            "7 lemons, sliced 1/4 inch thick (about 48 slices), plus zest of 6 lemons",
            "3 pounds center-cut beef filet",
            "Sea salt"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Heat a griddle over high heat.",
                "Sear the lemon slices on each side until they become slightly caramelized.",
                "Set the lemons aside.",
                "When ready to serve, chop the beef filet as finely as possible by hand using a sharp knife.",
                "Form the chopped meat into loose balls, about 1 ounce each.",
                "Place the seared lemons on a plate and top with the filet tartare balls.",
                "Serve immediately with lemon zest and salt as accompaniments."
            ],
            "pure_ingredients": [
                "lemons",
                "beef",
                "salt"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "10 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "griddle",
                "knife",
                "plate"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "HqNdO0C0RLCst7gKeebQX3/VKLGEqBi",
        "recipe_title": "Birds in a Nest",
        "original_instructions": "Place a very large nonstick skillet over low heat. Add the oil and garlic clove into the skillet and gently infuse the garlic flavor into the oil. In the meantime, using a round cookie cutter or an empty can, cut out the center of all 6 slices of bread. Add the prepared bread slices to the garlic infused oil. Crack the eggs 1 at a time and drop them into their \"nests\" or, the center of each slice of bread. Drain and slice red pepper. Add a strip or 2 of red pepper to each nest. Season the birds in their nests with salt and pepper and sprinkle a little cheese into each nest. Gently turn the birds in their nests and turn off the heat. Let the eggs sit in their nests 5 minutes more, then transfer to a platter and serve.",
        "ingredients": [
            "1/2 cup extra-virgin olive oil, eyeball it",
            "1 large clove garlic, cracked",
            "6 big, thick slices crusty Italian semolina bread",
            "6 extra large eggs",
            "1 (6-ounce) jar roasted red pepper",
            "Salt and pepper",
            "1/2 cup grated cheese, Parmesan or Romano"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Place a very large nonstick skillet over low heat.",
                "Add the oil and garlic clove into the skillet and gently infuse the garlic flavor into the oil.",
                "Using a round cookie cutter or an empty can, cut out the center of all 6 slices of bread.",
                "Add the prepared bread slices to the garlic infused oil in the skillet.",
                "Crack the eggs one at a time and drop them into the center of each slice of bread.",
                "Drain and slice the red pepper.",
                "Add a strip or two of red pepper to each nest.",
                "Season each nest with salt and pepper.",
                "Sprinkle a little cheese into each nest.",
                "Gently turn the bread with eggs in their nests and turn off the heat.",
                "Let the eggs sit in their nests for 5 more minutes.",
                "Transfer the nests to a platter and serve."
            ],
            "pure_ingredients": [
                "olive oil",
                "garlic",
                "bread",
                "eggs",
                "red pepper",
                "salt",
                "pepper",
                "cheese"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "15 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "nonstick skillet",
                "round cookie cutter",
                "can",
                "knife",
                "platter"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "W43Oz6ti9.q8O6ebpZAcxksbFWBbkhe",
        "recipe_title": "Ghastly Meringues",
        "original_instructions": "Preheat the oven to 200 degrees F. Line a baking sheet with parchment paper. Beat the egg whites and cream of tartar in a large bowl with a mixer on medium speed until frothy. Beat in the sugar; increase the mixer speed to high and beat until stiff peaks form, 5 to 6 minutes.\nTransfer to a pastry bag fitted with a large round tip. Pipe 8 to 10 swirls on the prepared baking sheet. Bake until dry, 1 hour to 1 hour, 15 minutes. Transfer the baking sheet to a rack and let cool completely.\nPut the chocolate chips in a microwave-safe bowl; microwave on 50 percent power until melted, about 1 minute, stirring halfway. Transfer the melted chocolate to a zip-top bag and snip a corner. Pipe the chocolate on the meringues to look like eyes.\nPhotograph by Raymond Hom",
        "ingredients": [
            "3 large egg whites",
            "1/2 teaspoon cream of tartar",
            "3/4 cup sugar",
            "1/2 cup semisweet chocolate chips"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat the oven to 200 degrees F.",
                "Line a baking sheet with parchment paper.",
                "Beat the egg whites and cream of tartar in a large bowl with a mixer on medium speed until frothy.",
                "Beat in the sugar; increase the mixer speed to high and beat until stiff peaks form, 5 to 6 minutes.",
                "Transfer the mixture to a pastry bag fitted with a large round tip.",
                "Pipe 8 to 10 swirls on the prepared baking sheet.",
                "Bake until dry, 1 hour to 1 hour, 15 minutes.",
                "Transfer the baking sheet to a rack and let cool completely.",
                "Put the chocolate chips in a microwave-safe bowl; microwave on 50 percent power until melted, about 1 minute, stirring halfway.",
                "Transfer the melted chocolate to a zip-top bag and snip a corner.",
                "Pipe the chocolate on the meringues to look like eyes."
            ],
            "pure_ingredients": [
                "egg",
                "cream of tartar",
                "sugar",
                "chocolate"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "75 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "oven",
                "baking sheet",
                "parchment paper",
                "mixer",
                "large bowl",
                "pastry bag",
                "microwave-safe bowl",
                "microwave",
                "zip-top bag"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "FuKryYWhhavse1O.PEEbCcB.RG2B7Ze",
        "recipe_title": "Peruvian Chicken",
        "original_instructions": "Special equipment: an instant-read thermometer\nCombine the rosemary, cumin, garlic, soy sauce, vinegar, oregano, lime juice, hoisin sauce, beer, salt and pepper in a blender and blend until completely combined. Pour the marinade over the chicken in a container and let it marinate, refrigerated, for 24 hours.\nPreheat the oven to 400 degrees F.\nRemove the chicken from the marinade (discard the marinade) and put on a rack in a roasting pan. Roast until the internal temperature registers 165 degrees F on an instant-read thermometer, about 1 hour. Let the chicken rest for 15 minutes before slicing and serving.",
        "ingredients": [
            "1/2 tablespoon chopped fresh rosemary",
            "1 tablespoon ground cumin",
            "3 cloves garlic",
            "3 tablespoons soy sauce",
            "1 tablespoon white vinegar",
            "1 tablespoon fresh oregano",
            "Juice of 1/2 lime",
            "1 tablespoon hoisin sauce",
            "1 bottle beer (lager)",
            "1/2 tablespoon salt",
            "1 tablespoon freshly ground black pepper",
            "One 3- to 4-pound chicken"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Combine rosemary, cumin, garlic, soy sauce, vinegar, oregano, lime juice, hoisin sauce, beer, salt, and pepper in a blender.",
                "Blend until completely combined.",
                "Pour the marinade over the chicken in a container.",
                "Refrigerate and marinate the chicken for 24 hours.",
                "Preheat the oven to 400 degrees F.",
                "Remove the chicken from the marinade and discard the marinade.",
                "Place the chicken on a rack in a roasting pan.",
                "Roast the chicken until the internal temperature registers 165 degrees F, about 1 hour.",
                "Let the chicken rest for 15 minutes before slicing and serving."
            ],
            "pure_ingredients": [
                "rosemary",
                "cumin",
                "garlic",
                "soy sauce",
                "vinegar",
                "oregano",
                "lime",
                "hoisin sauce",
                "beer",
                "salt",
                "pepper",
                "chicken"
            ],
            "cooking_time": {
                "preparation": "30 minutes",
                "cooking": "1 hour",
                "plating": "15 minutes"
            },
            "required_tools": [
                "blender",
                "container",
                "refrigerator",
                "oven",
                "roasting pan",
                "rack",
                "instant-read thermometer"
            ],
            "dietary_labels": [
                "gluten"
            ]
        }
    },
    {
        "recipe_id": "RzXe5DKlSaHav2M0RPQHtmuIjTxj0b2",
        "recipe_title": "Broccoli Souffle",
        "original_instructions": "Preheat oven to 350 degrees. Cook chopped broccoli then set aside. Melt butter in saucepan, stir in flour and cook over high heat for 2 minutes. Remove from heat. Add milk, whisk vigorously. Return to heat, stirring until thick and smooth, continue to stir while adding cheese and spices. Remove from heat and add beaten egg yolks little by little -- do not boil or mixture will curdle. Add drained broccoli and set the mixture aside. Beat the cream of tartar with the egg whites with until they are stiff. Fold in 1/3 of the whites to the broccoli mixture. Fold in the remaining egg whites.\nPour mixture into an 8 cup buttered souffle dish and bake in the preheated 350 degree oven for 45 minutes.",
        "ingredients": [
            "2 (10-ounce) packages frozen chopped broccoli",
            "1/4 cup butter",
            "1/4 cup flour",
            "2 cups milk",
            "1/2 cup grated Parmesan cheese",
            "1/2 teaspoon salt",
            "1/8 teaspoon pepper",
            "1/4 teaspoon grated nutmeg",
            "6 egg yolks beaten",
            "1/4 teaspoon cream of tartar",
            "8 egg whites beaten stiff"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat the oven to 350 degrees.",
                "Cook chopped broccoli and set aside.",
                "Melt butter in a saucepan, stir in flour and cook over high heat for 2 minutes.",
                "Remove from heat. Add milk, whisk vigorously.",
                "Return to heat and stir until thick and smooth, continue to stir while adding cheese and spices.",
                "Remove from heat and add beaten egg yolks little by little -- do not boil or the mixture will curdle.",
                "Add drained broccoli and set the mixture aside.",
                "Beat the cream of tartar with the egg whites until they are stiff.",
                "Fold in 1/3 of the egg whites into the broccoli mixture.",
                "Fold in the remaining egg whites.",
                "Pour mixture into an 8 cup buttered souffle dish.",
                "Bake in the preheated 350 degree oven for 45 minutes."
            ],
            "pure_ingredients": [
                "broccoli",
                "butter",
                "flour",
                "milk",
                "Parmesan cheese",
                "salt",
                "pepper",
                "nutmeg",
                "egg yolks",
                "cream of tartar",
                "egg whites"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "45 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "oven",
                "saucepan",
                "whisk",
                "souffle dish",
                "spoon",
                "mixing bowl"
            ],
            "dietary_labels": [
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "hJbyC289rDLcVRt.1F2M.xABE6NIXOi",
        "recipe_title": "Moroccan Chicken Stew",
        "original_instructions": "Toss flour and chicken in bag to coat. Cook chicken in oil in nonstick skillet 6 minutes, until browned, turning once. Transfer to plate.\nCook onion in skillet 7 minutes. Add garlic, cinnamon, ginger, cumin, cayenne; cook 1 minute. Stir in tomato, honey and salt. Add chicken; simmer, covered, 10 minutes. Stir in peppers, raisins and chickpeas; simmer, stirring, 15 minutes, until peppers are tender and chicken is no longer pink near the bone.\nServe over orzo. Sprinkle with almonds and parsley.",
        "ingredients": [
            "2 tablespoons all-purpose flour",
            "1 1/2 pounds skinless chicken thighs",
            "1 tablespoon olive oil",
            "2 red onions, quartered lengthwise, sliced crosswise",
            "2 cloves garlic, finely chopped",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground ginger",
            "1 teaspoon ground cumin",
            "1/4 teaspoon cayenne pepper",
            "1 (16-ounce) can tomato puree (no salt added)",
            "1/4 cup honey",
            "1 1/2 teaspoons salt",
            "2 sweet green peppers, cut in 1/2-inch squares",
            "1/3 cup golden raisins",
            "1 can (15 ounces) chickpeas, rinsed and drained",
            "12 ounces orzo pasta, cooked",
            "1/3 cup slivered almonds, toasted",
            "3 tablespoons chopped parsley leaves"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Toss flour and chicken in a bag to coat.",
                "Cook chicken in oil in a nonstick skillet for 6 minutes until browned, turning once.",
                "Transfer chicken to a plate.",
                "Cook onion in the skillet for 7 minutes.",
                "Add garlic, cinnamon, ginger, cumin, and cayenne; cook for 1 minute.",
                "Stir in tomato puree, honey, and salt.",
                "Add chicken back to the skillet; simmer, covered, for 10 minutes.",
                "Stir in peppers, raisins, and chickpeas; simmer, stirring occasionally, for 15 minutes until peppers are tender and chicken is no longer pink near the bone.",
                "Serve over cooked orzo.",
                "Sprinkle with almonds and parsley before serving."
            ],
            "pure_ingredients": [
                "flour",
                "chicken",
                "olive oil",
                "onion",
                "garlic",
                "cinnamon",
                "ginger",
                "cumin",
                "cayenne pepper",
                "tomato",
                "honey",
                "salt",
                "bell peppers",
                "raisins",
                "chickpeas",
                "orzo",
                "almonds",
                "parsley"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "38 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "bag",
                "nonstick skillet",
                "plate",
                "knife",
                "spoon"
            ],
            "dietary_labels": [
                "nut-free"
            ]
        }
    },
    {
        "recipe_id": "q4OBaC.GjRtFoYV.X4.R39CI9YWo7u2",
        "recipe_title": "Chili",
        "original_instructions": "Pour 1 gallon water into a large pot. Add the meat and stir with a spoon to break it up and combine with the water. Put the pot over low heat and cook for 5 hours. Remove the excess water and grease during the cooking process. At the end of the cooking time, add the onion, chili powder, paprika, cumin, garlic, black pepper, red pepper and salt to taste. Add the beans and tomato sauce to a large serving bowl and stir in the cooked chili.",
        "ingredients": [
            "10 pounds lean ground beef",
            "1/4 cup minced onion",
            "1/4 cup chili powder",
            "3 teaspoons paprika",
            "1 1/4 teaspoons ground cumin",
            "1 teaspoon granulated garlic",
            "1 teaspoon black pepper",
            "1 teaspoon red pepper",
            "Salt",
            "Two 15-ounce cans red beans",
            "Two 15-ounce cans tomato sauce"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Pour 1 gallon water into a large pot.",
                "Add the meat and stir with a spoon to break it up and combine with the water.",
                "Put the pot over low heat and cook for 5 hours.",
                "Remove the excess water and grease during the cooking process.",
                "At the end of the cooking time, add the onion, chili powder, paprika, cumin, garlic, black pepper, red pepper, and salt to taste.",
                "Add the beans and tomato sauce to a large serving bowl.",
                "Stir in the cooked chili."
            ],
            "pure_ingredients": [
                "water",
                "beef",
                "onion",
                "chili powder",
                "paprika",
                "cumin",
                "garlic",
                "black pepper",
                "red pepper",
                "salt",
                "beans",
                "tomato"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "5 hours",
                "plating": "5 minutes"
            },
            "required_tools": [
                "large pot",
                "spoon",
                "serving bowl"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "uZrzb7IVyVZId3Cv/Tti.naPNALt6CO",
        "recipe_title": "Grilled Corn and Chipotle Pepper Salad",
        "original_instructions": "Preheat the grill to medium.\nArrange the corn on the grill and cook, turning frequently, until the corn is slightly charred, about 12 to 15 minutes\nRemove the corn from the grill to a cutting board and let cool. Cut the kernels from the cobs with a sharp knife and transfer to a serving bowl. Add all the remaining ingredients and toss to combine.",
        "ingredients": [
            "8 ears fresh corn, husks and silk removed",
            "1/2 red bell pepper, diced",
            "1/2 red onion, chopped",
            "2 tablespoons sliced green onion",
            "2 chipotle peppers, minced",
            "3 tablespoons chopped fresh cilantro leaves",
            "1/4 cup extra-virgin olive oil",
            "1 tablespoon minced garlic",
            "1 lime, juiced",
            "1 1/2 tablespoons kosher salt",
            "1 teaspoon coarsely ground black pepper"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat the grill to medium.",
                "Arrange the corn on the grill and cook, turning frequently, until the corn is slightly charred, about 12 to 15 minutes.",
                "Remove the corn from the grill to a cutting board and let cool.",
                "Cut the kernels from the cobs with a sharp knife and transfer to a serving bowl.",
                "Add the red bell pepper, red onion, green onion, chipotle peppers, cilantro leaves, olive oil, minced garlic, lime juice, salt, and black pepper to the bowl.",
                "Toss to combine all the ingredients."
            ],
            "pure_ingredients": [
                "corn",
                "bell pepper",
                "onion",
                "green onion",
                "chipotle peppers",
                "cilantro",
                "olive oil",
                "garlic",
                "lime",
                "salt",
                "black pepper"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "15 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "grill",
                "cutting board",
                "knife",
                "serving bowl",
                "tongs"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "lBTOt3v9hf2J56LjefKVZLcD79fdeiu",
        "recipe_title": "Broiled Roma Tomatoes ",
        "original_instructions": "Preheat broiler. Place tomatoes cut side up in baking dish. Spread garlic over cut half of tomatoes. Sprinkle tomatoes with oregano then Romano. Season with pepper. Broil until tomatoes are tender, about 5 minutes. Serve.\nPreheat broiler. Place tomatoes cut side up in baking dish. Spread garlic over cut half of tomatoes. Sprinkle tomatoes with oregano then Romano. Season with pepper. Broil until tomatoes are tender, about 5 minutes. Serve.",
        "ingredients": [
            "8 plum tomatoes, cut in half lengthwise",
            "1 large garlic clove, pressed",
            "1 tablespoon minced fresh oregano or 1 teaspoon dried, crumbled",
            "4 teaspoons grated Romano cheese"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat broiler.",
                "Place tomatoes cut side up in baking dish.",
                "Spread garlic over cut half of tomatoes.",
                "Sprinkle tomatoes with oregano.",
                "Sprinkle tomatoes with Romano.",
                "Season with pepper.",
                "Broil until tomatoes are tender, about 5 minutes.",
                "Serve."
            ],
            "pure_ingredients": [
                "tomatoes",
                "garlic",
                "oregano",
                "Romano cheese",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "5 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "broiler",
                "baking dish"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "wcFGCmKT5Lzdt1Zojz1Q36n8ukl1qLC",
        "recipe_title": "Celery and Parmesan Salad",
        "original_instructions": "Watch how to make this recipe.\nAt least 1 hour before you plan to serve the salad, whisk together the olive oil, lemon zest, 1/4 cup of lemon juice, the shallots, celery seed, celery salt, anchovy paste, 2 teaspoons salt, and 1 teaspoon pepper. Place the celery in a mixing bowl and toss it with the remaining 1 tablespoon of lemon juice and 1/2 teaspoon of salt. (Even though these ingredients are in the dressing, believe me-this step makes a difference.) Add enough dressing to moisten well. Cover and refrigerate for at least an hour to allow the celery to crisp and the flavors to develop.\nWhen ready to serve, arrange the celery on a platter, shave the Parmesan onto the celery with a vegetable peeler, then sprinkle with walnuts, parsley leaves, salt, and pepper and serve immediately.",
        "ingredients": [
            "1/2 cup good olive oil",
            "2 teaspoons grated lemon zest",
            "1/4 cup plus 1 tablespoon freshly squeezed lemon juice (3 lemons)",
            "2 tablespoons minced shallots",
            "1 teaspoon celery seed",
            "1/2 teaspoon celery salt",
            "1/2 teaspoon anchovy paste",
            "Kosher salt and freshly ground black pepper",
            "5 cups thinly sliced celery hearts, tender leaves included, sliced on an angle (about 12 stalks)",
            "4-ounce chunk aged Parmesan cheese",
            "2/3 cup toasted walnuts, coarsely chopped",
            "Whole flat-leaf parsley leaves"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Whisk together the olive oil, lemon zest, 1/4 cup lemon juice, shallots, celery seed, celery salt, anchovy paste, 2 teaspoons salt, and 1 teaspoon pepper to make the dressing.",
                "Place the celery in a mixing bowl and toss with 1 tablespoon lemon juice and 1/2 teaspoon salt.",
                "Add enough dressing to moisten the celery well.",
                "Cover and refrigerate the celery for at least an hour.",
                "Arrange the celery on a platter.",
                "Shave the Parmesan cheese onto the celery using a vegetable peeler.",
                "Sprinkle with walnuts, parsley leaves, salt, and pepper.",
                "Serve immediately."
            ],
            "pure_ingredients": [
                "olive oil",
                "lemon",
                "shallots",
                "celery seed",
                "celery salt",
                "anchovy paste",
                "salt",
                "pepper",
                "celery",
                "Parmesan cheese",
                "walnuts",
                "parsley"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "0 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "whisk",
                "mixing bowl",
                "refrigerator",
                "platter",
                "vegetable peeler"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "DgN809iOi1MSSJ5jfOQhgvWm9TbgFcG",
        "recipe_title": "Red and Blue Cheese Salad",
        "original_instructions": "Divide Bibb lettuce leaves between 4 salad plates. Cover with thinly-sliced radishes, drizzle with olive oil and aged red wine vinegar, and sprinkle with blue cheese.",
        "ingredients": [
            "2 cups Boston Bibb lettuce",
            "2 cups radishes, thinly sliced",
            "1 tablespoon olive oil",
            "1 tablespoon aged red-wine vinegar",
            "2 tablespoon crumbled blue cheese"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Divide Bibb lettuce leaves between 4 salad plates.",
                "Cover with thinly-sliced radishes.",
                "Drizzle with olive oil.",
                "Drizzle with aged red wine vinegar.",
                "Sprinkle with blue cheese."
            ],
            "pure_ingredients": [
                "lettuce",
                "radishes",
                "olive oil",
                "vinegar",
                "blue cheese"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "0 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "knife",
                "cutting board",
                "salad plates",
                "spoon"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "AUIxz62m5LIFooWVIitQm4uhoQF3YQy",
        "recipe_title": "Traditional Pumpkin Pie",
        "original_instructions": "In the bowl of a food processor fitted with the steel blade, process the flour sugar, cinnamon and salt. Add the frozen butter and process until it is the size of large peas, about 5 seconds. Add the frozen shortening and process for 3 seconds. In a measuring cup, combine the egg and the water. Add egg mixture and process for 5 seconds. Empty the dough onto a counter and incorporate Remaining flour without overworking the dough. Let rest 2 hours.\nIn small bowl, combine sugar, salt and spices. Beat eggs in a large bowl. Stir in pumpkin and evaporated milk. Pour into pie shell. Bake at 425 degrees for 15 minutes. Reduce temperature to 350 and bake for 45 minutes or until firm.",
        "ingredients": [
            "1 1/4 cups flour",
            "1 teaspoon cinnamon",
            "2 teaspoons sugar",
            "Dash of salt",
            "4 tablespoons frozen butter, cut in pieces",
            "1/4 cup vegetable shortening, frozen in pieces",
            "1/2 egg, lightly beaten",
            "2 to 3 tablespoons cold water",
            "3/4 cup light brown sugar",
            "1/2 teaspoon salt",
            "1 teaspoon cinnamon",
            "1/2 teaspoon ground ginger",
            "1/4 teaspoon ground cloves",
            "2 eggs",
            "1 (15-ounce) can solid pack pumpkin",
            "1 (12-ounce) can evaporated milk"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In the bowl of a food processor fitted with the steel blade, process the flour, sugar, cinnamon, and salt.",
                "Add the frozen butter and process until it is the size of large peas, about 5 seconds.",
                "Add the frozen shortening and process for 3 seconds.",
                "In a measuring cup, combine the egg and the water.",
                "Add the egg mixture to the food processor and process for 5 seconds.",
                "Empty the dough onto a counter and incorporate the remaining flour without overworking the dough.",
                "Let the dough rest for 2 hours.",
                "In a small bowl, combine the sugar, salt, and spices.",
                "Beat eggs in a large bowl.",
                "Stir in the pumpkin and evaporated milk.",
                "Pour the mixture into the pie shell.",
                "Bake at 425 degrees for 15 minutes.",
                "Reduce the temperature to 350 degrees and bake for 45 minutes or until firm."
            ],
            "pure_ingredients": [
                "flour",
                "cinnamon",
                "sugar",
                "salt",
                "butter",
                "vegetable shortening",
                "egg",
                "water",
                "brown sugar",
                "ground ginger",
                "ground cloves",
                "pumpkin",
                "milk"
            ],
            "cooking_time": {
                "preparation": "30 minutes",
                "cooking": "1 hour",
                "plating": "10 minutes"
            },
            "required_tools": [
                "food processor",
                "steel blade",
                "bowl",
                "measuring cup",
                "oven"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "JmjpCw5RtZjvJZhTRJeotbT2XDnY1fy",
        "recipe_title": "Chicken Skewers With Grilled Romaine",
        "original_instructions": "Preheat a grill to medium high. Soak 8 wooden skewers in water, about 15 minutes. Meanwhile, make the dressing: Mix the olive oil, vinegar, oregano, shallot, garlic, red pepper flakes and 1 1/4 teaspoons salt in a large bowl. Drizzle the cut sides of each piece of romaine with about 1 teaspoon of the dressing. Add the chicken to the bowl with the remaining dressing and toss. Add the breadcrumbs and toss to coat. Thread the chicken onto the skewers, leaving space between each piece. Grill the chicken skewers, turning occasionally, until cooked through, 8 to 10 minutes. Meanwhile, grill the romaine, turning once, until marked and slightly wilted, 1 to 2 minutes. Transfer the romaine to plates and drizzle with olive oil and vinegar. Season with salt. Serve with the chicken skewers and sprinkle with the parmesan.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "1/4 cup extra-virgin olive oil, plus more for drizzling",
            "2 teaspoons red wine vinegar, plus more for drizzling",
            "2 tablespoons chopped fresh oregano",
            "1 tablespoon minced shallot or red onion",
            "1 teaspoon minced garlic",
            "1/4 teaspoon red pepper flakes",
            "Kosher salt",
            "1 head romaine lettuce, quartered lengthwise",
            "1 1/2 pounds skinless, boneless chicken breasts or thighs, cut into chunks",
            "1 1/2 cups breadcrumbs",
            "1/4 cup grated parmesan cheese"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat a grill to medium high.",
                "Soak 8 wooden skewers in water for about 15 minutes.",
                "Mix olive oil, red wine vinegar, oregano, shallot, garlic, red pepper flakes, and salt in a large bowl to make the dressing.",
                "Drizzle the cut sides of each piece of romaine lettuce with about 1 teaspoon of the dressing.",
                "Add the chicken to the bowl with the remaining dressing and toss to coat.",
                "Add breadcrumbs to the bowl and toss to coat the chicken.",
                "Thread the chicken onto the skewers, leaving space between each piece.",
                "Grill the chicken skewers, turning occasionally, until cooked through, for 8 to 10 minutes.",
                "Grill the romaine lettuce, turning once, until marked and slightly wilted, for 1 to 2 minutes.",
                "Transfer the grilled romaine to plates and drizzle with olive oil and vinegar.",
                "Season the grilled romaine with salt.",
                "Serve the grilled chicken skewers with the romaine and sprinkle with parmesan cheese."
            ],
            "pure_ingredients": [
                "olive oil",
                "vinegar",
                "oregano",
                "shallot",
                "garlic",
                "red pepper flakes",
                "salt",
                "romaine lettuce",
                "chicken",
                "breadcrumbs",
                "parmesan cheese"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "12 minutes",
                "plating": "3 minutes"
            },
            "required_tools": [
                "grill",
                "bowl",
                "grater",
                "skewers"
            ],
            "dietary_labels": [
                "gluten-containing"
            ]
        }
    },
    {
        "recipe_id": "bJ6iF8DJ.GqOcwozkhyOjOl4O65aqmC",
        "recipe_title": "Sweet Roasted Rosemary Acorn Squash Wedges",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 400 degrees F.\nCut the acorn squash in half from top to bottom using a sharp knife. Use a spoon to scrape out the stuff inside. Cut each half into 4 equal wedges, and then place the wedges, skin-side down, in a baking dish. Sprinkle lightly with salt.\nCombine the butter, brown sugar, salt, rosemary and chili powder in a bowl and mix into a paste. Smear the paste all over the squash.\nRoast in the oven for 20 minutes. Then baste with the butter mixture from the bottom of the pan and return to the oven for another 20 minutes.\nServe in the baking dish, drizzling more sauce at the end. Yummy!",
        "ingredients": [
            "2 acorn squash",
            "Salt",
            "1 stick butter",
            "1/2 cup brown sugar (firmly packed)",
            "2 tablespoons minced fresh rosemary",
            "1/4 teaspoon chili powder"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat the oven to 400 degrees F.",
                "Cut the acorn squash in half from top to bottom using a sharp knife.",
                "Use a spoon to scrape out the stuff inside.",
                "Cut each half into 4 equal wedges.",
                "Place the wedges, skin-side down, in a baking dish.",
                "Sprinkle lightly with salt.",
                "Combine butter, brown sugar, salt, rosemary, and chili powder in a bowl.",
                "Mix into a paste.",
                "Smear the paste all over the squash.",
                "Roast in the oven for 20 minutes.",
                "Baste with the butter mixture from the bottom of the pan.",
                "Return to the oven for another 20 minutes.",
                "Serve in the baking dish, drizzling more sauce at the end."
            ],
            "pure_ingredients": [
                "acorn squash",
                "salt",
                "butter",
                "brown sugar",
                "rosemary",
                "chili powder"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "40 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "oven",
                "sharp knife",
                "spoon",
                "baking dish",
                "bowl"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "QScG/ixoLJ0PayraIxw8JyxweR8vEZy",
        "recipe_title": "Roasted Pineapple with Thyme-Ginger Ice",
        "original_instructions": "Watch how to make this recipe.\nScatter the thyme leaves among the compartments of 2 large ice cube trays. Fill the trays with ginger beer and freeze at least 6 hours and preferably overnight.\nPreheat the oven to 400 degrees F.\nPut the pineapple slices on a nonstick baking sheet. Brush both sides very lightly with vegetable oil and sprinkle them evenly with the sugar; sprinkle very lightly with salt as well. Roast in the oven for 20 minutes. Remove from the oven and flip the slices.\nPut in the oven and continue roasting until they are golden, about 10 minutes more. Remove from oven and cool slightly in the pan.\nTransfer the ginger beer ice cubes to a food processor and pulse until broken down and fluffy. Transfer to a small cake pan or baking dish.\nTo serve, put 2 slices of warm pineapple on each dessert plate; top with a scoop of ginger ice and garnish with a small sprig of thyme.",
        "ingredients": [
            "Kosher salt",
            "1 teaspoon thyme leaves, plus small sprigs for garnish",
            "2 bottles, 12 ounces each, ginger beer or all-natural ginger soda",
            "1 whole pineapple, peeled, eyes removed, and sliced into 8 even slices",
            "Vegetable oil",
            "1 tablespoon sugar"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Scatter the thyme leaves among the compartments of 2 large ice cube trays.",
                "Fill the trays with ginger beer and freeze for at least 6 hours, preferably overnight.",
                "Preheat the oven to 400 degrees F.",
                "Put the pineapple slices on a nonstick baking sheet.",
                "Brush both sides of the pineapple slices very lightly with vegetable oil.",
                "Sprinkle the pineapple slices evenly with sugar and very lightly with salt.",
                "Roast in the oven for 20 minutes.",
                "Remove from the oven and flip the pineapple slices.",
                "Put the pineapple slices back in the oven and continue roasting until golden, about 10 minutes more.",
                "Remove from the oven and cool slightly in the pan.",
                "Transfer the ginger beer ice cubes to a food processor and pulse until broken down and fluffy.",
                "Transfer the processed ginger ice to a small cake pan or baking dish.",
                "To serve, put 2 slices of warm pineapple on each dessert plate, top with a scoop of ginger ice, and garnish with a small sprig of thyme."
            ],
            "pure_ingredients": [
                "thyme",
                "ginger",
                "pineapple",
                "vegetable oil",
                "sugar",
                "salt"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "30 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "ice cube trays",
                "oven",
                "baking sheet",
                "food processor",
                "cake pan",
                "dessert plates"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "oZ7XIU8W8ssXnXWLjguPRkZEFEHA1PO",
        "recipe_title": "Coco-Cafe Whistler",
        "original_instructions": "In a small pitcher combined all ingredient and stir together. Pour into a rocks glass filled with ice.",
        "ingredients": [
            "1 1/2 shots brandy",
            "1/2 shot creme de cacao",
            "1/2 shot peppermint schnapps",
            "1 shot heavy cream"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Combine all ingredients in a small pitcher.",
                "Stir the mixture together.",
                "Pour the mixture into a rocks glass filled with ice."
            ],
            "pure_ingredients": [
                "brandy",
                "creme de cacao",
                "peppermint schnapps",
                "cream"
            ],
            "cooking_time": {
                "preparation": "3 minutes",
                "cooking": "0 minutes",
                "plating": "1 minute"
            },
            "required_tools": [
                "small pitcher",
                "rocks glass",
                "stirrer"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "Tr/afF35Xh94iefZ6CgWJ0KiTdPI1oK",
        "recipe_title": "Bananas Foster",
        "original_instructions": "Combine the sugar, butter and cinnamon in a flambe pan or skillet. Place the pan over low heat either on an alcohol burner or on top of the stove and cook, stirring, until the sugar dissolves. Stir in the banana liqueur and then place the bananas in the pan. When the banana sections soften and begin to brown, carefully add the rum. Continue to cook the sauce until the rum is hot and then tip the pan slightly to ignite the rum. When the flames subside, lift the bananas out of the pan and place four pieces over each portion of ice cream. Generously spoon warm sauce over the top of the ice cream and serve immediately.",
        "ingredients": [
            "1 cup brown sugar",
            "1/4 cup (1/2 stick) butter",
            "1/2 teaspoon ground cinnamon",
            "1/4 cup banana liqueur",
            "4 bananas, cut in half lengthwise then halved",
            "1/4 cup white rum",
            "4 scoops vanilla ice cream"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Combine the sugar, butter, and cinnamon in a flambe pan or skillet.",
                "Place the pan over low heat either on an alcohol burner or on top of the stove.",
                "Cook, stirring, until the sugar dissolves.",
                "Stir in the banana liqueur.",
                "Place the bananas in the pan.",
                "When the banana sections soften and begin to brown, carefully add the rum.",
                "Continue to cook the sauce until the rum is hot and then tip the pan slightly to ignite the rum.",
                "When the flames subside, lift the bananas out of the pan and place four pieces over each portion of ice cream.",
                "Generously spoon warm sauce over the top of the ice cream and serve immediately."
            ],
            "pure_ingredients": [
                "sugar",
                "butter",
                "cinnamon",
                "banana",
                "rum",
                "ice cream"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "10 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "flambe pan",
                "skillet",
                "spoon"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "gCxLmGhXPxbF4XvbNulrgXv8AQK11/u",
        "recipe_title": "Orange-Scented Almond Cookies: Amygdalota me Orange",
        "original_instructions": "Grind the almonds in a food processor until ground fine. Add in 2 1/2 cups of sugar. Put the almond mixture into a small saucepan on medium high heat. Add in the liquids and simmer until sugar is dissolved. Put aside to cool.\nOnce cool, shape tablespoon-sized portions of the mixture into 1 1/2-inch-high pear shapes, wetting your fingers with the juice. Dredge each cookie in confectioners or granulated sugar to coat. Wrap individually in cellophane or place in a box with a lid. Let stand for at least 3 days before serving.",
        "ingredients": [
            "3 cups blanched almonds",
            "3 cups confectioners sugar",
            "1 tablespoon orange water",
            "1/4 cup orange juice, plus more, for shaping"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Grind the almonds in a food processor until ground fine.",
                "Add in 2 1/2 cups of sugar.",
                "Put the almond mixture into a small saucepan on medium high heat.",
                "Add in the liquids and simmer until sugar is dissolved.",
                "Put aside to cool.",
                "Once cool, shape tablespoon-sized portions of the mixture into 1 1/2-inch-high pear shapes, wetting your fingers with the juice.",
                "Dredge each cookie in granulated sugar to coat.",
                "Wrap individually in cellophane or place in a box with a lid.",
                "Let stand for at least 3 days before serving."
            ],
            "pure_ingredients": [
                "almonds",
                "sugar",
                "orange water",
                "orange juice"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "10 minutes",
                "plating": "10 minutes"
            },
            "required_tools": [
                "food processor",
                "small saucepan",
                "spoon",
                "cellophane",
                "box with lid"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "d3kZSJDqsCtnvJnsnTcu9dHK7FqBm0e",
        "recipe_title": "Sauteed Carrots with Red Bell Pepper and Dill ",
        "original_instructions": "Melt butter in heavy large skillet over medium heat. Add carrots and sauté until crisp-tender, about 3 minutes. Add bell pepper and water. Cover and cook until vegetables are tender, 5 minutes. Add dill. Season with salt and pepper.\nMelt butter in heavy large skillet over medium heat. Add carrots and sauté until crisp-tender, about 3 minutes. Add bell pepper and water. Cover and cook until vegetables are tender, 5 minutes. Add dill. Season with salt and pepper.",
        "ingredients": [
            "2 tablespoons (1/4 stick) butter",
            "1 pound carrots, peeled, thinly sliced",
            "1 red bell pepper finely chopped",
            "1/4 cup water",
            "1 tablespoon minced fresh dill",
            "Salt and pepper"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Melt butter in a heavy large skillet over medium heat.",
                "Add carrots and sauté until crisp-tender, about 3 minutes.",
                "Add bell pepper and water.",
                "Cover and cook until vegetables are tender, about 5 minutes.",
                "Add dill.",
                "Season with salt and pepper."
            ],
            "pure_ingredients": [
                "butter",
                "carrots",
                "bell pepper",
                "water",
                "dill",
                "salt",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "8 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "skillet",
                "knife",
                "cutting board",
                "measuring cup"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "60oeywv8fz5PCMl6wQoJdlCfGLo/03y",
        "recipe_title": "Grilled Cheese With Bacon and Thousand Island Dressing",
        "original_instructions": "Cook the bacon in a large nonstick skillet over medium heat until crisp, about 8 minutes. Remove and drain on a paper towel-lined plate. Wipe out the skillet.\nHeat the butter in the skillet over medium heat. Add 2 bread slices. Top each with one-quarter of the cheese and 2 strips bacon. Spread 2 bread slices with some of the dressing and press them on top of the sandwiches, dressing-side down. Cook until the cheese melts and the bread is golden, 3 to 4 minutes per side. Repeat to make 2 more sandwiches, adding more butter as needed.\nPhotograph by Andrew Mccaul",
        "ingredients": [
            "8 strips thick-cut maple-glazed bacon",
            "2 tablespoons unsalted butter, plus more as needed",
            "8 slices sourdough bread",
            "12 ounces cotswold cheese (double Gloucester with chives) or cheddar, shredded",
            "4 tablespoons Thousand Island dressing"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Cook the bacon in a large nonstick skillet over medium heat until crisp, about 8 minutes.",
                "Remove the bacon and drain on a paper towel-lined plate.",
                "Wipe out the skillet.",
                "Heat the butter in the skillet over medium heat.",
                "Add 2 bread slices to the skillet.",
                "Top each slice with one-quarter of the cheese and 2 strips of bacon.",
                "Spread 2 more bread slices with some of the dressing.",
                "Press them on top of the sandwiches, dressing-side down.",
                "Cook until the cheese melts and the bread is golden, about 3 to 4 minutes per side.",
                "Repeat to make 2 more sandwiches, adding more butter as needed."
            ],
            "pure_ingredients": [
                "bacon",
                "butter",
                "bread",
                "cheese",
                "dressing"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "26 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "large nonstick skillet",
                "paper towel-lined plate"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "wLzhsa7FGk4IYbMPdKQVRtFNs0dgRBW",
        "recipe_title": "Fruit Smoothie",
        "original_instructions": "Place all the ingredients in a blender and process until smooth.",
        "ingredients": [
            "1/2 cup nonfat vanilla frozen yogurt",
            "1/2 cup lemon nonfat yogurt",
            "1 medium banana or 1/2 cup frozen strawberries",
            "1 teaspoon sugar"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Place all the ingredients in a blender.",
                "Process until smooth."
            ],
            "pure_ingredients": [
                "yogurt",
                "yogurt",
                "banana",
                "sugar"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "0 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "blender"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "AGtOC8kiLhKCv/WkkNEObUwsvvSC2Em",
        "recipe_title": "Red Rice",
        "original_instructions": "In a medium saucepot, melt butter over medium-high heat. Add ham, celery, onions, and green peppers. Saute until celery is soft, about 5 minutes.\nAdd remaining ingredients and stir until rice is evenly distributed. Bring to boil. Cover and simmer for 30 minutes, or until all liquid is absorbed.",
        "ingredients": [
            "2 tablespoons butter",
            "1/2 pound diced ham",
            "2 ribs celery, finely chopped",
            "1 cup frozen chopped onions",
            "1 cup frozen chopped green peppers",
            "1 (14.5-ounce) can diced tomatoes with green peppers, celery, and onion (recommended: Hunt's)",
            "1 (14-ounce) jar pasta sauce",
            "1 1/2 cups low-sodium chicken stock",
            "1 teaspoon salt",
            "4 dashes hot sauce, or more if needed",
            "1 1/2 cups converted long-grain rice (recommended: Uncle Ben's)"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In a medium saucepot, melt butter over medium-high heat.",
                "Add ham, celery, onions, and green peppers.",
                "Saute until celery is soft, about 5 minutes.",
                "Add diced tomatoes, pasta sauce, chicken stock, salt, hot sauce, and rice.",
                "Stir until rice is evenly distributed.",
                "Bring to a boil.",
                "Cover and simmer for 30 minutes, or until all liquid is absorbed."
            ],
            "pure_ingredients": [
                "butter",
                "ham",
                "celery",
                "onions",
                "green peppers",
                "tomatoes",
                "pasta sauce",
                "chicken stock",
                "salt",
                "hot sauce",
                "rice"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "35 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "medium saucepot",
                "stirring spoon"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "siXPqhrGta3z57a86UgTvL7IrrFjdAu",
        "recipe_title": "Creamy Mustard Vinaigrette for Asparagus ",
        "original_instructions": "In a blender or food processor blend the cream, the vinegar, the mustard, the shallot, the sugar, and the lemon juice until the mixture is combined well, with the motor running add the oil in a stream, and blend the vinaigrette until it is emulsified. Add salt and pepper to taste and serve the vinaigrette over asparagus.\nIn a blender or food processor blend the cream, the vinegar, the mustard, the shallot, the sugar, and the lemon juice until the mixture is combined well, with the motor running add the oil in a stream, and blend the vinaigrette until it is emulsified. Add salt and pepper to taste and serve the vinaigrette over asparagus.",
        "ingredients": [
            "3 tablespoons heavy cream",
            "1/4 cup white-wine vinegar",
            "1 tablespoon Dijon-style mustard or to taste",
            "1 tablespoon minced shallot",
            "a pinch of sugar",
            "2 teaspoons fresh lemon juice, or to taste",
            "3/4 cup olive oil"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In a blender or food processor, blend the cream, vinegar, mustard, shallot, sugar, and lemon juice until the mixture is combined well.",
                "With the motor running, add the oil in a stream and blend the vinaigrette until it is emulsified.",
                "Add salt and pepper to taste.",
                "Serve the vinaigrette over asparagus."
            ],
            "pure_ingredients": [
                "cream",
                "vinegar",
                "mustard",
                "shallot",
                "sugar",
                "lemon juice",
                "olive oil",
                "salt",
                "pepper",
                "asparagus"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "0 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "blender",
                "food processor"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "LCymxo1va2uuzapk4SOIU3suyV28Mke",
        "recipe_title": "Roasted Chicken with Smokey Orange Sauce",
        "original_instructions": "Preheat oven to 400 degrees F. Coat a large roasting pan with cooking spray.\nSeason chicken all over with salt and black pepper. Arrange chicken in prepared pan and set aside.\nIn a small bowl, combine orange marmalade, soy sauce and liquid smoke. Mix until blended. Pour mixture over chicken.\nRoast 35 minutes, until chicken is cooked through. Serve 4 chicken breast halves with this meal and refrigerate remaining chicken until ready to use.\nYield: 4 servings (with leftovers for additional meals such as Robin's Chicken Quesadillas and Thai Chicken Salad)",
        "ingredients": [
            "Cooking spray",
            "8 (5-ounce) skinless chicken breast halves (with bone)",
            "Salt and ground black pepper",
            "1 cup orange marmalade",
            "1 tablespoon reduced-sodium soy sauce",
            "1 teaspoon liquid smoke"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat oven to 400 degrees F.",
                "Coat a large roasting pan with cooking spray.",
                "Season chicken all over with salt and black pepper.",
                "Arrange chicken in prepared pan and set aside.",
                "In a small bowl, combine orange marmalade, soy sauce, and liquid smoke.",
                "Mix until blended.",
                "Pour mixture over chicken.",
                "Roast for 35 minutes until chicken is cooked through.",
                "Serve 4 chicken breast halves and refrigerate remaining chicken."
            ],
            "pure_ingredients": [
                "cooking spray",
                "chicken",
                "salt",
                "black pepper",
                "orange marmalade",
                "soy sauce",
                "liquid smoke"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "35 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "oven",
                "roasting pan",
                "small bowl",
                "spoon"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "6IHDs69g3ekN1liToTyM0rhPqIx.OeS",
        "recipe_title": "Family-Style Chicken",
        "original_instructions": "Special equipment: 1 large roasting pan\nPreheat oven to 350 degrees F.\nLightly coat the roasting pan with vegetable spray.\nMake the Vegetables: Toss all of the ingredients in a large bowl, and arrange them in the roasting pan, leaving room in the center for the chicken.\nPrepare the Chicken: Nestle the chicken pieces in the center of the pan. Combine the remaining ingredients and sprinkle evenly over the chicken. Cover the pan tightly with aluminum foil and bake for 1 hour.\nRemove the chicken from the oven and baste with the drippings. Continue baking uncovered until well browned, about 1 hour more. Arrange the chicken on a platter surrounded by the vegetables. Sprinkle with the garnish.",
        "ingredients": [
            "Vegetable spray, as needed",
            "3 ribs celery, cut into thirds",
            "2 medium yellow squash, halved crosswise",
            "2 medium zucchini, halved crosswise",
            "1 medium yellow onion, quartered (about 1 cup)",
            "1 red bell pepper, cored, seeded, and quartered",
            "1 clove garlic, minced",
            "2 tablespoons olive oil",
            "1 1/2 teaspoons kosher salt",
            "1 teaspoon dried oregano",
            "1 teaspoon paprika",
            "1/4 teaspoon freshly ground black pepper",
            "1/8 teaspoon garlic powder",
            "1 (4-pound) chicken, cut into 8 pieces",
            "1 teaspoon kosher salt",
            "1 teaspoon paprika",
            "1/2 teaspoon freshly ground black pepper",
            "1/2 teaspoon poultry seasoning",
            "1/2 teaspoon dried oregano",
            "1/8 teaspoon garlic powder",
            "4 bay leaves",
            "Lemon zest, for garnish",
            "Chopped parsley, for garnish"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat oven to 350 degrees F.",
                "Lightly coat the roasting pan with vegetable spray.",
                "Toss celery, squash, zucchini, onion, red bell pepper, garlic, olive oil, salt, oregano, paprika, black pepper, and garlic powder in a large bowl.",
                "Arrange the vegetables in the roasting pan, leaving room in the center for the chicken.",
                "Nestle the chicken pieces in the center of the pan.",
                "Combine salt, paprika, black pepper, poultry seasoning, oregano, garlic powder, and bay leaves, and sprinkle evenly over the chicken.",
                "Cover the pan tightly with aluminum foil and bake for 1 hour.",
                "Remove the chicken from the oven and baste with the drippings.",
                "Continue baking uncovered until well browned, about 1 hour more.",
                "Arrange the chicken on a platter surrounded by the vegetables.",
                "Sprinkle with lemon zest and chopped parsley for garnish."
            ],
            "pure_ingredients": [
                "celery",
                "squash",
                "zucchini",
                "onion",
                "bell pepper",
                "garlic",
                "olive oil",
                "salt",
                "oregano",
                "paprika",
                "black pepper",
                "poultry",
                "bay leaves",
                "lemon",
                "parsley"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "2 hours",
                "plating": "5 minutes"
            },
            "required_tools": [
                "roasting pan",
                "large bowl",
                "aluminum foil",
                "oven"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "g3S3WKCYs3HPvbKcGqn4K6EEaYlOf/W",
        "recipe_title": "Asian Pear Slaw",
        "original_instructions": "Peel strings from celery with a Y-shaped vegetable peeler and cut celery into 1/4-inch-thick matchsticks.\nWhisk together juice, vinegar, and ginger and stir in celery and remaining ingredients with salt and pepper, to taste. Let stand at room temperature 15 minutes before serving.",
        "ingredients": [
            "2 celery ribs",
            "3 tablespoons fresh lime juice",
            "2 tablespoons seasoned rice vinegar",
            "1 teaspoon finely grated peeled fresh ginger",
            "2 firm Asian pears, cut into 1/4-inch-thick matchsticks",
            "2 scallions, thinly sliced diagonally",
            "1/4 cup fresh cilantro leaves",
            "1/2 teaspoon finely chopped fresh hot red chile, or to taste"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Peel strings from celery using a Y-shaped vegetable peeler.",
                "Cut celery into 1/4-inch-thick matchsticks.",
                "Whisk together lime juice, rice vinegar, and ginger in a bowl.",
                "Stir in celery, Asian pears, scallions, cilantro, and red chile.",
                "Season with salt and pepper to taste.",
                "Let the mixture stand at room temperature for 15 minutes before serving."
            ],
            "pure_ingredients": [
                "celery",
                "lime",
                "vinegar",
                "ginger",
                "pears",
                "scallions",
                "cilantro",
                "chile",
                "salt",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "0 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "Y-shaped vegetable peeler",
                "knife",
                "bowl",
                "whisk"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "EgRDBN24jS/yO1zF/cAN4S40r5xhPxq",
        "recipe_title": "Chocolate-Covered Apple Slices",
        "original_instructions": "Melt the chocolate chips and coconut oil together over a double boiler. Line a baking sheet with parchment paper or wax paper.\nSlice the apple into 1/4-inch-thick slices. Dip the apple slices one at a time into the chocolate, making sure to coat them evenly. The chocolate should go at least three-quarters of the way up each apple slice. Let the excess chocolate drip off.\nPress one side of each slice into the peanuts or coconut, and place the slices non-peanut/coconut-side down on the parchment. Place in the fridge or freezer until the chocolate hardens, 10 to 15 minutes. Serve.",
        "ingredients": [
            "1 cup semisweet chocolate chips",
            "2 tablespoons coconut oil",
            "1 Granny Smith apple",
            "1/4 cup chopped peanuts",
            "1/4 cup shredded coconut"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Melt the chocolate chips and coconut oil together over a double boiler.",
                "Line a baking sheet with parchment paper or wax paper.",
                "Slice the apple into 1/4-inch-thick slices.",
                "Dip the apple slices one at a time into the chocolate, making sure to coat them evenly.",
                "Let the excess chocolate drip off the apple slices.",
                "Press one side of each slice into the peanuts or coconut.",
                "Place the slices non-peanut/coconut-side down on the parchment.",
                "Place in the fridge or freezer until the chocolate hardens, 10 to 15 minutes.",
                "Serve."
            ],
            "pure_ingredients": [
                "chocolate",
                "coconut oil",
                "apple",
                "peanuts",
                "coconut"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "5 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "double boiler",
                "baking sheet",
                "parchment paper",
                "knife",
                "refrigerator"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "jiivAbxxc0Ek4Qz0A37AFGU1QtrKlPC",
        "recipe_title": "Shaved Summer Vegetable Salad",
        "original_instructions": "Make the vinaigrette: Stir together the shallot, mustard, honey, vinegar, 3/4 teaspoon salt, and pepper to taste in a bowl. Whisk in the olive oil.\nThinly slice the zucchini and squash lengthwise (with a mandoline, if you have one, or a vegetable peeler), then thinly slice the beets and mushrooms. Drizzle with the vinaigrette and toss. Sprinkle with the chives, chervil and tarragon. Season to taste with salt and pepper.\nPhotograph by Con Poulos",
        "ingredients": [
            "1 tablespoon finely chopped shallot",
            "1 1/2 teaspoons dijon mustard",
            "1 1/2 teaspoons honey",
            "3 tablespoons champagne vinegar",
            "Kosher salt and freshly ground pepper",
            "1/4 cup extra-virgin olive oil",
            "1 zucchini, cut into 2-inch segments",
            "1 yellow squash, cut into 2-inch segments",
            "4 baby golden beets, peeled",
            "3 large white mushrooms",
            "1/3 cup chopped fresh chives, chervil and/or tarragon",
            "Kosher salt and freshly ground pepper"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Stir together the shallot, mustard, honey, vinegar, salt, and pepper in a bowl.",
                "Whisk in the olive oil to complete the vinaigrette.",
                "Thinly slice the zucchini and squash lengthwise using a mandoline or vegetable peeler.",
                "Thinly slice the beets and mushrooms.",
                "Drizzle the sliced vegetables with the vinaigrette and toss to coat.",
                "Sprinkle the vegetables with chives, chervil, and tarragon.",
                "Season the salad to taste with salt and pepper."
            ],
            "pure_ingredients": [
                "shallot",
                "dijon mustard",
                "honey",
                "vinegar",
                "salt",
                "pepper",
                "olive oil",
                "zucchini",
                "squash",
                "beets",
                "mushrooms",
                "chives",
                "chervil",
                "tarragon"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "0 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "bowl",
                "whisk",
                "mandoline",
                "vegetable peeler",
                "knife"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "fde2XYl6kLEHe4/ygpbxb1Oaiuks9JW",
        "recipe_title": "Sauce Soubise ",
        "original_instructions": "To Béchamel sauce add Gruyère cheese, Parmesan cheese, and onion. Add salt and pepper to taste. Heat until flavors are thoroughly blended and the sauce is smooth.\nTo Béchamel sauce add Gruyère cheese, Parmesan cheese, and onion. Add salt and pepper to taste. Heat until flavors are thoroughly blended and the sauce is smooth.",
        "ingredients": [
            "1 1/2 cups Béchamel sauce",
            "1/2 cup grated Gruyère cheese",
            "1/4 cup grated Parmesan cheese",
            "1 cup cooked puréed onion"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Add Gruyère cheese to the Béchamel sauce.",
                "Add Parmesan cheese to the Béchamel sauce.",
                "Add onion to the Béchamel sauce.",
                "Add salt and pepper to taste.",
                "Heat the mixture until flavors are thoroughly blended and the sauce is smooth."
            ],
            "pure_ingredients": [
                "Béchamel sauce",
                "cheese",
                "onion",
                "salt",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "10 minutes",
                "plating": "0 minutes"
            },
            "required_tools": [
                "saucepan",
                "stirring spoon",
                "grater",
                "hob"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "T5RzxxoY.duNgm15D/UeRFo6KVE3myK",
        "recipe_title": "Peach Champagne",
        "original_instructions": "In a champagne glass pour chilled champagne. Carefully pour peach nectar down the inside of glass. Garnish with peach slice.",
        "ingredients": [
            "Scant 4 ounces Champagne",
            "1/2 ounce canned peach nectar",
            "1 slice fresh (or frozen) peach"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Pour chilled champagne into a champagne glass.",
                "Carefully pour peach nectar down the inside of the glass.",
                "Garnish with a slice of peach."
            ],
            "pure_ingredients": [
                "champagne",
                "peach",
                "peach"
            ],
            "cooking_time": {
                "preparation": "2 minutes",
                "cooking": "0 minutes",
                "plating": "1 minute"
            },
            "required_tools": [
                "champagne glass"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "58vgSgJKZiDmzMrdx/Gqro1xNGApeA6",
        "recipe_title": "Chile Dip",
        "original_instructions": "In a 1 quart microwave proof bowl combine cheese and salsa. Heat in the microwave for 2 minutes on high heat (stirring halfway through) or until cheese is melted and hot. Serve with tortilla chips and red bell pepper spears.",
        "ingredients": [
            "1 pound soft cheddar cheese",
            "1 cup prepared or fresh salsa",
            "Tortilla chips and red bell pepper spears"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Combine cheddar cheese and salsa in a 1 quart microwave-proof bowl.",
                "Heat in the microwave on high for 2 minutes.",
                "Stir halfway through the heating process.",
                "Continue heating until the cheese is melted and the mixture is hot.",
                "Serve with tortilla chips and red bell pepper spears."
            ],
            "pure_ingredients": [
                "cheddar cheese",
                "salsa",
                "tortilla chips",
                "red bell pepper"
            ],
            "cooking_time": {
                "preparation": "3 minutes",
                "cooking": "2 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "microwave",
                "microwave-proof bowl",
                "spoon"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "3uMyTm.6PO71rWe9lCwPDKLqqDHk45S",
        "recipe_title": "Roasted Red Potatoes",
        "original_instructions": "Preheat the oven to 425 degrees F.\nToss the potatoes with the canola oil, garlic paste and salt and pepper to taste. Place on a sheet tray and roast until cooked through and golden brown, 25 to 30 minutes.\nRemove from the oven and immediately fold in the herbs. Re-season if needed and drizzle with olive oil to finish.",
        "ingredients": [
            "6 to 8 new potatoes, cut in half or quartered, depending on size",
            "1 1/2 tablespoons canola oil",
            "2 cloves garlic, smashed and turned into a paste",
            "Salt and freshly ground pepper",
            "1 tablespoon finely chopped fresh chives",
            "1 teaspoon fresh thyme leaves",
            "Extra-virgin olive oil"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat the oven to 425 degrees F.",
                "Toss the potatoes with the canola oil, garlic paste, salt, and pepper.",
                "Place the potatoes on a sheet tray and roast in the oven until cooked through and golden brown, approximately 25 to 30 minutes.",
                "Remove the potatoes from the oven and immediately fold in the herbs.",
                "Re-season the potatoes if needed and drizzle with olive oil to finish."
            ],
            "pure_ingredients": [
                "potatoes",
                "canola oil",
                "garlic",
                "salt",
                "pepper",
                "chives",
                "thyme",
                "olive oil"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "30 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "oven",
                "sheet tray",
                "knife",
                "mixing bowl",
                "spoon"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "buK.Buuif6jjpcFRXlHd3mez1hKiRpa",
        "recipe_title": "House Sausage",
        "original_instructions": "Combine all of the ingredients in a medium bowl and wrap tightly with plastic wrap. Chill in the refrigerator for at least 1 hour and up to overnight.\nWhen ready to cook, form the mixture into small patties about 1/4-inch thick and 3 inches wide. Cook in a skillet over medium-high heat, turning once, until golden brown and completely cooked through, about 8 minutes total. Transfer the sausage to a serving dish and serve warm.",
        "ingredients": [
            "1 1/2 pounds ground pork shoulder",
            "2 tablespoons Grade B maple syrup",
            "1 teaspoon dried sage",
            "1 shallot, finely chopped",
            "1 tablespoon Dijon mustard",
            "1 teaspoon freshly cracked black pepper",
            "1 1/2 teaspoons kosher salt"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Combine the ground pork shoulder, maple syrup, dried sage, chopped shallot, Dijon mustard, black pepper, and kosher salt in a medium bowl.",
                "Wrap the mixture tightly with plastic wrap.",
                "Chill the mixture in the refrigerator for at least 1 hour and up to overnight.",
                "When ready to cook, form the mixture into small patties about 1/4-inch thick and 3 inches wide.",
                "Cook the patties in a skillet over medium-high heat, turning once, until golden brown and completely cooked through, about 8 minutes total.",
                "Transfer the cooked sausage patties to a serving dish and serve warm."
            ],
            "pure_ingredients": [
                "pork",
                "maple syrup",
                "sage",
                "shallot",
                "mustard",
                "black pepper",
                "salt"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "8 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "medium bowl",
                "plastic wrap",
                "skillet",
                "serving dish"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "qVZXU2oZuhTpA2G9/240tm96Nmj4J2u",
        "recipe_title": "Chicken Stroganoff",
        "original_instructions": "Bring a large pot of salted water to a boil. Add the noodles and cook as the label directs, then drain. Meanwhile, melt 2 tablespoons butter in a large skillet over medium-high heat. Add the onion and cook until slightly soft, about 2 minutes. Add the mushrooms and cook, stirring, until they begin to brown, about 2 minutes. Add the remaining 1 tablespoon butter, the chicken, flour, paprika, 1 teaspoon salt and 1/4 teaspoon pepper. Cook, stirring, until the chicken browns, about 3 minutes. Add the chicken broth and Worcestershire sauce and bring to a gentle simmer; cook until thickened, about 5 minutes. Stir in the sour cream and season with salt and pepper. Continue simmering gently until the chicken is cooked through, about 2 more minutes. Divide the noodles among plates. Top with the chicken mixture, parsley, some sour cream and paprika.\nPhotograph by Christopher Testani",
        "ingredients": [
            "Kosher salt",
            "12 ounces wide egg noodles",
            "3 tablespoons unsalted butter",
            "1 small onion, chopped",
            "4 ounces white or cremini mushrooms, sliced (about 2 cups)",
            "1 1/4 pounds skinless, boneless chicken thighs, cut into chunks",
            "2 tablespoons all-purpose flour",
            "1 teaspoon paprika, plus more for topping",
            "Freshly ground pepper",
            "1 cup fat-free low-sodium chicken or mushroom broth",
            "1 tablespoon Worcestershire sauce",
            "1/2 cup sour cream, plus more for topping",
            "2 tablespoons chopped fresh parsley"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Bring a large pot of salted water to a boil.",
                "Add the noodles and cook as the label directs, then drain.",
                "Meanwhile, melt 2 tablespoons butter in a large skillet over medium-high heat.",
                "Add the onion and cook until slightly soft, about 2 minutes.",
                "Add the mushrooms and cook, stirring, until they begin to brown, about 2 minutes.",
                "Add the remaining 1 tablespoon butter, the chicken, flour, paprika, 1 teaspoon salt and 1/4 teaspoon pepper.",
                "Cook, stirring, until the chicken browns, about 3 minutes.",
                "Add the chicken broth and Worcestershire sauce and bring to a gentle simmer; cook until thickened, about 5 minutes.",
                "Stir in the sour cream and season with salt and pepper.",
                "Continue simmering gently until the chicken is cooked through, about 2 more minutes.",
                "Divide the noodles among plates.",
                "Top with the chicken mixture, parsley, some sour cream and paprika."
            ],
            "pure_ingredients": [
                "salt",
                "egg noodles",
                "butter",
                "onion",
                "mushrooms",
                "chicken",
                "flour",
                "paprika",
                "pepper",
                "chicken broth",
                "Worcestershire sauce",
                "sour cream",
                "parsley"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "20 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "large pot",
                "large skillet",
                "knife",
                "cutting board",
                "spatula",
                "measuring spoons",
                "measuring cups",
                "plate"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "1TMdGo0FEtWGkjMkA..opDZUAQgMOpq",
        "recipe_title": "Honey-Glazed Wax Beans ",
        "original_instructions": "Cook beans in a 4-quart pot of boiling salted water until just tender, 6 to 8 minutes. Drain in a colander, then immediately toss with honey, zest, and salt in a large bowl.\nCook beans in a 4-quart pot of boiling salted water until just tender, 6 to 8 minutes. Drain in a colander, then immediately toss with honey, zest, and salt in a large bowl.",
        "ingredients": [
            "1 1/4 pounds wax (yellow) or green beans, trimmed",
            "1 tablespoon mild honey",
            "3/4 teaspoon finely grated fresh lemon zest",
            "1/4 teaspoon salt"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Bring a 4-quart pot of salted water to a boil.",
                "Add the trimmed beans to the boiling water.",
                "Cook the beans until just tender, about 6 to 8 minutes.",
                "Drain the beans using a colander.",
                "Immediately toss the drained beans with honey, lemon zest, and salt in a large bowl."
            ],
            "pure_ingredients": [
                "beans",
                "honey",
                "lemon",
                "salt"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "8 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "4-quart pot",
                "colander",
                "large bowl"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "/m4koDfdJOpzUZssW5Yf3Lo/IpcCQim",
        "recipe_title": "Man Coffee",
        "original_instructions": "Watch how to make this recipe.\nBring water to a boil in an electric kettle or in the microwave. Meanwhile, place the ground coffee and salt into a French press carafe. Pour the water over the grounds. Place the plunger in the carafe, but do not press down. Brew for 4 minutes, then slowly push the plunger down. Drink immediately or hold in a thermos for up to 3 hours.",
        "ingredients": [
            "24 fluid ounces filtered water",
            "1/2 cup freshly ground coffee",
            "Pinch kosher salt"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Bring water to a boil in an electric kettle or in the microwave.",
                "Place the ground coffee and salt into a French press carafe.",
                "Pour the boiling water over the coffee grounds.",
                "Place the plunger in the carafe but do not press down.",
                "Brew for 4 minutes.",
                "Slowly push the plunger down.",
                "Drink immediately or hold in a thermos for up to 3 hours."
            ],
            "pure_ingredients": [
                "water",
                "coffee",
                "salt"
            ],
            "cooking_time": {
                "preparation": "3 minutes",
                "cooking": "4 minutes",
                "plating": "1 minute"
            },
            "required_tools": [
                "electric kettle",
                "microwave",
                "French press",
                "thermos"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "76n/OU0/Qa99g7k5MjJs9JgmHj9XFF.",
        "recipe_title": "Iceberg Salad with Shrimp",
        "original_instructions": "Watch how to make this recipe.\nSlam the core of the head of lettuce on the counter then twist and remove it. Quarter the head of lettuce lengthwise.\nCombine cocktail sauce, hot sauce, lemon juice and zest and mayo. Stir shrimp into dressing and spoon it evenly down over quartered lettuce. Season salads with a little salt and pepper and scatter chives over the salads and serve.",
        "ingredients": [
            "1 head iceberg lettuce",
            "1/2 cup prepared cocktail sauce",
            "Few drops hot sauce",
            "1 lemon, juiced plus 2 teaspoons zest",
            "1/4 cup mayonnaise, eyeball it",
            "1 cup (300 count) small shrimp",
            "Salt and pepper",
            "2 to 3 tablespoons chopped chives"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Slam the core of the head of lettuce on the counter then twist and remove it.",
                "Quarter the head of lettuce lengthwise.",
                "Combine cocktail sauce, hot sauce, lemon juice and zest, and mayonnaise in a bowl.",
                "Stir the small shrimp into the dressing mix.",
                "Spoon the shrimp and dressing mix evenly down over the quartered lettuce.",
                "Season the salads with a little salt and pepper.",
                "Scatter chopped chives over the salads.",
                "Serve the salads."
            ],
            "pure_ingredients": [
                "lettuce",
                "cocktail sauce",
                "hot sauce",
                "lemon",
                "mayonnaise",
                "shrimp",
                "salt",
                "pepper",
                "chives"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "0 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "knife",
                "cutting board",
                "mixing bowl",
                "spoon"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "WMyipvBTBsuieC94/Sx0yOveHbzC.7W",
        "recipe_title": "Baked Salmon with Honey Mustard Sauce",
        "original_instructions": "Preheat the oven to 375 degrees F. Line a large baking sheet with a nonstick silicone liner, and lay the salmon, skin side down, on top. Set aside.\nCombine the mayonnaise, mustard, honey and chives in a medium bowl and stir to thoroughly combine. Reserve half of the sauce. Spoon the remaining sauce over the fish, spreading it evenly all over the top and sides of each fillet. Sprinkle with salt and pepper.\nRoast just until the fish is opaque in the center, 7 minutes. Increase the oven to broil. Broil the fish for 6 to 7 minutes, but keep your eye on it to avoid overcooking. Garnish with chives and serve with the reserved sauce.",
        "ingredients": [
            "Four 6- to 7-ounce salmon fillets, skin-on",
            "1/2 cup low-fat mayonnaise",
            "1/4 cup Dijon mustard",
            "1/4 cup honey",
            "2 tablespoons finely chopped chives, plus additional for garnish",
            "Kosher salt and freshly ground white pepper"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat the oven to 375 degrees F.",
                "Line a large baking sheet with a nonstick silicone liner, and lay the salmon, skin side down, on top. Set aside.",
                "Combine the mayonnaise, mustard, honey, and chives in a medium bowl and stir to thoroughly combine.",
                "Reserve half of the sauce.",
                "Spoon the remaining sauce over the fish, spreading it evenly all over the top and sides of each fillet.",
                "Sprinkle with salt and pepper.",
                "Roast just until the fish is opaque in the center, about 7 minutes.",
                "Increase the oven to broil.",
                "Broil the fish for 6 to 7 minutes, but keep your eye on it to avoid overcooking.",
                "Garnish with chives and serve with the reserved sauce."
            ],
            "pure_ingredients": [
                "salmon",
                "mayonnaise",
                "mustard",
                "honey",
                "chives",
                "salt",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "14 minutes",
                "plating": "3 minutes"
            },
            "required_tools": [
                "oven",
                "baking sheet",
                "nonstick silicone liner",
                "medium bowl",
                "spoon"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "1qsxt2Y24kDLuoebaMR3D0tTbelamHG",
        "recipe_title": "Sunny's Bacon Berry Fun Float",
        "original_instructions": "Divide the malt liquor between 2 large glasses, followed by the ice cream and bacon.",
        "ingredients": [
            "12 ounces raspberry-flavored malt liquor or wine cooler",
            "1 pint confetti vanilla ice cream",
            "4 strips crisp-cooked bacon, very finely minced"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Divide the malt liquor equally between 2 large glasses.",
                "Add the confetti vanilla ice cream to each glass.",
                "Sprinkle the finely minced crisp-cooked bacon on top."
            ],
            "pure_ingredients": [
                "malt liquor",
                "ice cream",
                "bacon"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "0 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "large glasses",
                "spoon"
            ],
            "dietary_labels": [
                "non-vegetarian"
            ]
        }
    },
    {
        "recipe_id": "Iy3d2JDO2x09uw8djCnbq0YP.s/oXgu",
        "recipe_title": "Hash Browns",
        "original_instructions": "In a heavy medium saute pan, melt 2 tablespoons of the butter with 1 tablespoon of the olive oil over medium heat. Spread the potatoes in an even layer in the saute pan, pressing down on them slightly with a spatula. Season with salt and pepper and cook until the potatoes begin to brown on the bottom, 6 to 7 minutes, shaking the pan occasionally to prevent sticking. Pour 1 tablespoon of the melted butter over the top of the potatoes.\nPlace a large plate over the pan and invert the potatoes onto the plate. Add the remaining 2 tablespoons butter and 1 tablespoon olive oil to the pan, slide the potatoes back in, and brown on the other side, about 5 minutes more. Season with salt and pepper and slide onto a platter. Serve immediately.",
        "ingredients": [
            "4 tablespoons (1/2 stick) unsalted butter, at room temperature",
            "2 tablespoons olive oil",
            "8 medium all-purpose potatoes, boiled, peeled and diced small",
            "Kosher salt and freshly cracked black pepper, to taste",
            "1 tablespoon unsalted butter, melted"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In a heavy medium saute pan, melt 2 tablespoons of the butter with 1 tablespoon of the olive oil over medium heat.",
                "Spread the potatoes in an even layer in the saute pan, pressing down on them slightly with a spatula.",
                "Season with salt and pepper and cook until the potatoes begin to brown on the bottom, 6 to 7 minutes, shaking the pan occasionally to prevent sticking.",
                "Pour 1 tablespoon of the melted butter over the top of the potatoes.",
                "Place a large plate over the pan and invert the potatoes onto the plate.",
                "Add the remaining 2 tablespoons butter and 1 tablespoon olive oil to the pan, slide the potatoes back in, and brown on the other side, about 5 minutes more.",
                "Season with salt and pepper and slide onto a platter.",
                "Serve immediately."
            ],
            "pure_ingredients": [
                "butter",
                "olive oil",
                "potatoes",
                "salt",
                "black pepper"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "12 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "heavy medium saute pan",
                "spatula",
                "large plate",
                "platter"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "bXql5Naf5tkIj8tHrp.V4NM49zHMs6C",
        "recipe_title": "BBQ Beef Chili",
        "original_instructions": "In a stockpot or Dutch oven over medium-high heat, add the oil, garlic and onion. Sprinkle with salt and pepper and saute until the onion gets tender and aromatic, 3 to 5 minutes. Add the tomato paste and stir well. Add the ground beef and cook until browned, stirring frequently and breaking it apart, about 5 minutes. Add the chili powder and cumin and stir until evenly distributed. Stir in the tomato sauce and broth and lower the heat to a simmer. Cook, stirring occasionally, 30 minutes. Stir in the barbecue sauce and cook for an additional 10 minutes. Serve hot.",
        "ingredients": [
            "2 teaspoons olive oil",
            "3 garlic cloves, minced",
            "1 medium onion, diced",
            "Salt and freshly ground black pepper",
            "1 tablespoon tomato paste",
            "1 pound lean ground beef (at least 90 percent lean)",
            "2 tablespoons chili powder",
            "1 teaspoon ground cumin",
            "One 15-ounce can no-salt-added tomato sauce",
            "1 cup low-sodium chicken broth",
            "3 tablespoons barbecue sauce"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In a stockpot or Dutch oven over medium-high heat, add the oil, garlic, and onion.",
                "Sprinkle with salt and pepper and sauté until the onion gets tender and aromatic, 3 to 5 minutes.",
                "Add the tomato paste and stir well.",
                "Add the ground beef and cook until browned, stirring frequently and breaking it apart, about 5 minutes.",
                "Add the chili powder and cumin and stir until evenly distributed.",
                "Stir in the tomato sauce and broth and lower the heat to a simmer.",
                "Cook, stirring occasionally, for 30 minutes.",
                "Stir in the barbecue sauce and cook for an additional 10 minutes.",
                "Serve hot."
            ],
            "pure_ingredients": [
                "olive oil",
                "garlic",
                "onion",
                "salt",
                "black pepper",
                "tomato",
                "beef",
                "chili powder",
                "cumin",
                "broth",
                "barbecue sauce"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "50 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "stockpot",
                "Dutch oven",
                "stirring spoon"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "7VHar/8CbDz3D1nBSMOQKUWpdiQwfHG",
        "recipe_title": "Chocolate Rice Pudding",
        "original_instructions": "In a medium pot, bring 1 1/3 cups water to a boil. Add the rice, cover and turn the heat to low. Cook until all the water has been absorbed and rice is tender, about 15 minutes. Let cool until warm.\nTo the pot with the rice, stir in the milk, sugar and salt. Bring to a simmer, turn the heat to low and cook until the mixture is thickened, about 10 minutes. Remove from the heat, stir in the chocolate chips and vanilla and let rest for 5 minutes. Serve warm or cover and cool in refrigerate for at least 1 hour.",
        "ingredients": [
            "2/3 cups white rice",
            "3 cups whole milk",
            "1/2 cup sugar",
            "Pinch kosher salt",
            "1/2 cup chocolate chips",
            "1 teaspoon vanilla extract"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In a medium pot, bring 1 1/3 cups water to a boil.",
                "Add the rice, cover and turn the heat to low.",
                "Cook until all the water has been absorbed and rice is tender, about 15 minutes.",
                "Let cool until warm.",
                "To the pot with the rice, stir in the milk, sugar and salt.",
                "Bring to a simmer, turn the heat to low and cook until the mixture is thickened, about 10 minutes.",
                "Remove from the heat, stir in the chocolate chips and vanilla.",
                "Let rest for 5 minutes.",
                "Serve warm or cover and cool in the refrigerator for at least 1 hour."
            ],
            "pure_ingredients": [
                "rice",
                "milk",
                "sugar",
                "salt",
                "chocolate",
                "vanilla"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "25 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "medium pot",
                "stirring spoon",
                "lid",
                "refrigerator"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "tQ1iNAO58pXlsyucKBkYDAlYLa4IlZG",
        "recipe_title": "Corn Relish",
        "original_instructions": "Cut corn from cobs. Measure out 8 cups of corn in a 10 quart Dutch oven pot. Combine corn and water. Bring to boil and reduce heat. Simmer, covered for 5 minutes. Drain corn. In same Dutch oven combine with corn, red and green peppers and onions. Stir in vinegar, sugar, mustard, salt and black pepper. Bring to a boil. Boil gently, uncovered for 5 minutes, stirring occasionally. Stir together cornstarch and 2 tablespoons water. Add this mixture to corn mixture. Cook and stir until slightly thickened and bubbly. Cook for 2 minutes more. Ladle relish into hot sterilized jars leaving 1/2-inch headspace. Remove any air bubbles. Wipe jar rims and adjust lids and rings. Process in hot boiling water canner for 15 minutes.",
        "ingredients": [
            "12 ears fresh corn",
            "2 cups water",
            "1 1/2 cups green pepper, chopped",
            "1 1/2 cups roasted red pepper, chopped",
            "1 cup onion, chopped",
            "2 1/2 cups vinegar",
            "1 3/4 cups sugar",
            "4 teaspoons dry mustard",
            "2 teaspoons black pepper",
            "2 teaspoons pickling salt",
            "3 tablespoons cornstarch",
            "2 tablespoons water"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Cut corn from cobs.",
                "Measure out 8 cups of corn and place in a 10 quart Dutch oven pot.",
                "Combine corn and water.",
                "Bring to boil and reduce heat.",
                "Simmer, covered for 5 minutes.",
                "Drain corn.",
                "In the same Dutch oven, combine corn, red and green peppers, and onions.",
                "Stir in vinegar, sugar, mustard, salt, and black pepper.",
                "Bring to a boil.",
                "Boil gently, uncovered for 5 minutes, stirring occasionally.",
                "Stir together cornstarch and 2 tablespoons of water.",
                "Add this mixture to the corn mixture.",
                "Cook and stir until slightly thickened and bubbly.",
                "Cook for 2 minutes more.",
                "Ladle relish into hot sterilized jars leaving 1/2-inch headspace.",
                "Remove any air bubbles.",
                "Wipe jar rims and adjust lids and rings.",
                "Process in hot boiling water canner for 15 minutes."
            ],
            "pure_ingredients": [
                "corn",
                "water",
                "green pepper",
                "red pepper",
                "onion",
                "vinegar",
                "sugar",
                "mustard",
                "black pepper",
                "salt",
                "cornstarch"
            ],
            "cooking_time": {
                "preparation": "30 minutes",
                "cooking": "30 minutes",
                "plating": "20 minutes"
            },
            "required_tools": [
                "knife",
                "cutting board",
                "10 quart Dutch oven pot",
                "measuring cups",
                "saucepan",
                "jar",
                "lid",
                "ring",
                "hot boiling water canner"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "JCgVDfRUgDsjIbuTf4MlvCE6.A/LaVq",
        "recipe_title": "Tropical Fruit Granita ",
        "original_instructions": "Stir juice and sugar in large bowl until sugar dissolves. Add rum, lime juice and vanilla. Pour mixture into shallow baking dish. Freeze until mixture is entirely crystallized, stirring frequently and scraping crystals from around edges, about 5 hours. (Can be prepared 2 days ahead. Cover and keep frozen.) Using tines of fork, scrape frozen juice mixture to form small flakes. Spoon granita into goblets and serve.\nStir juice and sugar in large bowl until sugar dissolves. Add rum, lime juice and vanilla. Pour mixture into shallow baking dish. Freeze until mixture is entirely crystallized, stirring frequently and scraping crystals from around edges, about 5 hours. (Can be prepared 2 days ahead. Cover and keep frozen.)\nUsing tines of fork, scrape frozen juice mixture to form small flakes. Spoon granita into goblets and serve.",
        "ingredients": [
            "3 cups tropical fruit juice blend (such as pineapple-orange-passion fruit)",
            "4 1/2 tablespoons sugar",
            "1 1/2 tablespoons dark rum",
            "1 tablespoon fresh lime juice",
            "3/4 teaspoon vanilla extract"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Stir juice and sugar in a large bowl until the sugar dissolves.",
                "Add rum, lime juice, and vanilla to the mixture.",
                "Pour the mixture into a shallow baking dish.",
                "Freeze the mixture until it is entirely crystallized, stirring frequently and scraping crystals from around the edges, about 5 hours.",
                "Using the tines of a fork, scrape the frozen juice mixture to form small flakes.",
                "Spoon the granita into goblets and serve."
            ],
            "pure_ingredients": [
                "fruit juice",
                "sugar",
                "rum",
                "lime juice",
                "vanilla"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "5 hours",
                "plating": "5 minutes"
            },
            "required_tools": [
                "large bowl",
                "shallow baking dish",
                "fork",
                "goblets"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "t9i63wBp9HXVj22ID7IuxdMIZBLrEMu",
        "recipe_title": "Bread and Butter Pickles and Pineapple Ginger Relish",
        "original_instructions": "Preheat an indoor grill pan.\nPlace the pineapple on the hot grill and grill until it gets nice and caramelized on all sides, about 6 to 8 minutes per side. Chop the grilled pineapple and set aside.\nIn a medium mixing bowl, add the garlic, pickles, ginger, habanero pepper, salt, and pepper, to taste. Add the grilled pineapple and mix together until well combined. This relish can be used on a burger or hot dogs.",
        "ingredients": [
            "4 slices pineapple",
            "1 clove garlic, minced",
            "1/2 cup bread and butter pickles, chopped",
            "3 ounces minced fresh ginger",
            "1 habanero pepper, seeded and finely chopped",
            "Kosher salt and freshly ground black pepper, to taste"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat an indoor grill pan.",
                "Place the pineapple on the hot grill and grill until it gets caramelized on all sides, about 6 to 8 minutes per side.",
                "Chop the grilled pineapple and set aside.",
                "In a medium mixing bowl, add the garlic, pickles, ginger, habanero pepper, salt, and pepper to taste.",
                "Add the grilled pineapple and mix together until well combined."
            ],
            "pure_ingredients": [
                "pineapple",
                "garlic",
                "pickles",
                "ginger",
                "habanero pepper",
                "salt",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "16 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "indoor grill pan",
                "mixing bowl",
                "knife",
                "cutting board"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "ZuZSEwIxGaXA82HACs1QsVq9EF3A1RK",
        "recipe_title": "Balsamic Dressing ",
        "original_instructions": "Combine all ingredients in a small, heavy nonreactive saucepan and cook over moderate heat until syrupy and reduced to a scant 1/4 cup, about 12 minutes. Cool to room temperature.\nCombine all ingredients in a small, heavy nonreactive saucepan and cook over moderate heat until syrupy and reduced to a scant 1/4 cup, about 12 minutes.\nCool to room temperature.",
        "ingredients": [
            "1/3 cup plus 1 tablespoon balsamic vinegar",
            "1 tablespoon honey",
            "1 teaspoon minced garlic",
            "1 teaspoon minced peeled fresh ginger",
            "1 plum tomato, chopped"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Combine all ingredients in a small, heavy nonreactive saucepan.",
                "Cook over moderate heat until syrupy and reduced to a scant 1/4 cup, about 12 minutes.",
                "Cool the mixture to room temperature."
            ],
            "pure_ingredients": [
                "balsamic vinegar",
                "honey",
                "garlic",
                "ginger",
                "tomato"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "12 minutes",
                "plating": "3 minutes"
            },
            "required_tools": [
                "saucepan",
                "stove"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "4nLoeS.9LH36fHavYcOqNZZp7yAWRGq",
        "recipe_title": "Chilled Tuna-Stuffed Chiles",
        "original_instructions": "Put the chiles in a 9-by-13-inch glass baking dish and set aside for stuffing.\nCombine the tuna, peas, corn and mayonnaise in a small bowl. Season with salt and pepper.\nStuff the peppers with the tuna mixture. Place back in the baking dish; they should fit snugly. Pour the pickled carrots and jalapeno juice over the stuffed chiles. Let come to room temperature, then cover and chill for 2 hours or overnight. Serve cold.",
        "ingredients": [
            "8 Anaheim chiles, charred, stemmed and seeded, left whole for stuffing (see Cook's Note)",
            "Two 6-ounce cans albacore tuna in water, drained",
            "1 cup fresh peas (from 1 pound in the shell), or canned or thawed frozen peas",
            "1/2 cup fresh corn kernels (from 1 ear), or canned or thawed frozen corn",
            "3 tablespoons mayonnaise",
            "Kosher salt and freshly ground black pepper",
            "One 14.1-ounce can carrots in jalapeno pickling juice"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Put the chiles in a 9-by-13-inch glass baking dish and set aside for stuffing.",
                "Combine the tuna, peas, corn and mayonnaise in a small bowl.",
                "Season with salt and pepper.",
                "Stuff the peppers with the tuna mixture.",
                "Place the stuffed peppers back in the baking dish; they should fit snugly.",
                "Pour the pickled carrots and jalapeno juice over the stuffed chiles.",
                "Let come to room temperature, then cover and chill for 2 hours or overnight.",
                "Serve cold."
            ],
            "pure_ingredients": [
                "chiles",
                "tuna",
                "peas",
                "corn",
                "mayonnaise",
                "salt",
                "pepper",
                "carrots",
                "jalapeno"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "0 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "9-by-13-inch glass baking dish",
                "small bowl",
                "spoon for mixing"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "8.tQMUkdwv6P68p9eCgh20YrBtpmh2S",
        "recipe_title": "Chicken Milk",
        "original_instructions": "Pour the milk into a saucepan and scrape in the seeds from the vanilla pod. Add the pod to the pot, too, and judiciously grate in some nutmeg. Heat the milk to the boiling point. Remove from the heat, cover, and let sit 10 minutes to infuse.\nMeanwhile, beat the egg yolks and sugar together in a bowl. When the milk has infused, whisk it into the eggs and return the whole thing to the saucepan. Place the pan back on the heat and whisk to thicken slightly, about 3 to 5 minutes. Do not allow the mixture to boil. Stir in the flower water, to taste. Strain the mixture into a jug, cool, and, chill.",
        "ingredients": [
            "3 cups whole milk",
            "1 vanilla bean, split",
            "Pinch freshly grated nutmeg",
            "4 egg yolks",
            "4 to 6 tablespoons sugar",
            "Orange flower water or rum, to taste"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Pour the milk into a saucepan and scrape in the seeds from the vanilla pod.",
                "Add the vanilla pod to the saucepan.",
                "Grate a pinch of nutmeg into the milk.",
                "Heat the milk to the boiling point.",
                "Remove the saucepan from heat, cover it, and let sit for 10 minutes to infuse.",
                "Meanwhile, beat the egg yolks and sugar together in a bowl.",
                "After the milk has infused, whisk it into the egg mixture.",
                "Return the mixture to the saucepan and place it back on the heat.",
                "Whisk the mixture to thicken slightly for about 3 to 5 minutes without allowing it to boil.",
                "Stir in orange flower water to taste.",
                "Strain the mixture into a jug, cool it, and then chill."
            ],
            "pure_ingredients": [
                "milk",
                "vanilla",
                "nutmeg",
                "egg",
                "sugar",
                "orange"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "13 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "saucepan",
                "bowl",
                "whisk",
                "juicer",
                "strainer",
                "jug"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "pdF85jxutyamZw7t/wFO7KcYm/2zHRa",
        "recipe_title": "Sunomono",
        "original_instructions": "Peel and slice cucumbers into very thin slices. Sprinkle sliced cucumber slices with salt and let stand a few minutes. Squeeze out excess moisture. Combine vinegar, sugar, and soy in a bowl and mix well. Pour the vinegar mixture over the cucumber slices and mix well. Serve in individual dishes.\nMay add Wakame (seaweed), crab, and shrimp.",
        "ingredients": [
            "1 large English cucumber, or 2 to 3 Japanese cucumbers",
            "1 teaspoon salt",
            "2 tablespoons rice wine vinegar",
            "1 tablespoon sugar",
            "1 drop soy sauce"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Peel and slice cucumbers into very thin slices.",
                "Sprinkle sliced cucumber slices with salt and let stand a few minutes.",
                "Squeeze out excess moisture.",
                "Combine vinegar, sugar, and soy sauce in a bowl and mix well.",
                "Pour the vinegar mixture over the cucumber slices and mix well.",
                "Serve in individual dishes. May add Wakame, crab, and shrimp."
            ],
            "pure_ingredients": [
                "cucumber",
                "salt",
                "vinegar",
                "sugar",
                "soy sauce"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "0 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "knife",
                "bowl",
                "spoon",
                "individual serving dishes"
            ],
            "dietary_labels": [
                "vegan"
            ]
        }
    },
    {
        "recipe_id": "4s7.oR.r4d7CiR8tGxAyjAVjwjvlLSu",
        "recipe_title": "Holiday Horseradish Deviled Eggs",
        "original_instructions": "Preheat the oven to 400 degrees F.\nPut the bacon on a sheet tray lined with a wire rack and bake until crisp, about 18 to 22 minutes Remove the bacon from oven, allow to cool and then crumble.\nPut the eggs in a small saucepan and cover them with salted water. Bring the water to a boil over medium heat, then cover, and remove the saucepan from the heat. Allow the eggs to sit for 10 minutes. Remove eggs from pan and shock in ice water. Peel the eggs and cut in half. Remove the yolks to a medium-sized bowl. Add the mayonnaise, cayenne, mustard, horseradish, salt, and pepper. Mix until smooth and creamy. Put the mixture into a piping bag. Arrange the egg whites on a serving platter. Pipe a heaping tablespoon of the egg yolk mixture into each of the egg whites. Sprinkle each egg with some bacon and scallions. Serve.",
        "ingredients": [
            "4 slices bacon",
            "6 eggs",
            "3 tablespoons mayonnaise",
            "1/2 teaspoon cayenne",
            "2 tablespoons prepared mustard",
            "1 tablespoon prepared horseradish",
            "Pinch salt",
            "Pinch cracked black pepper",
            "2 tablespoons thinly sliced scallion greens"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat the oven to 400 degrees F.",
                "Place the bacon on a sheet tray lined with a wire rack and bake until crisp, about 18 to 22 minutes.",
                "Remove the bacon from the oven, allow it to cool, and then crumble it.",
                "Put the eggs in a small saucepan and cover them with salted water.",
                "Bring the water to a boil over medium heat, then cover the saucepan and remove it from the heat.",
                "Allow the eggs to sit for 10 minutes.",
                "Remove the eggs from the pan and shock them in ice water.",
                "Peel the eggs and cut them in half.",
                "Remove the yolks and place them into a medium-sized bowl.",
                "Add mayonnaise, cayenne, mustard, horseradish, salt, and pepper to the yolks.",
                "Mix until smooth and creamy.",
                "Put the mixture into a piping bag.",
                "Arrange the egg whites on a serving platter.",
                "Pipe a heaping tablespoon of the egg yolk mixture into each egg white.",
                "Sprinkle each egg with some crumbled bacon and scallion greens.",
                "Serve."
            ],
            "pure_ingredients": [
                "bacon",
                "eggs",
                "mayonnaise",
                "cayenne",
                "mustard",
                "horseradish",
                "salt",
                "pepper",
                "scallions"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "30 minutes",
                "plating": "10 minutes"
            },
            "required_tools": [
                "oven",
                "sheet tray",
                "wire rack",
                "small saucepan",
                "bowl",
                "piping bag",
                "serving platter"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "MECzqaXRwp9zu11bHGCcRgEy1FkZWd2",
        "recipe_title": "Big Daddy's Get Up Granola",
        "original_instructions": "Preheat the oven to 275 degrees F. Lightly grease a half sheet tray lined with parchment paper.\nIn a large bowl, combine the oats, peanuts, almonds, walnuts, coconut and brown sugar. Mix well. Add the molasses and peanut oil. Toss well until all ingredients are evenly dispersed and coated. Spread the granola out evenly on the sheet tray. Bake in the oven for 60 minutes, stirring occasionally to achieve even color.\nRemove from the oven and transfer to a large bowl. Fold in raisins and graham crackers. Stir the blueberries into the yogurt in a small bowl. Spoon the yogurt into serving glasses or bowls and top with graham cracker granola.",
        "ingredients": [
            "1 1/2 cups rolled oats",
            "1/2 cup peanuts, roasted",
            "1/2 cup almonds, blanched",
            "1/2 cup chopped walnuts",
            "1/2 cup sweetened coconut",
            "2 tablespoons brown sugar",
            "2 tablespoons molasses",
            "3 tablespoons peanut oil",
            "1/2 cup raisins",
            "1/2 cup coarsely crushed graham crackers",
            "1 pint blueberries",
            "1 quart vanilla yogurt"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat the oven to 275 degrees F.",
                "Lightly grease a half sheet tray lined with parchment paper.",
                "In a large bowl, combine the oats, peanuts, almonds, walnuts, coconut, and brown sugar. Mix well.",
                "Add the molasses and peanut oil. Toss well until all ingredients are evenly dispersed and coated.",
                "Spread the granola out evenly on the sheet tray.",
                "Bake in the oven for 60 minutes, stirring occasionally to achieve even color.",
                "Remove from the oven and transfer to a large bowl.",
                "Fold in raisins and graham crackers.",
                "Stir the blueberries into the yogurt in a small bowl.",
                "Spoon the yogurt into serving glasses or bowls and top with graham cracker granola."
            ],
            "pure_ingredients": [
                "oats",
                "peanuts",
                "almonds",
                "walnuts",
                "coconut",
                "brown sugar",
                "molasses",
                "peanut oil",
                "raisins",
                "graham crackers",
                "blueberries",
                "yogurt"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "60 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "oven",
                "sheet tray",
                "parchment paper",
                "large bowl",
                "spoon",
                "serving glasses or bowls"
            ],
            "dietary_labels": [
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "PNIQJjABmFUKGPdQ7CyjKmWPNYbnIu.",
        "recipe_title": "Chicken with Almond-Parsley Pesto",
        "original_instructions": "Heat the oil in a large skillet over medium heat. Add the onion and cook, stirring, for 2 minutes. Add the chicken and cook until golden brown on all sides, about 5 minutes.\nIn a blender, combine the pesto ingredients and process until smooth, adding more oil if necessary to create a sauce-like consistency.\nAdd the sauce to the chicken in the skillet and cook for 1 minute to heat through. Serve the chicken and sauce over the pasta.",
        "ingredients": [
            "2 teaspoons olive oil",
            "1/2 cup chopped onion",
            "1 1/4 pounds boneless, skinless chicken breast halves, cut into 1-inch pieces",
            "12 ounces angel hair pasta, cooked",
            "1 packed cup fresh parsley leaves",
            "1/3 cup sour cream",
            "1/4 cup freshly grated Parmesan cheese",
            "3 tablespoons olive oil, or more as needed",
            "2 tablespoons toasted slivered almonds",
            "3 cloves garlic",
            "1/2 teaspoon salt"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Heat the olive oil in a large skillet over medium heat.",
                "Add the chopped onion and cook, stirring, for 2 minutes.",
                "Add the chicken pieces and cook until golden brown on all sides, about 5 minutes.",
                "In a blender, combine the parsley, sour cream, Parmesan cheese, additional olive oil, almonds, garlic, and salt, and process until smooth.",
                "Add the sauce to the chicken in the skillet and cook for 1 minute to heat through.",
                "Serve the chicken and sauce over the cooked pasta."
            ],
            "pure_ingredients": [
                "olive oil",
                "onion",
                "chicken",
                "pasta",
                "parsley",
                "sour cream",
                "cheese",
                "almonds",
                "garlic",
                "salt"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "8 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "skillet",
                "blender",
                "spatula"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "B4YaPlx8ekAPjmoXFTt3vrjTjDAlFuW",
        "recipe_title": "Brussels Sprouts with Golden Onion ",
        "original_instructions": "Trim Brussels sprouts and quarter lengthwise. In a large saucepan of boiling salted water boil sprouts 5 minutes, or until just tender, and drain in a colander. In pan cook onion in butter over moderate heat, stirring occasionally, until golden. Add sprouts and cook, stirring, 1 minute. In a small bowl stir together mustard and water and stir into sprouts with salt and pepper to taste.\nTrim Brussels sprouts and quarter lengthwise. In a large saucepan of boiling salted water boil sprouts 5 minutes, or until just tender, and drain in a colander. In pan cook onion in butter over moderate heat, stirring occasionally, until golden. Add sprouts and cook, stirring, 1 minute. In a small bowl stir together mustard and water and stir into sprouts with salt and pepper to taste.",
        "ingredients": [
            "10 ounces Brussels sprouts (about 2 1/2 cups)",
            "1 small onion, sliced thin",
            "1 tablespoon unsalted butter",
            "2 1/2 teaspoons Dijon mustard (preferably coarse-grained)",
            "1 teaspoon water"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Trim Brussels sprouts and quarter them lengthwise.",
                "Bring a large saucepan of salted water to a boil.",
                "Boil the Brussels sprouts in the boiling salted water for 5 minutes, or until just tender.",
                "Drain the boiled Brussels sprouts in a colander.",
                "In the same pan, cook the sliced onion in butter over moderate heat, stirring occasionally, until the onion is golden.",
                "Add the drained Brussels sprouts to the pan with the onion and cook, stirring, for 1 minute.",
                "In a small bowl, stir together the mustard and water.",
                "Stir the mustard mixture into the sprouts and onion, adding salt and pepper to taste."
            ],
            "pure_ingredients": [
                "Brussels sprouts",
                "onion",
                "butter",
                "mustard",
                "water",
                "salt",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "10 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "saucepan",
                "colander",
                "stirring spoon",
                "small bowl",
                "knife"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "rFq1AMAwmAzGUcvRbyh2ljMOE7NxM5i",
        "recipe_title": "Kale and Portobello Mushrooms",
        "original_instructions": "Heat a large skillet over medium-high heat with extra-virgin olive oil. When the oil is hot, add mushrooms and cook until dark and tender. Add kale and turn with tongs to wilt. Season the mixture of mushrooms and greens with salt, pepper and nutmeg. Add wine and deglaze the pan. Reduce heat to low and cook greens 5 minutes longer then serve.",
        "ingredients": [
            "3 tablespoons extra-virgin olive oil",
            "4 portobello mushroom caps, sliced",
            "1 1/4 pounds kale, stemmed and chopped",
            "Salt and pepper",
            "Freshly grated nutmeg, to taste, about 1/4 teaspoon",
            "1/2 cup dry Italian red wine"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Heat a large skillet over medium-high heat with extra-virgin olive oil.",
                "When the oil is hot, add mushrooms and cook until dark and tender.",
                "Add kale and turn with tongs to wilt.",
                "Season the mixture of mushrooms and greens with salt, pepper and nutmeg.",
                "Add wine and deglaze the pan.",
                "Reduce heat to low and cook greens 5 minutes longer then serve."
            ],
            "pure_ingredients": [
                "olive oil",
                "mushrooms",
                "kale",
                "salt",
                "pepper",
                "nutmeg",
                "wine"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "10 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "skillet",
                "tongs"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "KEmGqtP1L/cDPch0qxqaiwiZGmv7j.e",
        "recipe_title": "Strawberry Ice Cream Pie",
        "original_instructions": "In a food processor, process crackers, butter, sugar and cinnamon until crumbly. Press into 9\" pie plate and chill until firm about 20 minutes.\nIn a large bowl mix together the softened ice cream with the orange zest and pour into pie plate. Freeze until firm about 3 hours. Serve each slice of pie with some of the strawberries",
        "ingredients": [
            "20 graham crackers",
            "1/2 stick unsalted butter, melted",
            "2 tablespoons sugar",
            "1 tablespoon cinnamon",
            "1 quart vanilla ice cream, softened",
            "1 tablespoon orange zest",
            "2 cups frozen strawberries with sugar syrup, thawed at room temperature"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In a food processor, process crackers, butter, sugar, and cinnamon until crumbly.",
                "Press the mixture into a 9\" pie plate and chill until firm for about 20 minutes.",
                "In a large bowl, mix together the softened ice cream with the orange zest.",
                "Pour the ice cream mixture into the pie plate.",
                "Freeze until firm for about 3 hours.",
                "Serve each slice of pie with some of the strawberries."
            ],
            "pure_ingredients": [
                "graham crackers",
                "butter",
                "sugar",
                "cinnamon",
                "vanilla ice cream",
                "orange zest",
                "strawberries"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "3 hours 20 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "food processor",
                "pie plate",
                "large bowl"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "8uQUJazVggPsTia9QBUEQC1ujbOqcn6",
        "recipe_title": "Chocolate-Cherry Fun-due",
        "original_instructions": "Melt chocolate in the cream over a double boiler or in a fondue pot then stir in remaining ingredients. Serve with pieces of fresh or dried fruit and pound or angel food cake for dipping.",
        "ingredients": [
            "12 ounces semisweet dark chocolate",
            "3 ounces heavy cream",
            "2 ounces Kirsch or cherry brandy",
            "1 teaspoon vanilla",
            "Pinch salt"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Melt chocolate in the cream over a double boiler or in a fondue pot.",
                "Stir in Kirsch or cherry brandy, vanilla, and salt.",
                "Serve with pieces of fresh or dried fruit and pound or angel food cake for dipping."
            ],
            "pure_ingredients": [
                "chocolate",
                "cream",
                "vanilla",
                "salt",
                "cherry brandy"
            ],
            "cooking_time": {
                "preparation": "5 minutes",
                "cooking": "10 minutes",
                "plating": "3 minutes"
            },
            "required_tools": [
                "double boiler",
                "fondue pot",
                "stirring spoon"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "GT1CnfVaWStj3o305f8JcQYiBwBo.ua",
        "recipe_title": "Chocolate Orange Fondue",
        "original_instructions": "For serving: pound cake, doughnuts, long-stemmed strawberries, bananas or pretzels\nChop the chocolate and place it in a heat-proof bowl set over a pan of simmering water. Add the cream, zest, coffee, and liqueur and stir constantly until the chocolate is melted and smooth. Transfer the mixture to a fondue pot and serve warm with pound cake, doughnuts, strawberries, bananas or pretzels.",
        "ingredients": [
            "7 ounces good semisweet chocolate",
            "1/3 cup heavy cream",
            "1 1/2 teaspoons grated orange zest",
            "1/2 teaspoon instant coffee granules",
            "2 tablespoons orange-flavored liqueur (recommended: Grand Marnier)"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Chop the chocolate.",
                "Place the chopped chocolate in a heat-proof bowl set over a pan of simmering water.",
                "Add the cream, zest, coffee, and liqueur to the bowl.",
                "Stir constantly until the chocolate is melted and smooth.",
                "Transfer the mixture to a fondue pot.",
                "Serve warm with pound cake."
            ],
            "pure_ingredients": [
                "chocolate",
                "cream",
                "orange zest",
                "coffee",
                "liqueur",
                "cake",
                "strawberries",
                "bananas",
                "pretzels"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "5 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "chopping board",
                "knife",
                "heat-proof bowl",
                "pan",
                "fondue pot",
                "stirrer"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "itTTC2We7WbBhs9Bv0xmNcXNX.ccPxm",
        "recipe_title": "Pasta and Tomato \"Cruda\" with Basil",
        "original_instructions": "Choose very ripe tomatoes. Peel the tomatoes by submerging in boiling water for 30 seconds after scoring the end with a knife and removing the core. Refresh the tomatoes in ice water, remove the skin, cut the tomatoes in half and squeeze out the seeds. Cut them into 1/2 inch dice and set aside.\nPrepare the remaining ingredients and set aside to have ready for the final assembly of the dish.\nBring the water to a boil in a large pot. Add the salt and reboil before adding the pasta. Cook according to the package directions, about 10 minutes or until al dente. Immediately drain the pasta and place into a large serving bowl.\nAdd the oil to the cooked pasta and toss well. Now add the ingredients in quick succession: tomatoes, red pepper, basil, salt and pepper. Toss everything together and incorporate well.\nTop with optional ricotta salata cheese.",
        "ingredients": [
            "1 1/2 pounds ripe fresh tomato, peeled and seeded",
            "1/3 cup extra virgin olive oil",
            "1/2 teaspoon red pepper flakes",
            "1/4 cup julienne basil leaves",
            "1/2 teaspoon sea salt and freshly ground black pepper to taste",
            "8 quarts water",
            "2 tablespoons coarse salt",
            "1 pound thin spaghetti or other dry pasta",
            "Optional: 1/2 cup grated dry ricotta salata cheese"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Score the ends of the tomatoes with a knife and remove the cores.",
                "Submerge the tomatoes in boiling water for 30 seconds.",
                "Transfer the tomatoes to ice water and peel off the skins.",
                "Cut the tomatoes in half and squeeze out the seeds.",
                "Dice the tomatoes into 1/2 inch pieces and set aside.",
                "Bring the water to a boil in a large pot.",
                "Add the salt to the boiling water.",
                "Reboil the water and add the pasta.",
                "Cook the pasta according to the package directions, approximately 10 minutes.",
                "Drain the pasta immediately and place it into a large serving bowl.",
                "Add the olive oil to the cooked pasta and toss well.",
                "Add the diced tomatoes, red pepper flakes, basil leaves, salt, and pepper to the pasta.",
                "Toss everything together to incorporate well.",
                "Top with ricotta salata cheese if using."
            ],
            "pure_ingredients": [
                "tomato",
                "olive oil",
                "red pepper flakes",
                "basil",
                "salt",
                "pepper",
                "water",
                "pasta",
                "cheese"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "10 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "knife",
                "pot",
                "bowl",
                "strainer",
                "spoon"
            ],
            "dietary_labels": [
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "nBQjDOs8CFNilyW0aF0y3VwVCxE5cle",
        "recipe_title": "Almond-Pistachio Nougatine ",
        "original_instructions": "Making the Caramel Put the sugar and corn syrup in a medium saucepan and make a light caramel: Place saucepan over medium heat. The sugar will melt and start to caramelize. When the mixture is pale brown, add the almonds, pistachios, and butter. Mix well to coat the nuts in the caramel and toast them lightly.\nPut the sugar and corn syrup in a medium saucepan and make a light caramel: Place saucepan over medium heat. The sugar will melt and start to caramelize. When the mixture is pale brown, add the almonds, pistachios, and butter. Mix well to coat the nuts in the caramel and toast them lightly.\nMaking the Nougatine Working quickly, turn the mixture out onto a sheet of parchment paper or onto a silicone mat. Place a second sheet or mat on top, then roll out the nougatine very thinly with a rolling pin. To finish, cut out the desired shapes using a knife or a pair of scissors. If the nougatine hardens too much to cut, reheat it in a 275°F oven for 4 to 5 minutes to soften it a little. (Store in an airtight container, away from moisture, for up to 1 month.)\nWorking quickly, turn the mixture out onto a sheet of parchment paper or onto a silicone mat. Place a second sheet or mat on top, then roll out the nougatine very thinly with a rolling pin. To finish, cut out the desired shapes using a knife or a pair of scissors. If the nougatine hardens too much to cut, reheat it in a 275°F oven for 4 to 5 minutes to soften it a little. (Store in an airtight container, away from moisture, for up to 1 month.)",
        "ingredients": [
            "3/4 cup sugar",
            "1/3 cup light corn syrup",
            "3/4 cup plus 2 tbsp sliced almonds",
            "1/3 cup chopped pistachios",
            "2 tbsp unsalted butter"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Place sugar and corn syrup in a medium saucepan over medium heat to make a light caramel.",
                "When the sugar mixture is pale brown, add almonds, pistachios, and butter. Mix well to coat the nuts.",
                "Turn the mixture onto a sheet of parchment paper or a silicone mat.",
                "Place another sheet or mat on top and roll out the nougatine very thinly with a rolling pin.",
                "Cut out desired shapes using a knife or a pair of scissors.",
                "If the nougatine hardens too much, reheat in a 275°F oven for 4 to 5 minutes to soften."
            ],
            "pure_ingredients": [
                "sugar",
                "corn syrup",
                "almonds",
                "pistachios",
                "butter"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "20 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "medium saucepan",
                "parchment paper",
                "silicone mat",
                "rolling pin",
                "knife",
                "scissors",
                "oven"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "3H.nGNZgTronQDNqcTFmHPxPPdwuytK",
        "recipe_title": "Southern Rice Pilaf Stuffing with Ham, Pecans and Greens ",
        "original_instructions": "Bring 3 cups broth and bay leaf to boil in medium saucepan. Mix in wild rice; reduce heat to low, cover and cook 30 minutes. Mix in white rice. Cover; cook until both are tender and liquid is absorbed, about 20 minutes more. Transfer rice to large bowl. Discard bay leaf. Melt butter in heavy large Dutch oven over medium heat. Add ham, onions and celery and sauté until onions are tender, about 10 minutes. Add collard greens and marjoram and sauté until greens wilt, about 3 minutes. Add mixture to rice. Mix in cubed stuffing, pecans and nutmeg. Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate.) Mix eggs into stuffing. To bake stuffing in turkey: Fill main turkey cavity with stuffing. Mix enough chicken broth into remaining stuffing to moisten (about 1/2 to 3/4 cup broth, depending on amount of remaining stuffing). Spoon remaining stuffing into buttered baking dish. Cover with buttered aluminum foil. Bake stuffing in dish alongside turkey until heated through, about 30 minutes. To bake all stuffing in pan: Preheat oven to 375°F. Butter 13x9x2-inch baking dish. Mix 1 1/2 cups broth into stuffing. Transfer to prepared dish. Cover with buttered foil and bake until heated through, about 30 minutes.\nBring 3 cups broth and bay leaf to boil in medium saucepan. Mix in wild rice; reduce heat to low, cover and cook 30 minutes. Mix in white rice. Cover; cook until both are tender and liquid is absorbed, about 20 minutes more. Transfer rice to large bowl. Discard bay leaf.\nMelt butter in heavy large Dutch oven over medium heat. Add ham, onions and celery and sauté until onions are tender, about 10 minutes. Add collard greens and marjoram and sauté until greens wilt, about 3 minutes. Add mixture to rice. Mix in cubed stuffing, pecans and nutmeg. Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate.) Mix eggs into stuffing.\nTo bake stuffing in turkey: Fill main turkey cavity with stuffing. Mix enough chicken broth into remaining stuffing to moisten (about 1/2 to 3/4 cup broth, depending on amount of remaining stuffing). Spoon remaining stuffing into buttered baking dish. Cover with buttered aluminum foil. Bake stuffing in dish alongside turkey until heated through, about 30 minutes.\nTo bake all stuffing in pan: Preheat oven to 375°F. Butter 13x9x2-inch baking dish. Mix 1 1/2 cups broth into stuffing. Transfer to prepared dish. Cover with buttered foil and bake until heated through, about 30 minutes.",
        "ingredients": [
            "4 1/2 cups (about) canned low-salt chicken broth",
            "1 bay leaf",
            "3/4 cup wild rice",
            "3/4 cup long-grain white rice",
            "3 tablespoons butter",
            "2 cups chopped ham (about 3/4 pound)",
            "1 1/2 cups chopped onions",
            "1 1/2 cups chopped celery with leaves",
            "1 large bunch collard greens, sliced",
            "2 tablespoons chopped fresh marjoram or 2 teaspoons dried",
            "3 cups packaged cubed bread stuffing",
            "1 cup pecans, toasted, coarsely chopped",
            "1/4 teaspoon ground nutmeg",
            "3 eggs, beaten to blend"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Bring 3 cups of broth and a bay leaf to boil in a medium saucepan.",
                "Mix in the wild rice, reduce heat to low, cover, and cook for 30 minutes.",
                "Mix in the white rice, cover, and cook until both types of rice are tender and liquid is absorbed, about 20 minutes more.",
                "Transfer the rice to a large bowl and discard the bay leaf.",
                "Melt butter in a large Dutch oven over medium heat.",
                "Add ham, onions, and celery and sauté until onions are tender, about 10 minutes.",
                "Add collard greens and marjoram and sauté until greens wilt, about 3 minutes.",
                "Add the mixture to the rice.",
                "Mix in cubed stuffing, pecans, and nutmeg.",
                "Season to taste with salt and pepper.",
                "Mix eggs into the stuffing.",
                "For turkey stuffing: Fill the main turkey cavity with stuffing.",
                "Moisten remaining stuffing with chicken broth (about 1/2 to 3/4 cup).",
                "Spoon remaining stuffing into a buttered baking dish, cover with buttered aluminum foil, and bake alongside turkey until heated through, about 30 minutes.",
                "For baking in a pan: Preheat oven to 375°F.",
                "Butter a 13x9x2-inch baking dish.",
                "Mix in 1 1/2 cups broth into stuffing.",
                "Transfer stuffing to prepared dish, cover with buttered foil, and bake until heated through, about 30 minutes."
            ],
            "pure_ingredients": [
                "broth",
                "bay leaf",
                "wild rice",
                "white rice",
                "butter",
                "ham",
                "onions",
                "celery",
                "collard greens",
                "marjoram",
                "bread",
                "pecans",
                "nutmeg",
                "eggs",
                "salt",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "60 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "medium saucepan",
                "large bowl",
                "Dutch oven",
                "baking dish",
                "aluminum foil",
                "oven"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "oji1LKgnsQcAUX2CXr/vEToCneYFHfu",
        "recipe_title": "Homemade Ricotta Cheese",
        "original_instructions": "Line a colander with 4 layers of cheesecloth, and secure it with 3 or 4 clothespins. Set the colander inside a bowl.\nIn a large saucepan over medium-high heat, with a thermometer handy, combine the whole milk and buttermilk and heat, stirring nearly constantly, until the temperature reaches 180 degrees F. When you reach 170 to 175 degrees F, you'll start to see fine, little curds separating from the whey. At 180 degrees F, turn off the heat, and skim the curds from the whey using a finely slotted spoon, dropping the curds into the cheesecloth-lined colander. (Save the whey for another use, such as breadmaking.) Gather the cheesecloth around the curds and tie it with a 2-foot length of string. Gently squeeze to remove more, but not all, liquid from the cheese, and then hang over the sink or a bowl for 20 to 30 minutes to drain it a bit more. (I use the string to tie the bag to my faucet.)\nRemove the ricotta from the cheesecloth, spoon it into a container, and stir in the salt. Serve ASAP, preferably without refrigerating.",
        "ingredients": [
            "1/2 gallon whole milk",
            "2 cups buttermilk",
            "1/2 teaspoon kosher salt"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Line a colander with 4 layers of cheesecloth and secure it with clothespins.",
                "Set the colander inside a bowl.",
                "In a large saucepan over medium-high heat, combine the whole milk and buttermilk.",
                "Stir nearly constantly and heat until the temperature reaches 180 degrees F.",
                "At 170 to 175 degrees F, observe as fine curds start separating from the whey.",
                "At 180 degrees F, turn off the heat.",
                "Skim the curds from the whey using a finely slotted spoon and deposit them into the cheesecloth-lined colander.",
                "Gather the cheesecloth around the curds and tie it with a string.",
                "Gently squeeze to remove some liquid from the cheese.",
                "Hang the tied cheesecloth over a sink or bowl for 20 to 30 minutes to drain more liquid.",
                "Remove the ricotta from the cheesecloth and spoon it into a container.",
                "Stir in the salt.",
                "Serve immediately, preferably without refrigerating."
            ],
            "pure_ingredients": [
                "milk",
                "buttermilk",
                "salt"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "15 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "colander",
                "cheesecloth",
                "clothespins",
                "bowl",
                "large saucepan",
                "thermometer",
                "slotted spoon",
                "string"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "uJ1rCYZMqvbn.oBGJuILbr2FYPs6dFu",
        "recipe_title": "Creole Crab Burgers ",
        "original_instructions": "Stir together crabmeat, mayonnaise, scallions, egg, Worcestershire sauce, mustard, cayenne, 1/4 teaspoon salt, and 3/4 cup bread crumbs in a bowl until just combined. Form into 4 (1-inch-thick) patties (3 1/2 inches in diameter; patties will be soft but will firm up when fried). Spread remaining cup bread crumbs on a plate, then dredge patties in crumbs, knocking off excess, and transfer to a platter. Heat oil in a 12-inch heavy skillet over medium heat until it shimmers, then fry patties, turning over once, until golden, 5 to 6 minutes total. Transfer to paper towels to drain. Assemble burgers with buns and accompaniments.\nStir together crabmeat, mayonnaise, scallions, egg, Worcestershire sauce, mustard, cayenne, 1/4 teaspoon salt, and 3/4 cup bread crumbs in a bowl until just combined. Form into 4 (1-inch-thick) patties (3 1/2 inches in diameter; patties will be soft but will firm up when fried). Spread remaining cup bread crumbs on a plate, then dredge patties in crumbs, knocking off excess, and transfer to a platter.\nHeat oil in a 12-inch heavy skillet over medium heat until it shimmers, then fry patties, turning over once, until golden, 5 to 6 minutes total. Transfer to paper towels to drain.\nAssemble burgers with buns and accompaniments.",
        "ingredients": [
            "1 pound lump crabmeat, picked over",
            "1/4 cup mayonnaise",
            "3 scallions, thinly sliced",
            "1 large egg, lightly beaten",
            "1 teaspoon Worcestershire sauce",
            "3/4 teaspoon dry mustard",
            "1/2 teaspoon cayenne",
            "1 3/4 cups fine dry bread crumbs, divided",
            "3/4 cup vegetable oil",
            "4 kaiser rolls or hamburger buns, split and toasted",
            "Accompaniments: tartar sauce; iceberg lettuce"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Combine crabmeat, mayonnaise, scallions, egg, Worcestershire sauce, mustard, cayenne, salt, and 3/4 cup bread crumbs in a bowl.",
                "Form the mixture into 4 patties, each 1 inch thick and 3 1/2 inches in diameter.",
                "Spread the remaining bread crumbs on a plate.",
                "Dredge the patties in the bread crumbs, knocking off excess, and transfer to a platter.",
                "Heat oil in a 12-inch heavy skillet over medium heat until it shimmers.",
                "Fry the patties until golden, turning them over once, about 5 to 6 minutes total.",
                "Transfer the fried patties to paper towels to drain.",
                "Assemble the crab cakes into burgers with buns and accompaniments like iceberg lettuce and tartar sauce."
            ],
            "pure_ingredients": [
                "crabmeat",
                "mayonnaise",
                "scallions",
                "egg",
                "Worcestershire sauce",
                "mustard",
                "cayenne",
                "salt",
                "bread crumbs",
                "oil",
                "buns",
                "lettuce",
                "tartar sauce"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "6 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "bowl",
                "plate",
                "platter",
                "12-inch heavy skillet",
                "paper towels"
            ],
            "dietary_labels": [
                "pescatarian"
            ]
        }
    },
    {
        "recipe_id": "i/m.viYsrM5yhccuoPZDxIfftqjOKv2",
        "recipe_title": "Monkfish \"Lobster\" Rolls",
        "original_instructions": "Season the monkfish with 1/2 teaspoon celery salt, 1/4 teaspoon kosher salt and a few grinds of pepper. Melt the butter in a large nonstick skillet over medium-high heat. Add the monkfish and cook until golden brown and cooked through, 4 to 6 minutes per side. Transfer the monkfish to a cutting board and cut into 1-inch pieces. Let cool.\nMeanwhile, whisk the mayonnaise, the remaining 1 teaspoon celery salt, the lemon zest and juice, celery leaves and a few grinds of pepper in a medium bowl. Refrigerate until ready to serve.\nToast the rolls and line the insides with lettuce. Add the monkfish, chopped celery and chives to the bowl with the mayonnaise mixture; gently toss. Divide the monkfish salad among the rolls. Serve with pickles and the potato chips.\nMost monkfish fillets are sold skinless with the membrane removed. If your fillets have a membrane, remove before seasoning.\nPhotograph by Ryan Dausch",
        "ingredients": [
            "1 1/2 pounds monkfish fillets",
            "1 1/2 teaspoons celery salt",
            "Kosher salt and freshly ground pepper",
            "3 tablespoons unsalted butter",
            "1/3 cup mayonnaise",
            "Grated zest and juice of 1/2 lemon",
            "1 stalk celery, finely chopped, plus 1/4 cup chopped celery leaves",
            "4 split-top hot dog rolls",
            "Bibb lettuce leaves, for serving",
            "3 tablespoons chopped fresh chives",
            "Dill pickle spears, for serving",
            "4 cups barbecue potato chips"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Season the monkfish with 1/2 teaspoon celery salt, 1/4 teaspoon salt, and a few grinds of pepper.",
                "Melt the butter in a large nonstick skillet over medium-high heat.",
                "Add the monkfish and cook until golden brown and cooked through, about 4 to 6 minutes per side.",
                "Transfer the monkfish to a cutting board and cut into 1-inch pieces. Let cool.",
                "Meanwhile, whisk the mayonnaise, the remaining 1 teaspoon celery salt, the lemon zest and juice, celery leaves, and a few grinds of pepper in a medium bowl.",
                "Refrigerate the mayonnaise mixture until ready to serve.",
                "Toast the rolls and line the insides with lettuce.",
                "Add the monkfish, chopped celery, and chives to the bowl with the mayonnaise mixture; gently toss.",
                "Divide the monkfish salad among the rolls.",
                "Serve with pickles and the potato chips."
            ],
            "pure_ingredients": [
                "monkfish",
                "celery salt",
                "salt",
                "pepper",
                "butter",
                "mayonnaise",
                "lemon",
                "celery",
                "celery leaves",
                "hot dog rolls",
                "lettuce",
                "chives",
                "pickles",
                "potato chips"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "12 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "nonstick skillet",
                "cutting board",
                "whisk",
                "medium bowl",
                "knife",
                "toaster"
            ],
            "dietary_labels": [
                "gluten-containing",
                "contains-dairy"
            ]
        }
    },
    {
        "recipe_id": "pdlZ48Rqs6mfRpbRSs5GHdtglhX1L7O",
        "recipe_title": "Classic Mayonnaise ",
        "original_instructions": "Whisk together yolk, mustard, and 1/4 teaspoon salt until combined well. Add about 1/4 cup oil drop by drop, whisking constantly until mixture begins to thicken. Whisk in vinegar and lemon juice, then add remaining 1/2 cup oil in a very slow, thin stream, whisking constantly until well blended. If at any time it appears that oil is not being incorporated, stop adding oil and whisk mixture vigorously until smooth, then continue adding oil. Whisk in salt to taste and white pepper. Chill, surface covered with plastic wrap, until ready to use.\nWhisk together yolk, mustard, and 1/4 teaspoon salt until combined well. Add about 1/4 cup oil drop by drop, whisking constantly until mixture begins to thicken. Whisk in vinegar and lemon juice, then add remaining 1/2 cup oil in a very slow, thin stream, whisking constantly until well blended. If at any time it appears that oil is not being incorporated, stop adding oil and whisk mixture vigorously until smooth, then continue adding oil. Whisk in salt to taste and white pepper. Chill, surface covered with plastic wrap, until ready to use.",
        "ingredients": [
            "1 large egg yolk, at room temperature 30 minutes",
            "1/2 teaspoon Dijon mustard",
            "3/4 cup olive or vegetable oil (or a combination), divided",
            "1 teaspoon white-wine vinegar or cider vinegar",
            "1 1/2 teaspoons fresh lemon juice",
            "1/4 teaspoon white pepper"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Whisk together yolk, mustard, and 1/4 teaspoon salt until combined well.",
                "Add about 1/4 cup oil drop by drop, whisking constantly until mixture begins to thicken.",
                "Whisk in vinegar and lemon juice.",
                "Add remaining 1/2 cup oil in a very slow, thin stream, whisking constantly until well blended.",
                "If oil is not being incorporated, stop adding oil and whisk mixture vigorously until smooth, then continue adding oil.",
                "Whisk in salt to taste and white pepper.",
                "Chill, surface covered with plastic wrap, until ready to use."
            ],
            "pure_ingredients": [
                "egg",
                "mustard",
                "oil",
                "vinegar",
                "lemon juice",
                "salt",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "0 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "whisk",
                "bowl",
                "measuring spoon",
                "plastic wrap"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "X4q5Fn83YCY3Rs8DpmWqTDvEVYPPCM2",
        "recipe_title": "Quinoa Stuffing ",
        "original_instructions": "Preheat the oven to 350°F. Combine the stock and 1 cup water in a medium saucepan and bring to a boil over high heat. Stir in the quinoa and bring back to a boil. Reduce the heat to low, cover, and simmer for 12 minutes, or until the quinoa has absorbed all the liquid. Meanwhile, melt the butter in large skillet over medium heat. Stir in the onion and celery and cook, stirring occasionally, until translucent, about 10 minutes. Remove the onion mixture from the heat and add the quinoa to the pan. Stir in the sage and salt and pepper and mix thoroughly. Transfer the stuffing to an 8-inch square pan and bake for 30 minutes. Garnish with parsley before serving.\nPreheat the oven to 350°F.\nCombine the stock and 1 cup water in a medium saucepan and bring to a boil over high heat. Stir in the quinoa and bring back to a boil. Reduce the heat to low, cover, and simmer for 12 minutes, or until the quinoa has absorbed all the liquid.\nMeanwhile, melt the butter in large skillet over medium heat. Stir in the onion and celery and cook, stirring occasionally, until translucent, about 10 minutes.\nRemove the onion mixture from the heat and add the quinoa to the pan. Stir in the sage and salt and pepper and mix thoroughly. Transfer the stuffing to an 8-inch square pan and bake for 30 minutes.\nGarnish with parsley before serving.",
        "ingredients": [
            "1 cup vegetable stock",
            "1 cup quinoa",
            "2 ounces (1/2 stick) unsalted butter or nonhydrogenated margarine",
            "1 onion, chopped",
            "6 stalks celery, diced",
            "1 tablespoon fresh sage",
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "2 tablespoons chopped fresh flat-leaf parsley"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat the oven to 350°F.",
                "Combine the vegetable stock and 1 cup of water in a medium saucepan and bring to a boil over high heat.",
                "Stir in the quinoa and bring the mixture back to a boil.",
                "Reduce the heat to low, cover, and simmer for 12 minutes or until the quinoa has absorbed all the liquid.",
                "Meanwhile, melt the butter in a large skillet over medium heat.",
                "Stir in the chopped onion and diced celery.",
                "Cook, stirring occasionally, until the onion and celery are translucent, about 10 minutes.",
                "Remove the skillet from the heat and add the quinoa to the pan.",
                "Stir in the sage, salt, and black pepper, mixing thoroughly.",
                "Transfer the stuffing mixture to an 8-inch square pan.",
                "Bake in the preheated oven for 30 minutes.",
                "Garnish with chopped parsley before serving."
            ],
            "pure_ingredients": [
                "vegetable stock",
                "water",
                "quinoa",
                "butter",
                "onion",
                "celery",
                "sage",
                "salt",
                "black pepper",
                "parsley"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "42 minutes",
                "plating": "2 minutes"
            },
            "required_tools": [
                "oven",
                "medium saucepan",
                "large skillet",
                "8-inch square pan",
                "spoon"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "jzIH6HKoGz5YjBUeTzfYOqApiZQ861G",
        "recipe_title": "Sausage, Dried Cranberry and Apple Stuffing",
        "original_instructions": "Watch how to make this recipe.\nPreheat the oven to 375 degrees F.\nSaute the sausage in a large heavy skillet over medium-high heat until cooked through, crumbling coarsely with the back of a spoon, about 10 minutes. Using a slotted spoon, transfer the sausage and drippings to a large bowl. Melt the butter in the same skillet over medium-high heat. Add the leeks, apples, celery and poultry seasoning to the skillet and saute until the leeks are soft, about 8 minutes. Mix in the drained cranberries, sage and rosemary. Add the mixture to the sausage, then mix in the croutons and parsley. Next add the chicken stock a little at a time until the stuffing is very moist. Be sure not to overdo it; it shouldn't be mushy. Season with salt and pepper. Place in a casserole dish. (The stuffing can be made to this point 2 days before Thanksgiving, refrigerated.)\nBake in a 14-inch oval or 9 by 13-inch rectangular casserole dish and place, uncovered, in the oven for 20 to 30 minutes, until the top is crispy and the center piping hot. Remove and serve immediately.",
        "ingredients": [
            "1 pound mild bulk breakfast sausage",
            "4 tablespoons butter",
            "3 cups sliced leeks, white and pale-green parts only, cleaned well (about 2 large leeks)",
            "2 Granny Smith apples, cored and chopped",
            "1 cup chopped celery with leaves",
            "1 tablespoon poultry seasoning",
            "1 cup dried cranberries, rehydrated in boiling water for 15 minutes and drained",
            "1 tablespoon chopped fresh sage leaves",
            "2 teaspoons chopped fresh rosemary",
            "6 cups boxed bread cubes (croutons)",
            "1/3 cup chopped fresh parsley leaves",
            "2 to 3 cups chicken stock",
            "1 tablespoon salt",
            "2 teaspoons ground black pepper"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat the oven to 375 degrees F.",
                "Saute the sausage in a large heavy skillet over medium-high heat until cooked through, crumbling it with a spoon, about 10 minutes.",
                "Using a slotted spoon, transfer the sausage and drippings to a large bowl.",
                "Melt the butter in the same skillet over medium-high heat.",
                "Add the leeks, apples, celery, and poultry seasoning to the skillet and saute until the leeks are soft, about 8 minutes.",
                "Mix in the drained cranberries, sage, and rosemary.",
                "Add the vegetable mixture to the sausage bowl, then mix in the croutons and parsley.",
                "Incrementally add chicken stock to the mixture until the stuffing is very moist but not mushy.",
                "Season with salt and pepper.",
                "Transfer the stuffing to a casserole dish.",
                "Bake, uncovered, in the oven for 20 to 30 minutes, until the top is crispy and the center is piping hot.",
                "Remove from oven and serve immediately."
            ],
            "pure_ingredients": [
                "sausage",
                "butter",
                "leeks",
                "apples",
                "celery",
                "poultry seasoning",
                "cranberries",
                "sage",
                "rosemary",
                "bread",
                "parsley",
                "chicken stock",
                "salt",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "30 minutes",
                "cooking": "30 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "oven",
                "skillet",
                "spoon",
                "slotted spoon",
                "bowl",
                "casserole dish"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "ypFZ1ujPgiNVJ6Dr6476i5tg2NGeWNu",
        "recipe_title": "Irish Coffee Meringues ",
        "original_instructions": "For meringues: Preheat oven to 250°F. Line 2 heavy baking sheets with parchment paper. Stir 3 tablespoons sugar, 1 tablespoon brown sugar and 1 teaspoon instant espresso powder in small bowl to blend well. Using hand-held electric mixer, beat egg whites in medium bowl until medium-stiff peaks form. Add remaining 4 tablespoons sugar and 2 tablespoons dark brown sugar to egg whites by tablespoonfuls and beat until stiff peaks form. Fold coffee-sugar mixture into meringue. Drop meringue by rounded tablespoonfuls onto prepared baking sheets, spacing evenly. Using knife, gently spread meringues 2 1/2- to 3-inch rounds. Bake until meringues are dry and can be easily be lifted from parchment, about 45 minutes. Transfer meringues to racks and cool completely. (Can be prepared 2 days ahead. Store in airtight containers at room temperature.)\nPreheat oven to 250°F. Line 2 heavy baking sheets with parchment paper. Stir 3 tablespoons sugar, 1 tablespoon brown sugar and 1 teaspoon instant espresso powder in small bowl to blend well. Using hand-held electric mixer, beat egg whites in medium bowl until medium-stiff peaks form. Add remaining 4 tablespoons sugar and 2 tablespoons dark brown sugar to egg whites by tablespoonfuls and beat until stiff peaks form. Fold coffee-sugar mixture into meringue.\nDrop meringue by rounded tablespoonfuls onto prepared baking sheets, spacing evenly. Using knife, gently spread meringues 2 1/2- to 3-inch rounds. Bake until meringues are dry and can be easily be lifted from parchment, about 45 minutes. Transfer meringues to racks and cool completely. (Can be prepared 2 days ahead. Store in airtight containers at room temperature.)\nFor filling: Beat 1 cup whipping cream in medium bowl to medium-firm peaks. Add sugar, Irish whiskey and instant espresso powder and beat until firm peaks form. Place 1 meringue on plate, flat side down. Spoon 1 generous tablespoon of espresso cream filling over. Top with another meringue, flat side down, and press gently until filling spreads to edge. Repeat with remaining meringues and filling. (Can be prepared 1 hour ahead. Cover with plastic wrap and refrigerate.) Beat remaining 1/4 cup whipping cream in small bowl until firm peaks form. Spoon small dollop of cream atop each meringue. Garnish each with chocolate-covered coffee beans, if desired.\nBeat 1 cup whipping cream in medium bowl to medium-firm peaks. Add sugar, Irish whiskey and instant espresso powder and beat until firm peaks form.\nPlace 1 meringue on plate, flat side down. Spoon 1 generous tablespoon of espresso cream filling over. Top with another meringue, flat side down, and press gently until filling spreads to edge. Repeat with remaining meringues and filling. (Can be prepared 1 hour ahead. Cover with plastic wrap and refrigerate.)\nBeat remaining 1/4 cup whipping cream in small bowl until firm peaks form. Spoon small dollop of cream atop each meringue. Garnish each with chocolate-covered coffee beans, if desired.",
        "ingredients": [
            "7 tablespoons sugar",
            "3 tablespoons (packed) dark brown sugar",
            "1 teaspoon instant espresso powder or instant coffee powder",
            "2 large egg whites",
            "1 1/4 cups chilled whipping cream",
            "2 tablespoons sugar",
            "2 tablespoons Irish whiskey",
            "2 teaspoons instant espresso powder or instant coffee powder",
            "Chocolate-covered coffee beans (optional)"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat oven to 250°F.",
                "Line 2 heavy baking sheets with parchment paper.",
                "Stir 3 tablespoons sugar, 1 tablespoon brown sugar and 1 teaspoon instant espresso powder in a small bowl to blend well.",
                "Using a hand-held electric mixer, beat egg whites in a medium bowl until medium-stiff peaks form.",
                "Add remaining 4 tablespoons sugar and 2 tablespoons dark brown sugar to the egg whites by tablespoonfuls and beat until stiff peaks form.",
                "Fold the coffee-sugar mixture into the meringue.",
                "Drop meringue by rounded tablespoonfuls onto prepared baking sheets, spacing evenly.",
                "Using a knife, gently spread meringues into 2 1/2- to 3-inch rounds.",
                "Bake until meringues are dry and can be easily lifted from parchment, about 45 minutes.",
                "Transfer meringues to racks and cool completely.",
                "Beat 1 cup whipping cream in a medium bowl to medium-firm peaks.",
                "Add sugar, Irish whiskey and instant espresso powder, and beat until firm peaks form.",
                "Place 1 meringue on a plate, flat side down.",
                "Spoon 1 generous tablespoon of espresso cream filling over.",
                "Top with another meringue, flat side down, and press gently until filling spreads to edge.",
                "Repeat with remaining meringues and filling.",
                "Beat remaining 1/4 cup whipping cream in a small bowl until firm peaks form.",
                "Spoon a small dollop of cream atop each meringue.",
                "Garnish each with chocolate-covered coffee beans, if desired."
            ],
            "pure_ingredients": [
                "sugar",
                "brown sugar",
                "espresso powder",
                "egg whites",
                "whipping cream",
                "Irish whiskey",
                "chocolate",
                "coffee beans"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "45 minutes",
                "plating": "10 minutes"
            },
            "required_tools": [
                "oven",
                "baking sheets",
                "parchment paper",
                "small bowl",
                "hand-held electric mixer",
                "medium bowl",
                "knife",
                "rack",
                "plate"
            ],
            "dietary_labels": [
                "gluten-free",
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "7FhtgSZDiV3TWwar8G/SRvlIw2aOp2a",
        "recipe_title": "Caraway Parsley Potatoes ",
        "original_instructions": "Peel potatoes and in a 3- to 4-quart saucepan cover with salted cold water by 2 inches. Simmer potatoes until just tender, 12 to 15 minutes, and drain in a colander. While potatoes are cooking, in a small heavy skillet dry-roast seeds over moderate heat, shaking skillet, until fragrant and slightly darker, being careful not to burn them, 3 to 4 minutes. Transfer seeds to a small bowl and cool. With mortar and pestle or in an electric coffee/spice grinder grind seeds coarse. In a heavy skillet melt butter over moderately low heat and add potatoes, stirring and shaking skillet to coat. Sprinkle potatoes with ground seeds, parsley, and salt and pepper to taste and stir, shaking skillet occasionally, to coat.\nPeel potatoes and in a 3- to 4-quart saucepan cover with salted cold water by 2 inches. Simmer potatoes until just tender, 12 to 15 minutes, and drain in a colander.\nWhile potatoes are cooking, in a small heavy skillet dry-roast seeds over moderate heat, shaking skillet, until fragrant and slightly darker, being careful not to burn them, 3 to 4 minutes. Transfer seeds to a small bowl and cool. With mortar and pestle or in an electric coffee/spice grinder grind seeds coarse.\nIn a heavy skillet melt butter over moderately low heat and add potatoes, stirring and shaking skillet to coat. Sprinkle potatoes with ground seeds, parsley, and salt and pepper to taste and stir, shaking skillet occasionally, to coat.",
        "ingredients": [
            "2 1/2 pounds small red potatoes (about twenty-four, 1 1/2-inches in diameter)",
            "1 tablespoon caraway seeds",
            "1 1/2 tablespoons unsalted butter",
            "2 tablespoons minced fresh parsley leaves"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Peel the potatoes.",
                "Place the potatoes in a 3- to 4-quart saucepan and cover them with salted cold water by 2 inches.",
                "Simmer the potatoes until just tender, about 12 to 15 minutes.",
                "Drain the potatoes in a colander.",
                "While the potatoes are cooking, in a small heavy skillet, dry-roast the caraway seeds over moderate heat, shaking the skillet until fragrant and slightly darker, about 3 to 4 minutes.",
                "Transfer the seeds to a small bowl and allow them to cool.",
                "Using a mortar and pestle or electric coffee/spice grinder, grind the seeds coarse.",
                "In a heavy skillet, melt the butter over moderately low heat.",
                "Add the drained potatoes to the skillet, stirring and shaking the skillet to coat the potatoes in butter.",
                "Sprinkle the potatoes with the ground seeds, minced parsley, and salt and pepper to taste.",
                "Stir and shake the skillet occasionally to coat the potatoes evenly."
            ],
            "pure_ingredients": [
                "potatoes",
                "caraway seeds",
                "butter",
                "parsley",
                "salt",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "15 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "saucepan",
                "colander",
                "small heavy skillet",
                "mortar and pestle or spice grinder",
                "heavy skillet"
            ],
            "dietary_labels": [
                "vegetarian",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "0MiL.hZcapJB42/K2uvyDc6OXg.5gkC",
        "recipe_title": "Cumin-Scented Beef Kebabs ",
        "original_instructions": "Stir together oil, oregano, garlic, spices, and 1 teaspoon salt in a bowl, then toss with beef. Marinate, chilled, at least 2 hours. Prepare grill for direct-heat cooking over medium-hot charcoal (high heat for gas); see Grilling Procedure . Thread about 4 pieces of beef onto each skewer, leaving small spaces between pieces, then transfer to a tray. Oil grill rack, then grill beef, covered only if using a gas grill, turning, until browned but still pink inside, 4 to 5 minutes.\nStir together oil, oregano, garlic, spices, and 1 teaspoon salt in a bowl, then toss with beef. Marinate, chilled, at least 2 hours.\nPrepare grill for direct-heat cooking over medium-hot charcoal (high heat for gas); see Grilling Procedure . Thread about 4 pieces of beef onto each skewer, leaving small spaces between pieces, then transfer to a tray.\nOil grill rack, then grill beef, covered only if using a gas grill, turning, until browned but still pink inside, 4 to 5 minutes.",
        "ingredients": [
            "1/4 cup olive oil",
            "2 tablespoons finely chopped oregano",
            "2 garlic cloves, minced",
            "2 teaspoons ground cumin",
            "1 teaspoon ground coriander",
            "1/4 teaspoon cayenne",
            "2 pounds sirloin flap steak or flatiron steak, cut into 1 1/2-inch pieces",
            "Equipment: 12 (12-inch) skewers, soaked in water 30 minutes if wooden",
            "Accompaniment: roasted red pepper and walnut spread"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Mix olive oil, oregano, garlic, cumin, coriander, cayenne, and salt together in a bowl.",
                "Add beef pieces to the bowl and toss to coat evenly with the marinade.",
                "Cover and chill the marinated beef for at least 2 hours.",
                "Prepare the grill for direct-heat cooking over medium-hot charcoal or high heat if using a gas grill.",
                "Thread about 4 pieces of marinated beef onto each skewer, leaving small spaces between the pieces.",
                "Transfer the skewers to a tray and ensure the grill rack is oiled.",
                "Place the skewers on the grill, covering only if using a gas grill, and cook by turning them until they are browned but still pink inside, approximately 4 to 5 minutes."
            ],
            "pure_ingredients": [
                "olive oil",
                "oregano",
                "garlic",
                "cumin",
                "coriander",
                "cayenne",
                "salt",
                "beef"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "5 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "bowl",
                "grill",
                "skewers",
                "tray"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "dJGg.RUj362zfeYXdERHaBdvBhXihYW",
        "recipe_title": "Pastry Cream ",
        "original_instructions": "In a medium saucepan, scald the milk over medium-high heat (bubbles start to form around the edge of the pan, but the milk is not boiling). While the milk is heating, in a small bowl, stir together the sugar, flour, and salt. (Mixing the flour with the sugar will prevent the flour from clumping when you add it to the egg yolks.) In a medium bowl, whisk the egg yolks until blended, then slowly whisk in the flour mixture. The mixture will be thick and pasty. Remove the milk from the heat and slowly add it to the egg-flour mixture, a little at a time, whisking constantly. When all of the milk has been incorporated, return the contents of the bowl to the saucepan and place over medium heat. Whisk continuously and vigorously for about 3 minutes, or until the mixture thickens and comes to a boil. At first, the mixture will be very frothy and liquid; as it cooks longer, it will slowly start to thicken until the frothy bubbles disappear and it becomes more viscous. Once it thickens, stop whisking every few seconds to see if the mixture has come to a boil. If it has not, keep whisking vigorously. As soon as you see it bubbling, immediately go back to whisking for just 10 seconds, and then remove the pan from the heat. Boiling the mixture will thicken it and cook out the flour taste, but if you let it boil for longer than 10 seconds, the mixture can become grainy. Pour the mixture through a fine-mesh sieve into a small heatproof bowl. Stir in the vanilla, then cover with plastic wrap, placing it directly on the surface of the cream. This will prevent a skin from forming. Refrigerate for at least 4 hours, or until cold, or up to 3 days.\nIn a medium saucepan, scald the milk over medium-high heat (bubbles start to form around the edge of the pan, but the milk is not boiling). While the milk is heating, in a small bowl, stir together the sugar, flour, and salt. (Mixing the flour with the sugar will prevent the flour from clumping when you add it to the egg yolks.) In a medium bowl, whisk the egg yolks until blended, then slowly whisk in the flour mixture. The mixture will be thick and pasty.\nRemove the milk from the heat and slowly add it to the egg-flour mixture, a little at a time, whisking constantly. When all of the milk has been incorporated, return the contents of the bowl to the saucepan and place over medium heat. Whisk continuously and vigorously for about 3 minutes, or until the mixture thickens and comes to a boil. At first, the mixture will be very frothy and liquid; as it cooks longer, it will slowly start to thicken until the frothy bubbles disappear and it becomes more viscous. Once it thickens, stop whisking every few seconds to see if the mixture has come to a boil. If it has not, keep whisking vigorously. As soon as you see it bubbling, immediately go back to whisking for just 10 seconds, and then remove the pan from the heat. Boiling the mixture will thicken it and cook out the flour taste, but if you let it boil for longer than 10 seconds, the mixture can become grainy.\nPour the mixture through a fine-mesh sieve into a small heatproof bowl. Stir in the vanilla, then cover with plastic wrap, placing it directly on the surface of the cream. This will prevent a skin from forming. Refrigerate for at least 4 hours, or until cold, or up to 3 days.",
        "ingredients": [
            "1 1/4 cups (300 grams) milk",
            "1/2 cup (100 grams) sugar",
            "1/4 cup (30 grams) cake flour",
            "1/2 teaspoon kosher salt",
            "4 egg yolks",
            "1 teaspoon vanilla extract"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In a medium saucepan, scald the milk over medium-high heat until bubbles form around the edge, but do not let it boil.",
                "While the milk is heating, stir together the sugar, flour, and salt in a small bowl.",
                "In a medium bowl, whisk the egg yolks until blended.",
                "Slowly whisk the flour mixture into the egg yolks, creating a thick and pasty mixture.",
                "Remove the milk from heat and slowly add it to the egg-flour mixture, whisking constantly.",
                "Once all milk is incorporated, return the mixture to the saucepan and place over medium heat.",
                "Whisk continuously for about 3 minutes until the mixture thickens and begins to boil.",
                "Stop whisking every few seconds to check if the mixture is boiling. Once bubbling, whisk for 10 seconds then remove from heat.",
                "Pour the mixture through a fine-mesh sieve into a heatproof bowl.",
                "Stir in vanilla extract.",
                "Cover with plastic wrap directly on the surface and refrigerate for at least 4 hours or up to 3 days."
            ],
            "pure_ingredients": [
                "milk",
                "sugar",
                "flour",
                "salt",
                "egg yolks",
                "vanilla extract"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "10 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "medium saucepan",
                "small bowl",
                "medium bowl",
                "whisk",
                "fine-mesh sieve",
                "plastic wrap"
            ],
            "dietary_labels": [
                "vegetarian"
            ]
        }
    },
    {
        "recipe_id": "5zotA4wuE1MSitb0fV23SLQX.IzQZXi",
        "recipe_title": "Roasted Garlic Soup with Parmesan Cheese ",
        "original_instructions": "Preheat oven to 350°F. Place 26 garlic cloves in small glass baking dish. Add 2 tablespoons olive oil and sprinkle with salt and pepper; toss to coat. Cover baking dish tightly with foil and bake until garlic is golden brown and tender, about 45 minutes. Cool. Squeeze garlic between fingertips to release cloves. Transfer cloves to small bowl. Melt butter in heavy large saucepan over medium-high heat. Add onions and thyme and cook until onions are translucent, about 6 minutes. Add roasted garlic and 18 raw garlic cloves and cook 3 minutes. Add chicken stock; cover and simmer until garlic is very tender, about 20 minutes. Working in batches, purée soup in blender until smooth. Return soup to saucepan; add cream and bring to simmer. Season with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate. Rewarm over medium heat, stirring occasionally.) Divide grated cheese among 4 bowls and ladle soup over. Squeeze juice of 1 lemon wedge into each bowl and serve.\nPreheat oven to 350°F. Place 26 garlic cloves in small glass baking dish. Add 2 tablespoons olive oil and sprinkle with salt and pepper; toss to coat. Cover baking dish tightly with foil and bake until garlic is golden brown and tender, about 45 minutes. Cool. Squeeze garlic between fingertips to release cloves. Transfer cloves to small bowl.\nMelt butter in heavy large saucepan over medium-high heat. Add onions and thyme and cook until onions are translucent, about 6 minutes. Add roasted garlic and 18 raw garlic cloves and cook 3 minutes. Add chicken stock; cover and simmer until garlic is very tender, about 20 minutes. Working in batches, purée soup in blender until smooth. Return soup to saucepan; add cream and bring to simmer. Season with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate. Rewarm over medium heat, stirring occasionally.)\nDivide grated cheese among 4 bowls and ladle soup over. Squeeze juice of 1 lemon wedge into each bowl and serve.",
        "ingredients": [
            "26 garlic cloves (unpeeled)",
            "2 tablespoons olive oil",
            "2 tablespoons (1/4 stick) butter",
            "2 1/4 cups sliced onions",
            "1 1/2 teaspoons chopped fresh thyme",
            "18 garlic cloves, peeled",
            "3 1/2 cups chicken stock or canned low-salt chicken broth",
            "1/2 cup whipping cream",
            "1/2 cup finely grated Parmesan cheese (about 2 ounces)",
            "4 lemon wedges"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat oven to 350°F.",
                "Place 26 garlic cloves in a small glass baking dish.",
                "Add 2 tablespoons olive oil and sprinkle with salt and pepper; toss to coat.",
                "Cover baking dish tightly with foil and bake until garlic is golden brown and tender, about 45 minutes.",
                "Cool and squeeze garlic between fingertips to release cloves. Transfer cloves to a small bowl.",
                "Melt butter in a heavy large saucepan over medium-high heat.",
                "Add onions and thyme and cook until onions are translucent, about 6 minutes.",
                "Add roasted garlic and 18 raw garlic cloves and cook for 3 minutes.",
                "Add chicken stock; cover and simmer until garlic is very tender, about 20 minutes.",
                "Working in batches, purée soup in blender until smooth.",
                "Return soup to saucepan; add cream and bring to a simmer.",
                "Season with salt and pepper.",
                "Divide grated cheese among 4 bowls and ladle soup over.",
                "Squeeze juice of 1 lemon wedge into each bowl and serve."
            ],
            "pure_ingredients": [
                "garlic",
                "olive oil",
                "salt",
                "pepper",
                "butter",
                "onions",
                "thyme",
                "chicken stock",
                "cream",
                "cheese",
                "lemon"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "68 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "oven",
                "glass baking dish",
                "foil",
                "saucepan",
                "blender",
                "bowl"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "qLgOqOAzaXl2GyGDDI4vqJAVmrOfeni",
        "recipe_title": "Broiled Grapefruit with Vanilla Ginger Sugar ",
        "original_instructions": "Preheat broiler. In an electric coffee/spice grinder combine sugar, ginger, and vanilla and ground fine. Halve each grapefruit crosswise and run knife around each section to loosen membranes. Arrange grapefruits, cut sides up, in a flameproof baking dish or baking pan just large enough to hold them in one layer and sprinkle with sugar mixture. Broil grapefruits about 1 1/2 inches from heat until sugar melts and tops begin to brown, 10 to 15 minutes. Serve grapefruits at room temperature.\nPreheat broiler.\nIn an electric coffee/spice grinder combine sugar, ginger, and vanilla and ground fine.\nHalve each grapefruit crosswise and run knife around each section to loosen membranes. Arrange grapefruits, cut sides up, in a flameproof baking dish or baking pan just large enough to hold them in one layer and sprinkle with sugar mixture. Broil grapefruits about 1 1/2 inches from heat until sugar melts and tops begin to brown, 10 to 15 minutes.\nServe grapefruits at room temperature.",
        "ingredients": [
            "2/3 cup sugar",
            "3 tablespoons chopped crystallized ginger",
            "3/4 teaspoon vanilla extract",
            "6 large pink grapefruits"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat broiler.",
                "In an electric coffee/spice grinder, combine sugar, ginger, and vanilla and grind fine.",
                "Halve each grapefruit crosswise and run a knife around each section to loosen membranes.",
                "Arrange grapefruits, cut sides up, in a flameproof baking dish or baking pan just large enough to hold them in one layer.",
                "Sprinkle with sugar mixture.",
                "Broil grapefruits about 1 1/2 inches from heat until sugar melts and tops begin to brown, 10 to 15 minutes.",
                "Serve grapefruits at room temperature."
            ],
            "pure_ingredients": [
                "sugar",
                "ginger",
                "vanilla extract",
                "grapefruit"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "10 to 15 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "broiler",
                "electric coffee/spice grinder",
                "knife",
                "flameproof baking dish"
            ],
            "dietary_labels": [
                "vegan",
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "XFJeL1JBvGn1oheyv0Dd2Be9h4ts.Xu",
        "recipe_title": "3-Ingredient Thanksgiving Stuffing ",
        "original_instructions": "Preheat oven to 350°F. Oil a 3-qt. baking dish. Heat remaining 1 Tbsp. oil in a large skillet over high. Cook sausage, breaking up into pieces with the back of a spoon, until just beginning to brown, about 5 minutes. Add sliced celery and continue to cook, stirring often, until sausage is cooked through, 5–7 minutes. Transfer sausage mixture with drippings to a large bowl. Add bread and toss to combine. Add 2 cups water to hot skillet; heat over medium-high, scraping up brown bits with a spoon; season with salt and pepper. Pour over bread mixture, then toss to combine. Transfer to prepared baking dish and cover tightly with foil. Bake stuffing 40 minutes. Uncover and continue to bake until top is lightly browned and crisp, 20–25 minutes more. Top with celery leaves, if desired.\nPreheat oven to 350°F. Oil a 3-qt. baking dish. Heat remaining 1 Tbsp. oil in a large skillet over high. Cook sausage, breaking up into pieces with the back of a spoon, until just beginning to brown, about 5 minutes. Add sliced celery and continue to cook, stirring often, until sausage is cooked through, 5–7 minutes. Transfer sausage mixture with drippings to a large bowl. Add bread and toss to combine.\nAdd 2 cups water to hot skillet; heat over medium-high, scraping up brown bits with a spoon; season with salt and pepper. Pour over bread mixture, then toss to combine. Transfer to prepared baking dish and cover tightly with foil.\nBake stuffing 40 minutes. Uncover and continue to bake until top is lightly browned and crisp, 20–25 minutes more. Top with celery leaves, if desired.\nDo Ahead Stuffing can be made 4 hours ahead; store at room temperature and rewarm before serving.\nStuffing can be made 4 hours ahead; store at room temperature and rewarm before serving.",
        "ingredients": [
            "1 tablespoon olive oil, plus more for pan",
            "1 1/2 pounds sweet Italian sausage, casing removed",
            "3 large celery stalks, sliced crosswise into 1/4\" pieces (about 2 cups); plus whole leaves for serving (optional)",
            "2 (1-pound) loaves cranberry-nut bread, cut into 1\" cubes",
            "1 1/2 teaspoons kosher salt",
            "1 teaspoon freshly ground black pepper"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat oven to 350°F.",
                "Oil a 3-quart baking dish.",
                "Heat 1 tablespoon oil in a large skillet over high heat.",
                "Cook sausage, breaking it into pieces, until it begins to brown, about 5 minutes.",
                "Add sliced celery to the skillet and continue to cook, stirring often, until sausage is cooked through, 5 to 7 minutes.",
                "Transfer the sausage and celery mixture with drippings to a large bowl.",
                "Add bread cubes to the bowl and toss to combine.",
                "Add 2 cups water to the hot skillet and heat over medium-high, scraping up brown bits.",
                "Season water with salt and pepper.",
                "Pour the seasoned water over the bread and sausage mixture, then toss to combine.",
                "Transfer the mixture to the prepared baking dish and cover tightly with foil.",
                "Bake the stuffing for 40 minutes.",
                "Uncover and continue to bake until the top is lightly browned and crisp, 20 to 25 minutes more.",
                "Top with celery leaves if desired."
            ],
            "pure_ingredients": [
                "olive oil",
                "sausage",
                "celery",
                "bread",
                "water",
                "salt",
                "black pepper"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "65 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "oven",
                "baking dish",
                "skillet",
                "spoon",
                "aluminum foil",
                "bowl"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "A6F/cd6X.bMyScoSMS9PKhglknIdNGG",
        "recipe_title": "Lemon Cupcakes ",
        "original_instructions": "1. Preheat oven to 325°F. Line a 12-hole muffin tin with 12 paper cupcake cases. Prepare the cake batter according to the package directions. 2. Fill each cupcake case with batter up to just below the rim of the paper. Cover and refrigerate the remaining cake batter. Bake the cupcakes until a toothpick inserted into the center of a cupcake comes out clean, about 25 to 35 minutes. Remove and let cool in the tin for 10 minutes, then lift the cakes out of the tray and place on a cake rack to cool completely. 3. Repeat steps 1 and 2 with the remaining cake batter. 4. Meanwhile, using an electric mixer, beat the butter with 4 tablespoons of the lemon curd until smooth. Gradually add the sugar and continue beating until the mixture becomes a thick, creamy, spreadable frosting. Add more lemon curd to taste, if desired. If the frosting becomes too thick, gradually add the milk, beating between each addition, until the desired consistency is achieved. 5. Slice the top from each cupcake, cutting just above the rim of the paper case. Scoop out about 1 teaspoon of cake crumbs from the center of each cupcake and replace them with 11/2teaspoons of lemon curd. Place the top back on each cupcake, sticking it back together with the lemon curd. Spread the top of each cupcake with some frosting and dust with the colored sugars. Allow the frosting to set for at least 20 minutes before serving.\n1. Preheat oven to 325°F. Line a 12-hole muffin tin with 12 paper cupcake cases. Prepare the cake batter according to the package directions.\n2. Fill each cupcake case with batter up to just below the rim of the paper. Cover and refrigerate the remaining cake batter. Bake the cupcakes until a toothpick inserted into the center of a cupcake comes out clean, about 25 to 35 minutes. Remove and let cool in the tin for 10 minutes, then lift the cakes out of the tray and place on a cake rack to cool completely.\n3. Repeat steps 1 and 2 with the remaining cake batter.\n4. Meanwhile, using an electric mixer, beat the butter with 4 tablespoons of the lemon curd until smooth. Gradually add the sugar and continue beating until the mixture becomes a thick, creamy, spreadable frosting. Add more lemon curd to taste, if desired. If the frosting becomes too thick, gradually add the milk, beating between each addition, until the desired consistency is achieved.\n5. Slice the top from each cupcake, cutting just above the rim of the paper case. Scoop out about 1 teaspoon of cake crumbs from the center of each cupcake and replace them with 11/2teaspoons of lemon curd. Place the top back on each cupcake, sticking it back together with the lemon curd. Spread the top of each cupcake with some frosting and dust with the colored sugars. Allow the frosting to set for at least 20 minutes before serving.",
        "ingredients": [
            "1 box of your favorite cake mix",
            "3 sticks unsalted butter, at room temperature",
            "25 ounces lemon curd",
            "1 pound confectioners' sugar, sifted",
            "1 to 2 tablespoons milk",
            "A selection of colored sugars"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Preheat oven to 325°F. Line a 12-hole muffin tin with 12 paper cupcake cases.",
                "Prepare the cake batter according to the package directions.",
                "Fill each cupcake case with batter up to just below the rim of the paper.",
                "Cover and refrigerate the remaining cake batter.",
                "Bake the cupcakes until a toothpick inserted into the center of a cupcake comes out clean, about 25 to 35 minutes.",
                "Remove and let cool in the tin for 10 minutes, then lift the cakes out of the tray and place on a cake rack to cool completely.",
                "Repeat baking with remaining cake batter.",
                "Using an electric mixer, beat the butter with 4 tablespoons of lemon curd until smooth.",
                "Gradually add the sugar and continue beating until the mixture becomes a thick, creamy, spreadable frosting.",
                "Add more lemon curd to taste, if desired.",
                "If the frosting becomes too thick, gradually add the milk, beating between each addition, until the desired consistency is achieved.",
                "Slice the top from each cupcake, cutting just above the rim of the paper case.",
                "Scoop out about 1 teaspoon of cake crumbs from the center of each cupcake and replace them with 1 and 1/2 teaspoons of lemon curd.",
                "Place the top back on each cupcake, sticking it back together with the lemon curd.",
                "Spread the top of each cupcake with some frosting.",
                "Dust with the colored sugars.",
                "Allow the frosting to set for at least 20 minutes before serving."
            ],
            "pure_ingredients": [
                "cake mix",
                "butter",
                "lemon curd",
                "confectioners' sugar",
                "milk",
                "sugars"
            ],
            "cooking_time": {
                "preparation": "30 minutes",
                "cooking": "50 to 70 minutes",
                "plating": "20 minutes"
            },
            "required_tools": [
                "oven",
                "muffin tin",
                "paper cupcake cases",
                "electric mixer",
                "toothpick",
                "cake rack"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "Ra9ZSF54s5sAK/a2rotxgrF7/Nhza8a",
        "recipe_title": "Red Bell Pepper and Coriander Pancakes with Smoked Salmon ",
        "original_instructions": "Make pancakes: In a bowl stir together all pancake ingredients except egg whites and season batter with salt and pepper. In another bowl with an electric mixer beat egg whites until they just hold stiff peaks and gently fold into batter. Heat a non-stick skillet over moderate heat and brush with some melted butter. Working in batches, drop tablespoonfuls of batter into skillet to form pancakes 1 1/4 inches in diameter. Cook pancakes until bubbles appear on surface and undersides are golden, about 1 minute. Turn pancakes and cook until undersides are golden. Transfer pancakes to a rack and cool.\nIn a bowl stir together all pancake ingredients except egg whites and season batter with salt and pepper. In another bowl with an electric mixer beat egg whites until they just hold stiff peaks and gently fold into batter.\nHeat a non-stick skillet over moderate heat and brush with some melted butter. Working in batches, drop tablespoonfuls of batter into skillet to form pancakes 1 1/4 inches in diameter. Cook pancakes until bubbles appear on surface and undersides are golden, about 1 minute. Turn pancakes and cook until undersides are golden. Transfer pancakes to a rack and cool.\nSpoon about 1/2 teaspoon sour cream onto center of each pancake and top with a twisted smoked salmon strip and a coriander leaf.\nSpoon about 1/2 teaspoon sour cream onto center of each pancake and top with a twisted smoked salmon strip and a coriander leaf.",
        "ingredients": [
            "2/3 cup all-purpose flour",
            "1/4 cup cornmeal",
            "1/2 teaspoon dried hot red pepper flakes",
            "2/3 cup milk",
            "1/2 cup diced red bell pepper",
            "3 tablespoons chopped fresh coriander leaves (wash and dry before chopping)",
            "2 large eggs, separated",
            "1 tablespoon unsalted butter, melted",
            "1/2 cup sour cream",
            "5 ounces smoked salmon, cut into 46 strips",
            "about 46 fresh coriander leaves, washed and dried"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "In a bowl stir together all pancake ingredients except egg whites and season batter with salt and pepper.",
                "In another bowl with an electric mixer beat egg whites until they just hold stiff peaks and gently fold into batter.",
                "Heat a non-stick skillet over moderate heat and brush with some melted butter.",
                "Working in batches, drop tablespoonfuls of batter into skillet to form pancakes 1 1/4 inches in diameter.",
                "Cook pancakes until bubbles appear on surface and undersides are golden, about 1 minute.",
                "Turn pancakes and cook until undersides are golden.",
                "Transfer pancakes to a rack and cool.",
                "Spoon about 1/2 teaspoon sour cream onto center of each pancake.",
                "Top with a twisted smoked salmon strip and a coriander leaf."
            ],
            "pure_ingredients": [
                "flour",
                "cornmeal",
                "pepper flakes",
                "milk",
                "bell pepper",
                "coriander",
                "eggs",
                "butter",
                "salt",
                "pepper",
                "sour cream",
                "salmon"
            ],
            "cooking_time": {
                "preparation": "15 minutes",
                "cooking": "6 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "bowl",
                "electric mixer",
                "non-stick skillet",
                "brush",
                "rack",
                "spoon"
            ],
            "dietary_labels": [
                "contains dairy",
                "contains eggs",
                "contains fish"
            ]
        }
    },
    {
        "recipe_id": "1opMj6YEWBDwqGUfqbR/EC14Rsla3/y",
        "recipe_title": "Rump Steaks Braised with Mushrooms and Onions and Porter Sauce",
        "original_instructions": "Season the steaks on both sides with salt and pepper. Heat 1/8 cup of the canola oil in a large saute pan over medium-high heat. Dredge the steaks in flour, and shake to remove excess. Sear the steaks on both sides, remove from pan, and set aside on a utility platter. Add the other 1/8 cup of canola oil to the same pan and saute the onions and mushrooms until the onions become translucent, about 3 to 5 minutes. Add the chicken or beef broth, porter beer, molasses, thyme, hot sauce and bay leaves to the onion/mushroom mixture. Reduce the heat to low and return the steaks to the pan. Simmer covered for at least 2 hours. Rump steaks are a tough meat and will require slow cooking (braising). You may wish transfer the ingredients to a crock-pot for this process. When the steaks are fork tender, remove them to a platter in a warm place. The liquid in the pan should have evaporated to a large degree, intensifying the flavor. If necessary, increase the heat to reduce and thicken into a sauce. Whisk in the butter and creme fraiche or sour cream to finish the sauce, and spoon sauce over the steaks. Garnish with the fresh chopped chives.",
        "ingredients": [
            "Six 8-ounce rump steaks",
            "Salt",
            "Freshly ground black pepper",
            "1 cup all-purpose flour",
            "1/4 cup grapeseed oil",
            "2 large onions, sliced",
            "3 cups mushrooms, cleaned and sliced (your choice of type of mushrooms)",
            "4 cups chicken broth or beef broth",
            "8 ounces porter (dark beer)",
            "2 teaspoons dark molasses",
            "1 teaspoon fresh chopped thyme leaves",
            "3 teaspoons hot sauce (recommended: Tabasco)",
            "2 bay leaves",
            "1/4 cup (1/2 stick) butter, cut into cubes",
            "5 ounces creme fraiche or sour cream",
            "1/4 cup chopped fresh chives"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Season the steaks on both sides with salt and pepper.",
                "Heat 1/8 cup of canola oil in a large saute pan over medium-high heat.",
                "Dredge the steaks in flour, and shake to remove excess.",
                "Sear the steaks on both sides, remove from pan, and set aside on a utility platter.",
                "Add the other 1/8 cup of canola oil to the same pan.",
                "Saute the onions and mushrooms until the onions become translucent, about 3 to 5 minutes.",
                "Add the chicken broth, porter beer, molasses, thyme, hot sauce and bay leaves to the onion/mushroom mixture.",
                "Reduce the heat to low and return the steaks to the pan.",
                "Simmer covered for at least 2 hours.",
                "Remove the steaks to a platter in a warm place when they are fork tender.",
                "If necessary, increase the heat to reduce and thicken the liquid into a sauce.",
                "Whisk in the butter and creme fraiche to finish the sauce.",
                "Spoon sauce over the steaks.",
                "Garnish with the fresh chopped chives."
            ],
            "pure_ingredients": [
                "rump steak",
                "salt",
                "black pepper",
                "flour",
                "canola oil",
                "onion",
                "mushroom",
                "chicken broth",
                "porter",
                "molasses",
                "thyme",
                "hot sauce",
                "bay leaf",
                "butter",
                "creme fraiche",
                "chive"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "2 hours 10 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "large saute pan",
                "whisk",
                "utility platter",
                "crock-pot",
                "knife"
            ],
            "dietary_labels": []
        }
    },
    {
        "recipe_id": "gdnDE.yYi.bU3Nb92d.I6F33g2LVvuW",
        "recipe_title": "Cola-Braised Pork Stew ",
        "original_instructions": "Heat oil in large pot over high heat. Add half of pork; sauté until brown on all sides, about 8 minutes. Transfer pork to bowl. Repeat with remaining pork. Return pork to pot. Turn off heat and pour cola slowly into pot. Bring to boil. Reduce heat to medium-low, cover, and simmer 30 minutes. Add garlic, soy sauce, ginger, and half of green onions. Cover and simmer until pork is tender, about 50 minutes longer. Uncover and simmer until sauce is slightly thickened, about 10 minutes. Season stew with salt and pepper. Transfer to bowl; sprinkle with remaining green onions.\nHeat oil in large pot over high heat. Add half of pork; sauté until brown on all sides, about 8 minutes. Transfer pork to bowl. Repeat with remaining pork. Return pork to pot. Turn off heat and pour cola slowly into pot. Bring to boil. Reduce heat to medium-low, cover, and simmer 30 minutes. Add garlic, soy sauce, ginger, and half of green onions. Cover and simmer until pork is tender, about 50 minutes longer. Uncover and simmer until sauce is slightly thickened, about 10 minutes. Season stew with salt and pepper. Transfer to bowl; sprinkle with remaining green onions.",
        "ingredients": [
            "1 tablespoon vegetable oil",
            "2 pounds boneless country-style pork ribs, excess fat trimmed, cut into 1 1/2- to 2-inch cubes",
            "2 cups cola (do not use diet cola)",
            "6 garlic cloves, minced",
            "3 tablespoons soy sauce",
            "2 tablespoons chopped peeled fresh ginger",
            "1 bunch green onions, chopped"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Heat oil in a large pot over high heat.",
                "Add half of the pork and sauté until brown on all sides, about 8 minutes.",
                "Transfer the browned pork to a bowl.",
                "Repeat the browning process with the remaining pork.",
                "Return all the pork to the pot.",
                "Turn off the heat and pour the cola slowly into the pot.",
                "Bring the mixture to a boil.",
                "Reduce the heat to medium-low, cover, and simmer for 30 minutes.",
                "Add garlic, soy sauce, ginger, and half of the green onions.",
                "Cover and simmer until the pork is tender, about 50 minutes longer.",
                "Uncover and simmer until the sauce is slightly thickened, about 10 minutes.",
                "Season the stew with salt and pepper.",
                "Transfer the stew to a bowl and sprinkle with the remaining green onions."
            ],
            "pure_ingredients": [
                "vegetable oil",
                "pork",
                "cola",
                "garlic",
                "soy sauce",
                "ginger",
                "green onions",
                "salt",
                "pepper"
            ],
            "cooking_time": {
                "preparation": "10 minutes",
                "cooking": "106 minutes",
                "plating": "4 minutes"
            },
            "required_tools": [
                "large pot",
                "bowl",
                "stove"
            ],
            "dietary_labels": [
                "gluten-free"
            ]
        }
    },
    {
        "recipe_id": "AZbyY/meWDDimUnLQGFDsEZqRry1g7e",
        "recipe_title": "Sausage Schnitzel with Quick Sauerkraut",
        "original_instructions": "Watch how to make this recipe.\nSauerkraut:\nAdd the oil to a large skillet over medium heat. Drop in the cabbage and saute for a few minutes until the greens have slightly wilted. Add the remaining ingredients to the pan and cook until the liquid has reduced by half and cabbage is tender but still has a slight crunch. Set aside.\nMustard:\nWhisk together all of the ingredients in a small bowl and set the sauce aside.\nSchnitzel:\nSet up a breading station using 3plates or pie dishes. To the first dish, add the flour. In the second dish, combine the eggs with the water and whisk them together. In the third dish, toss the bread crumbs with the paprika, garlic powder, onion powder and healthy pinches of salt and pepper, to taste.\nLightly dredged the sausages in the flour, then in the egg wash, and then coat them thoroughly in the bread crumb mixture. Set them aside on a sheet tray.\nHeat the canola oil in a large skillet over medium-high heat. Fry the sausages until brown and crispy, about 3 to 4 minutes per side. Transfer them to a paper towel-lined plate to drain.\nSlice open each roll lengthwise and stuff them with the fried sausages. Top the portions with some sauerkraut, drizzle with the mustard and serve.",
        "ingredients": [
            "2 tablespoons canola oil",
            "1 small head savoy cabbage, shredded",
            "3/4 cup German beer",
            "1 tablespoon mustard seeds",
            "1/4 cup cider vinegar",
            "2 tablespoons brown sugar",
            "1 tablespoon honey",
            "3 tablespoons mayonnaise",
            "3 tablespoons whole-grain mustard",
            "2 tablespoons German Beer",
            "Pinch salt",
            "1/4 cup all-purpose flour",
            "2 eggs",
            "1/4 cup water",
            "1 1/2 cups plain bread crumbs",
            "1 teaspoon paprika",
            "1 teaspoon garlic powder",
            "1 teaspoon onion powder",
            "Salt and freshly cracked black pepper",
            "1 pound or 6 links smoked bratwurst, butterflied",
            "2 cups canola oil",
            "6 pretzel rolls or small grinder rolls"
        ],
        "processed_output": {
            "step_by_step_instructions": [
                "Add oil to a large skillet over medium heat.",
                "Drop in the shredded cabbage and sauté for a few minutes until wilted.",
                "Add beer, mustard seeds, vinegar, brown sugar, and honey to the pan.",
                "Cook until the liquid reduces by half and the cabbage is tender but slightly crunchy.",
                "Set the sauerkraut aside.",
                "Whisk mayonnaise, whole-grain mustard, beer, and salt in a bowl to make the mustard sauce.",
                "For the schnitzel, place flour in the first dish.",
                "In the second dish, whisk together eggs and water.",
                "Combine bread crumbs, paprika, garlic powder, onion powder, salt, and pepper in the third dish.",
                "Lightly dredge the bratwurst in flour, then egg wash, and coat in the bread crumb mix.",
                "Set bratwurst aside on a sheet tray.",
                "Heat canola oil in a large skillet over medium-high heat.",
                "Fry the bratwurst until brown and crispy, about 3 to 4 minutes per side.",
                "Transfer to a paper towel-lined plate to drain.",
                "Slice open rolls and stuff with fried bratwurst.",
                "Top with sauerkraut and drizzle with mustard sauce before serving."
            ],
            "pure_ingredients": [
                "oil",
                "cabbage",
                "beer",
                "mustard seeds",
                "vinegar",
                "brown sugar",
                "honey",
                "mayonnaise",
                "mustard",
                "flour",
                "eggs",
                "water",
                "bread crumbs",
                "paprika",
                "garlic powder",
                "onion powder",
                "salt",
                "pepper",
                "bratwurst",
                "pretzel rolls"
            ],
            "cooking_time": {
                "preparation": "20 minutes",
                "cooking": "16 minutes",
                "plating": "5 minutes"
            },
            "required_tools": [
                "large skillet",
                "whisk",
                "3 plates or pie dishes",
                "sheet tray",
                "paper towel",
                "knife"
            ],
            "dietary_labels": [
                "contains eggs",
                "contains gluten"
            ]
        }
    }
]