[
    {
        "recipe_id": "TEDprvmvp82S0IIe1SwYgT/aOI9UEWi",
        "recipe_title": "Peaches, Raspberries, and Blueberries with Prosecco",
        "original_instructions": "Wash the peaches, peel them, pit them, and cut into slices about 1/4 inch thick. Put the peaches in a serving bowl, add the sugar and wine, and stir thoroughly. Wash the raspberries and blueberries and add them to the peaches.\nGrate the thin, yellow skin of half a lemon, being careful not to dig into the bitter white pith beneath, and add it to the bowl. Turn over the bowl's contents several times. Refrigerate at least 1 hour before serving, or even as far ahead as early morning of the day in which you intend to serve the fruit.",
        "ingredients": [
            "2 pounds peaches, preferably the aromatic white-fleshed variety",
            "2/3 cup granulated sugar",
            "1 1/2 cups Prosecco or other young, fruity, dry white wine",
            "1/2 pint raspberries",
            "1/2 pint blueberries",
            "Zest of 1 lemon"
        ],
        "step_by_step_instructions": [
            "Wash 1 peach, peel it, pit it, and cut into slices about 1/4 inch thick.",
            "Put the peach slices in a serving bowl.",
            "Add approximately 1 tablespoon of granulated sugar to the bowl.",
            "Pour about 1/4 cup of Prosecco into the bowl and stir thoroughly.",
            "Wash about 15 raspberries and 15 blueberries, then add them to the bowl.",
            "Grate the zest of 1/4 lemon, avoiding the bitter white pith, and add it to the bowl.",
            "Turn over the bowl's contents several times to mix.",
            "Refrigerate the mixture for at least 1 hour before serving."
        ],
        "processed_ingredients": [
            "1 peach",
            "1 tablespoon granulated sugar",
            "0.25 cup Prosecco",
            "15 raspberries",
            "15 blueberries",
            "0.25 lemon"
        ],
        "pure_ingredients": [
            "peach",
            "sugar",
            "wine",
            "raspberries",
            "blueberries",
            "lemon"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "knife",
            "cutting board",
            "serving bowl",
            "grater",
            "refrigerator"
        ]
    },
    {
        "recipe_id": "boMgE7R5wM16a3fjtn4lZ2tfoaRNPRK",
        "recipe_title": "Roasted Vegetable Gravy ",
        "original_instructions": "Melt butter in a 1 1/2- to 2-quart heavy saucepan over moderate heat, then add flour and cook roux, stirring, until pale golden, 2 to 3 minutes. Add stock in a stream, whisking constantly to prevent lumps, and bring to a boil, whisking. Reduce heat and simmer, whisking occasionally, until slightly thickened, about 8 minutes. Stir in salt and pepper.\nMelt butter in a 1 1/2- to 2-quart heavy saucepan over moderate heat, then add flour and cook roux, stirring, until pale golden, 2 to 3 minutes. Add stock in a stream, whisking constantly to prevent lumps, and bring to a boil, whisking. Reduce heat and simmer, whisking occasionally, until slightly thickened, about 8 minutes. Stir in salt and pepper.",
        "ingredients": [
            "2 tablespoons plus 1 teaspoon unsalted butter",
            "3 tablespoons plus 1 teaspoon all-purpose flour",
            "Roasted vegetable stock , heated",
            "1/4 teaspoon salt",
            "1/4 teaspoon black pepper"
        ],
        "step_by_step_instructions": [
            "Melt 1 tablespoon of unsalted butter in a small (1 1/2- to 2-quart) heavy saucepan over moderate heat.",
            "Add 1 1/2 tablespoons of all-purpose flour to the melted butter.",
            "Cook the roux, stirring, until it becomes pale golden, which should take about 2 to 3 minutes.",
            "Add heated roasted vegetable stock in a stream while whisking constantly to prevent lumps.",
            "Bring the mixture to a boil while continuing to whisk.",
            "Reduce the heat and let it simmer, whisking occasionally, until it is slightly thickened, about 8 minutes.",
            "Stir in 1/8 teaspoon salt and 1/8 teaspoon black pepper."
        ],
        "processed_ingredients": [
            "1 tablespoon unsalted butter",
            "1.50 tablespoon all-purpose flour",
            "1 cup roasted vegetable stock",
            "0.13 teaspoon salt",
            "0.13 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "butter",
            "flour",
            "vegetable stock",
            "salt",
            "pepper"
        ],
        "cooking_time": "11 minutes",
        "required_tools": [
            "saucepan",
            "whisk",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "1jj3vxub9Ds9Amx8VtTqCaehxShbbFS",
        "recipe_title": "Lamb and Sweet Potato Stew ",
        "original_instructions": "In a bowl toss lamb with flour and salt and pepper to taste. In a 10-inch skillet heat oil over moderately high heat and sauté garlic, stirring, 1 minute. Add lamb and brown, stirring, about 2 minutes. Add wine and boil 1 minute. Add water and cinnamon stick and scatter sweet potato on top. Simmer stew, covered, about 30 minutes, or until lamb is tender, and season with salt and pepper.\nIn a bowl toss lamb with flour and salt and pepper to taste. In a 10-inch skillet heat oil over moderately high heat and sauté garlic, stirring, 1 minute. Add lamb and brown, stirring, about 2 minutes. Add wine and boil 1 minute. Add water and cinnamon stick and scatter sweet potato on top. Simmer stew, covered, about 30 minutes, or until lamb is tender, and season with salt and pepper.",
        "ingredients": [
            "1 pound boneless lamb shoulder, cut into 1/2-inch pieces",
            "1 1/2 tablespoons all-purpose flour",
            "1 tablespoon olive oil",
            "1 garlic clove, minced",
            "1/4 cup red wine",
            "1 cup water",
            "1/2 cinnamon stick",
            "a 1/2-pound sweet potato, peeled and cut into 1-inch pieces"
        ],
        "step_by_step_instructions": [
            "In a bowl, toss 0.25 lb of lamb with 0.38 tablespoon of flour and salt and pepper to taste.",
            "In a 10-inch skillet, heat 0.25 tablespoon of olive oil over moderately high heat and sauté 0.25 garlic clove, minced, stirring for 1 minute.",
            "Add the lamb to the skillet and brown, stirring, for about 2 minutes.",
            "Add 0.06 cup of red wine and boil for 1 minute.",
            "Add 0.25 cup of water and 0.13 cinnamon stick, then scatter 0.13 lb of sweet potato, cut into 1-inch pieces, on top.",
            "Simmer the stew, covered, for about 30 minutes or until the lamb is tender.",
            "Season with salt and pepper to taste before serving."
        ],
        "processed_ingredients": [
            "0.25 lb lamb shoulder",
            "0.38 tbsp all-purpose flour",
            "0.25 tbsp olive oil",
            "0.25 clove garlic",
            "0.06 cup red wine",
            "0.25 cup water",
            "0.13 cinnamon stick",
            "0.13 lb sweet potato"
        ],
        "pure_ingredients": [
            "lamb",
            "flour",
            "olive oil",
            "garlic",
            "red wine",
            "water",
            "cinnamon",
            "sweet potato",
            "salt",
            "pepper"
        ],
        "cooking_time": "35 minutes",
        "required_tools": [
            "bowl",
            "10-inch skillet"
        ]
    },
    {
        "recipe_id": "QRcSrZ6BX73dHBlfubXsBHA1YaBBChO",
        "recipe_title": "Gingersnap Apple Crisp with Cream Cheese and Walnuts",
        "original_instructions": "For the crisp: Peel and core the apples. Roughly chop into 1-inch chunks and toss with the sugar in a large bowl. Cover with plastic wrap and refrigerate 8 hours or up to overnight.\nPreheat the oven to 350 degrees F. Butter a 13-by-9-inch or 2-quart baking dish.\nDrain the apples from their liquid and return the apples to the bowl. Add the cinnamon, nutmeg, salt, cloves and ginger and toss well. Using a rubber spatula, mix in the walnuts, maple syrup and half the cream cheese. Spread evenly in the prepared baking dish, then dot the mixture with the remaining cream cheese.\nFor the topping: Mix together the crushed gingersnaps, oats, sugar and melted butter. Spread the topping evenly across the crisp and bake until bubbly, 25 to 30 minutes. Serve hot or at room temperature with ice cream.",
        "ingredients": [
            "8 large baking apples, such as Granny Smiths",
            "1/3 cup sugar",
            "Butter, for buttering baking dish",
            "1 teaspoon ground cinnamon",
            "1/2 teaspoon ground nutmeg",
            "1/2 teaspoon salt",
            "1/4 teaspoon ground cloves",
            "1/4 teaspoon ground ginger",
            "1 1/2 cups chopped walnuts, toasted",
            "1/4 cup maple syrup",
            "Two 8-ounce packages cream cheese, cut into cubes",
            "2 cups crushed gingersnap cookies",
            "1 cup old-fashioned rolled oats",
            "1/4 cup sugar",
            "1 stick (8 tablespoons) unsalted butter, melted",
            "Ice cream, for serving"
        ],
        "step_by_step_instructions": [
            "Peel and core 1 apple.",
            "Roughly chop the apple into 1-inch chunks.",
            "Toss the chopped apple with 0.04 cup sugar in a large bowl.",
            "Cover with plastic wrap and refrigerate for 8 hours or overnight.",
            "Preheat the oven to 350 degrees F.",
            "Butter a small baking dish.",
            "Drain the apple from its liquid and return the apple to the bowl.",
            "Add 0.13 teaspoon cinnamon, 0.06 teaspoon nutmeg, 0.06 teaspoon salt, 0.03 teaspoon cloves, and 0.03 teaspoon ginger to the bowl and toss well.",
            "Mix in 0.19 cup walnuts, 0.03 cup maple syrup, and 1.33 ounces cream cheese with a rubber spatula.",
            "Spread the mixture evenly in the prepared baking dish.",
            "Dot the mixture with 1.33 ounces of cream cheese.",
            "Mix together 0.25 cup crushed gingersnaps, 0.13 cup oats, 0.03 cup sugar, and 1 tablespoon melted butter for the topping.",
            "Spread the topping evenly across the apple mixture.",
            "Bake in the oven until bubbly, approximately 25 to 30 minutes.",
            "Serve hot or at room temperature with ice cream."
        ],
        "processed_ingredients": [
            "1 apple",
            "0.04 cup sugar",
            "0.13 teaspoon cinnamon",
            "0.06 teaspoon nutmeg",
            "0.06 teaspoon salt",
            "0.03 teaspoon cloves",
            "0.03 teaspoon ginger",
            "0.19 cup walnuts",
            "0.03 cup maple syrup",
            "2.67 ounces cream cheese",
            "0.25 cup crushed gingersnaps",
            "0.13 cup oats",
            "0.03 cup sugar",
            "1 tablespoon butter"
        ],
        "pure_ingredients": [
            "apple",
            "sugar",
            "butter",
            "cinnamon",
            "nutmeg",
            "salt",
            "cloves",
            "ginger",
            "walnuts",
            "maple syrup",
            "cream cheese",
            "gingersnap cookies",
            "oats",
            "ice cream"
        ],
        "cooking_time": "8 hours 30 minutes",
        "required_tools": [
            "peeler",
            "knife",
            "bowl",
            "plastic wrap",
            "oven",
            "baking dish",
            "rubber spatula",
            "measuring spoons",
            "measuring cups"
        ]
    },
    {
        "recipe_id": "/CWg/tOV9TdX8.jlvuLYGEt.v6eNWhu",
        "recipe_title": "Vanilla Bean Ice Cream",
        "original_instructions": "In a small saucepan over medium-high heat, combine milk, heavy cream, and vanilla bean. Bring to a boil. Remove from heat and let steep for 1 hour.\nIn a large bowl, whisk yolks, vanilla sugar, and salt to combine. Bring milk mixture to a boil and remove the vanilla bean; reserving for another use. Slowly add to yolks while whisking constantly. Let stand 5 minutes.\nPrepare an ice bath. Add vanilla extract to the ice cream base stirring to combine. Strain through a fine sieve over a medium bowl. Cool ice cream base in ice bath. Transfer to an ice cream maker and freeze according to the manufacturer's directions.",
        "ingredients": [
            "3 cups milk, not skim",
            "1 cup heavy cream",
            "1 vanilla bean, split lengthwise and scraped",
            "8 large egg yolks",
            "2/3 cup vanilla sugar",
            "1/4 teaspoon salt",
            "1 teaspoon pure vanilla extract"
        ],
        "step_by_step_instructions": [
            "In a small saucepan over medium-high heat, combine 0.5 cups of milk, 0.17 cups of heavy cream, and a portion of vanilla bean (approximately 0.17 of a vanilla bean). Bring to a boil.",
            "Remove from heat and let steep for 1 hour.",
            "In a large bowl, whisk 1.33 large egg yolks, 0.11 cups of vanilla sugar, and 0.04 teaspoon of salt to combine.",
            "Bring milk mixture to a boil again and remove the vanilla bean.",
            "Slowly add milk mixture to yolks while whisking constantly. Let stand for 5 minutes.",
            "Prepare an ice bath.",
            "Add 0.17 teaspoon of pure vanilla extract to the ice cream base, stirring to combine.",
            "Strain through a fine sieve over a medium bowl.",
            "Cool ice cream base in ice bath.",
            "Transfer to an ice cream maker and freeze according to manufacturer's directions."
        ],
        "processed_ingredients": [
            "0.5 cup milk",
            "0.17 cup heavy cream",
            "0.17 vanilla bean",
            "1.33 egg yolks",
            "0.11 cup vanilla sugar",
            "0.04 tsp salt",
            "0.17 tsp pure vanilla extract"
        ],
        "pure_ingredients": [
            "milk",
            "cream",
            "vanilla",
            "egg",
            "sugar",
            "salt"
        ],
        "cooking_time": "80 minutes",
        "required_tools": [
            "small saucepan",
            "large bowl",
            "whisk",
            "ice bath",
            "fine sieve",
            "medium bowl",
            "ice cream maker"
        ]
    },
    {
        "recipe_id": "GVDOCgkCeAnyGekgqrTb6EgnVysCt0K",
        "recipe_title": "Amaretto Coffee",
        "original_instructions": "Pour in Amaretto in a clear glass mug and add coffee. Garnish with whipped cream, cinnamon, nutmeg and cinnamon stick.",
        "ingredients": [
            "1-2 shots of amaretto",
            "strong coffee",
            "whipped cream",
            "cinnamon sticks",
            "cinnamon",
            "nutmeg"
        ],
        "step_by_step_instructions": [
            "Pour 1.5 ounces of Amaretto into a clear glass mug.",
            "Add 8 ounces of strong coffee to the mug.",
            "Garnish with 2 tablespoons of whipped cream.",
            "Sprinkle a pinch of cinnamon and nutmeg on top.",
            "Place 1 cinnamon stick in the mug for garnish."
        ],
        "processed_ingredients": [
            "1.50 oz amaretto",
            "8.00 oz coffee",
            "2.00 tbsp whipped cream",
            "1.00 g cinnamon stick",
            "0.50 tsp cinnamon",
            "0.50 tsp nutmeg"
        ],
        "pure_ingredients": [
            "amaretto",
            "coffee",
            "whipped cream",
            "cinnamon stick",
            "cinnamon",
            "nutmeg"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "clear glass mug"
        ]
    },
    {
        "recipe_id": "id1PQ.sYplXT3.l0UuKMu3eJKXVN5gG",
        "recipe_title": "Frittata",
        "original_instructions": "Heat oil in a large non-stick skillet over medium high heat. Add onion and bell pepper and cook for 3 minutes. Stir in potatoes and cook until golden brown. Add cooked leftover meat and toss to coat.\nIn a mixing bowl beat together the eggs and cream and season with salt and pepper. Pour egg mixture into skillet and stir in chopped herbs. Top with grated cheese and brown under broiler for about 2-3 minutes until the frittata puffs.",
        "ingredients": [
            "1 tablespoon olive oil",
            "1/2 onion, chopped",
            "1/2 red or green bell pepper, chopped",
            "1 cup boiled potatoes, chopped",
            "1/2 cup leftover cooked chopped ham, chicken, turkey or sausage",
            "6 eggs, lightly beaten",
            "1/4 cup cream",
            "Salt and pepper",
            "2 tablespoons chopped parsley, basil or cilantro",
            "1/2 cup grated cheddar, Monterey jack or mozzarella"
        ],
        "step_by_step_instructions": [
            "Heat 0.33 tablespoon of olive oil in a large non-stick skillet over medium high heat.",
            "Add 0.17 onion, chopped, and 0.17 bell pepper, chopped, and cook for 3 minutes.",
            "Stir in 0.33 cup of boiled potatoes, chopped, and cook until golden brown.",
            "Add 0.17 cup of leftover cooked chopped ham, and toss to coat.",
            "In a mixing bowl, beat together 2 eggs and 0.08 cup of cream, and season with salt and pepper.",
            "Pour the egg mixture into the skillet and stir in 0.67 tablespoon of chopped parsley.",
            "Top with 0.17 cup of grated cheddar cheese.",
            "Brown under broiler for about 2-3 minutes until the frittata puffs."
        ],
        "processed_ingredients": [
            "0.33 tablespoon olive oil",
            "0.17 onion",
            "0.17 bell pepper",
            "0.33 cup boiled potatoes",
            "0.17 cup cooked ham",
            "2 eggs",
            "0.08 cup cream",
            "1.00 teaspoon salt",
            "0.50 teaspoon pepper",
            "0.67 tablespoon parsley",
            "0.17 cup cheddar cheese"
        ],
        "pure_ingredients": [
            "olive oil",
            "onion",
            "bell pepper",
            "potato",
            "ham",
            "egg",
            "cream",
            "salt",
            "pepper",
            "parsley",
            "cheese"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "large non-stick skillet",
            "mixing bowl",
            "broiler"
        ]
    },
    {
        "recipe_id": "/QFiu9bDV5QCbE9DnGBG4bFtpQ9WpSW",
        "recipe_title": "Sauteed Shredded Brussels Sprouts",
        "original_instructions": "Watch how to make this recipe.\nPlace the Brussels sprouts in the feed tube of the food processor fitted with a large slicing disc. (There is no need to core them.) Process the Brussels sprouts until they're all sliced.\nPlace the butter and olive oil in a large (12-inch) saute pan and heat it over medium heat. Add the sliced Brussels sprouts, 1 1/2 teaspoons salt, and 1/2 teaspoon pepper and saute them, stirring frequently, for about 4 to 5 minutes, until tender but still bright green. Stir in the balsamic vinegar, season to taste, and serve hot.",
        "ingredients": [
            "2 (12-ounce) packages Brussels sprouts, ends and brown leaves trimmed",
            "2 tablespoons unsalted butter",
            "2 tablespoons good olive oil",
            "Kosher salt and freshly ground black pepper",
            "1 tablespoon syrupy balsamic vinegar"
        ],
        "step_by_step_instructions": [
            "Trim the ends and brown leaves from approximately 6 ounces of Brussels sprouts.",
            "Place the Brussels sprouts in the feed tube of a food processor fitted with a large slicing disc and slice them.",
            "In a large (12-inch) saute pan, heat 0.5 tablespoon of unsalted butter and 0.5 tablespoon of olive oil over medium heat.",
            "Add the sliced Brussels sprouts to the pan.",
            "Season with 0.38 teaspoon of salt and 0.13 teaspoon of pepper.",
            "Saute the Brussels sprouts, stirring frequently, for about 4 to 5 minutes until tender but still bright green.",
            "Stir in 0.25 tablespoon of syrupy balsamic vinegar.",
            "Season to taste and serve hot."
        ],
        "processed_ingredients": [
            "6.00 ounce Brussels sprouts",
            "0.50 tablespoon unsalted butter",
            "0.50 tablespoon olive oil",
            "0.38 teaspoon salt",
            "0.13 teaspoon black pepper",
            "0.25 tablespoon balsamic vinegar"
        ],
        "pure_ingredients": [
            "Brussels sprouts",
            "butter",
            "olive oil",
            "salt",
            "black pepper",
            "balsamic vinegar"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "food processor",
            "large saute pan",
            "slicing disc",
            "spatula"
        ]
    },
    {
        "recipe_id": "Mh7.r51OX4Q5750zul2rXWfbINQbe2O",
        "recipe_title": "Shredded Brussels Sprouts",
        "original_instructions": "Watch how to make this recipe.\nCook the bacon until crisp in a large skillet. Remove with a slotted spoon to a plate.\nWhile the bacon is cooking, cut off the ends of the brussels sprouts. Then chop the Brussels sprouts in half. Lay them cut-side-down and finely chop until they are all shredded.\nAdd the garlic and shallots to the skillet and saute until fragrant and the shallots are soft, 1 to 2 minutes. Stir in the Brussels sprouts and saute until tender crisp, 3 to 5 minutes. Add a pinch of brown sugar. Season with salt and pepper and add the lemon juice. Saute for 1 minute more. Toss with the chopped parsley and bacon. Serve hot or at room temperature.",
        "ingredients": [
            "1 strip bacon, sliced into thin strips",
            "2 cloves garlic, minced",
            "1 shallot, minced",
            "6 ounces Brussels sprouts (2 big handfuls)",
            "Pinch brown sugar",
            "Kosher salt and freshly ground black pepper",
            "Juice of 1/2 a lemon",
            "1 tablespoon chopped fresh flat-leaf parsley"
        ],
        "step_by_step_instructions": [
            "Cook 1 slice of bacon in a large skillet until crisp. Remove it with a slotted spoon and set aside.",
            "While the bacon is cooking, cut off the ends of the Brussels sprouts, then chop them in half. Lay them cut-side-down and finely chop until shredded.",
            "Add 2 cloves of minced garlic and 1 minced shallot to the skillet and sauté until fragrant and the shallots are soft, about 1 to 2 minutes.",
            "Stir in the shredded Brussels sprouts and sauté until tender crisp, about 3 to 5 minutes.",
            "Add a pinch of brown sugar, season with salt and pepper, and add the juice of 1/2 a lemon. Sauté for 1 more minute.",
            "Toss the mixture with 1 tablespoon of chopped fresh parsley and the cooked bacon.",
            "Serve hot or at room temperature."
        ],
        "processed_ingredients": [
            "1 slice bacon",
            "2 cloves garlic",
            "1 shallot",
            "6 ounces Brussels sprouts",
            "0.25 teaspoon brown sugar",
            "0.25 teaspoon salt",
            "0.25 teaspoon black pepper",
            "1 tablespoon lemon juice",
            "1 tablespoon parsley"
        ],
        "pure_ingredients": [
            "bacon",
            "garlic",
            "shallot",
            "Brussels sprouts",
            "brown sugar",
            "salt",
            "pepper",
            "lemon",
            "parsley"
        ],
        "cooking_time": "12 minutes",
        "required_tools": [
            "large skillet",
            "slotted spoon",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "IVEMKLRHwQ7aTXJfVY6JvncbI0qX4zK",
        "recipe_title": "Watermelon Granita",
        "original_instructions": "In a small saucepan combine the sugar and 3/4 cup water, bring the mixture to a boil, stirring until the sugar is dissolved, and let the syrup cool. In a blender or food processor puree the watermelon. In a bowl combine the puree, the syrup and the lemon juice and chill the mixture, covered, for 1 to 2 hours or until it is cold. The mixture may be made up to this point 1 day in advance and kept covered and chilled. Stir the mixture, transfer it to 2 metal ice cube trays without the dividers or a shallow metal bowl, and freeze it, stirring it with a fork every 20 to 30 minutes depending on the temperature of the freezer and crushing the large frozen clumps, for 2 to 3 hours, or until it is firm but not frozen hard. Scrape the granita with a fork to lighten the texture and serve it in chilled bowls.;",
        "ingredients": [
            "1/3 cup sugar",
            "3 1/2 cups seeded and chopped watermelon (about 3 1/4 pound wedge)",
            "1 tablespoon fresh lemon juice, or to taste"
        ],
        "step_by_step_instructions": [
            "Combine 0.08 cup sugar and 0.19 cup water in a small saucepan.",
            "Bring the mixture to a boil, stirring until the sugar is dissolved, then let the syrup cool.",
            "Puree 0.88 cup chopped watermelon in a blender or food processor.",
            "In a bowl, combine the watermelon puree, cooled syrup, and 0.25 tablespoon fresh lemon juice.",
            "Chill the mixture, covered, for 1 to 2 hours or until it is cold.",
            "Stir the mixture and transfer it to a shallow metal bowl.",
            "Freeze it, stirring with a fork every 20 to 30 minutes and crushing the large frozen clumps, for 2 to 3 hours, until firm but not frozen hard.",
            "Scrape the granita with a fork to lighten the texture.",
            "Serve the granita in chilled bowls."
        ],
        "processed_ingredients": [
            "0.08 cup sugar",
            "0.88 cup watermelon",
            "0.25 tablespoon lemon juice"
        ],
        "pure_ingredients": [
            "sugar",
            "watermelon",
            "lemon juice"
        ],
        "cooking_time": "4 hours",
        "required_tools": [
            "saucepan",
            "blender",
            "bowl",
            "metal bowl",
            "fork"
        ]
    },
    {
        "recipe_id": "KHO5fmRvfjCISnmIHCHI6/6TzsCbtH2",
        "recipe_title": "Sweet Potato Waffles",
        "original_instructions": "Preheat your waffle iron, and sift together the dry ingredients.\nCombine the wet ingredients, the potatoes and the dry ingredients.\n*Don't over-mix the batter! Pour in enough batter to cover waffle iron. Take out when your waffle iron indicates by the light that your waffle is done! Enjoy!",
        "ingredients": [
            "1 cup sifted flour",
            "2 teaspoons of baking powder",
            "1/2 teaspoon salt",
            "2 tablespoons light brown sugar",
            "1/4 teaspoon allspice",
            "3 beaten eggs",
            "2 tablespoons butter",
            "1 1/2 cups milk",
            "1/2 cup sweet potatoes, cooked and mashed, or canned"
        ],
        "step_by_step_instructions": [
            "Preheat your waffle iron.",
            "Sift together the dry ingredients: flour, baking powder, salt, light brown sugar, and allspice.",
            "In a separate bowl, combine the wet ingredients: beaten eggs, melted butter, milk, and mashed sweet potatoes.",
            "Gently fold the wet ingredients into the dry ingredients; do not over-mix the batter.",
            "Pour enough batter to cover the waffle iron.",
            "Cook the waffle until your waffle iron indicates it is done.",
            "Remove the waffle and enjoy."
        ],
        "processed_ingredients": [
            "0.25 cup flour",
            "0.50 teaspoon baking powder",
            "0.13 teaspoon salt",
            "0.50 tablespoon light brown sugar",
            "0.06 teaspoon allspice",
            "0.75 egg",
            "0.50 tablespoon butter",
            "0.38 cup milk",
            "0.13 cup sweet potatoes"
        ],
        "pure_ingredients": [
            "flour",
            "baking powder",
            "salt",
            "light brown sugar",
            "allspice",
            "egg",
            "butter",
            "milk",
            "potato"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "waffle iron",
            "sifter",
            "bowl",
            "spoon",
            "measuring cup",
            "measuring spoon"
        ]
    },
    {
        "recipe_id": "JSYXmMcxYFJu0SBCnPKqW2MOdkjUCHm",
        "recipe_title": "Summer Vegetable Chili",
        "original_instructions": "Heat the vegetable oil in a large pot over medium heat. Add all but a few tablespoons of the chopped red onion. Stir in the garlic, chili powder and cumin and cook, stirring occasionally, until the onion begins to soften, about 3 minutes. Add the poblano, mushrooms and corn and cook, stirring occasionally, until just tender, about 3 more minutes. Add the beans, tomatoes, 1 1/2 cups water and 1/2 teaspoon each salt and pepper. Bring to a boil, then stir and reduce the heat to medium. Simmer, stirring occasionally, until the vegetables are tender and the chili is thick, about 20 minutes. Season with salt and pepper.\nDivide the chili among bowls. Top with the cheese, sour cream and/or cilantro; sprinkle with the reserved red onion. Serve with the tortillas.\nPhotograph by Johnny Miller",
        "ingredients": [
            "3 tablespoons vegetable oil",
            "1 medium red onion, chopped",
            "3 cloves garlic, chopped",
            "2 tablespoons chili powder",
            "2 teaspoons ground cumin",
            "1 poblano chile pepper, seeded and diced",
            "2 portobello mushrooms, stemmed and chopped",
            "2 cups frozen corn (preferably fire-roasted), thawed",
            "2 14-ounce cans no-salt-added pinto beans",
            "1 14-ounce can no-salt-added diced tomatoes",
            "Kosher salt and freshly ground pepper",
            "Shredded cheddar cheese, sour cream and/or torn fresh cilantro, for topping (optional)",
            "8 corn tortillas, warmed"
        ],
        "step_by_step_instructions": [
            "Heat 0.38 tablespoons of vegetable oil in a large pot over medium heat.",
            "Add 0.75 ounces of chopped red onion, reserving a few pieces for garnish.",
            "Stir in 0.38 cloves of chopped garlic, 0.25 tablespoons of chili powder, and 0.13 teaspoons of ground cumin.",
            "Cook, stirring occasionally, until the onion begins to soften, about 3 minutes.",
            "Add 0.13 poblano chile pepper, diced, 0.25 portobello mushrooms, chopped, and 0.25 cups of corn.",
            "Cook, stirring occasionally, until just tender, about 3 more minutes.",
            "Add 0.5 cups of pinto beans and 0.25 cups of diced tomatoes.",
            "Add 0.19 cups of water and 0.06 teaspoons each of salt and pepper.",
            "Bring to a boil, then stir and reduce the heat to medium.",
            "Simmer, stirring occasionally, until the vegetables are tender and the chili is thick, about 20 minutes.",
            "Season with additional salt and pepper to taste.",
            "Divide the chili into a bowl.",
            "Top with 0.5 ounces of shredded cheddar cheese, 0.25 ounces of sour cream, and sprinkle with the reserved red onion pieces.",
            "Serve with 1 warmed corn tortilla."
        ],
        "processed_ingredients": [
            "0.38 tablespoon vegetable oil",
            "0.75 ounce red onion",
            "0.38 clove garlic",
            "0.25 tablespoon chili powder",
            "0.13 teaspoon ground cumin",
            "0.13 poblano chile pepper",
            "0.25 portobello mushrooms",
            "0.25 cup corn",
            "0.5 cup pinto beans",
            "0.25 cup diced tomatoes",
            "0.06 teaspoon salt",
            "0.06 teaspoon pepper",
            "0.19 cup water",
            "0.5 ounce cheddar cheese",
            "0.25 ounce sour cream",
            "1 corn tortilla"
        ],
        "pure_ingredients": [
            "vegetable oil",
            "red onion",
            "garlic",
            "chili powder",
            "cumin",
            "poblano chile pepper",
            "portobello mushrooms",
            "corn",
            "pinto beans",
            "tomatoes",
            "salt",
            "pepper",
            "water",
            "cheddar cheese",
            "sour cream",
            "cilantro",
            "corn tortillas"
        ],
        "cooking_time": "26 minutes",
        "required_tools": [
            "large pot",
            "stirring spoon",
            "knife",
            "cutting board",
            "measuring spoons",
            "measuring cups"
        ]
    },
    {
        "recipe_id": "DU.DJNXcKSQsQKvVcFnCimQI7D94tZK",
        "recipe_title": "Habanero Sauce",
        "original_instructions": "In a food processor, finely chop the carrots and habanero peppers. In a small saucepan heat the butter and add the chopped garlic. Then add the carrot and habanero mixture and saute until carrots are soft. While stirring add the apple cider vinegar and salt and pepper, to taste. Then add the water and simmer until mixture is thick enough for spreading.",
        "ingredients": [
            "2 carrots, sliced",
            "6 habanero peppers, seeds removed and sliced",
            "2 teaspoons butter",
            "2 teaspoons chopped garlic",
            "2 tablespoons apple cider vinegar",
            "Salt and freshly ground black pepper",
            "1 cup water"
        ],
        "step_by_step_instructions": [
            "Finely chop 1 carrot and 2 habanero peppers using a food processor.",
            "Heat 0.67 teaspoon butter in a small saucepan.",
            "Add 0.67 teaspoon chopped garlic to the saucepan.",
            "Add the chopped carrot and habanero mixture to the saucepan and sauté until the carrots are soft.",
            "While stirring, add 0.67 tablespoon apple cider vinegar and salt and pepper to taste.",
            "Add 0.33 cup water to the mixture.",
            "Simmer the mixture until it is thick enough for spreading."
        ],
        "processed_ingredients": [
            "1 carrot",
            "2 habanero peppers",
            "0.67 teaspoon butter",
            "0.67 teaspoon garlic",
            "0.67 tablespoon apple cider vinegar",
            "0.33 cup water",
            "1 teaspoon salt",
            "1 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "carrot",
            "habanero pepper",
            "butter",
            "garlic",
            "apple cider vinegar",
            "salt",
            "black pepper",
            "water"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "food processor",
            "small saucepan",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "TPZuCxZbSasWRxO5YTeW8qbXelWkUry",
        "recipe_title": "Sesame-Lime Vinaigrette ",
        "original_instructions": "Combine shallot and lime juice in a large jar or medium bowl; season with salt and pepper and let sit 10 minutes. Add sesame oil, vegetable oil, soy sauce, and honey to shallot mixture; cover and shake (or whisk) to combine. Season sesame-lime vinaigrette with salt and pepper.\nCombine shallot and lime juice in a large jar or medium bowl; season with salt and pepper and let sit 10 minutes.\nAdd sesame oil, vegetable oil, soy sauce, and honey to shallot mixture; cover and shake (or whisk) to combine. Season sesame-lime vinaigrette with salt and pepper.\nDo Ahead Vinaigrette can be made 1 week ahead. Cover and chill. Shake to reincorporate just before serving.\nVinaigrette can be made 1 week ahead. Cover and chill. Shake to reincorporate just before serving.",
        "ingredients": [
            "1 large shallot, finely chopped",
            "1 cup fresh lime juice",
            "Kosher salt, freshly ground pepper",
            "1/2 cup toasted sesame oil",
            "1/2 cup vegetable oil",
            "1/4 cup soy sauce",
            "2 tablespoons honey or maple syrup"
        ],
        "step_by_step_instructions": [
            "Finely chop approximately 0.25 of a large shallot.",
            "In a medium bowl or a large jar, combine the chopped shallot with about 0.25 cup of fresh lime juice.",
            "Season the mixture with a pinch of kosher salt and a pinch of freshly ground pepper, then let it sit for 10 minutes.",
            "Add 1 tablespoon of toasted sesame oil, 1 tablespoon of vegetable oil, 0.5 tablespoon of soy sauce, and 0.5 tablespoon of honey to the shallot mixture.",
            "Cover the jar and shake well (or whisk in the bowl) to combine all the ingredients.",
            "Season the sesame-lime vinaigrette with additional salt and pepper to taste before serving."
        ],
        "processed_ingredients": [
            "0.25 large shallot",
            "0.25 cup lime juice",
            "0.25 tsp kosher salt",
            "0.25 tsp freshly ground pepper",
            "1 tbsp sesame oil",
            "1 tbsp vegetable oil",
            "0.5 tbsp soy sauce",
            "0.5 tbsp honey"
        ],
        "pure_ingredients": [
            "shallot",
            "lime juice",
            "salt",
            "pepper",
            "sesame oil",
            "vegetable oil",
            "soy sauce",
            "honey"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "jar",
            "bowl",
            "whisk"
        ]
    },
    {
        "recipe_id": "ulNXZDSPPi0XGEhx3yyf.6DFcYRdojW",
        "recipe_title": "Bird Flanagan Potato Pancakes ",
        "original_instructions": "Peel and grate raw potato; place in a bowl. Beat egg, and add to the potato. Slice the raw lean bacon into thin strips (julienne). Add to the potatoes along with the diced onion, parsley, pepper, and cheddar. Combine thoroughly. In a crepe pan, heat oil over medium-high heat. Pour the mix onto the pan. Cook on both sides, until golden brown.\nPeel and grate raw potato; place in a bowl. Beat egg, and add to the potato.\nSlice the raw lean bacon into thin strips (julienne). Add to the potatoes along with the diced onion, parsley, pepper, and cheddar. Combine thoroughly.\nIn a crepe pan, heat oil over medium-high heat. Pour the mix onto the pan. Cook on both sides, until golden brown.",
        "ingredients": [
            "2 medium potatoes",
            "1 whole egg",
            "4 slices lean Canadian bacon",
            "1 tablespoon finely diced onion",
            "1 teaspoon chopped parsley",
            "1/4 teaspoon ground pepper",
            "2 tablespoons grated cheddar cheese",
            "3 tablespoons vegetable oil",
            "1/4 teaspoon salt"
        ],
        "step_by_step_instructions": [
            "Peel and grate 1 medium potato and place in a bowl.",
            "Beat 1 whole egg and add to the potato.",
            "Slice 2 slices of lean Canadian bacon into thin strips and add to the potatoes.",
            "Add 0.5 tablespoon finely diced onion to the mixture.",
            "Add 0.33 teaspoon chopped parsley to the mixture.",
            "Add 0.13 teaspoon ground pepper to the mixture.",
            "Add 1 tablespoon grated cheddar cheese to the mixture.",
            "Combine all ingredients thoroughly.",
            "In a crepe pan, heat 1.5 tablespoons vegetable oil over medium-high heat.",
            "Pour the mixture onto the pan and cook on both sides until golden brown."
        ],
        "processed_ingredients": [
            "1 medium potato",
            "1 whole egg",
            "2 slices of lean Canadian bacon",
            "0.5 tablespoon finely diced onion",
            "0.33 teaspoon chopped parsley",
            "0.13 teaspoon ground pepper",
            "1 tablespoon grated cheddar cheese",
            "1.5 tablespoons vegetable oil",
            "0.13 teaspoon salt"
        ],
        "pure_ingredients": [
            "potato",
            "egg",
            "bacon",
            "onion",
            "parsley",
            "pepper",
            "cheddar cheese",
            "vegetable oil",
            "salt"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "bowl",
            "crepe pan",
            "grater",
            "knife",
            "spatula"
        ]
    },
    {
        "recipe_id": "uuAyJqTt0W0NXvcUEMBRWdd2fUkCyya",
        "recipe_title": "Sweet-and-Salty Peanut Butter Sauce ",
        "original_instructions": "Purée all ingredients in a food processor, scraping down sides, until smooth.\nPurée all ingredients in a food processor, scraping down sides, until smooth.",
        "ingredients": [
            "2 cups creamy peanut butter",
            "1/2 cup peanut oil",
            "1/4 cup powdered sugar",
            "1 teaspoon kosher salt"
        ],
        "step_by_step_instructions": [
            "Place all ingredients into a food processor.",
            "Purée the ingredients, scraping down the sides, until the mixture is smooth."
        ],
        "processed_ingredients": [
            "0.50 cup creamy peanut butter",
            "0.13 cup peanut oil",
            "0.06 cup powdered sugar",
            "0.25 teaspoon kosher salt"
        ],
        "pure_ingredients": [
            "peanut butter",
            "peanut oil",
            "powdered sugar",
            "salt"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "food processor",
            "spatula"
        ]
    },
    {
        "recipe_id": "vocOXCRZhYapYbDK4STZYbHlBsEYiru",
        "recipe_title": "Nasturtium Butter ",
        "original_instructions": "Mix 3 tablespoons chopped nasturtium flowers (red, yellow, and/or orange) and 1/2 teaspoon kosher salt into 1/2 cup (1 stick) room-temperature unsalted butter in a small bowl. Season with freshly ground black pepper. Place on parchment or waxed paper and roll up into a log. Chill until firm, 1 hour. Do ahead: Butter can be made 2 days ahead. Keep chilled.\nMix 3 tablespoons chopped nasturtium flowers (red, yellow, and/or orange) and 1/2 teaspoon kosher salt into 1/2 cup (1 stick) room-temperature unsalted butter in a small bowl. Season with freshly ground black pepper. Place on parchment or waxed paper and roll up into a log. Chill until firm, 1 hour. Do ahead: Butter can be made 2 days ahead. Keep chilled.",
        "ingredients": [
            "3 tablespoons chopped nasturtium flowers (red, yellow, and/or orange)",
            "1/2 teaspoon kosher salt",
            "1/2 cup (1 stick) room-temperature unsalted butter",
            "Freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Chop nasturtium flowers until you have 1 tablespoon.",
            "In a small bowl, mix 1 tablespoon chopped nasturtium flowers with 1/8 teaspoon kosher salt.",
            "Add 2 tablespoons room-temperature unsalted butter to the bowl.",
            "Season the mixture with freshly ground black pepper to taste.",
            "Place the mixture on parchment or waxed paper and roll it into a log.",
            "Chill the log until firm, approximately 1 hour before use."
        ],
        "processed_ingredients": [
            "1 tablespoon nasturtium flowers",
            "0.13 teaspoon kosher salt",
            "2 tablespoon unsalted butter",
            "0.13 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "nasturtium flowers",
            "salt",
            "butter",
            "black pepper"
        ],
        "cooking_time": "1 hour",
        "required_tools": [
            "small bowl",
            "parchment or waxed paper",
            "knife for chopping",
            "refrigerator"
        ]
    },
    {
        "recipe_id": "kXY1wSiKZ5gTrMn03W5/iobBZ7te60.",
        "recipe_title": "Butter Poached Lobster Shooters",
        "original_instructions": "Reserve 1 cup of clarified butter and try to keep warm.\nPlace lobster tails in a large pot and cover with the remaining butter. Add 3 cloves of garlic to the pot. Poach on a low heat until the lobster shell changes color and meat is cooked. Allow to cool slightly and harvest meat from tails. Chop meat into bite-size pieces.\nWhile meat is still warm, assemble the shooters. In shot glass pour a bit of the reserved warm butter into each glass. Top with lobster meat and drizzle with a bit of the lemon juice.",
        "ingredients": [
            "4 pounds salted butter, clarified",
            "4 to 6 fresh Maine lobster tails",
            "3 garlic cloves",
            "4 fresh lemons, juiced"
        ],
        "step_by_step_instructions": [
            "Reserve 0.25 cup of clarified butter and keep warm.",
            "Place 1 lobster tail in a pot and cover with 0.75 cup of the remaining butter.",
            "Add 0.75 clove of garlic to the pot.",
            "Poach on low heat until the lobster shell changes color and meat is cooked.",
            "Allow to cool slightly and harvest meat from the tail.",
            "Chop meat into bite-size pieces.",
            "In a shot glass, pour a bit of the reserved warm butter.",
            "Top with lobster meat and drizzle with a bit of lemon juice."
        ],
        "processed_ingredients": [
            "1 lb butter",
            "1 lobster tail",
            "0.75 clove garlic",
            "1 tbsp lemon juice"
        ],
        "pure_ingredients": [
            "butter",
            "lobster",
            "garlic",
            "lemon"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "large pot",
            "shot glass",
            "knife",
            "cutting board",
            "spoon"
        ]
    },
    {
        "recipe_id": "dAAIsmXSZuS5yo0CdxmArbMqQgR9I7G",
        "recipe_title": "Poached Salmon",
        "original_instructions": "Combine the stock, wine, thyme, garlic, shallot and lemon zest in a wide, deep pan and bring to a simmer. Add the salmon, a pinch of salt and a grind of pepper. Partially cover and simmer until the salmon is fully cooked, 8 to 10 minutes.\nServe with an arugula salad, lemon slices and olive oil drizzled on top.",
        "ingredients": [
            "3 cups vegetable stock",
            "1 cup dry white wine, such as Sauvignon Blanc",
            "2 sprigs fresh thyme",
            "2 cloves garlic, smashed",
            "1 shallot, sliced",
            "1 lemon, zested",
            "Two 6-ounce pieces skin-on salmon",
            "Kosher salt and freshly ground black pepper",
            "Arugula salad, for serving",
            "Lemon slices, for serving",
            "Olive oil, for drizzling"
        ],
        "step_by_step_instructions": [
            "Combine 1.5 cups of vegetable stock, 0.5 cup of dry white wine, 1 sprig of fresh thyme, 1 smashed clove of garlic, 0.5 sliced shallot, and zest from 0.5 lemon in a wide, deep pan and bring to a simmer.",
            "Add 1 piece of 6-ounce salmon, a pinch of kosher salt, and a grind of freshly ground black pepper.",
            "Partially cover the pan and simmer until the salmon is fully cooked, approximately 8 to 10 minutes.",
            "Serve the salmon with arugula salad, lemon slices, and drizzle with olive oil."
        ],
        "processed_ingredients": [
            "1.50 cup vegetable stock",
            "0.50 cup dry white wine",
            "1 sprig fresh thyme",
            "1 clove garlic",
            "0.50 shallot",
            "0.50 lemon",
            "1 piece 6-ounce salmon",
            "0.25 tsp kosher salt",
            "0.25 tsp freshly ground black pepper",
            "30 g arugula salad",
            "2 slice lemon",
            "1 tbsp olive oil"
        ],
        "pure_ingredients": [
            "vegetable stock",
            "white wine",
            "thyme",
            "garlic",
            "shallot",
            "lemon",
            "salmon",
            "salt",
            "black pepper",
            "arugula",
            "olive oil"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "wide deep pan",
            "knife",
            "cutting board",
            "zester"
        ]
    },
    {
        "recipe_id": "k70WFrRo1x6EXzn8ZzdxQjHxbu2Yzfu",
        "recipe_title": "Roasted Marinated Portobello Mushrooms",
        "original_instructions": "Remove the stems from the portobello mushrooms or trim the ends of each stem of the white mushrooms. Arrange the mushrooms in a large baking dish. In a bowl whisk together the vinegar, mustard, salt and pepper. Gradually whisk in the olive oil until the vinaigrette is emulsified. Whisk in the garlic, rosemary and thyme. Pour the vinaigrette over the mushrooms and allow to marinate at room temperature for 20 to 30 minutes. Roast the mushrooms in a preheated 400 degree F. oven for about 20 minutes or until tender. Allow the mushrooms to cool to room temperature. Arrange greens on a platter. Cut mushrooms into 1/2-inch slices and fan on a serving platter. Drizzle with the reserved vinaigrette. Sprinkle the sliced mushrooms with the chopped parsley. Serve at room temperature.",
        "ingredients": [
            "8 large (about 5 to 6 inches wide) portobello mushrooms or 2 pounds standard white mushrooms, brushed clean",
            "1/3 cup balsamic or red wine vinegar",
            "2 tablespoons Dijon mustard",
            "Salt and pepper",
            "2/3 cup olive oil",
            "2 garlic cloves, minced",
            "1 1/2 tablespoons minced fresh rosemary",
            "1 1/2 tablespoons minced fresh thyme leaves",
            "2 bunches arugula or another green of choice, trimmed, washed and dried",
            "1/4 cup minced fresh parsley"
        ],
        "step_by_step_instructions": [
            "Remove the stems from 1 large portobello mushroom.",
            "Arrange the mushroom in a small baking dish.",
            "In a bowl, whisk together 1.5 teaspoons of balsamic vinegar, 0.5 teaspoon of Dijon mustard, a pinch of salt, and a pinch of pepper.",
            "Gradually whisk in 1.5 tablespoons of olive oil until the vinaigrette is emulsified.",
            "Whisk in 0.25 teaspoon of minced garlic, 0.25 teaspoon of minced fresh rosemary, and 0.25 teaspoon of minced fresh thyme leaves.",
            "Pour the vinaigrette over the mushroom and allow to marinate at room temperature for 20 to 30 minutes.",
            "Preheat the oven to 400 degrees F.",
            "Roast the mushroom in the oven for about 20 minutes or until tender.",
            "Allow the mushroom to cool to room temperature.",
            "Arrange a handful of arugula on a platter.",
            "Cut the mushroom into 0.5-inch slices and fan on a serving platter.",
            "Drizzle with the reserved vinaigrette.",
            "Sprinkle the sliced mushroom with 1 teaspoon of chopped parsley.",
            "Serve at room temperature."
        ],
        "processed_ingredients": [
            "1.00 large portobello mushroom",
            "1.50 teaspoon balsamic vinegar",
            "0.50 teaspoon Dijon mustard",
            "0.01 teaspoon salt",
            "0.01 teaspoon pepper",
            "1.50 tablespoon olive oil",
            "0.25 teaspoon garlic",
            "0.25 teaspoon rosemary",
            "0.25 teaspoon thyme leaves",
            "1.00 handful arugula",
            "1.00 teaspoon parsley"
        ],
        "pure_ingredients": [
            "portobello mushroom",
            "balsamic vinegar",
            "Dijon mustard",
            "salt",
            "pepper",
            "olive oil",
            "garlic",
            "rosemary",
            "thyme",
            "arugula",
            "parsley"
        ],
        "cooking_time": "70 minutes",
        "required_tools": [
            "bowl",
            "whisk",
            "baking dish",
            "oven",
            "platter",
            "knife"
        ]
    },
    {
        "recipe_id": "zULTIMMaYFgqizLjz5w.r29rCdCT2uC",
        "recipe_title": "Puffed Rice and Coconut Crunchies ",
        "original_instructions": "Preheat oven to 400°F. Toss puffed rice, coconut flakes, coconut oil, brown rice syrup, sesame seeds, poppy seeds, and paprika on a rimmed baking sheet until rice and coconut are evenly coated. Season with salt and roast until coconut is golden brown, about 4 minutes. Let cool.\nPreheat oven to 400°F. Toss puffed rice, coconut flakes, coconut oil, brown rice syrup, sesame seeds, poppy seeds, and paprika on a rimmed baking sheet until rice and coconut are evenly coated. Season with salt and roast until coconut is golden brown, about 4 minutes. Let cool.\nDo Ahead Crunchies can be made 5 days ahead. Cover and chill.\nCrunchies can be made 5 days ahead. Cover and chill.",
        "ingredients": [
            "1/2 cup plain puffed brown rice",
            "1/4 cup unsweetened coconut flakes",
            "1 tablespoon virgin coconut oil, warmed to liquefy if needed",
            "1 1/2 teaspoons brown rice syrup or pure maple syrup",
            "2 teaspoons sesame seeds",
            "3/4 teaspoon poppy seeds",
            "1/2 teaspoon smoked paprika",
            "Kosher salt"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400°F.",
            "Toss 0.13 cup puffed brown rice, 0.06 cup coconut flakes, 0.25 tablespoon coconut oil, 0.38 teaspoon brown rice syrup, 0.5 teaspoon sesame seeds, 0.19 teaspoon poppy seeds, and 0.13 teaspoon smoked paprika on a rimmed baking sheet until rice and coconut are evenly coated.",
            "Season with salt.",
            "Roast in the oven until coconut is golden brown, about 4 minutes.",
            "Let the mixture cool."
        ],
        "processed_ingredients": [
            "0.13 cup plain puffed brown rice",
            "0.06 cup unsweetened coconut flakes",
            "0.25 tablespoon virgin coconut oil",
            "0.38 teaspoon brown rice syrup",
            "0.5 teaspoon sesame seeds",
            "0.19 teaspoon poppy seeds",
            "0.13 teaspoon smoked paprika",
            "0.06 teaspoon salt"
        ],
        "pure_ingredients": [
            "puffed brown rice",
            "coconut flakes",
            "coconut oil",
            "brown rice syrup",
            "sesame seeds",
            "poppy seeds",
            "paprika",
            "salt"
        ],
        "cooking_time": "4 minutes",
        "required_tools": [
            "oven",
            "rimmed baking sheet"
        ]
    },
    {
        "recipe_id": "swb19FjX6rNoUa73a/d4w6SqQr6POVW",
        "recipe_title": "Vanilla Ice Cream with Kiwi and Banana in Lime Rum Syrup ",
        "original_instructions": "In a small saucepan simmer water with sugar, rum, and zest 5 minutes. add kiwi and simmer 2 minutes. Cut banana into 1/4-inch slices and simmer in syrup 30 seconds. Transfer fruit with a slotted spoon to a bowl. Boil syrup until reduced to about 1/2 cup and stir in fruit.\nIn a small saucepan simmer water with sugar, rum, and zest 5 minutes. add kiwi and simmer 2 minutes. Cut banana into 1/4-inch slices and simmer in syrup 30 seconds. Transfer fruit with a slotted spoon to a bowl. Boil syrup until reduced to about 1/2 cup and stir in fruit.\nServe fruit and syrup over ice cream.\nServe fruit and syrup over ice cream.",
        "ingredients": [
            "1 cup water",
            "1/4 cup sugar",
            "1 tablespoon dark rum",
            "1/4 teaspoon freshly grated lime zest",
            "1 kiwi, peeled, quartered lengthwise, and cut into 1/4-inch-thick pieces",
            "1 small banana",
            "vanilla ice cream"
        ],
        "step_by_step_instructions": [
            "Simmer 0.25 cup water with 1 tablespoon sugar, 0.25 tablespoon dark rum, and 0.06 teaspoon lime zest in a small saucepan for 5 minutes.",
            "Add 0.25 kiwi, cut into 0.25-inch thick pieces, and simmer for 2 minutes.",
            "Cut 0.25 small banana into 0.25-inch slices and add to the syrup, simmering for 30 seconds.",
            "Transfer the fruit with a slotted spoon to a bowl.",
            "Boil the syrup until it reduces to about 0.125 cup.",
            "Stir the fruit back into the reduced syrup.",
            "Serve the fruit and syrup over a scoop of vanilla ice cream."
        ],
        "processed_ingredients": [
            "0.25 cup water",
            "1.00 tbsp sugar",
            "0.25 tbsp dark rum",
            "0.06 tsp lime zest",
            "0.25 kiwi",
            "0.25 small banana",
            "1.00 scoop vanilla ice cream"
        ],
        "pure_ingredients": [
            "water",
            "sugar",
            "rum",
            "lime",
            "kiwi",
            "banana",
            "ice cream"
        ],
        "cooking_time": "8 minutes",
        "required_tools": [
            "small saucepan",
            "slotted spoon",
            "bowl"
        ]
    },
    {
        "recipe_id": "ZChnSoXjPB/ZyKa5yeZa0uNDNGmDZfC",
        "recipe_title": "Rotini with Salsa di Limone",
        "original_instructions": "Bring a large pot of salted water to a boil over high heat. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes. Drain pasta, reserving 1 cup of the pasta water.\nPlace the hot pasta in a large bowl. Add the tomatoes, olive oil, lemon zest and juice, ricotta salata cheese, salt, pepper, and 1/2 cup of the pasta water. Toss to combine, adding the remaining pasta water, if desired. Serve.",
        "ingredients": [
            "1 pound rotini pasta",
            "1 1/4 pound Roma tomatoes, seeded and diced",
            "1/4 cup extra-virgin olive oil",
            "1 large lemon, zested and juiced",
            "1 cup crumbled ricotta salata cheese or feta cheese",
            "1 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Bring about 2 cups of salted water to a boil over high heat.",
            "Add approximately 2.67 oz of rotini pasta to the boiling water.",
            "Cook the pasta until tender but still firm to the bite, stirring occasionally, for about 8 to 10 minutes.",
            "Drain the pasta, reserving about 0.33 cup of the pasta water.",
            "Place the hot pasta in a large bowl.",
            "Add about 3.34 oz of diced Roma tomatoes to the pasta.",
            "Mix in about 0.5 tablespoon of extra-virgin olive oil.",
            "Add the zest and juice from about 0.25 of a lemon.",
            "Stir in approximately 0.13 cup of crumbled feta cheese.",
            "Season with about 0.13 teaspoon of salt and 0.06 teaspoon of freshly ground black pepper.",
            "Add about 0.06 cup of the reserved pasta water to the mixture and toss well to combine.",
            "Serve immediately."
        ],
        "processed_ingredients": [
            "2.67 oz rotini pasta",
            "3.34 oz Roma tomatoes",
            "0.5 tbsp extra-virgin olive oil",
            "0.25 large lemon",
            "0.13 cup crumbled feta cheese",
            "0.13 tsp salt",
            "0.06 tsp freshly ground black pepper",
            "0.33 cup pasta water"
        ],
        "pure_ingredients": [
            "pasta",
            "tomatoes",
            "olive oil",
            "lemon",
            "cheese",
            "salt",
            "pepper",
            "water"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "large pot",
            "bowl",
            "zester",
            "juicer",
            "stirring spoon",
            "measuring cups"
        ]
    },
    {
        "recipe_id": "qzrq..U4j96jO0XksjtegmUyVp/2bsa",
        "recipe_title": "Red Cabbage Slaw",
        "original_instructions": "Combine all ingredients, except cabbage, in a blender and blend until smooth. Season with salt and pepper, to taste. Place cabbage in a large bowl and toss with the vinaigrette. Season with salt and pepper and let sit 30 minutes in the refrigerator before serving.",
        "ingredients": [
            "1/2 cup freshly squeezed orange juice",
            "1/4 cup freshly squeezed lime juice",
            "1/2 small red onion, coarsely chopped",
            "2 cloves garlic, coarsely chopped",
            "1/4 cup fresh basil leaves",
            "2 tablespoons chopped cilantro leaves",
            "1 tablespoon honey",
            "1/2 cup canola oil",
            "Salt and pepper",
            "1/2 head red cabbage, finely shredded"
        ],
        "step_by_step_instructions": [
            "Combine all ingredients except cabbage in a blender and blend until smooth.",
            "Season the mixture with salt and pepper to taste.",
            "Place the cabbage in a large bowl.",
            "Toss the cabbage with the prepared vinaigrette.",
            "Season the cabbage with salt and pepper.",
            "Let the mixture sit for 30 minutes in the refrigerator before serving."
        ],
        "processed_ingredients": [
            "0.13 cup freshly squeezed orange juice",
            "0.06 cup freshly squeezed lime juice",
            "0.06 small red onion",
            "0.50 clove garlic",
            "0.06 cup fresh basil leaves",
            "0.50 tbsp chopped cilantro leaves",
            "0.25 tbsp honey",
            "0.13 cup canola oil",
            "0.25 head red cabbage",
            "1.00 tsp salt",
            "0.50 tsp pepper"
        ],
        "pure_ingredients": [
            "orange juice",
            "lime juice",
            "red onion",
            "garlic",
            "basil",
            "cilantro",
            "honey",
            "canola oil",
            "salt",
            "pepper",
            "red cabbage"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "blender",
            "large bowl",
            "refrigerator"
        ]
    },
    {
        "recipe_id": "KYgvAaBv5wB.MXMCO2hPo2sOAGTy0B6",
        "recipe_title": "Parmesan-Roasted Butternut Squash ",
        "original_instructions": "Preheat oven to 400°F with rack in middle. Toss squash with cream, sage, 1 teaspoon salt, and 1/4 teaspoon pepper in a 2-quart shallow baking dish. Bake, covered, 30 minutes. Stir in half of cheese and sprinkle remainder on top. Roast, uncovered, until squash is tender and beginning to brown, about 20 minutes. Let stand about 5 minutes before serving (cream will thicken).\nPreheat oven to 400°F with rack in middle.\nToss squash with cream, sage, 1 teaspoon salt, and 1/4 teaspoon pepper in a 2-quart shallow baking dish. Bake, covered, 30 minutes.\nStir in half of cheese and sprinkle remainder on top. Roast, uncovered, until squash is tender and beginning to brown, about 20 minutes. Let stand about 5 minutes before serving (cream will thicken).",
        "ingredients": [
            "2 1/2 pounds butternut squash, peeled and cut into 1-inch pieces",
            "3/4 cup heavy cream",
            "3 sage leaves",
            "2/3 cup finely grated parmigiano-reggiano"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400°F with the rack in the middle.",
            "Toss approximately 0.63 pounds of butternut squash with 3 tablespoons of heavy cream, 1 sage leaf, 0.25 teaspoons of salt, and a pinch of pepper in a smaller baking dish.",
            "Bake the mixture covered for 30 minutes.",
            "Stir in roughly 2.67 tablespoons of finely grated parmigiano-reggiano cheese.",
            "Sprinkle the remaining cheese on top.",
            "Roast uncovered until the squash is tender and beginning to brown, about 20 minutes.",
            "Let stand about 5 minutes before serving to allow the cream to thicken."
        ],
        "processed_ingredients": [
            "0.63 lb butternut squash",
            "3 tbsp heavy cream",
            "1 sage leaf",
            "0.25 tsp salt",
            "2.67 tbsp finely grated parmigiano-reggiano"
        ],
        "pure_ingredients": [
            "butternut squash",
            "heavy cream",
            "sage",
            "salt",
            "pepper",
            "parmigiano-reggiano"
        ],
        "cooking_time": "55 minutes",
        "required_tools": [
            "oven",
            "baking dish",
            "measuring spoons"
        ]
    },
    {
        "recipe_id": "SPl4SdBdKidTnX1ZJUlENMd9toBO4NK",
        "recipe_title": "Ginger-Spiced Buttered Rum Cocktail",
        "original_instructions": "In a medium bowl, use a wooden spoon to combine the sugar, butter, maple syrup, ground ginger and allspice. Mix until well combined.\nTransfer the mixture to a pitcher. Add the boiling water and rum. Divide the fresh ginger among 4 mugs or coffee cups and portion the cocktail. Serve hot.",
        "ingredients": [
            "3/4 cup dark brown sugar",
            "1 stick (8 tablespoons) unsalted butter",
            "3 tablespoons maple syrup",
            "1 teaspoon ground ginger",
            "1/8 teaspoon ground allspice",
            "2 cups boiling water",
            "6 ounces dark rum, such as Myers's",
            "4 slices fresh ginger"
        ],
        "step_by_step_instructions": [
            "In a medium bowl, use a wooden spoon to combine 3 tablespoons of dark brown sugar, 2 tablespoons of unsalted butter, 0.75 tablespoons of maple syrup, 0.25 teaspoon of ground ginger, and a pinch of ground allspice. Mix until well combined.",
            "Transfer the mixture to a pitcher.",
            "Add 0.5 cup of boiling water and 1.5 ounces of dark rum to the pitcher.",
            "Divide a slice of fresh ginger among one mug or coffee cup.",
            "Portion the cocktail into the mug or coffee cup.",
            "Serve hot."
        ],
        "processed_ingredients": [
            "3 tablespoon dark brown sugar",
            "2 tablespoon unsalted butter",
            "0.75 tablespoon maple syrup",
            "0.25 teaspoon ground ginger",
            "0.03 teaspoon ground allspice",
            "0.5 cup boiling water",
            "1.5 ounce dark rum",
            "0.25 ounce fresh ginger"
        ],
        "pure_ingredients": [
            "dark brown sugar",
            "butter",
            "maple syrup",
            "ginger",
            "allspice",
            "water",
            "rum"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "medium bowl",
            "wooden spoon",
            "pitcher",
            "mug or coffee cup"
        ]
    },
    {
        "recipe_id": "lDnHfh.OA67OM2rvAf7gjO3hMnua9S.",
        "recipe_title": "Lemon Bars",
        "original_instructions": "Bottom Lemon Cake: In mixing bowl, combine cake mix, pie filling, and coconut. Stir until thoroughly mixed (do not add any liquid). Spread this mixture in a 10 by 15-inch baking pan. Bake for 30 minutes in a preheated 350 degree F oven. Cool.\nTop Creamy Frosting: Combine all ingredients until blended well. Frost the Bottom Lemon Cake. Garnish with sprinkles of lemon zest and cut into 1 1/2 by 2 1/2-inch bars. Cover and refrigerate overnight for better flavoring.",
        "ingredients": [
            "16 ounces store bought angel food cake mix",
            "1 (22-ounce) can lemon pie filling",
            "1 cup finely shredded coconut",
            "8 ounces cream cheese, softened",
            "1/2 cup butter, softened",
            "2 1/2 cups powdered sugar",
            "1 teaspoon vanilla",
            "Lemon zest, for garnish"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "In a mixing bowl, combine 2.67 oz angel food cake mix, 3.67 oz lemon pie filling, and 0.17 cup finely shredded coconut. Stir until thoroughly mixed.",
            "Spread the mixture in a small baking dish.",
            "Bake for 30 minutes.",
            "Allow the cake to cool.",
            "In a separate bowl, combine 1 oz cream cheese, 0.06 cup butter, 0.42 cup powdered sugar, and 0.06 teaspoon vanilla. Blend well to make the frosting.",
            "Frost the cooled lemon cake with the creamy frosting.",
            "Garnish with a small amount of lemon zest.",
            "Cut into smaller bars, approximately 1 1/2 by 2 1/2 inches each.",
            "Cover and refrigerate overnight for better flavoring before serving."
        ],
        "processed_ingredients": [
            "2.67 oz angel food cake mix",
            "3.67 oz lemon pie filling",
            "0.17 cup coconut",
            "1 oz cream cheese",
            "0.06 cup butter",
            "0.42 cup powdered sugar",
            "0.06 teaspoon vanilla",
            "0.01 oz lemon zest"
        ],
        "pure_ingredients": [
            "cake mix",
            "lemon pie filling",
            "coconut",
            "cream cheese",
            "butter",
            "powdered sugar",
            "vanilla",
            "lemon zest"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "mixing bowl",
            "baking dish",
            "oven",
            "spatula",
            "knife",
            "refrigerator"
        ]
    },
    {
        "recipe_id": "tjRHMw.AGAprHSB6FOP6fKPsDBELYAy",
        "recipe_title": "Watermelon-Raspberry Breakfast Pops",
        "original_instructions": "Special equipment: Four 3- to 4-ounce ice pop molds\nCombine the raspberries, watermelon, coconut milk, honey, lime juice and salt in a blender and puree until smooth.\nDivide the mixture evenly among four 3- to 4-ounce ice pop molds and freeze until solid, at least 8 hours and preferably overnight. Let sit at room temperature for a few minutes before unmolding. Roll in toasted coconut or cocoa nibs if desired.\nThe pops will keep in the freezer for up to 2 weeks.",
        "ingredients": [
            "1 cup raspberries",
            "1 cup cubed seedless watermelon",
            "1/3 cup coconut milk (shake well before opening)",
            "3 tablespoons honey",
            "Juice of 1 lime",
            "Pinch kosher salt",
            "Toasted coconut or cocoa nibs, for serving, optional"
        ],
        "step_by_step_instructions": [
            "Shake the coconut milk well before opening.",
            "Combine 0.25 cup raspberries, 0.25 cup cubed seedless watermelon, 1 tablespoon coconut milk, 0.75 tablespoon honey, juice of 0.25 lime, and a pinch of salt in a blender.",
            "Puree the mixture until smooth.",
            "Pour the mixture into a single 3- to 4-ounce ice pop mold.",
            "Freeze the mold until solid, at least 8 hours or preferably overnight.",
            "Let the ice pop sit at room temperature for a few minutes before unmolding.",
            "Optional: Roll the unmolded ice pop in toasted coconut."
        ],
        "processed_ingredients": [
            "0.25 cup raspberries",
            "0.25 cup watermelon",
            "1 tablespoon coconut milk",
            "0.75 tablespoon honey",
            "0.25 lime",
            "0.1 teaspoon salt",
            "0.5 tablespoon toasted coconut"
        ],
        "pure_ingredients": [
            "raspberries",
            "watermelon",
            "coconut milk",
            "honey",
            "lime",
            "salt",
            "coconut"
        ],
        "cooking_time": "8 hours",
        "required_tools": [
            "blender",
            "ice pop mold"
        ]
    },
    {
        "recipe_id": "4/yrLrgOjtN6dU7E0Rvg.uq7XW6pAZ.",
        "recipe_title": "Gina's Spicy Creamed Spinach",
        "original_instructions": "Bring a pot of salted water to a boil over high heat. Add the spinach and simmer for 2 minutes. Drain the spinach in a colander. Press down on the spinach with a clean kitchen towel to release all of the liquid. Remove to a cutting board and roughly chop.\nHeat a large saute pan, over medium-high heat and add the butter and olive oil. When the butter has melted, add the shallots and garlic and saute until fragrant and tender. Stir in the red pepper flakes and spinach. Sprinkle with salt and pepper, to taste. Saute briefly, then add the heavy cream, nutmeg and Parmesan. Reduce the spinach mixture until it has thickened, about 2 minutes. Transfer to a serving bowl and serve.",
        "ingredients": [
            "3 bunches fresh spinach, washed well, rough stems removed",
            "2 tablespoons butter",
            "2 tablespoons extra-virgin olive oil",
            "2 shallots, chopped",
            "3 cloves garlic, chopped",
            "1 1/2 teaspoons red pepper flakes",
            "3/4 cup heavy whipping cream",
            "1/4 teaspoon freshly ground nutmeg",
            "1/4 cup freshly grated Parmesan",
            "Salt and freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Bring a pot of salted water to a boil over high heat.",
            "Add approximately 1 bunch of spinach and simmer for 2 minutes.",
            "Drain the spinach in a colander.",
            "Press down on the spinach with a clean kitchen towel to release all of the liquid.",
            "Remove to a cutting board and roughly chop the spinach.",
            "Heat a large saute pan over medium-high heat and add about 0.67 tablespoons of butter and 0.67 tablespoons of olive oil.",
            "When the butter has melted, add approximately 0.67 of a chopped shallot and 1 chopped garlic clove.",
            "Saute until fragrant and tender.",
            "Stir in about 0.5 teaspoon of red pepper flakes and the chopped spinach.",
            "Sprinkle with salt and pepper to taste.",
            "Saute briefly, then add approximately 0.25 cup of heavy cream, 0.08 teaspoon of nutmeg, and 0.08 cup of grated Parmesan.",
            "Reduce the spinach mixture until it has thickened, about 2 minutes.",
            "Transfer to a serving bowl and serve."
        ],
        "processed_ingredients": [
            "1 bunch spinach",
            "0.67 tablespoon butter",
            "0.67 tablespoon extra-virgin olive oil",
            "0.67 shallot",
            "1 clove garlic",
            "0.5 teaspoon red pepper flakes",
            "0.25 cup heavy whipping cream",
            "0.08 teaspoon nutmeg",
            "0.08 cup Parmesan",
            "1 teaspoon salt",
            "1 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "spinach",
            "butter",
            "olive oil",
            "shallot",
            "garlic",
            "red pepper flakes",
            "heavy cream",
            "nutmeg",
            "Parmesan",
            "salt",
            "black pepper"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "pot",
            "colander",
            "kitchen towel",
            "cutting board",
            "saute pan",
            "serving bowl"
        ]
    },
    {
        "recipe_id": "t01zR4qH4YvaeAjXNYtyNo16vbYi8iK",
        "recipe_title": "Par 3 Potatoes with Grilled Baby Bok Choy",
        "original_instructions": "Heat the oil in a deep-fryer to 350 degrees F. Heat grill.\nGrill bell peppers until it begins to char in a few spots. Grill bok choy, turning to grill on all sides until the stalks show signs of caramelization. Deep-fry red potato halves until the cut sides are golden and they are tender inside. Drain potatoes on paper toweling. Cut bell peppers into strips and slice tough stem end off the bok choy. Combine peppers, bok choy and potatoes in a bowl. Season with salt and pepper.",
        "ingredients": [
            "1 liter canola oil, for deep frying",
            "3 large yellow bell peppers, halved and seeds and stems removed",
            "4 heads baby bok choy, rinsed but left as a bunch",
            "8 small (3 to 4 inch diameter) red potatoes, skin on, scrubbed and halved"
        ],
        "step_by_step_instructions": [
            "Heat 125 ml of canola oil in a deep fryer to 350 degrees F.",
            "Heat a grill.",
            "Grill half of a yellow bell pepper until it begins to char in a few spots.",
            "Grill 1 head of baby bok choy, turning to grill on all sides until the stalks show signs of caramelization.",
            "Deep-fry 1 small red potato half until the cut side is golden and the inside is tender.",
            "Drain the potato on paper toweling.",
            "Cut the grilled bell pepper into strips.",
            "Slice the tough stem end off the grilled bok choy.",
            "Combine the bell pepper strips, grilled bok choy, and fried potato half in a bowl.",
            "Season with salt and pepper to taste."
        ],
        "processed_ingredients": [
            "125.00 ml canola oil",
            "0.50 piece yellow bell pepper",
            "1.00 head baby bok choy",
            "1.00 piece red potato",
            "1.00 tsp salt",
            "1.00 tsp pepper"
        ],
        "pure_ingredients": [
            "oil",
            "bell pepper",
            "bok choy",
            "potato",
            "salt",
            "pepper"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "deep fryer",
            "grill",
            "bowl",
            "paper towels",
            "knife"
        ]
    },
    {
        "recipe_id": "CKSkmL1FhncEIq96OUEIPeLxaM8SOYW",
        "recipe_title": "Big Apple Borscht",
        "original_instructions": "Heat grapeseed oil over medium heat in a large pot and add onion and garlic, sauteing them until they are translucent. Add beets and cucumber, and cover with 6 cups water. Season with salt and pepper. Bring to a boil and cook until tender, about 45 minutes. Remove from heat and bring to room temperature.\nAdd orange juice and blend with an immersion blender, or in batches in a conventional blender. Season with salt and pepper, to taste. Stir in lime juice and chill.\nSpoon into serving bowls, garnish with a dollop of sour cream and sprinkle with dill pickle.",
        "ingredients": [
            "2 tablespoons grapeseed oil",
            "1 medium onion, chopped",
            "6 garlic cloves, lightly crushed with the side of a knife blade",
            "3 pounds fresh beets, peeled and quartered",
            "2 English cucumbers, peeled and diced",
            "Salt and freshly ground black pepper",
            "2 cups orange juice",
            "1 fresh lime, juiced",
            "1/2 cup sour cream",
            "2 tablespoons chopped dill pickle"
        ],
        "step_by_step_instructions": [
            "Heat 0.25 tablespoon grapeseed oil over medium heat in a large pot.",
            "Add 0.17 medium onion, chopped, and 1 garlic clove, lightly crushed with the side of a knife blade, and sauté until translucent.",
            "Add 0.5 pounds fresh beets, peeled and quartered, and 0.33 English cucumber, peeled and diced.",
            "Cover with 1 cup water.",
            "Season with salt and pepper.",
            "Bring to a boil and cook until tender, about 45 minutes.",
            "Remove from heat and bring to room temperature.",
            "Add 0.33 cup orange juice and blend with an immersion blender, or in batches in a conventional blender.",
            "Season again with salt and pepper, to taste.",
            "Stir in 0.17 fresh lime, juiced, and chill.",
            "Spoon into a serving bowl, garnish with a dollop of 0.08 cup sour cream, and sprinkle with 0.33 tablespoon chopped dill pickle."
        ],
        "processed_ingredients": [
            "0.25 tablespoon grapeseed oil",
            "0.17 medium onion",
            "1 clove garlic",
            "0.5 pounds beets",
            "0.33 cucumber",
            "1 cup water",
            "0.33 cup orange juice",
            "0.17 unit lime",
            "0.08 cup sour cream",
            "0.33 tablespoon dill pickle",
            "1 teaspoon salt",
            "1 teaspoon pepper"
        ],
        "pure_ingredients": [
            "grapeseed oil",
            "onion",
            "garlic",
            "beets",
            "cucumber",
            "water",
            "salt",
            "pepper",
            "orange juice",
            "lime",
            "sour cream",
            "dill pickle"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "large pot",
            "knife",
            "immersion blender",
            "serving bowl"
        ]
    },
    {
        "recipe_id": "OlKVjSweheuQ/BAYXkLA6CgigCv1Txa",
        "recipe_title": "Grilled Corn on the Cob",
        "original_instructions": "Prepare a charcoal grill with a single layer of hot coals.\nPeel back the husk from the corn and remove the silk. Brush the kernels with the melted butter and replace the husk to cover the ear of corn.\nGrill the corn for a total of 20 minutes, turning it every 5 minutes. Remove the ear from the grill and carefully peel back the husk. Sprinkle the kernels with salt and serve.",
        "ingredients": [
            "1 ear fresh corn on the cob, with the husk",
            "1 teaspoon unsalted butter, melted",
            "Kosher salt"
        ],
        "step_by_step_instructions": [
            "Prepare a charcoal grill with a single layer of hot coals.",
            "Peel back the husk from 1 ear of corn and remove the silk.",
            "Brush the kernels with 1 teaspoon of melted butter and replace the husk to cover the ear of corn.",
            "Grill the corn for a total of 20 minutes, turning it every 5 minutes.",
            "Remove the ear from the grill and carefully peel back the husk.",
            "Sprinkle the kernels with salt and serve."
        ],
        "processed_ingredients": [
            "1 ear corn",
            "1 teaspoon butter",
            "1 teaspoon salt"
        ],
        "pure_ingredients": [
            "corn",
            "butter",
            "salt"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "charcoal grill",
            "brush",
            "tongs"
        ]
    },
    {
        "recipe_id": "6pwZ0/WVfZqhtuu4TIQ1tu0MUPL1Lne",
        "recipe_title": "Dollar Martini",
        "original_instructions": "In a large pitcher, combine vodka, water, limeade and lemon juice. Pour into martini glasses.",
        "ingredients": [
            "1 cup vodka",
            "1 cup water",
            "1 (8-ounce) can frozen limeade",
            "2 tablespoon lemon juice"
        ],
        "step_by_step_instructions": [
            "In a large pitcher, combine 0.25 cup vodka, 0.25 cup water, 2 ounces frozen limeade, and 0.5 tablespoon lemon juice.",
            "Mix well until the ingredients are fully combined.",
            "Pour the mixture into a martini glass."
        ],
        "processed_ingredients": [
            "0.25 cup vodka",
            "0.25 cup water",
            "2.00 ounce frozen limeade",
            "0.50 tablespoon lemon juice"
        ],
        "pure_ingredients": [
            "vodka",
            "water",
            "limeade",
            "lemon juice"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "large pitcher",
            "martini glass"
        ]
    },
    {
        "recipe_id": "Y6C6FC0jhIuUac7d1O.nwvoGsm3zGBC",
        "recipe_title": "Pane, Zucchero, Vino",
        "original_instructions": "Drizzle your bread with the wine, and then sprinkle evenly with the sugar.",
        "ingredients": [
            "6 slices bread",
            "1 cup red wine",
            "1/4 cup sugar"
        ],
        "step_by_step_instructions": [
            "Take 1 slice of bread and place it on a flat surface.",
            "Drizzle approximately 0.17 cup of red wine evenly over the slice of bread.",
            "Sprinkle about 0.04 cup of sugar evenly over the wine-soaked bread."
        ],
        "processed_ingredients": [
            "1 slice bread",
            "0.17 cup red wine",
            "0.04 cup sugar"
        ],
        "pure_ingredients": [
            "bread",
            "red wine",
            "sugar"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "knife",
            "spoon"
        ]
    },
    {
        "recipe_id": "elP8zMVkuthLRvwJuOfNgMb33uvrWr.",
        "recipe_title": "Dirty Martini",
        "original_instructions": "Shake ingredients with ice in cocktail shaker and strain. Serve chilled.",
        "ingredients": [
            "2 1/2 shots Gin",
            "1/2 shot of brine from cocktail olives",
            "1/8 shot extra-dry Vermouth"
        ],
        "step_by_step_instructions": [
            "Measure 2 1/2 shots of gin.",
            "Measure 1/2 shot of brine from cocktail olives.",
            "Measure 1/8 shot of extra-dry vermouth.",
            "Combine all measured ingredients in a cocktail shaker.",
            "Add ice to the cocktail shaker.",
            "Shake the cocktail shaker to mix the ingredients thoroughly.",
            "Strain the mixture into a chilled glass.",
            "Serve the drink chilled."
        ],
        "processed_ingredients": [
            "2.50 ounce gin",
            "0.50 ounce brine from cocktail olives",
            "0.13 ounce extra-dry vermouth"
        ],
        "pure_ingredients": [
            "gin",
            "brine",
            "olives",
            "vermouth"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "cocktail shaker",
            "strainer",
            "measuring tool",
            "glass"
        ]
    },
    {
        "recipe_id": ".8RIH2afwKKSljRdg25mO7k3wgwqOF6",
        "recipe_title": "Loukanika with Sausage, Pepper and Eggs",
        "original_instructions": "Heat the olive oil in a nonstick pan over medium-high heat. Add the sausage and peppers and cook until sausage starts to brown, about 2 to 3 minutes. Add the chopped onions and cook, stirring, until onions are translucent, about 5 minutes. Add garlic and tomatoes and cook until tomatoes release their juices, about 5 minutes. Add the eggs and scallions and fold together gently with a rubber spatula. When well blended, season with salt and pepper and serve hot.",
        "ingredients": [
            "4 tablespoons olive oil",
            "1 pound Loukanika sausage, large dice",
            "1 medium red pepper, small dice",
            "1 yellow onion, chopped",
            "3 cloves garlic, chopped",
            "1/2 pound plum tomatoes, chopped",
            "4 eggs, beaten",
            "2 tablespoons chopped scallions",
            "Kosher salt",
            "Freshly ground black pepper"
        ],
        "step_by_step_instructions": [
            "Heat 1 tablespoon of olive oil in a nonstick pan over medium-high heat.",
            "Add 0.25 pound of Loukanika sausage and 0.25 of a red pepper to the pan and cook until sausage starts to brown, about 2 to 3 minutes.",
            "Add 0.25 of a yellow onion, chopped, to the pan and cook, stirring, until onions are translucent, about 5 minutes.",
            "Add 0.75 cloves of garlic and 2 ounces of chopped plum tomatoes to the pan and cook until tomatoes release their juices, about 5 minutes.",
            "Add 1 egg and 0.5 tablespoons of chopped scallions to the pan and fold together gently with a rubber spatula.",
            "When well blended, season with salt and pepper to taste and serve hot."
        ],
        "processed_ingredients": [
            "1 tablespoon olive oil",
            "0.25 pound Loukanika sausage",
            "0.25 red pepper",
            "0.25 yellow onion",
            "0.75 cloves garlic",
            "2 ounces plum tomatoes",
            "1 egg",
            "0.5 tablespoon scallions",
            "0.25 teaspoon salt",
            "0.25 teaspoon black pepper"
        ],
        "pure_ingredients": [
            "olive oil",
            "sausage",
            "pepper",
            "onion",
            "garlic",
            "tomatoes",
            "eggs",
            "scallions",
            "salt",
            "black pepper"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "nonstick pan",
            "rubber spatula"
        ]
    },
    {
        "recipe_id": "WvQELPv8bFGVRzEx2p86K90wKF9pqQ.",
        "recipe_title": "Slow-Cooker Chile Con Queso",
        "original_instructions": "Watch how to make this recipe.\nBrown the beef in a large skillet over medium-high heat, 10 to 15 minutes. Add the chili powder and garlic powder and stir to combine. Add 1/4 cup water and let simmer until evaporated.\nTransfer the beef to a slow cooker. Stir in the cheese and salsa. Cover and let cook on high until melted, about 1 hour.\nServe with tortilla chips.",
        "ingredients": [
            "1 pound ground beef",
            "3 tablespoons chili powder",
            "1 teaspoon garlic powder",
            "One 32-ounce block processed cheese, such as Velveeta, cubed",
            "One 16-ounce jar salsa",
            "Tortilla chips, for serving"
        ],
        "step_by_step_instructions": [
            "1. In a large skillet, brown approximately 0.25 lb of ground beef over medium-high heat for 10 to 15 minutes.",
            "2. Add 0.75 tablespoons of chili powder and 0.25 teaspoon of garlic powder to the beef and stir to combine.",
            "3. Pour in 1 tablespoon of water and let the mixture simmer until the water evaporates.",
            "4. Transfer the beef mixture to a slow cooker.",
            "5. Stir in about 8 ounces of cubed processed cheese and 4 ounces of salsa.",
            "6. Cover the slow cooker and cook on high for about 1 hour until the cheese is melted.",
            "7. Serve the mixture with tortilla chips."
        ],
        "processed_ingredients": [
            "0.25 lb ground beef",
            "0.75 tablespoon chili powder",
            "0.25 teaspoon garlic powder",
            "8 ounce processed cheese",
            "4 ounce salsa",
            "1 tablespoon water",
            "3 ounce tortilla chips"
        ],
        "pure_ingredients": [
            "beef",
            "chili",
            "garlic",
            "cheese",
            "salsa",
            "tortilla",
            "water"
        ],
        "cooking_time": "85 minutes",
        "required_tools": [
            "skillet",
            "slow cooker",
            "stirring spoon",
            "measuring spoons",
            "knife"
        ]
    },
    {
        "recipe_id": "uNS1nO2RxzOgm18Muxq7oYkR46Txsqe",
        "recipe_title": "Spicy Red-Pepper and Eggplant Confit ",
        "original_instructions": "Put oven rack in middle position and preheat oven to 400°F. Cut peppers into 1-inch pieces. Toss together all ingredients in a large roasting pan, then spread evenly. Roast, stirring occasionally, until vegetables are very tender, about 1 hour. Cool before serving.\nPut oven rack in middle position and preheat oven to 400°F.\nCut peppers into 1-inch pieces. Toss together all ingredients in a large roasting pan, then spread evenly. Roast, stirring occasionally, until vegetables are very tender, about 1 hour. Cool before serving.",
        "ingredients": [
            "2 lb red bell peppers,tender-roasted",
            "1 (1 1/2-lb) eggplant, peeled and cut into 1-inch pieces",
            "4 large garlic cloves, smashed",
            "1 (28-oz) can whole tomatoes in juice, drained and coarsely chopped",
            "1 cup extra-virgin olive oil",
            "3/4 teaspoon salt",
            "1/2 teaspoon dried hot red-pepper flakes"
        ],
        "step_by_step_instructions": [
            "1. Preheat your oven to 400°F and position the oven rack in the middle.",
            "2. Cut approximately 0.33 lb of red bell pepper into 1-inch pieces.",
            "3. Peel and cut about 0.25 lb of eggplant into 1-inch pieces.",
            "4. Smash 1 large garlic clove.",
            "5. Drain and coarsely chop about 4.67 oz of whole tomatoes from a can.",
            "6. In a large roasting pan, combine the prepared red bell pepper, eggplant, garlic, tomatoes, 0.17 cup of extra-virgin olive oil, 0.13 teaspoon of salt, and 0.08 teaspoon of dried hot red-pepper flakes.",
            "7. Toss the ingredients together and spread them evenly in the roasting pan.",
            "8. Roast the vegetables in the oven, stirring occasionally, for about 1 hour or until very tender.",
            "9. Allow the vegetables to cool before serving."
        ],
        "processed_ingredients": [
            "0.33 lb red bell peppers",
            "0.25 lb eggplant",
            "1 g garlic",
            "4.67 oz whole tomatoes",
            "0.17 cup extra-virgin olive oil",
            "0.13 tsp salt",
            "0.08 tsp dried hot red-pepper flakes"
        ],
        "pure_ingredients": [
            "red bell peppers",
            "eggplant",
            "garlic",
            "tomatoes",
            "olive oil",
            "salt",
            "pepper flakes"
        ],
        "cooking_time": "1 hour",
        "required_tools": [
            "oven",
            "roasting pan",
            "knife",
            "cutting board",
            "spoon"
        ]
    },
    {
        "recipe_id": "lOztEE/1Af/r94bV2zJroc1HAZ7m8Eu",
        "recipe_title": "Rice-Hash Cakes",
        "original_instructions": "Preheat oven to 350 degrees F.\nMelt the butter in a saucepan. When hot and bubbly, and the onion, carrot and celery. Cook until the vegetables begin to soften. Add the beef, potato and mushrooms and cook for an additional 4 minutes. Transfer the mixture to a bowl, mix in the rice, sprinkle with the flour and then with the broth. Mix in the egg. Sprinkle with salt and pepper.\nLightly butter a baking sheet. Using a lightly oiled bowl for a mold, pack about 1 1/2 cups of the mixture into a lightly oiled small bowl and turn out onto the baking dish. Repeat 3 times for 4 hash cakes.\nAlternatively, these can be hand shaped. Lightly dusted with additional flour and sauteed in your grandmother's heirloom cast iron skillet.",
        "ingredients": [
            "3 tablespoons butter",
            "1/2 pound roast pork or beef, cut 1/2-inch cubes (more or less)",
            "1 cup cooked and diced potato, cut 1/2-inch cubes",
            "1 cup small diced onion",
            "1/4 cup small diced carrot",
            "1/4 cup small diced celery",
            "1 cup sliced raw mushrooms",
            "1/2 cup chicken or beef broth",
            "1 cup cooked and drained rice",
            "2 tablespoons all-purpose flour",
            "1 egg, lightly beaten",
            "Salt and pepper, to taste"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350 degrees F.",
            "Melt 0.75 tablespoons of butter in a saucepan.",
            "When hot and bubbly, add 0.25 cup of diced onion, 1 tablespoon of diced carrot, and 1 tablespoon of diced celery.",
            "Cook until the vegetables begin to soften.",
            "Add 0.12 lb of beef, 0.25 cup of diced potato, and 0.25 cup of sliced mushrooms.",
            "Cook for an additional 4 minutes.",
            "Transfer the mixture to a bowl.",
            "Mix in 0.25 cup of cooked rice.",
            "Sprinkle with 0.5 tablespoon of flour and then with 0.12 cup of broth.",
            "Mix in 0.25 of a beaten egg.",
            "Sprinkle with salt and pepper to taste.",
            "Lightly butter a baking sheet.",
            "Using a lightly oiled bowl as a mold, pack about 0.38 cup of the mixture into the bowl and turn out onto the baking dish.",
            "Repeat to form 1 hash cake.",
            "Alternatively, shape by hand.",
            "Lightly dust with additional flour and sauté in a skillet if preferred."
        ],
        "processed_ingredients": [
            "0.75 tablespoon butter",
            "0.12 lb beef",
            "0.25 cup potato",
            "0.25 cup onion",
            "1 tablespoon carrot",
            "1 tablespoon celery",
            "0.25 cup mushrooms",
            "0.12 cup broth",
            "0.25 cup rice",
            "0.5 tablespoon flour",
            "0.25 egg",
            "0.5 teaspoon salt",
            "0.25 teaspoon pepper"
        ],
        "pure_ingredients": [
            "butter",
            "pork",
            "beef",
            "potato",
            "onion",
            "carrot",
            "celery",
            "mushrooms",
            "broth",
            "rice",
            "flour",
            "egg",
            "salt",
            "pepper"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "oven",
            "saucepan",
            "bowl",
            "baking sheet",
            "skillet"
        ]
    },
    {
        "recipe_id": "IG/2j03wNnGeKEn9EAjffGTdlqx31R6",
        "recipe_title": "Roast Beef Wrap",
        "original_instructions": "Stir together sour cream and horseradish in a small bowl.\nTo assemble, spread a tortilla evenly with 1 heaping tablespoon of the horseradish mixture. Cover with watercress and a quarter of the roast beef, making sure the ingredients don't quite touch the edges. Spread another heaping tablespoon of the horseradish mixture over the top, followed by a quarter of the apples and 1 tablespoon of blue cheese. Roll up the tortilla. Complete the wraps with the remaining ingredients. Cut in half on the bias.\nThese wraps can be made a day ahead, sealed in wax paper or foil and refrigerated. Serve cold or at room temperature.",
        "ingredients": [
            "2/3 cup plain sour cream",
            "2 tablespoons drained bottled horseradish, to taste",
            "4 flour burrito-size tortillas or lavash (an Armenian soft bread)",
            "1 bunch watercress",
            "1 pound sliced roast beef",
            "1 firm apple, like Granny Smith or Cortland, cored and sliced into very thin wedges",
            "4 tablespoons crumbled blue cheese"
        ],
        "step_by_step_instructions": [
            "Mix 2 tablespoons of sour cream with 1 teaspoon of horseradish in a small bowl.",
            "Spread 1/4 of the tortilla with approximately 1/2 tablespoon of the horseradish mixture.",
            "Layer a small amount of watercress over the spread.",
            "Add about 4 ounces of roast beef evenly over the watercress.",
            "Spread another 1/2 tablespoon of the horseradish mixture over the roast beef.",
            "Top with approximately 1/4 of the sliced apple wedges.",
            "Sprinkle 1/4 tablespoon of blue cheese over the apples.",
            "Roll up the tortilla tightly.",
            "Repeat the process for one complete wrap.",
            "Cut the wrap in half diagonally."
        ],
        "processed_ingredients": [
            "2 tablespoon sour cream",
            "1 teaspoon horseradish",
            "1 piece tortilla",
            "10 g watercress",
            "4 oz roast beef",
            "0.25 piece apple",
            "1/4 tablespoon blue cheese"
        ],
        "pure_ingredients": [
            "sour cream",
            "horseradish",
            "tortilla",
            "watercress",
            "beef",
            "apple",
            "cheese"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "bowl",
            "spoon",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "mbnIUaFrIsSv10SNJ4jU.8gEUiImTku",
        "recipe_title": "Poached Pears with Creamy Pecan Sauce",
        "original_instructions": "To poach the pears: In a large pot, combine the water and sugar over medium-high heat. Using a vegetable peeler, cut wide strips of lemon zest from the lemon and add to the pot along with the juice of the whole lemon. Bring the mixture to a boil, stirring to dissolve the sugar, then reduce the heat to maintain a gentle simmer. Submerge pears in the simmering liquid, adding more water, if necessary, to just cover the pears. Cut a piece of parchment paper into a circle just large enough to cover the pot. Ease the paper down into the pot until it is touching the surface of the liquid. Simmer the pears until a knife inserted directly into a pear meets little resistance, about 30 minutes. Remove the pot from the heat and cool the pears completely in the poaching liquid.\nTo make the sauce: In a saucepan, over high heat, combine the brown sugar and water and bring it to a boil. Reduce heat to medium and simmer until the sauce is reduced, thicker and takes on a dark golden brown color, about 8 to 10 minutes. Carefully stir in cream, reduce the heat to medium-low and simmer until very thick, 2 to 3 minutes more. Stir in the toasted pecans and salt.\nServe 1 to 2 pear halves per person, drizzled with the creamy pecan caramel sauce.",
        "ingredients": [
            "5 cups water, plus more as needed",
            "1/2 cup packed light brown sugar",
            "6 ripe but firm pears, such as Bosc or Anjou, peeled, halved lengthwise and cored",
            "1 lemon",
            "3/4 cup packed light brown sugar",
            "1/2 cup water",
            "1/2 cup heavy cream",
            "1 cup toasted pecan halves",
            "Pinch kosher salt"
        ],
        "step_by_step_instructions": [
            "In a small pot, combine 0.83 cups water and 0.05 cups packed light brown sugar over medium-high heat.",
            "Using a vegetable peeler, cut a strip of lemon zest and add to the pot along with the juice from approximately 0.17 of a lemon.",
            "Bring the mixture to a boil, stirring to dissolve the sugar, then reduce the heat to maintain a gentle simmer.",
            "Submerge approximately 1 pear half in the simmering liquid, adding more water if necessary to just cover the pear.",
            "Cut a piece of parchment paper into a circle just large enough to cover the pot and place it on the surface of the liquid.",
            "Simmer the pear until a knife inserted directly into the pear meets little resistance, about 30 minutes.",
            "Remove the pot from the heat and cool the pear completely in the poaching liquid.",
            "In a small saucepan over high heat, combine 0.13 cups packed light brown sugar and 0.08 cups water, and bring it to a boil.",
            "Reduce heat to medium and simmer until the sauce is reduced, thicker, and takes on a dark golden brown color, about 8 to 10 minutes.",
            "Carefully stir in 0.08 cups heavy cream, reduce the heat to medium-low, and simmer until very thick, 2 to 3 minutes more.",
            "Stir in approximately 0.17 cups toasted pecan halves and a small pinch of kosher salt.",
            "Serve 1 pear half per person, drizzled with the creamy pecan caramel sauce."
        ],
        "processed_ingredients": [
            "0.83 cup water",
            "0.05 cup packed light brown sugar",
            "0.17 lemon",
            "0.13 cup packed light brown sugar",
            "0.08 cup water",
            "0.08 cup heavy cream",
            "0.17 cup toasted pecan halves",
            "1 pinch kosher salt",
            "1 pear"
        ],
        "pure_ingredients": [
            "water",
            "light brown sugar",
            "lemon",
            "heavy cream",
            "pecans",
            "salt",
            "pears"
        ],
        "cooking_time": "55 minutes",
        "required_tools": [
            "large pot",
            "vegetable peeler",
            "parchment paper",
            "knife",
            "small pot",
            "saucepan"
        ]
    },
    {
        "recipe_id": "F5ifI/WpDJxtUWfmdyA7pRyYnJiv7wa",
        "recipe_title": "Smoked Paprika Dry-Rubbed Pulled Pork Sandwiches",
        "original_instructions": "For the pulled pork: Mix the paprika, pepper, salt, chili powder, garlic powder and brown sugar in a bowl. Rub all over the pork. Cover and refrigerate for 1 hour or up to overnight.\nPreheat the oven to 300 degrees F. Pour the beer into a roasting pan. Place the pork in the pan, cover with foil and bake until an instant-read thermometer inserted into the thickest part registers 170 degrees F, about 6 hours. Remove the pork from the oven and let the meat rest for at least 20 minutes.\nHeat the barbeque sauce in a saucepan over low heat. Keep warm. Shred the pork using two forks. In a large bowl, toss the pork with the warm barbeque sauce until well coated.\nFor the coleslaw: Whisk together the mayonnaise, vinegar and granulated sugar in a large bowl. Add the cabbage and carrots and toss to coat. Season with salt and pepper, cover and refrigerate for at least 1 hour. The coleslaw can be made up to 2 hours in advance.\nTo serve, spoon the pulled pork mixture onto the bottom half of a brioche bun, and top with some coleslaw and the other bun half.",
        "ingredients": [
            "3 tablespoons smoked paprika",
            "2 tablespoons coarsely ground black pepper",
            "2 tablespoons coarse salt",
            "1 tablespoon chili powder",
            "1 tablespoon garlic powder",
            "1 tablespoon brown sugar",
            "One 5- to 7-pound Boston pork butt",
            "Two 12-ounce bottles wheat ale beer",
            "1 cup store-bought barbeque sauce",
            "1 1/4 cups mayonnaise",
            "1/3 cup rice wine vinegar",
            "2 teaspoons granulated sugar",
            "2 1/2 pounds green cabbage, cored and finely shredded",
            "1 large carrot, coarsely grated",
            "Kosher salt and freshly ground black pepper",
            "12 brioche buns, split"
        ],
        "step_by_step_instructions": [
            "Mix 0.38 tablespoons of smoked paprika, 0.25 tablespoons of coarsely ground black pepper, 0.25 tablespoons of coarse salt, 0.13 tablespoons of chili powder, 0.13 tablespoons of garlic powder, and 0.13 tablespoons of brown sugar in a bowl.",
            "Rub the mixture all over a 0.63 lb portion of pork.",
            "Cover and refrigerate the pork for 1 hour or up to overnight.",
            "Preheat the oven to 300 degrees F.",
            "Pour 3 ounces of wheat ale beer into a small roasting pan.",
            "Place the pork in the pan, cover with foil, and bake until an instant-read thermometer inserted into the thickest part registers 170 degrees F, about 6 hours.",
            "Remove the pork from the oven and let the meat rest for at least 20 minutes.",
            "Heat 0.08 cups of barbeque sauce in a saucepan over low heat and keep it warm.",
            "Shred the pork using two forks.",
            "In a large bowl, toss the shredded pork with the warm barbeque sauce until well coated.",
            "Whisk together 0.10 cups of mayonnaise, 0.03 cups of rice wine vinegar, and 0.17 teaspoons of granulated sugar in a large bowl.",
            "Add 0.21 pounds of finely shredded green cabbage and 0.08 ounces of coarsely grated carrot and toss to coat.",
            "Season the coleslaw with salt and pepper, cover, and refrigerate for at least 1 hour.",
            "Spoon the pulled pork mixture onto the bottom half of a brioche bun, top with some coleslaw, and add the other bun half."
        ],
        "processed_ingredients": [
            "0.38 tablespoon smoked paprika",
            "0.25 tablespoon coarsely ground black pepper",
            "0.25 tablespoon coarse salt",
            "0.13 tablespoon chili powder",
            "0.13 tablespoon garlic powder",
            "0.13 tablespoon brown sugar",
            "0.63 lb Boston pork butt",
            "3 ounce wheat ale beer",
            "0.08 cup barbeque sauce",
            "0.10 cup mayonnaise",
            "0.03 cup rice wine vinegar",
            "0.17 teaspoon granulated sugar",
            "0.21 lb green cabbage",
            "0.08 ounce carrot",
            "1 brioche bun"
        ],
        "pure_ingredients": [
            "paprika",
            "black pepper",
            "salt",
            "chili powder",
            "garlic powder",
            "brown sugar",
            "pork",
            "beer",
            "barbeque sauce",
            "mayonnaise",
            "vinegar",
            "sugar",
            "cabbage",
            "carrot",
            "brioche bun"
        ],
        "cooking_time": "8 hours",
        "required_tools": [
            "bowl",
            "refrigerator",
            "oven",
            "roasting pan",
            "foil",
            "instant-read thermometer",
            "saucepan",
            "forks",
            "large bowl"
        ]
    },
    {
        "recipe_id": "BVCjlG2WrqvOhFxu3lDOJVD6Pa5/T9q",
        "recipe_title": "Sour Cherry Tartlets ",
        "original_instructions": "Make pastry: Mix first 4 ingredients in medium bowl. Add butter. Rub in with fingers until butter is size of small peas. Add egg; mix until dough comes together. Gather into ball. Shape into 5-inch-long log. Wrap in waxed paper; chill 1 hour.\nMix first 4 ingredients in medium bowl. Add butter. Rub in with fingers until butter is size of small peas. Add egg; mix until dough comes together. Gather into ball. Shape into 5-inch-long log. Wrap in waxed paper; chill 1 hour.\nMake pastry cream: Whisk yolks and 1/4 cup sugar in heavy small saucepan. Whisk in flour, then milk. Add lemon peel. Bring to boil over medium-high heat, whisking constantly. Remove from heat. Whisk in vanilla. Transfer to bowl. Press plastic wrap onto surface. Chill until cold, about 1 hour. (Pastry and pastry cream can be made 1 day ahead. Keep chilled.) Preheat oven to 375°F. Cut dough into twenty 1/4-inch-thick slices. Roll out 1 dough slice between sheets of floured plastic wrap to 3 1/2-inch round. Transfer to 3-inch-diameter tartlet pan with 1/2-inch-high sides. Repeat with 9 more dough pieces and tartlet pans. Remove lemon peel from pastry cream. Spoon 1 tablespoon pastry cream into each crust. Top each with 2 teaspoons jam. Roll remaining 10 dough pieces out between sheets of floured plastic wrap to 3 1/2-inch rounds. Place 1 round atop each tartlet. Pinch dough edges together to seal. Place tartlets on baking sheet. Bake until pastry is golden on top, about 30 minutes. Using small knife, loosen tartlets from pans. Remove from pans. Transfer to rack; cool. Sift powdered sugar over.\nWhisk yolks and 1/4 cup sugar in heavy small saucepan. Whisk in flour, then milk. Add lemon peel. Bring to boil over medium-high heat, whisking constantly. Remove from heat. Whisk in vanilla. Transfer to bowl. Press plastic wrap onto surface. Chill until cold, about 1 hour. (Pastry and pastry cream can be made 1 day ahead. Keep chilled.)\nPreheat oven to 375°F. Cut dough into twenty 1/4-inch-thick slices. Roll out 1 dough slice between sheets of floured plastic wrap to 3 1/2-inch round. Transfer to 3-inch-diameter tartlet pan with 1/2-inch-high sides. Repeat with 9 more dough pieces and tartlet pans.\nRemove lemon peel from pastry cream. Spoon 1 tablespoon pastry cream into each crust. Top each with 2 teaspoons jam. Roll remaining 10 dough pieces out between sheets of floured plastic wrap to 3 1/2-inch rounds. Place 1 round atop each tartlet. Pinch dough edges together to seal.\nPlace tartlets on baking sheet. Bake until pastry is golden on top, about 30 minutes. Using small knife, loosen tartlets from pans. Remove from pans. Transfer to rack; cool. Sift powdered sugar over.",
        "ingredients": [
            "1 1/4 cups all purpose flour",
            "1/3 cup sugar",
            "3/4 teaspoon grated lemon peel",
            "1/4 teaspoon salt",
            "6 tablespoons (3/4 stick) unsalted butter, room temperature",
            "1 large egg, beaten to blend",
            "2 large egg yolks",
            "1/4 cup sugar",
            "3 tablespoons all purpose flour",
            "1 cup whole milk",
            "2 3-inch-long strips lemon peel (yellow part only)",
            "1/2 teaspoon vanilla extract",
            "1/2 cup (about) sour cherry jam",
            "Powdered sugar"
        ],
        "step_by_step_instructions": [
            "Mix 0.31 cup flour, 0.08 cup sugar, 0.19 teaspoon grated lemon peel, and 0.06 teaspoon salt in a medium bowl.",
            "Add 1.5 tablespoons butter and rub in with fingers until butter is size of small peas.",
            "Add 0.2 of a beaten egg and mix until dough comes together.",
            "Gather into a ball and shape into a 1-inch-long log.",
            "Wrap in waxed paper and chill for 1 hour.",
            "Whisk 0.4 egg yolk and 0.05 cup sugar in a small heavy saucepan.",
            "Whisk in 0.45 tablespoon flour, then 0.25 cup milk.",
            "Add a 0.3-inch-long strip of lemon peel.",
            "Bring to boil over medium-high heat, whisking constantly.",
            "Remove from heat and whisk in 0.1 teaspoon vanilla.",
            "Transfer to a bowl and press plastic wrap onto the surface. Chill until cold, about 1 hour.",
            "Preheat oven to 375°F.",
            "Cut dough into four 1/4-inch-thick slices.",
            "Roll out 1 dough slice between sheets of floured plastic wrap to a 3.5-inch round.",
            "Transfer to a 3-inch-diameter tartlet pan with 0.5-inch-high sides.",
            "Repeat with 1 more dough piece and tartlet pan.",
            "Remove lemon peel from pastry cream.",
            "Spoon 1 tablespoon pastry cream into each crust.",
            "Top each with 1 teaspoon jam.",
            "Roll remaining 2 dough pieces out between sheets of floured plastic wrap to 3.5-inch rounds.",
            "Place 1 round atop each tartlet and pinch dough edges together to seal.",
            "Place tartlets on baking sheet.",
            "Bake until pastry is golden on top, about 30 minutes.",
            "Using a small knife, loosen tartlets from pans.",
            "Remove from pans and transfer to a rack to cool.",
            "Sift powdered sugar over the tartlets."
        ],
        "processed_ingredients": [
            "0.31 cup all purpose flour",
            "0.08 cup sugar",
            "0.19 teaspoon grated lemon peel",
            "0.06 teaspoon salt",
            "1.5 tablespoon unsalted butter",
            "0.2 egg",
            "0.4 egg yolk",
            "0.05 cup sugar",
            "0.45 tablespoon all purpose flour",
            "0.25 cup whole milk",
            "0.3 inch lemon peel",
            "0.1 teaspoon vanilla extract",
            "0.05 cup sour cherry jam",
            "0.01 cup powdered sugar"
        ],
        "pure_ingredients": [
            "flour",
            "sugar",
            "lemon peel",
            "salt",
            "butter",
            "egg",
            "egg yolk",
            "milk",
            "vanilla extract",
            "cherry jam",
            "powdered sugar"
        ],
        "cooking_time": "240 minutes",
        "required_tools": [
            "medium bowl",
            "small heavy saucepan",
            "waxed paper",
            "plastic wrap",
            "tartlet pan",
            "baking sheet",
            "small knife",
            "rack"
        ]
    },
    {
        "recipe_id": "M/OLlWjByPA2YGpuj1zAAXiSqHvTehO",
        "recipe_title": "Chocolate-Dipped Orange Cookies ",
        "original_instructions": "Into a large bowl sift together the flour, the cornstarch, the baking powder and a pinch of salt. In a bowl with an electric mixer cream together the butter and the confectioners' sugar until the mixture is light and fluffy, beat in the yolk, the zest, the vanilla, and the orange juice, and stir in the flour mixture well. In a bowl beat the white until it forms soft peaks and fold it gently but thoroughly into the mixture. (The batter will have the consistency of soft dough.) Transfer the batter to a pastry bag fitted with a decorative ribbon tip and onto the buttered baking sheet pipe 1 1/2-inch lengths 1 inch apart. Sprinkle the lengths with the granulated sugar and bake the cookies in the middle of a preheated 350°F. oven for 10 to 12 minutes, or until the edges are golden. Transfer the cookies to racks and let them cool until they can be handled. Dip 1 end of each cookie into the chocolate and let the cookies dry completely on the racks.\nInto a large bowl sift together the flour, the cornstarch, the baking powder and a pinch of salt. In a bowl with an electric mixer cream together the butter and the confectioners' sugar until the mixture is light and fluffy, beat in the yolk, the zest, the vanilla, and the orange juice, and stir in the flour mixture well. In a bowl beat the white until it forms soft peaks and fold it gently but thoroughly into the mixture. (The batter will have the consistency of soft dough.) Transfer the batter to a pastry bag fitted with a decorative ribbon tip and onto the buttered baking sheet pipe 1 1/2-inch lengths 1 inch apart. Sprinkle the lengths with the granulated sugar and bake the cookies in the middle of a preheated 350°F. oven for 10 to 12 minutes, or until the edges are golden. Transfer the cookies to racks and let them cool until they can be handled. Dip 1 end of each cookie into the chocolate and let the cookies dry completely on the racks.",
        "ingredients": [
            "3/4 cup all-purpose flour",
            "2 tablespoons cornstarch",
            "1/8 teaspoon double-acting baking powder",
            "1 stick (1/2 cup) unsalted butter, softened",
            "1/3 cup confectioners' sugar",
            "1 large egg, separated, the white at room temperature",
            "2 tablespoons freshly grated orange zest",
            "1/4 teaspoon vanilla",
            "1 tablespoon fresh orange juice",
            "granulated sugar for sprinkling the cookies",
            "2 ounces bittersweet or semisweet chocolate, melted and cooked slightly"
        ],
        "step_by_step_instructions": [
            "Sift together 0.19 cup all-purpose flour, 0.50 tbsp cornstarch, 0.03 tsp baking powder, and a pinch of salt into a large bowl.",
            "In a separate bowl, cream together 0.13 cup unsalted butter and 0.08 cup confectioners' sugar using an electric mixer until the mixture is light and fluffy.",
            "Beat in 0.17 egg yolk, 0.50 tbsp freshly grated orange zest, 0.06 tsp vanilla, and 0.25 tbsp fresh orange juice into the butter mixture.",
            "Stir in the flour mixture until well combined.",
            "In another bowl, beat 0.17 egg white until it forms soft peaks.",
            "Fold the beaten egg white gently but thoroughly into the batter, which should have the consistency of soft dough.",
            "Transfer the batter to a pastry bag fitted with a decorative ribbon tip.",
            "Pipe 1.5-inch lengths of batter onto a buttered baking sheet, spacing them 1 inch apart.",
            "Sprinkle the piped lengths with granulated sugar.",
            "Bake the cookies in the middle of a preheated 350°F oven for approximately 10 to 12 minutes, or until the edges are golden.",
            "Transfer the cookies to racks and let them cool until they can be handled.",
            "Dip one end of each cookie into 0.50 oz melted bittersweet chocolate and let them dry completely on the racks."
        ],
        "processed_ingredients": [
            "0.19 cup all-purpose flour",
            "0.50 tbsp cornstarch",
            "0.03 tsp baking powder",
            "0.13 cup unsalted butter",
            "0.08 cup confectioners' sugar",
            "0.17 egg",
            "0.50 tbsp orange zest",
            "0.06 tsp vanilla",
            "0.25 tbsp orange juice",
            "0.50 oz bittersweet chocolate",
            "1.00 pinch salt",
            "various amounts granulated sugar"
        ],
        "pure_ingredients": [
            "flour",
            "cornstarch",
            "baking powder",
            "butter",
            "confectioners' sugar",
            "egg",
            "orange zest",
            "vanilla",
            "orange juice",
            "chocolate",
            "salt",
            "sugar"
        ],
        "cooking_time": "12 minutes",
        "required_tools": [
            "large bowl",
            "electric mixer",
            "pastry bag",
            "decorative ribbon tip",
            "baking sheet",
            "oven",
            "racks"
        ]
    },
    {
        "recipe_id": "Li18hkJQPDL1RMjCYFs5h.2ED20/CdG",
        "recipe_title": "Chinese Beef With Broccoli",
        "original_instructions": "Whisk 1 tablespoon cornstarch, 3 tablespoons soy sauce, 1 teaspoon sugar and 1 tablespoon peanut oil in a large bowl. Add the steak and toss to coat; refrigerate until ready to cook.\nWhisk the remaining 1 tablespoon each cornstarch and soy sauce, the oyster sauce and chicken broth in a small bowl; set aside.\nHeat 1 tablespoon peanut oil in a large skillet over high heat. Add the ginger, broccoli and the remaining 1 teaspoon sugar and stir-fry 3 to 4 minutes; transfer to a plate. Heat 1 more tablespoon peanut oil in the skillet, add the onion and stir-fry 2 to 3 minutes. Add the tomatoes and cook, turning gently, 2 minutes. Transfer the onion and tomatoes to the plate with the broccoli.\nReduce the heat to medium high; add the remaining 2 tablespoons peanut oil to the skillet. Add the garlic and steak and stir-fry 1 minute. Whisk the sauce mixture, then add to the skillet and simmer 1 minute. Return the vegetables to the skillet; cook until the meat is cooked through, 3 to 4 minutes. Serve with rice, if desired.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "2 tablespoons cornstarch",
            "4 tablespoons soy sauce",
            "2 teaspoons sugar",
            "5 tablespoons peanut oil",
            "1 pound flank steak, thinly sliced against the grain",
            "1 tablespoon oyster sauce",
            "1 1/4 cups low-sodium chicken broth",
            "4 thin slices peeled ginger",
            "1 head broccoli, cut into florets",
            "1 large onion, halved and sliced 1/2 inch thick",
            "3 plum tomatoes, quartered lengthwise",
            "2 cloves garlic, minced",
            "Cooked white rice, for serving (optional)"
        ],
        "step_by_step_instructions": [
            "Whisk 0.25 tablespoon cornstarch, 0.75 tablespoon soy sauce, 0.25 teaspoon sugar and 0.25 tablespoon peanut oil in a large bowl.",
            "Add about 0.25 lb of the flank steak and toss to coat; refrigerate until ready to cook.",
            "Whisk the remaining 0.25 tablespoon each cornstarch and soy sauce, 0.25 tablespoon oyster sauce and 0.31 cup chicken broth in a small bowl; set aside.",
            "Heat 0.25 tablespoon peanut oil in a large skillet over high heat.",
            "Add 1 slice ginger, about 2.5 oz of broccoli florets and 0.25 teaspoon sugar and stir-fry for 3 to 4 minutes; transfer to a plate.",
            "Heat 0.25 tablespoon peanut oil in the skillet, add about 0.25 of the onion and stir-fry for 2 to 3 minutes.",
            "Add 0.75 of a plum tomato and cook, turning gently, for 2 minutes.",
            "Transfer the onion and tomatoes to the plate with the broccoli.",
            "Reduce the heat to medium-high; add the remaining 0.5 tablespoon peanut oil to the skillet.",
            "Add about 0.5 clove garlic and the steak and stir-fry for 1 minute.",
            "Whisk the sauce mixture, then add to the skillet and simmer for 1 minute.",
            "Return the vegetables to the skillet; cook until the meat is cooked through, 3 to 4 minutes.",
            "Serve with rice, if desired."
        ],
        "processed_ingredients": [
            "0.5 tablespoon cornstarch",
            "1 tablespoon soy sauce",
            "0.5 teaspoon sugar",
            "1 tablespoon peanut oil",
            "0.25 lb flank steak",
            "0.25 tablespoon oyster sauce",
            "0.31 cup chicken broth",
            "1 slice ginger",
            "2.5 oz broccoli",
            "0.25 large onion",
            "0.75 plum tomato",
            "0.5 clove garlic",
            "0.25 cup cooked white rice"
        ],
        "pure_ingredients": [
            "cornstarch",
            "soy sauce",
            "sugar",
            "peanut oil",
            "flank steak",
            "oyster sauce",
            "chicken broth",
            "ginger",
            "broccoli",
            "onion",
            "tomato",
            "garlic",
            "rice"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "whisk",
            "large bowl",
            "small bowl",
            "large skillet",
            "plate"
        ]
    },
    {
        "recipe_id": "Rx0czIiui69iAylPVy.jHhmW1ru7Nxa",
        "recipe_title": "Sticky Figgy Chickie (Stuffed Chicken Breast)",
        "original_instructions": "Special equipment: Kitchen twine or toothpicks\nPreheat the oven to 350 degrees F.\nButterfly the chicken breast and pound it out until flat, then season both sides with salt and pepper, to taste.\nIn a large saute pan over medium-high heat, add 1 tablespoon of the olive oil and the sausage. Break up the sausage and cook until browned. Remove the sausage from the pan to a bowl. Add the mushrooms to the hot pan, season with salt, to taste and saute until soft. When soft, add the figs and saute for 2 to 3 minutes. Season with salt and pepper to taste, then remove from heat and cool. Add the sausage back into the pan and stir the mixture until combined.\nAdd the sausage filling to flattened chicken on the side closest to you. Roll chicken like a cigar tucking it tightly at each roll. Tie with kitchen string or secure with toothpicks.\nHeat the remaining oil in an oven-proof saute pan over medium-high heat. Add the chicken and sear it on all sides until golden brown. Transfer the pan to the oven and bake for 10 minutes. Remove the chicken from the oven and pour off the grease from the pan. Brush the chicken with honey or maple syrup and truffle oil and serve.",
        "ingredients": [
            "1 chicken breast",
            "Kosher salt and freshly ground black pepper",
            "2 tablespoons olive oil, divided",
            "1 small link pork sausage, casing removed",
            "1/2 cup roughly sliced mixed mushrooms",
            "1/4 cup halved figs",
            "1/8 cup honey or maple syrup",
            "Truffle oil, to taste"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Butterfly the chicken breast and pound it out until flat, then season both sides with salt and pepper.",
            "In a large saute pan over medium-high heat, add 1 tablespoon of olive oil.",
            "Add the sausage to the pan, break it up, and cook until browned.",
            "Remove the sausage from the pan to a bowl.",
            "Add the mushrooms to the hot pan, season with salt, and saute until soft.",
            "When mushrooms are soft, add the figs and saute for 2 to 3 minutes.",
            "Season the mixture with salt and pepper to taste, then remove from heat and let it cool.",
            "Add the sausage back into the pan and stir the mixture until combined.",
            "Place the sausage filling onto the flattened chicken on the side closest to you.",
            "Roll the chicken like a cigar, tucking it tightly at each roll.",
            "Tie with kitchen string or secure with toothpicks.",
            "Heat the remaining olive oil in an oven-proof saute pan over medium-high heat.",
            "Add the chicken and sear it on all sides until golden brown.",
            "Transfer the pan to the oven and bake the chicken for 10 minutes.",
            "Remove the chicken from the oven and pour off the grease from the pan.",
            "Brush the chicken with honey or maple syrup and truffle oil and serve."
        ],
        "processed_ingredients": [
            "1 chicken breast",
            "0.50 tsp salt",
            "0.25 tsp black pepper",
            "2 tbsp olive oil",
            "1.50 oz pork sausage",
            "2 oz mushrooms",
            "1 oz figs",
            "2 tbsp honey",
            "1 tbsp truffle oil"
        ],
        "pure_ingredients": [
            "chicken",
            "salt",
            "pepper",
            "olive oil",
            "pork",
            "mushrooms",
            "figs",
            "honey",
            "truffle oil"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "oven",
            "saute pan",
            "bowl",
            "kitchen twine",
            "toothpicks"
        ]
    },
    {
        "recipe_id": "6NFkcVqGw.M5X8gZ9COhQODEUvp1gDm",
        "recipe_title": "Yams with Spiced Sorghum Butter ",
        "original_instructions": "Beat butter, sorghum syrup, cinnamon, cloves and cayenne in medium bowl to blend; season with salt. (Can be prepared 5 days ahead. Cover and refrigerate. Bring mixture to room temperature before using.) Preheat oven to 350°F. Rinse potatoes; pat dry. Pierce each several times with fork; place on baking sheet. Bake potatoes until tender, about 1 hour. Cut top of each potato lengthwise; press in ends to open top. Spoon some sorghum butter into opening of each potato and serve. *Sorghum syrup (a juice extracted from cereal grass) is available at some natural foods stores or by mail order; call Brownville Mills at 800-305-7990\nBeat butter, sorghum syrup, cinnamon, cloves and cayenne in medium bowl to blend; season with salt. (Can be prepared 5 days ahead. Cover and refrigerate. Bring mixture to room temperature before using.)\nPreheat oven to 350°F. Rinse potatoes; pat dry. Pierce each several times with fork; place on baking sheet. Bake potatoes until tender, about 1 hour.\nCut top of each potato lengthwise; press in ends to open top. Spoon some sorghum butter into opening of each potato and serve.\n*Sorghum syrup (a juice extracted from cereal grass) is available at some natural foods stores or by mail order; call Brownville Mills at 800-305-7990",
        "ingredients": [
            "1 cup (2 sticks) unsalted butter, room temperature",
            "9 tablespoonssorghum syrup* or 1/2 cup clover honey plus 1 tablespoon robust-flavored (dark) molasses",
            "1 teaspoon ground cinnamon",
            "1/2 teaspoon ground cloves",
            "Large pinch of cayenne pepper",
            "8 10- to 11-ounce yams (red-skinned sweet potatoes)"
        ],
        "step_by_step_instructions": [
            "Mix 1 tablespoon of butter, 1.13 tablespoons of sorghum syrup, 0.13 teaspoon of cinnamon, 0.06 teaspoon of cloves, and a pinch of cayenne pepper in a bowl until well blended. Add a pinch of salt.",
            "Preheat oven to 350°F.",
            "Rinse and pat dry 1 yam weighing approximately 10 ounces.",
            "Pierce the yam several times with a fork and place it on a baking sheet.",
            "Bake the yam in the oven for about 1 hour until tender.",
            "Cut the top of the yam lengthwise and press in the ends to open the top.",
            "Spoon approximately 1 tablespoon of the sorghum butter into the opening of the yam and serve."
        ],
        "processed_ingredients": [
            "1 tbsp butter",
            "1.13 tbsp sorghum syrup",
            "0.13 tsp cinnamon",
            "0.06 tsp cloves",
            "0.63 oz yam",
            "0.06 tsp cayenne pepper",
            "0.03 tsp salt"
        ],
        "pure_ingredients": [
            "butter",
            "sorghum syrup",
            "cinnamon",
            "cloves",
            "cayenne pepper",
            "salt",
            "yam"
        ],
        "cooking_time": "1 hour 10 minutes",
        "required_tools": [
            "bowl",
            "fork",
            "baking sheet",
            "oven",
            "knife",
            "spoon"
        ]
    },
    {
        "recipe_id": "AABuGMRPfEvaHJphkW2g9iIpcSg/JyS",
        "recipe_title": "Lemon-Mustard Chicken with Chive Mashed Potatoes",
        "original_instructions": "Preheat the oven to 450 degrees F. Put the potatoes in a saucepan and cover with cold water; season with salt. Bring to a boil, then reduce the heat to medium and simmer until tender, 15 minutes. Reserve 1/4 cup cooking water, then drain the potatoes; return to the pot. Add the sour cream, butter and reserved cooking water and mash with a masher or fork. Stir in the chives and season with salt and pepper. Cover to keep warm.\nMeanwhile, place the chicken skin-side up on a rimmed baking sheet; season with salt and pepper. Bake 20 minutes; remove from the oven.\nMix the mustard, lemon juice, garlic, 2 teaspoons olive oil and the thyme; brush on the chicken and push to the sides of the pan. Toss the broccolini with the remaining 1 teaspoon olive oil in the middle of the pan; season with salt and pepper. Bake until the chicken is cooked through and the broccolini is tender, 10 minutes. Serve with the potatoes.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "1 1/2 pounds Yukon gold potatoes, peeled and quartered",
            "Kosher salt",
            "1/2 cup sour cream",
            "3 tablespoons unsalted butter, at room temperature",
            "2 tablespoons chopped fresh chives",
            "Freshly ground pepper",
            "8 skin-on, bone-in chicken thighs (about 2 1/2 pounds)",
            "1 tablespoon dijon mustard",
            "Juice of 1 lemon",
            "2 cloves garlic, grated",
            "1 tablespoon extra-virgin olive oil",
            "1 teaspoon chopped fresh thyme",
            "1 bunch broccolini, trimmed"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450 degrees F.",
            "Put approximately 190 g of potatoes in a saucepan and cover with cold water; season with salt.",
            "Bring to a boil, then reduce the heat to medium and simmer until tender, about 15 minutes.",
            "Reserve 1 tbsp cooking water, then drain the potatoes and return to the pot.",
            "Add about 2 tbsp sour cream, 0.5 tbsp butter, and the reserved cooking water to the potatoes.",
            "Mash with a masher or fork.",
            "Stir in approximately 0.5 tsp chopped chives and season with salt and pepper.",
            "Cover to keep warm.",
            "Place 1 chicken thigh skin-side up on a rimmed baking sheet; season with salt and pepper.",
            "Bake for 20 minutes and then remove from the oven.",
            "Mix about 0.5 tsp mustard, 1 tsp lemon juice, 0.5 grated garlic clove, 0.5 tsp olive oil, and a pinch of thyme.",
            "Brush the mixture on the chicken.",
            "Push the chicken to the sides of the pan.",
            "Toss approximately 60 g of broccolini with 0.2 tsp olive oil in the middle of the pan; season with salt and pepper.",
            "Bake until the chicken is cooked through and the broccolini is tender, about 10 minutes.",
            "Serve with the mashed potatoes."
        ],
        "processed_ingredients": [
            "190 g Yukon gold potatoes",
            "1 tsp salt",
            "2 tbsp sour cream",
            "0.5 tbsp unsalted butter",
            "0.5 tsp chopped fresh chives",
            "0.5 tsp freshly ground pepper",
            "1 chicken thigh",
            "0.5 tsp dijon mustard",
            "1 tsp lemon juice",
            "0.5 clove garlic",
            "0.7 tsp extra-virgin olive oil",
            "0.2 tsp chopped fresh thyme",
            "60 g broccolini"
        ],
        "pure_ingredients": [
            "potatoes",
            "salt",
            "sour cream",
            "butter",
            "chives",
            "pepper",
            "chicken",
            "mustard",
            "lemon",
            "garlic",
            "olive oil",
            "thyme",
            "broccolini"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "oven",
            "saucepan",
            "masher",
            "fork",
            "rimmed baking sheet",
            "knife",
            "brush"
        ]
    },
    {
        "recipe_id": "HJ/mR5oY2sXwYk2wSWeL/priQPrEP.W",
        "recipe_title": "Plum Tart with Marzipan Crumble ",
        "original_instructions": "For crust: Blend first four ingredients in processor until nuts are finely ground. Add butter; process until mixture resembles coarse meal. Add cream and yolk. Blend, using on/off turns, until dough comes together. Press over bottom and up sides of 11-inch-diameter tart pan with removable bottom. Pierce all over with fork. Chill at least 2 hours and up to 1 day. Preheat oven to 400°F. Bake crust until golden, pressing with back of fork every 5 minutes if crust bubbles, about 25 minutes. Transfer crust to rack; cool. Reduce oven temperature to 375°F.\nBlend first four ingredients in processor until nuts are finely ground. Add butter; process until mixture resembles coarse meal. Add cream and yolk. Blend, using on/off turns, until dough comes together. Press over bottom and up sides of 11-inch-diameter tart pan with removable bottom. Pierce all over with fork. Chill at least 2 hours and up to 1 day.\nPreheat oven to 400°F. Bake crust until golden, pressing with back of fork every 5 minutes if crust bubbles, about 25 minutes. Transfer crust to rack; cool. Reduce oven temperature to 375°F.\n<For crumble: Blend flour, almond paste and sugar in processor until almond paste is finely ground. Add butter and blend, using on/off turns, until coarse crumbs form. Transfer crumble to bowl; mix in almonds.\nBlend flour, almond paste and sugar in processor until almond paste is finely ground. Add butter and blend, using on/off turns, until coarse crumbs form. Transfer crumble to bowl; mix in almonds.\n<For filling: Combine all ingredients in medium bowl; toss to blend well.\nCombine all ingredients in medium bowl; toss to blend well.\nSprinkle 3/4 cup crumble over cooled crust. Top with plums. Sprinkle with remaining crumble. Bake tart until filling bubbles thickly and top is golden, about 40 minutes. Cool 10 minutes. Push up pan bottom to release tart. Cool. (Can be made 8 hours ahead. Let stand at room temperature.)\nSprinkle 3/4 cup crumble over cooled crust. Top with plums. Sprinkle with remaining crumble.\nBake tart until filling bubbles thickly and top is golden, about 40 minutes. Cool 10 minutes. Push up pan bottom to release tart. Cool. (Can be made 8 hours ahead. Let stand at room temperature.)",
        "ingredients": [
            "1 cup all purpose flour",
            "3/4 cup sliced almonds",
            "1/4 cup sugar",
            "1/3 teaspoon salt",
            "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
            "2 tablespoons chilled whipping cream",
            "1 large egg yolk",
            "3/4 cup all purpose flour",
            "1/2 cup (packed) almond paste (about 5 ounces)",
            "1/2 cup (packed) golden brown sugar",
            "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch cubes",
            "1/4 cup sliced almonds",
            "2 1/4 pounds plums (about 12), halved, pitted, thinly sliced",
            "1/2 cup sugar",
            "2 tablespoons plus 2 teaspoons cornstarch"
        ],
        "step_by_step_instructions": [
            "Blend 0.13 cup all purpose flour, 0.10 cup sliced almonds, 0.03 cup sugar, and 0.04 teaspoon salt in a processor until nuts are finely ground.",
            "Add 0.06 cup chilled unsalted butter; process until mixture resembles coarse meal.",
            "Add 0.03 tablespoon chilled whipping cream and 0.08 large egg yolk. Blend using on/off turns until dough comes together.",
            "Press over bottom and up sides of a small tart pan. Pierce all over with fork.",
            "Chill at least 2 hours.",
            "Preheat oven to 400°F.",
            "Bake crust until golden, about 25 minutes, pressing with back of fork every 5 minutes if crust bubbles.",
            "Transfer crust to rack; cool. Reduce oven temperature to 375°F.",
            "Blend 0.10 cup all purpose flour, 0.07 cup almond paste, and 0.07 cup sugar in processor until almond paste is finely ground.",
            "Add 0.04 cup chilled unsalted butter and blend using on/off turns until coarse crumbs form.",
            "Transfer crumble to bowl; mix in 0.03 cup sliced almonds.",
            "Combine 0.28 pound plums, 0.06 cup sugar, and 0.01 cup cornstarch in medium bowl; toss to blend well.",
            "Sprinkle 0.10 cup crumble over cooled crust. Top with plums.",
            "Sprinkle with remaining crumble.",
            "Bake tart until filling bubbles thickly and top is golden, about 40 minutes.",
            "Cool 10 minutes. Push up pan bottom to release tart. Cool."
        ],
        "processed_ingredients": [
            "0.13 cup all purpose flour",
            "0.10 cup sliced almonds",
            "0.03 cup sugar",
            "0.04 teaspoon salt",
            "0.06 cup unsalted butter",
            "0.03 tablespoon whipping cream",
            "0.08 large egg yolk",
            "0.10 cup all purpose flour",
            "0.07 cup almond paste",
            "0.07 cup sugar",
            "0.04 cup unsalted butter",
            "0.03 cup sliced almonds",
            "0.28 pound plums",
            "0.06 cup sugar",
            "0.01 cup cornstarch"
        ],
        "pure_ingredients": [
            "flour",
            "almonds",
            "sugar",
            "salt",
            "butter",
            "cream",
            "egg",
            "almond paste",
            "plums",
            "cornstarch"
        ],
        "cooking_time": "65 minutes",
        "required_tools": [
            "processor",
            "tart pan",
            "fork",
            "oven",
            "bowl"
        ]
    },
    {
        "recipe_id": "6G2q1chDnaY8f1OZJ2z12HWyCbODJIO",
        "recipe_title": "Scalloped Potatoes ",
        "original_instructions": "Preheat oven to 350°F. and butter a 2-quart shallow baking dish. In a heavy saucepan melt butter over moderately low heat and whisk in flour. Cook roux, whisking, 3 minutes and add broth in a stream, whisking. Bring sauce to a boil, whisking, and simmer, whisking, until thickened, about 2 minutes. Remove pan from heat and whisk in cheese and salt and pepper to taste, whisking until cheese is melted. Peel potatoes and slice about 1/8 inch thick. In prepared baking dish make 5 layers each of potatoes and sauce, beginning with potatoes and ending with sauce. Scalloped potatoes may be prepared up to this point 2 hours ahead and kept covered. Sprinkle bread crumbs on top and bake, uncovered, in oven 1 hour, or until potatoes are tender and top is golden.\nPreheat oven to 350°F. and butter a 2-quart shallow baking dish.\nIn a heavy saucepan melt butter over moderately low heat and whisk in flour. Cook roux, whisking, 3 minutes and add broth in a stream, whisking. Bring sauce to a boil, whisking, and simmer, whisking, until thickened, about 2 minutes. Remove pan from heat and whisk in cheese and salt and pepper to taste, whisking until cheese is melted.\nPeel potatoes and slice about 1/8 inch thick. In prepared baking dish make 5 layers each of potatoes and sauce, beginning with potatoes and ending with sauce. Scalloped potatoes may be prepared up to this point 2 hours ahead and kept covered.\nSprinkle bread crumbs on top and bake, uncovered, in oven 1 hour, or until potatoes are tender and top is golden.",
        "ingredients": [
            "3 tablespoons unsalted butter",
            "1/4 cup all-purpose flour",
            "2 cups chicken broth",
            "1 1/2 cups coarsely grated extra-sharp Cheddar cheese",
            "2 pounds boiling potatoes",
            "1/2 cup fresh bread crumbs"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350°F.",
            "Butter a 2-quart shallow baking dish.",
            "In a heavy saucepan, melt 1 tablespoon of butter over moderately low heat.",
            "Whisk in 1 tablespoon of flour to make a roux.",
            "Cook the roux, whisking, for 3 minutes.",
            "Add 1/2 cup of chicken broth in a stream, whisking constantly.",
            "Bring the sauce to a boil, whisking.",
            "Simmer the sauce, whisking, until thickened, about 2 minutes.",
            "Remove the pan from heat and whisk in 1/2 cup of grated Cheddar cheese.",
            "Add salt and pepper to taste, whisking until cheese is melted.",
            "Peel and slice 0.5 lb of potatoes about 1/8 inch thick.",
            "In the prepared baking dish, make 5 layers each of the sliced potatoes and cheese sauce, beginning with potatoes and ending with sauce.",
            "Sprinkle 2 tablespoons of fresh bread crumbs on top.",
            "Bake, uncovered, in the oven for 1 hour, or until potatoes are tender and the top is golden."
        ],
        "processed_ingredients": [
            "1 tbsp butter",
            "1 tbsp flour",
            "0.50 cup chicken broth",
            "0.50 cup Cheddar cheese",
            "0.50 lb potatoes",
            "2 tbsp bread crumbs"
        ],
        "pure_ingredients": [
            "butter",
            "flour",
            "chicken broth",
            "cheese",
            "salt",
            "pepper",
            "potatoes",
            "bread crumbs"
        ],
        "cooking_time": "68 minutes",
        "required_tools": [
            "oven",
            "saucepan",
            "whisk",
            "knife",
            "baking dish"
        ]
    }
]