{
    "LsnJheI7509o1e0LkxTeoxbwggI3/oO": {
        "instructions": "To make the dressing, combine the rice vinegar, vegetable oil, soy sauce, sesame oil, grated ginger, sugar and 1/2 teaspoon salt in a small bowl and mix well. Set aside.\nCombine the remaining salt and the five-spice powder and sprinkle the mixture over the duck. Place a nonstick frying pan over high heat until hot. Place the duck, skin side down, in the pan and cook until golden brown, about 3 minutes. Turn the breasts, reduce the heat and cook until medium-rare, 6 to 7 minutes. Remove the duck from the pan, place on a cutting board, and let rest for 5 minutes. Do not cover the duck or the skin will not be crisp.\nIn a large bowl, combine the watercress, snow peas and cabbage. Pour the dressing over the top and toss to coat. Divide the salad among 4 serving plates. Cut the duck into slices on the diagonal. Arrange the slices on each salad and serve.",
        "ingredients": [
            "3 tablespoons rice vinegar",
            "2 tablespoons vegetable oil",
            "1 tablespoon soy sauce",
            "2 teaspoons sesame oil",
            "1 tablespoon grated ginger",
            "1 teaspoon sugar",
            "1 1/2 teaspoons salt",
            "1/2 teaspoon Chinese five-spice powder",
            "12 ounces boneless duck breast, skin scored",
            "1 bunch watercress (about 4 ounces), tough stems removed",
            "2 cups snow peas, thinly sliced",
            "2 cups shredded Napa cabbage"
        ],
        "title": "Seared Five-Spice Duck Breast with Snow Peas and Watercress",
        "picture_link": null
    },
    "3jIyetJs3uc8.aRk2/2UWdbkmQr38Rm": {
        "ingredients": [
            "One 12-ounce can evaporated milk",
            "2 large egg yolks",
            "One 15-ounce can unsweetened coconut milk",
            "One 14-ounce can sweetened condensed milk",
            "1 cup white rum",
            "1/4 teaspoon ground cinnamon",
            "Pinch of salt"
        ],
        "picture_link": "bBG.j0hBmEOAXa89go8cNQtOjVh3w6W",
        "instructions": "Beat together the evaporated milk and egg yolks in a medium bowl. Strain into a 3-quart pot and simmer over medium heat until slightly thickened, about 5 minutes. Remove from the heat and let cool. Transfer the egg yolk mixture to a blender, and blend in batches. Add the remaining ingredients, blending at high speed until frothy. Pour into a pitcher and refrigerate until chilled before serving.\nBeat together the evaporated milk and egg yolks in a medium bowl. Strain into a 3-quart pot and simmer over medium heat until slightly thickened, about 5 minutes. Remove from the heat and let cool.\nTransfer the egg yolk mixture to a blender, and blend in batches. Add the remaining ingredients, blending at high speed until frothy. Pour into a pitcher and refrigerate until chilled before serving.",
        "title": "Puerto Rican Coconut Eggnog (Coquito) "
    },
    "yGYp8y3SMiu49Uvm3bMVHHa86K.0yIW": {
        "instructions": "Place beans, celery, red pepper, vinegar, and oil in a medium bowl. Toss until well combined. Adjust seasonings with salt and pepper. Add basil and serve immediately.\nMorph: For a super quick white bean dip: puree the salad in a food processor or blender, add 1 or 2 dashes of hot sauce and serve on crackers or grilled bread.",
        "ingredients": [
            "1 (19-ounce) can cannellini beans, rinsed and drained (use any canned bean you like)",
            "1 large rib celery, thinly sliced",
            "1/2 roasted red pepper, peeled, seeded, and chopped",
            "2 tablespoons red wine vinegar",
            "1 tablespoon extra-virgin olive oil",
            "Coarse grained salt",
            "Freshly ground black pepper",
            "1/2 cup basil leaves, hand torn"
        ],
        "title": "White Bean Salad",
        "picture_link": null
    },
    "1ESWmvbMQFVbHNDak8wSxllJBSJLi32": {
        "instructions": "In a salad bowl combine the horseradish, mustard, red wine vinegar and honey. In a slow steady steam add the extra-virgin olive oil and whisk to combine. Add the carrots, radishes, dill and parsley, toss to coat. Season with salt and pepper, toss again and serve.",
        "ingredients": [
            "1/2 tablespoon prepared horseradish",
            "1/2 tablespoon Dijon mustard",
            "1 tablespoon red wine vinegar",
            "1 tablespoon honey",
            "3 tablespoons extra-virgin olive oil",
            "1 (12-ounce) sack shredded carrots",
            "8 radishes, thinly sliced",
            "1/2 cup chopped flat-leaf parsley, 2 generous handfuls",
            "2 to 3 sprigs dill, chopped",
            "Salt and freshly ground black pepper"
        ],
        "title": "Root Veggie Salad with Horseradish Dressing",
        "picture_link": null
    },
    "thRzYzmAoS3npX4Kitj0QB2YHqACTCi": {
        "instructions": "Pull the lettuce leaves from the head, rinse gently under cold water, and lay out on clean towels to dry. Use a spoon to remove the flesh in 1 piece from each half of the avocado. Thinly slice the avocado flesh into thin wedges.\nWhisk together all the dressing ingredients.\nArrange the lettuce leaves on a plate and top with the avocado wedges, scallion, and cilantro. Finish with a healthy drizzling of the dressing.",
        "ingredients": [
            "2 small to medium heads Boston lettuce, discard any wilted leaves",
            "1 Hass avocado, pitted",
            "1 large bunch scallions, thinly sliced",
            "Leaves from 1 bunch cilantro, finely chopped",
            "2 limes, juiced",
            "1/3 cup extra-virgin olive oil",
            "1/2 teaspoon salt",
            "1 teaspoon sugar",
            "About 20 grinds fresh black pepper",
            "1 tablespoon whole-grain mustard"
        ],
        "title": "Boston Lettuce Avocado Salad and Lime Dressing",
        "picture_link": "f.ly5mhat/KQ2c.kH/mvJ9Mp49pHevO"
    },
    "hnhYDOk8HIQ/XdnQj4ZY432i6PFEgpW": {
        "instructions": "Preheat the oven to 325 degrees F.\nPut the cake mix in a mixing bowl and add the butter. Using a pastry blender or 2 forks, cut in the butter until the mixture resembles coarse crumbs. Add the eggs, milk and rum. Beat with a wooden spoon until you form a smooth batter. Fold in coconut until evenly distributed.\nSpray 2 madeleine molds with nonstick cooking spray. Using a tablespoon, drop the batter into the molds filling halfway. If you don't have madeleine molds, you may drop the batter on an ungreased baking pan. Bake for 12 to 15 minutes, until the cookies are nicely browned. Let cool in the pan then turn out onto a platter. Repeat method with remaining batter.",
        "ingredients": [
            "1 (18.25-ounce) box pineapple cake mix",
            "1/2 cup (1 stick) unsalted butter, cut into chunks",
            "2 large eggs, lightly beaten",
            "1 cup milk",
            "2 tablespoons dark rum or rum extract",
            "1 cup flaked coconut"
        ],
        "title": "Pina Colada Madeleine Cookies",
        "picture_link": "enoSPIumrtRCq5n/dNi/VEgXCyH63Ce"
    },
    "loLVwetgWlmdEuvFcNEFSRPdsmajuzu": {
        "ingredients": [
            "3/4 lb extra-lean ground beef (or bison)",
            "2 tbsp finely chopped onion",
            "2 tbsp chili sauce",
            "1 tsp Dijon mustard",
            "4 slices (about 3/4 oz each) reduced-fat cheddar",
            "4 whole-wheat hamburger buns",
            "Lettuce and tomato slices"
        ],
        "picture_link": null,
        "instructions": "Mix first 4 ingredients. Form mixture into four 1-inch-thick patties. Broil 5 to 7 minutes on each side for medium to well-done burgers. Top each burger with a cheese slice right before removing from the oven. Transfer burgers onto buns, top with lettuce and tomato and serve.\nMix first 4 ingredients. Form mixture into four 1-inch-thick patties. Broil 5 to 7 minutes on each side for medium to well-done burgers. Top each burger with a cheese slice right before removing from the oven. Transfer burgers onto buns, top with lettuce and tomato and serve.",
        "title": "Healthy Homemade Cheeseburgers "
    },
    "udw8I73c8cD0Hk0tIQr2cnuYPo8n9eO": {
        "instructions": "Make the dressing: Whisk the vinegar, mustard, sugar, 1 teaspoon salt and 1/2 teaspoon pepper in a large bowl. Gradually whisk in the olive oil until well blended.\nAdd the cabbage, parsley, scallions and grapes to the bowl and toss to coat with the dressing. Cover and refrigerate 1 to 4 hours before serving.\nPhotograph by Yunhee Kim",
        "ingredients": [
            "2 tablespoons apple cider vinegar",
            "1 tablespoon dijon mustard",
            "2 teaspoons sugar",
            "Kosher salt and freshly ground pepper",
            "1/4 cup extra-virgin olive oil",
            "1 small or 1/2 large head red cabbage, finely shredded",
            "1/3 cup chopped fresh parsley",
            "6 scallions, chopped",
            "2 cups seedless red grapes, chopped"
        ],
        "title": "Red Coleslaw With Grapes",
        "picture_link": "PSK1LUqdfR.43q.7mnri4xxV3bNinYq"
    },
    "qUZKI3hBy9WJFQRkhkiIX15W.zph6z6": {
        "instructions": "Cut the top third off each lemon. Cut a small slice off the bottom of each lemon so it stands up. Using a spoon, carefully scoop out the inside of each lemon, creating a lemon cup. Put the lemon cup in the freezer for at least 1 hour.\nPut the sorbet into the bowl of a food processor. Add the limoncello and vodka and process until smooth. Place the frozen lemon cups onto shot glasses filled with limoncello. Fill the lemon shells with the sorbet mixture and serve.",
        "ingredients": [
            "4 lemons",
            "1 pint lemon sorbet",
            "4 ounces limoncello or other lemon-flavored liqueur, chilled, plus 4 shots for serving",
            "4 ounces vanilla vodka, chilled"
        ],
        "title": "Limoncello Sorbet Cocktail",
        "picture_link": "a/1CrBnX4BFM9Dlij2KcTy47kJW2nHy"
    },
    "wrVeKH9BlRsjYJSA75tO9IGd9J./pJy": {
        "ingredients": [
            "3 tablespoons extra-virgin olive oil",
            "1 tablespoon sour cream",
            "1 tablespoon cider vinegar",
            "1 tablespoon water",
            "1/2 teaspoon anchovy paste",
            "1/4 teaspoon salt",
            "1/8 teaspoon black pepper",
            "1/2 Savoy or green cabbage, cored, cut into 3 wedges, and thinly sliced crosswise (6 to 8 cups)",
            "2 cups fresh flat-leaf parsley leaves"
        ],
        "picture_link": null,
        "instructions": "Whisk together oil, sour cream, vinegar, water, anchovy paste, salt, and pepper in a large bowl. Add cabbage and parsley and toss until coated.\nWhisk together oil, sour cream, vinegar, water, anchovy paste, salt, and pepper in a large bowl. Add cabbage and parsley and toss until coated.",
        "title": "Parsley and Cabbage Salad "
    },
    "trCycFqcWZDQavc82kgIWxO1aLyb6Bu": {
        "instructions": "Whisk together mayonnaise, sour cream, cheese, lemon juice, chives, salt, and pepper in a small bowl and thin with milk or water to desired consistency.\nToss iceberg, watercress, and celery in a large bowl and drizzle with dressing.",
        "ingredients": [
            "1/4 cup mayonnaise",
            "1/4 cup sour cream",
            "1 cup blue cheese, crumbled (about 4 ounces)",
            "1 tablespoon fresh lemon juice",
            "1 tablespoon finely chopped fresh chives",
            "1/4 teaspoon salt",
            "1/4 teaspoon black pepper",
            "1 to 2 tablespoons milk or water",
            "1/2 head iceberg lettuce, coarsely shredded",
            "2 bunches watercress, coarse stems discarded (6 cups)",
            "3 celery ribs, thinly sliced diagonally"
        ],
        "title": "Iceberg and Watercress Salad with Blue Cheese Dressing",
        "picture_link": null
    },
    "a3Cp5gMoXWJAVzjW8.BV.rJ/0K0EViK": {
        "instructions": "In a blender, add the ice cream, milk, marshmallow cream and white chocolate liqueur and blend until smooth. If you do not add the liqueur replace it with milk. Serve in tall glasses.",
        "ingredients": [
            "1 pint vanilla ice cream",
            "1/2 cup cold milk (increase to 1 cup if omitting liqueur)",
            "1/2 cup marshmallow cream",
            "1 cup white chocolate liqueur, optional"
        ],
        "title": "White Chocolate Marshmallow Shake",
        "picture_link": null
    },
    "Ngjg7yEAF5daXZDoo9mwbRvZZVJ2l8m": {
        "instructions": "Reserve 4 raspberries and cut off 4 slices of lemon for the garnish. Mash the raspberries and sugar in a small bowl and let sit at room temperature to thaw and bring out their juices, about 15 minutes. Set a sieve over a pitcher and juice the lemons. Rinse the sieve and add the raspberries. Push the raspberry mixture through the sieve with a rubber spatula, leaving the seeds in the sieve. Pour 1 quart of cold water through the sieve to get remove the remaining juices. Stir the lemonade and check for sweetness. Serve in ice-filled glasses and garnish with raspberry and a lemon slice. For the adults, add 1 1/2 ounces vodka to each glass.",
        "ingredients": [
            "1/2 cup frozen raspberries",
            "4 lemons",
            "3/4 cup sugar",
            "6 ounces raspberry or citrus vodka, divided, optional"
        ],
        "title": "Raspberry Lemonade",
        "picture_link": ".yrPRgcBH4LxQL5QJjDjVnSfCfY.ALS"
    },
    "VmS1LBqyLxp72wJLB/dquiaqCTDysWK": {
        "instructions": "Preheat the oven to 375 degrees F.\nPrepare the leg of lamb by rubbing salt, pepper, and chopped garlic all over the outside of the meat, then rub with the olive oil to coat. Put the lamb in a large baking pan, cover it with 4 orange slices, 4 lemon slices, and the rosemary. Bake for 2 hours. Serve the lamb sliced on a plate with the dressing on top.\n1 orange, zested\n1 lemon, zested\n1 cup olive oil\n1 cup fresh squeezed orange juice\n1/2 cup fresh squeezed lemon juice\n1/2 cup red wine vinegar\n2 cloves garlic\n2 tablespoons chopped fresh oregano leaves\n2 tablespoons salt\n1 teaspoon freshly ground black pepper\nPut all the ingredients into a blender. Blend until the dressing is completely uniform and creamy.",
        "ingredients": [
            "1 (9-pound) leg of lamb",
            "2 tablespoons salt",
            "1 tablespoon freshly ground black pepper",
            "2 cloves garlic, chopped",
            "1 cup olive oil",
            "1 medium orange, sliced",
            "1 large lemon, sliced",
            "2 stems fresh rosemary",
            "Dressing, recipe follows"
        ],
        "title": "Roasted Lamb",
        "picture_link": "JWjJTPf4FkwjfsBMVqcUIsDeuS5LDV2"
    },
    "5oVIDq2FKGFqmm13PE8AuY5PtOabiCK": {
        "instructions": "Heat 1 tablespoon of the oil in a wok or a large frying pan. Add the garlic and ginger, and saute until golden brown. Add the shrimp and cook for 1 to 2 minutes until pink, tossing from time to time. Remove and set aside in a bowl.\nHeat 1/2 tablespoon of oil in the same pan and add the eggs. Stir to scramble the egg into small pieces, remove and set aside with the shrimp.\nHeat the remaining oil in the pan and add the soy sauce, fish sauce, rice wine, red pepper flakes, and brown sugar. Stir briefly, add the drained noodles, and cook for 5 minutes.\nAdd the bean sprouts, chopped scallions, and cilantro. Mix well and continue to cook until noodles are heated through. Season, if necessary, with a little more soy sauce or fish sauce, sprinkle in lime zest and juice, and serve while hot!",
        "ingredients": [
            "1 1/2 tablespoons vegetable oil, divided",
            "1 tablespoon garlic, minced",
            "1 tablespoon ginger, minced",
            "16 large shrimp, peeled and deveined",
            "1 egg, lightly beaten",
            "2 tablespoons soy sauce",
            "1 tablespoon fish sauce",
            "1 tablespoon rice wine vinegar",
            "1/2 teaspoon red crushed pepper flakes",
            "1 teaspoon brown sugar",
            "7 ounces rice noodles, soaked in warm water for 10 to 15 minutes then drained",
            "1/2 cup bean sprouts",
            "3 scallions, sliced",
            "1 cup freshly chopped cilantro leaves",
            "1 lime, zested and juiced"
        ],
        "title": "Shrimp Pad Thai",
        "picture_link": "zdT.IiHRNKZbc0NHkpO4/RxVN61clyS"
    },
    "g3S3WKCYs3HPvbKcGqn4K6EEaYlOf/W": {
        "instructions": "Peel strings from celery with a Y-shaped vegetable peeler and cut celery into 1/4-inch-thick matchsticks.\nWhisk together juice, vinegar, and ginger and stir in celery and remaining ingredients with salt and pepper, to taste. Let stand at room temperature 15 minutes before serving.",
        "ingredients": [
            "2 celery ribs",
            "3 tablespoons fresh lime juice",
            "2 tablespoons seasoned rice vinegar",
            "1 teaspoon finely grated peeled fresh ginger",
            "2 firm Asian pears, cut into 1/4-inch-thick matchsticks",
            "2 scallions, thinly sliced diagonally",
            "1/4 cup fresh cilantro leaves",
            "1/2 teaspoon finely chopped fresh hot red chile, or to taste"
        ],
        "title": "Asian Pear Slaw",
        "picture_link": null
    },
    "ctP/mhCMhalYaSKIE2..B/N8oy16P5G": {
        "ingredients": [
            "4 ounces shredded pepper jack cheese (1 cup)",
            "1/2 cup black beans",
            "1/2 avocado, sliced",
            "2 8\" tortillas",
            "1 teaspoon lightly salted butter"
        ],
        "picture_link": null,
        "instructions": "1. Place shredded cheese, beans and avocado onto 1 tortilla. 2. Place 2nd tortilla on top. 3. Close the sandwich. 4. Spread evenly 1/2 teaspoon of lightly salted butter onto each side of the tortilla. 5. Grill over moderate heat for approximately 3-4 minutes per side. 6. Garnish with sour cream and salsa.\n1. Place shredded cheese, beans and avocado onto 1 tortilla.\n2. Place 2nd tortilla on top.\n3. Close the sandwich.\n4. Spread evenly 1/2 teaspoon of lightly salted butter onto each side of the tortilla.\n5. Grill over moderate heat for approximately 3-4 minutes per side.\n6. Garnish with sour cream and salsa.",
        "title": "Pepper Jack, Avocado and Black Beans in a Tortilla "
    },
    "XkvCjrgFwwQYuBgu5BlCWnrw0NTagHy": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 450 degrees F. Prepare a 10-inch cast iron skillet by heating it in the oven for 5 minutes. Remove the pan from the oven, add the butter, let it melt and set aside.\nPut the eggs and corn in the bowl of a food processor and pulse until the corn is slightly smooth. Add the cornmeal, flour, sour cream, sugar, baking powder and salt and pulse until smooth. Transfer the mixture to a bowl and fold in the jalapeno and melted butter.\nPour the batter into the skillet and bake until golden brown and a skewer inserted in the center comes out clean, about 20 minutes. Serve warm or room temperature.",
        "ingredients": [
            "4 tablespoons unsalted butter",
            "2 large eggs",
            "1 1/2 cups frozen corn, thawed",
            "1 cup yellow cornmeal",
            "1 cup all-purpose flour",
            "1 cup sour cream",
            "1 teaspoon sugar",
            "1/2 teaspoon baking powder",
            "1/2 teaspoon kosher salt",
            "1 jalapeno pepper, chopped"
        ],
        "title": "Jalapeno Cornbread",
        "picture_link": "zkvlZ56hbVuPXjWzxMttFkyqSyfUgAe"
    },
    ".ZDYcYpURNWo0QcT7JoGRRIN4vRBzpO": {
        "instructions": "In a steamer, set over boiling water, steam the carrots, covered, for 4 to 8 minutes, or until they are just tender. In a small skillet melt the butter with the honey over moderately low heat, add the carrots and salt and pepper to taste, and cook the carrots, tossing them, for 1 minute, or until they are well-coated with the glaze.;",
        "ingredients": [
            "1 pound baby carrots, trimmed and peeled",
            "2 tablespoons unsalted butter",
            "2 tablespoons honey"
        ],
        "title": "Honey-Glazed Baby Carrots",
        "picture_link": null
    },
    "YHHYIOHHZEm37uVxRWc3oUx.ov/PjHy": {
        "instructions": "Mix the flour, eggs and a pinch of salt in a bowl, then gradually stir in up to 1 cup water to make a smooth, batter-like dough. Beat with a wooden spoon until bubbles form, then stir in the melted butter.\nBring a large saucepan of salted water to a boil. Place about 1 cup of the dough in a colander with large holes; use a rubber spatula to push the dough through the holes and into the boiling water. (Or use a spaetzle press.) Cook for about 1 minute after the spaetzle float to the surface, then transfer with a slotted spoon to another colander. Repeat with the remaining dough. Rinse the spaetzle in cold water if not serving immediately and set aside.\nBefore serving, saute the spaetzle in a skillet with the remaining 2 tablespoons butter until warmed through. Season with pepper and garnish with parsley.\nPhotograph by Kate Mathis",
        "ingredients": [
            "3 cups all-purpose flour",
            "2 large eggs",
            "Kosher salt",
            "4 tablespoons unsalted butter; 2 tablespoons melted",
            "Freshly ground pepper",
            "Chopped fresh parsley, for garnish"
        ],
        "title": "Homemade Spaetzle",
        "picture_link": "EJOoUg3kuAYsr2o.ym9GB5Vbs3HpLr."
    },
    "bm.BNGnYq6DNCRS8O1eT6b5OLEKa0X2": {
        "instructions": "Trim ends of the broccoli rabe and cut into 3-inch pieces.\nBring 2 inches water to a boil in a high sided skillet. Salt the water. Add the broccoli rabe and simmer 10 minutes, drain. Return skillet to the stove and heat extra-virgin olive oil over medium-high heat. Add sausage, brown and crumble 6 to 7 minutes. Add the broccoli rabe and stir to combine.",
        "ingredients": [
            "1 large bundle broccoli rabe, about 1 1/4 to 1 1/2 pounds",
            "Salt",
            "2 tablespoons extra-virgin olive oil",
            "1 pound bulk Italian hot or sweet sausage"
        ],
        "title": "Sausage and Broccoli Rabe",
        "picture_link": "dz74muVd/sDuMiiao54O0yY4ALIu6EC"
    },
    "nfWj/AEuJXXfJVUSStktZ3YEaqhmnky": {
        "instructions": "Thread the carrots, cucumber, lettuce and tomatoes onto 4 long wooden skewers, alternating the vegetables. Refrigerate; serve with the dressing.\nPhotograph by Levi Brown",
        "ingredients": [
            "2 carrots, thinly sliced diagonally",
            "1 cucumber, thinly sliced diagonally",
            "1/2 head iceberg lettuce, cut into 2 1/2-inch chunks",
            "1 cup grape or cherry tomatoes",
            "Blue cheese dressing, for serving"
        ],
        "title": "Salad on a Stick",
        "picture_link": ".hrjs.mxsVDMNRLCKBKX6LiJbhGQXMS"
    },
    "W1H8cE27VFurNIbN9X6ZgzC59zw.3GS": {
        "ingredients": [
            "1 2-pound package frozen hash brown potatoes, unthawed",
            "1 10 3/4-ounce can cream of celery soup, undiluted",
            "3 cups (packed) grated sharp cheddar cheese (about 12 ounces)",
            "1 cup sour cream",
            "1 cup finely chopped onion",
            "1 6-ounce can french fried onions"
        ],
        "picture_link": null,
        "instructions": "Preheat oven to 350°F. Combine first 5 ingredients in large bowl. Transfer to 13x9x2-inch glass baking dish. Bake until top is slightly golden, about 1 hour 10 minutes. Sprinkle with onions. Bake until golden brown, about 5 minutes.\nPreheat oven to 350°F. Combine first 5 ingredients in large bowl. Transfer to 13x9x2-inch glass baking dish. Bake until top is slightly golden, about 1 hour 10 minutes. Sprinkle with onions. Bake until golden brown, about 5 minutes.",
        "title": "Hash Brown Brunch Casserole "
    },
    "OFZb5F6L/N26JAEaPDlm81o6PmVIT.u": {
        "instructions": "In a small bowl, stir together mayonnaise, creme fraiche, cornichons, parsley, lemon juice, capers, mustard, tarragon, and salt and pepper, to taste until combined well.\nIn a large saucepan of salted boiling water, cook celery root 2 minutes. Drain celery root in a sieve and refresh under cold water. Dry celery root completely. Add celery root to sauce and stir together. Chill salad until ready to serve.",
        "ingredients": [
            "1/4 cup mayonnaise",
            "2 tablespoons creme fraiche or sour cream",
            "2 cornichons (sour gherkins), minced, or 1 tablespoon minced dill pickle",
            "1 tablespoon minced fresh parsley leaves",
            "2 teaspoons fresh lemon juice",
            "1/2 teaspoon drained bottled capers, minced",
            "1/2 teaspoon Dijon mustard",
            "Pinch dried tarragon, crumbled",
            "2 small celery roots (about 1 1/4 pound total), peeled and cut into matchstick pieces or shredded coarse"
        ],
        "title": "Celery Root Remoulade",
        "picture_link": null
    },
    "FP0izgfiJIAuCbkK.0f2Qc8S//OLUdG": {
        "instructions": "Clean and slice potatoes into bite sized rounds and boil until fork tender. Squeeze out the pulp from the head of garlic. Make vinaigrette by whisking garlic, mustard and vinegar in a bowl and then slowly whisking in olive oil, season with salt and pepper and add mustard seeds at the end. While potatoes are still warm and drained, toss with vinaigrette. Just before serving add onions, herbs and watercress.",
        "ingredients": [
            "2 pounds fingerling potatoes (you can also use red bliss or other heirloom potatoes)",
            "1 tablespoon roasted garlic (1 head rubbed with olive oil then baked at 350 degrees for 45 minutes)",
            "2 1/2 teaspoons Dijon mustard",
            "1/2 cup red wine vinegar",
            "1 1/2 cups olive oil",
            "1 tablespoon yellow mustard seeds",
            "Salt and pepper",
            "2 medium red onions, sliced thin",
            "1/3 cup fresh chopped herbs (parsley, tarragon, and thyme)",
            "2 bunches watercress"
        ],
        "title": "Mustard Seed Potato Salad",
        "picture_link": null
    },
    "0YzatppKPM17idlxYCouYUV3bPVcAcm": {
        "instructions": "Combine cucumber, cabbage, and onion in a bowl. Bring the rice vinegar, sugar, 1/2 cup water and salt, to taste, to a boil in saucepan, stirring, and immediately pour over cucumber mixture. Toss mixture and let stand at room temperature, stirring occasionally, for 10 minutes. To cool quickly, chill in freezer 15 minutes.;",
        "ingredients": [
            "2/3 English cucumber, halved lengthwise and thinly sliced crosswise",
            "1/2 small red cabbage, very thinly sliced",
            "1 red onion, thinly sliced",
            "1 cup rice vinegar (not seasoned)",
            "2/3 cup sugar",
            "1/2 cup water",
            "Salt"
        ],
        "title": "Pickled Cucumber and Red Cabbage",
        "picture_link": null
    },
    "urY2qBwvvvuIy.48G3Y4AJC/Z5g.qra": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 350 degrees F. Place 16 paper liners in muffin pans.\nIn the bowl of an electric mixer fitted with the paddle attachment, cream the butter and sugar until light and fluffy, about 5 minutes. With the mixer on low speed, add the eggs 1 at a time, then add the vanilla, sour cream, and milk. In a separate bowl, sift together the flour, baking powder, baking soda, and salt. With the mixer on low speed add the flour mixture to the batter and beat until just mixed. Fold in the blueberries with a spatula and be sure the batter is completely mixed.\nScoop the batter into the prepared muffin pans, filling each cup just over the top, and bake for 25 to 30 minutes, until the muffins are lightly browned on top and a cake tester comes out clean.",
        "ingredients": [
            "12 tablespoons (1 1/2 sticks) unsalted butter, at room temperature",
            "1 1/2 cups sugar",
            "3 extra-large eggs, at room temperature",
            "1 1/2 teaspoons pure vanilla extract",
            "8 ounces (about 1 cup) sour cream",
            "1/4 cup milk",
            "2 1/2 cups all-purpose flour",
            "2 teaspoons baking powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon kosher salt",
            "2 half-pints fresh blueberries, picked through for stems"
        ],
        "title": "Blueberry Coffee Cake Muffins",
        "picture_link": "oIKOhKfDUfWnX7qzwqRN2jhRNvET3Z."
    },
    "swoMd/KUZTOr/iwd1nRWZeRHtGi071a": {
        "ingredients": [
            "8 cups water",
            "2 teaspoons salt",
            "2 cups polenta (not quick-cooking) or yellow cornmeal (10 ounces)"
        ],
        "picture_link": null,
        "instructions": "Bring water to a boil with salt in a 4-quart heavy pot, then add polenta in a thin stream, whisking. Cook over moderate heat, whisking, 2 minutes. Reduce heat to low and simmer polenta, covered, stirring for 1 minute after every 10 minutes of cooking, 45 minutes total. Remove from heat and serve warm.\nBring water to a boil with salt in a 4-quart heavy pot, then add polenta in a thin stream, whisking. Cook over moderate heat, whisking, 2 minutes. Reduce heat to low and simmer polenta, covered, stirring for 1 minute after every 10 minutes of cooking, 45 minutes total. Remove from heat and serve warm.",
        "title": "Creamy Polenta "
    },
    "ugmJpqLWs1d/IUN5SdOY1hs0MfELB9e": {
        "instructions": "Spread the mango chutney over the tortilla and sprinkle with the Mediterranean spice blend. Top with turkey, spinach and cheese.\nRoll-up and serve immediately or wrap in plastic wrap and refrigerate until ready to serve.",
        "ingredients": [
            "1 (8-inch) whole wheat tortilla",
            "1/4 teaspoon mango chutney",
            "1/4 teaspoon Mediterranean spice blend",
            "4 slices Hillshire Farm(R) Lower Sodium Oven Roasted Turkey",
            "1/4 cup baby spinach leaves",
            "1 slice Manchego cheese (can be substituted with fat-free feta)"
        ],
        "title": "Mango Chutney Turkey Wrap",
        "picture_link": ".B33rJ4brRIvrLymt0OMt9GFvXIOyGm"
    },
    "QngWp4.jCAa7w5A71v66OTYn.cvI3Sy": {
        "instructions": "Preheat the oven to 400 degrees F. Place a heavy duty sheet tray into the oven to heat.\nAdd the sweet potatoes to a large bowl and drizzle with the olive oil. Season with the cinnamon, cumin, salt and pepper.\nSpread out on the hot sheet tray and bake until crisp, 25 to 30 minutes. Flip the fries halfway through roasting.",
        "ingredients": [
            "2 large (about 1 1/2 pounds) sweet potatoes, peeled & cut into thin fries",
            "2 tablespoons olive oil",
            "1 teaspoon ground cinnamon",
            "1/8 teaspoon ground cumin",
            "Kosher salt and freshly ground black pepper"
        ],
        "title": "Oven Roasted Cinnamon Sweet Potato Fries",
        "picture_link": "bWCPvQQuii0BzNiOFtqjGHJhpvmvJm2"
    },
    "wnlgq6By4xfUtVoMl12eMMVaCpomq4u": {
        "instructions": "Preheat the broiler.\nPlace the first 4 ingredients in a medium mixing bowl and toss together. Let stand for at least 30 minutes.\nDrain the excess liquid from the fruit mixture and reserve. Melt half of the unsalted and clarified butters in a medium non-stick pan over medium-high heat. Add half of the fruit mixture and brown for 3 minutes.\nPour half of the pancake batter over the fruit starting from the center of the pan. Let batter set for about 3 minutes, and then place under the broiler for about 3 to 4 minutes, or until lightly browned. Watch carefully the whole time, as it may brown more quickly. Remove from the oven. Place a large enough plate to cover the pan over the pan and invert onto the plate. Repeat with the second half of the fruit and batter.\nGarnish with powdered sugar and serve.",
        "ingredients": [
            "4 Babcock peaches or Braeburn apples, peeled and sliced",
            "1/4 cup brown sugar",
            "1/4 cup vanilla sugar or regular sugar",
            "2 teaspoons vanilla extract",
            "4 tablespoons unsalted butter",
            "4 tablespoons clarified or melted butter",
            "2 cups Gingerbread Pancake batter, or your favorite pancake batter",
            "2 tablespoons powdered sugar"
        ],
        "title": "Babcock Peach or Braeburn Apple Pancake Tatins",
        "picture_link": "Xk/Cr5CiOtHwH9.XQfv8.Rw/qKOoAxy"
    },
    "x1S6wN9aJvtJgJbG8L2RHBknbhV4WoO": {
        "instructions": "Stir together the garlic, chiles, oregano and oil in a large baking dish. Add the steaks and turn to coat in the marinade. Cover and refrigerate for at least 4 hours and up to 8 hours.\nHeat grill to high. Remove the steaks from the refrigerator 30 minutes before grilling to take the chill off. Remove from the marinade and season liberally on both sides with salt and pepper. Grill the steaks on both sides until golden brown and slightly charred and cooked to medium-rare and an instant-read thermometer registers 130 degrees F. Remove from the grill to a cutting board and let rest, loosely tented with foil, for 10 minutes. Slice into 1/2-inch thick slices and serve.",
        "ingredients": [
            "8 cloves garlic, finely chopped",
            "3 Anaheim chiles, stems removed, sliced with seed and coarsely chopped",
            "3 tablespoons finely chopped oregano leaves",
            "1/2 cup canola oil",
            "3 (1-inch) thick bone-in rib-eye",
            "Salt and coarsely ground black pepper"
        ],
        "title": "Rib-Eye Marinated in Garlic, Anaheim Chiles and Fresh Oregano",
        "picture_link": null
    },
    "Kd0Q74kBW8glkS.zYpvQnvsidxT5iim": {
        "instructions": "Place the chopped chocolate into a large bowl. In a heavy saucepan heat the heavy cream until it just begins to simmer. Pour the cream over the chocolate. Stir until all of the chocolate has melted. The ganache is ready to pour.",
        "ingredients": [
            "12 ounces heavy cream",
            "12 ounces semisweet chocolate, chopped"
        ],
        "title": "Chocolate Ganache",
        "picture_link": null
    },
    "vhlTt3DmOJ6doXlxxqSsCqInFeZo7jS": {
        "instructions": "Watch how to make this recipe.\nHeat a gas grill to medium-high heat on one side and medium heat on the other.\nGenerously season the steak with salt and pepper. Use a clean tea towel to brush the grill grates with oil.\nGrill the steak on each side for 5 to 6 minutes for medium. Remove from the grill and allow to rest for 5 minutes. While the steak rests, prepare the salad.\nIn a separate bowl, add the vinegar and drizzle in the olive oil while whisking and season with salt and pepper. Add the arugula and tomatoes and toss to coat. Divide and arrange the salad between two plates. Slice the steak and divide between the two plates.",
        "ingredients": [
            "1 (20-ounce) rib eye steak, 1 1/2-inches thick",
            "Kosher salt and freshly ground pepper",
            "2 tablespoons extra-virgin olive oil, plus more for grill grates",
            "1 tablespoon balsamic vinegar",
            "2 large handfuls arugula",
            "1 cup cherry tomatoes, halved"
        ],
        "title": "Grilled Rib Eye with Tomato and Arugula Salad",
        "picture_link": "I59Reg9pwgi9KnW0iT7TFmolpACjk7G"
    },
    "pkm4GNhNCQ0MMWiuUN5hJWlFCe2n5SK": {
        "instructions": "Heat the butter and 1 tablespoon olive oil in a soup pot over medium heat. Add the onion, garlic, and thyme and cook until the vegetables are good and soft, 8 to 10 minutes. Dust the vegetables with flour and stir to coat everything well. Pour in the vegetable stock and bring to a boil. Add the cream and the potatoes, bring to a boil and boil hard for about 7 minutes, until the potatoes break down (this will help to thicken the soup and give it a good texture).\nCut the corn kernels off the cob and add to the soup. Season with salt and pepper and simmer until the corn is soft, about 10 to 12 minutes. Stir in the parsley and give it another little drink of olive oil. Ladle the soup into bowls and serve.",
        "ingredients": [
            "2 tablespoons butter",
            "Extra-virgin olive oil",
            "1 onion, diced",
            "2 garlic cloves, minced",
            "6 sprigs fresh thyme, leaves only",
            "1/4 cup all-purpose flour",
            "6 cups canned vegetable stock",
            "2 cups heavy cream",
            "2 Idaho potatoes, peeled and diced",
            "6 ears corn",
            "Salt and freshly ground black pepper",
            "1/4 cup chopped fresh parsley leaves"
        ],
        "title": "Corn Chowder",
        "picture_link": null
    },
    "GYQc9jGITyvegGRWswWy.10MgTZ6ya2": {
        "instructions": "Heat the coconut oil and chocolate over a double boiler of simmering water, stirring until melted. Turn off the heat and let cool for 5 minutes. Divide the ice cream among 3 bowls. Pour over the sauce; it will harden immediately.",
        "ingredients": [
            "2 tablespoons coconut oil",
            "8 ounces dark, milk or bittersweet chocolate, broken into pieces",
            "1 pint ice cream"
        ],
        "title": "Chocolate Shell Sauce for Ice Cream",
        "picture_link": "yzoGFtss7/LumqiPKJu3Uc2iIYWSzT2"
    },
    "KQtnd..xZBkiZPtqT/UjgLiXFKJWA3i": {
        "instructions": "Special equipment: 4 sheets of cello paper\nHalf freeze the fresh salmon, so it can be cut easily. Cut thinly the fresh salmon in very small cubes, add salt, pepper, then the chopped shallot, the chive and the mayonnaise. Mix together.\nPut 4 sheets of cello paper on your table, put on top the slices of smoked salmon, and then the fresh salmon tartar. Then you close the plastic wrap and you twist it to make a little balluchon. Then you take away the plastic wrap. To make the sauce: Crush the raspberries with the salt, the pepper and the hot sauce, add the vinegar and mix thoroughly. Add the olive oil and the cream. Place a cucumber rose on a plate, and place the balluchon on top. Make the balluchon shiny by pouring a little bit of olive oil on it. Put the sauce all around it and decorate with fresh raspberries and caviar.",
        "ingredients": [
            "9 ounces (250 grams) fresh salmon",
            "Sea salt and freshly ground black pepper",
            "1 shallot, finely chopped",
            "1 bunch chives, thinly sliced",
            "2 ounces mayonnaise",
            "4 slices smoked salmon",
            "5 fresh raspberries",
            "Sea salt and freshly ground black pepper",
            "Hot pepper sauce",
            "2 ounces raspberry vinegar",
            "4 ounces (100 grams) olive oil",
            "4 ounces light cream",
            "1 cucumber, thinly sliced and formed into roses",
            "Salmon caviar"
        ],
        "title": "Fresh Smoked Salmon Tartar with Raspberries",
        "picture_link": null
    },
    "I/d01xHYPfXpstlZ0z6AcwZWBI2oVoi": {
        "ingredients": [
            "1 cup chopped fresh cilantro leaves",
            "4 garlic cloves, minced",
            "2 tablespoons apple cider vinegar",
            "1 tablespoon fresh lime juice",
            "3/4 cup olive oil",
            "1/2 teaspoon hot pepper sauce"
        ],
        "picture_link": null,
        "instructions": "Blend first 4 ingredients in food processor until cilantro is finely chopped, about 15 seconds. Transfer mixture to medium heatproof bowl. Heat oil in medium skillet over medium heat until hot; slowly whisk into cilantro mixture. Mix in hot sauce. Season sauce to taste with salt and pepper; transfer to small bowl. Serve with plantain chips. (Dip can be made 2 hours ahead. Let stand at room temperature.)\nBlend first 4 ingredients in food processor until cilantro is finely chopped, about 15 seconds. Transfer mixture to medium heatproof bowl.\nHeat oil in medium skillet over medium heat until hot; slowly whisk into cilantro mixture. Mix in hot sauce. Season sauce to taste with salt and pepper; transfer to small bowl. Serve with plantain chips. (Dip can be made 2 hours ahead. Let stand at room temperature.)",
        "title": "Warm Cilantro Dipping Sauce "
    },
    "lWq0Mrjl5SeH7vD.elPRP48n2SLyx4y": {
        "instructions": "Watch how to make this recipe.\nTo make the meatballs: Stir the first 6 ingredients in a large bowl to blend. Stir in the cheese, beef and pork. Using 1 1/2 teaspoons for each, shape the meat mixture into 1-inch-diameter meatballs. Place on a baking sheet.\nTo make the soup: Bring the broth to a boil in a large pot over medium-high heat. Add the meatballs and curly endive and simmer until the meatballs are cooked through and the curly endive is tender, about 8 minutes. Whisk the eggs and cheese in a medium bowl to blend. Stir the soup in a circular motion. Gradually drizzle the egg mixture into the moving broth, stirring gently with a fork to form thin stands of egg, about 1 minute. Season the soup to taste with salt and pepper.\nLadle the soup into bowls and serve. Finish soup with parmesan cheese if desired.",
        "ingredients": [
            "1 small onion, grated",
            "1/3 cup chopped fresh Italian parsley",
            "1 large egg",
            "1 teaspoon minced garlic",
            "1 teaspoon salt",
            "1 slice fresh white bread, crust trimmed, bread torn into small pieces",
            "1/2 cup grated Parmesan",
            "8 ounces ground beef",
            "8 ounces ground pork",
            "Freshly ground black pepper",
            "12 cups low-sodium chicken broth",
            "1 pound curly endive, coarsely chopped (1 pound of escarole would be a good substitution)",
            "2 large eggs",
            "2 tablespoon freshly grated Parmesan, plus extra for garnish",
            "Salt and freshly ground black pepper"
        ],
        "title": "Italian Wedding Soup",
        "picture_link": "Md3SecXnNkcEX1MTUvgbeZ5D.1kaEca"
    },
    "6FqODRLUQrdgkkYX1GKRxgTJN4VxYn2": {
        "instructions": "Combine marinade ingredients in the bottom of a shallow dish. Season meat of choice with salt and pepper and set meat into marinade and turn to coat. Allow meat to hangout 10 minutes.\nHeat a nonstick skillet over medium high heat. Add marinated meat to the pan and cook 5 or 6 minutes on each side. Remove meat from the pan to a warm platter. Add butter to the skillet, chopped shallot or onion and mushroom bits (optional) then saute for 3 minutes over moderate heat. Add flour to the pan and cook for 2 minutes, stirring constantly. Whisk in stock and reduce for another minute. Pour pan gravy over the meat and serve.",
        "ingredients": [
            "3 tablespoons red wine vinegar",
            "1/3 cup extra-virgin olive oil",
            "2 cloves garlic, chopped",
            "1/4 to 1/2 teaspoon crushed red pepper flakes",
            "1 tablespoon chopped fresh thyme leaves, a few sprigs",
            "1 tablespoon chopped parsley leaves, half a palm full",
            "4 to 6 (1-inch) thick beef tournedos (filet steaks), 6 ounces each",
            "4 strip steaks, 12 ounces each",
            "4 pieces boneless skinless chicken breast, 6 to 8 ounces each",
            "4 center cut pork loin chops, 8 ounces each, 1 inch thick",
            "2 tablespoons butter",
            "2 tablespoons chopped shallot or onion",
            "4 mushrooms, crimini or button, finely chopped, optional",
            "2 tablespoons all-purpose flour, a handful",
            "1 cup beef, chicken or vegetable stock, found on soup aisle"
        ],
        "title": "Marinated No-Mystery Meats",
        "picture_link": "oL8Dy8CLtErUzjjWSpgFabL8920f3dy"
    },
    "fACQsNu.nRQbq5FOvOvkaOvORLOgNJy": {
        "ingredients": [
            "3/4 cup fresh lemon juice",
            "1 tablespoon finely grated fresh lemon zest",
            "3/4 cup sugar",
            "3 large eggs",
            "1 stick (1/2 cup) unsalted butter"
        ],
        "picture_link": "w1an9iBd34Ge.Wj6PlJ7wvXr7nWyacK",
        "instructions": "Whisk together lemon juice, lemon zest, sugar, and eggs in a 2-quart saucepan. Cut butter into bits and add to mixture. Cook mixture, stirring constantly, over moderately low heat until curd is thick enough to hold marks of whisk and first bubble appears on surface, about 6 minutes. (You can make the curd 1 week ahead and chill it, covering its surface with plastic wrap.)\nWhisk together lemon juice, lemon zest, sugar, and eggs in a 2-quart saucepan.\nCut butter into bits and add to mixture.\nCook mixture, stirring constantly, over moderately low heat until curd is thick enough to hold marks of whisk and first bubble appears on surface, about 6 minutes. (You can make the curd 1 week ahead and chill it, covering its surface with plastic wrap.)",
        "title": "Lemon Curd "
    },
    "lA40Uy36PTtybi2/C73aB3mF/peNGHO": {
        "ingredients": [
            "8 to 9 ounce egg fettuccine in nests",
            "1/2 cup heavy cream",
            "1/2 stick unsalted butter, cut into pieces",
            "1/3 cup grated Parmigiano-Reggiano"
        ],
        "picture_link": "383GF57ldMoOjJcoiFksMMxn4Td7G2W",
        "instructions": "Cook fettuccine in a pasta pot of boiling salted water (2 tablespoons salt for 6 quarts water) until al dente. Reserve 1/2 cup cooking water, then drain pasta. Meanwhile, bring cream and butter to a simmer in a 12-inch heavy skillet over medium-low heat, adding 1/4 teaspoon salt and 1/2 teaspoon pepper. Add fettuccine, 1/4 cup reserved water, and cheese to sauce and toss. Add more cooking water if necessary.\nCook fettuccine in a pasta pot of boiling salted water (2 tablespoons salt for 6 quarts water) until al dente. Reserve 1/2 cup cooking water, then drain pasta.\nMeanwhile, bring cream and butter to a simmer in a 12-inch heavy skillet over medium-low heat, adding 1/4 teaspoon salt and 1/2 teaspoon pepper.\nAdd fettuccine, 1/4 cup reserved water, and cheese to sauce and toss. Add more cooking water if necessary.",
        "title": "Fettuccine Alfredo "
    },
    "UJlyhzS33WIa63eEhUDrnIQT7/wNNH2": {
        "instructions": "Bring 2 cups water to a boil in a small saucepan over high heat. Stir in the quinoa. Cover, reduce the heat to low and cook until the liquid is just absorbed and the quinoa is moist and nearly tender, about 15 minutes.\nTransfer the quinoa to a large bowl and immediately stir in the oil, apricots, 1 1/4 teaspoons salt and 3/4 teaspoon pepper. Set aside to cool slightly, about 20 minutes, stirring a couple times. Refrigerate until chilled, at least 2 hours.\nWhen the quinoa is cool and ready to serve, stir in the arugula, basil, lemon juice and pistachios. Add salt and pepper to taste. Sprinkle with the goat cheese and serve.",
        "ingredients": [
            "1 cup quinoa, rinsed and strained",
            "2 1/2 tablespoons extra-virgin olive oil",
            "12 dried apricots, finely diced, or 1/2 cup packed golden seedless raisins",
            "Kosher salt and freshly ground black pepper",
            "5 cups packed baby arugula (about 5 ounces)",
            "1/4 cup thinly sliced fresh basil",
            "Juice of 1 large lemon (about 1/4 cup)",
            "1/2 cup shelled lightly salted pistachios",
            "3 ounces soft goat cheese, crumbled"
        ],
        "title": "Quinoa Salad with Apricots, Basil and Pistachios",
        "picture_link": "RH29eCGRigmdqybszRtgzsyHj0w94gC"
    },
    "poBxiOOm8c93gX2AsVdXPrlDJj235L6": {
        "ingredients": [
            "2 well-chilled 750-ml. bottles champagne or sparkling cider",
            "1 cup well-chilled cranberry juice cocktail, or to taste",
            "3 tablespoons Grand Marnier or other orange-flavored liqueur, or to taste, if desired"
        ],
        "picture_link": null,
        "instructions": "In a large pitcher stir together well the champagne, the cranberry juice cocktail and the Grand Marnier.\nIn a large pitcher stir together well the champagne, the cranberry juice cocktail and the Grand Marnier.",
        "title": "Cranberry Champagne Cocktail "
    },
    "jGeeLeXea12ByuwgWOZEAT8x8Grvr46": {
        "instructions": "Preheat oven to 350 degrees.\nIn a baking pan, spread seeds evenly and toast, stirring once halfway through toasting, until seeds are deep golden, about 12 minutes. Cool seeds, and in a food processor, pulse with salt until coarsely ground. Sesame salt may be made 2 weeks ahead and kept, covered, at room temperature.\nIn a saucepan, cover eggs with cold water by 1 inch and bring just to a boil. Remove pan from heat and let eggs stand, covered, 7 minutes for quail eggs or 17 minutes for chicken eggs. Drain water from pan and run cold water over eggs, cracking shells against side of pan. Peel eggs, and quarter chicken eggs if using. Serve eggs with sesame salt.",
        "ingredients": [
            "3/4 cup sesame seeds",
            "1 teaspoon coarse salt",
            "16 quail eggs, or 4 chicken eggs"
        ],
        "title": "Quail Eggs with Toasted-Sesame Salt",
        "picture_link": null
    },
    "GVCjQr2XjC6sB.SaaqAnwnUcFNK0GzS": {
        "instructions": "Watch how to make this recipe.\nSlice the pound cake horizontally into 3 pieces. Place the first slice in a loaf tin lined with plastic wrap. Cover the cake with the vanilla ice cream, followed by three-quarters of the chopped peanut butter cups. Add a second layer of cake and cover with the chocolate ice cream, followed by three-quarters of the chocolate candies. Place the last layer of cake on top, followed by the chocolate chip ice cream. Cover with the chocolate shell sauce, then the remaining peanut butter cups and chocolate candies. Let the sauce set for a few seconds, then fold over the plastic wrap and place in the freezer until frozen, about 4 hours.\nWhen ready to serve, pull back the plastic wrap, gently lift the cake out and peel off the wrapping completely. Slice to serve.",
        "ingredients": [
            "1 pound cake",
            "1 cup vanilla ice cream, slightly softened",
            "4 large peanut butter cup candies, roughly chopped",
            "1 cup chocolate ice cream, slightly softened",
            "1/2 cup chocolate candies, such as M and Ms, roughly chopped",
            "1 cup chocolate chip ice cream, slightly softened",
            "Chocolate shell ice cream sauce (the type that hardens), such as Smucker's Magic Shell, for covering the top"
        ],
        "title": "Ice Cream Layer Cake",
        "picture_link": "7NYSe/Y7v3Y1j1OVn3vRs83EBQ/Y8pi"
    },
    "0MorCRCIkDPevEXSjvCuMD6QIfU2vVe": {
        "instructions": "Set a saucepan over high heat. Pour in the milk and water. Add the salt and vanilla extract. Bring the liquids to a boil.\nWhen the milky water is boiling, pour in the oats. Stir quite vigorously. When the water returns to a boil, turn down the heat to low. Simmer the oats, stirring every few minutes, until the oats are creamy and plump, the liquid fully absorbed, about 15 minutes.\nTurn off the heat and cover the pan. Let the oatmeal sit for five minutes to fully absorb the liquid.\nTop with your favorite sweetener and fruit. (This one is maple syrup, peaches, and blackberries.)\nVariations: If you cannot eat dairy, almond milk or hemp milk work well here too.\nIf you have a fresh vanilla bean, scrape the insides of it into the pot instead of vanilla extract. This will be the best oatmeal you have ever eaten.",
        "ingredients": [
            "1 cup whole milk",
            "1 cup water",
            "1/2 teaspoon kosher salt",
            "1 teaspoon vanilla extract",
            "1 cup whole rolled gluten-free oats"
        ],
        "title": "A Bowl of Gluten-Free Oatmeal",
        "picture_link": "uSO8D0KAiidQ2jEuLhO/4UK8nwPqGse"
    },
    "UOXsIFbsfw8vEuQ5ETdfAt9YmZDrT1m": {
        "instructions": "Place the onions in a small bowl and cover with cold water. Let soak for 15 minutes. Drain.\nMeanwhile, using a small knife and your hands, remove the skin, bones, and any brown bits from the whitefish and discard. Flake the whitefish into small pieces into a medium bowl, checking again for any bones.\nAdd the egg and onion to the whitefish and mash together with a fork. Stir in the mayonnaise and lemon juice. (For a smoother textured salad, pulse the whitefish mixture in a food processor.) Season with salt and pepper to taste. Serve immediately or store in the refrigerator for up to 3 days.",
        "ingredients": [
            "1/4 medium yellow onion, finely chopped",
            "1/2 whole smoked whitefish (about 2 pounds) (see note)",
            "1 hard-boiled large egg, finely chopped",
            "3/4 cup mayonnaise",
            "1 tablespoon freshly squeezed lemon juice",
            "Kosher salt and freshly ground black pepper"
        ],
        "title": "Smoked Whitefish Salad",
        "picture_link": null
    },
    "zKik8vKR7tGQQFUxWDFxzT6C6RL7QjG": {
        "ingredients": [
            "1 medium red onion, thinly sliced (about 1 cup)",
            "1/4 cup red wine vinegar or apple cider vinegar",
            "1/2 teaspoon sugar",
            "Kosher salt"
        ],
        "picture_link": "W3h9wEB9zmFOVw5GjKJeLrkpCdi.Zaa",
        "instructions": "Place onion slices in a medium bowl. Pour vinegar and 1/2 cup warm water over onion. Stir in sugar and season with salt; let stand until slightly pickled, about 30 minutes. Drain. DO AHEAD: Can be made 2 days ahead. Let cool slightly. Cover and refrigerate.\nPlace onion slices in a medium bowl. Pour vinegar and 1/2 cup warm water over onion. Stir in sugar and season with salt; let stand until slightly pickled, about 30 minutes. Drain. DO AHEAD: Can be made 2 days ahead. Let cool slightly. Cover and refrigerate.",
        "title": "Pickled Onions "
    },
    "s90G1r4P6nJRA/OQubWJBnnUXNklqUy": {
        "instructions": "Preheat the oven to 425 degrees F.\nLay the pepperoni slices in a single layer on a baking sheet and bake for 8 to 10 minutes.\nRemove the pan from the oven and soak up the excess grease by pressing paper towels against the pepperoni chips. Return the pan to the oven and bake an additional 2 to 4 minutes, until the pepperoni slices are very crispy.\nServe as a snack anytime or use in place of crackers for dipping or for topping with your favorite cheese! They'll stay fresh and crispy for 1 to 2 days if you store them in an airtight container.",
        "ingredients": [
            "6 ounces pepperoni, thinly sliced"
        ],
        "title": "Crispy Pepperoni Chips",
        "picture_link": null
    },
    "UOL/1C1ZW/RQDLHSBkPhqYvW1Y/lLoG": {
        "instructions": "Watch how to make this recipe.\nHeat a small skillet with the butter over medium heat. Add the onions, season with salt ground thyme, bay leaf and cook until very soft and sweet and lightly caramelized, 20 minutes. Season with salt and pepper, to taste, and discard the bay leaf.\nWhile the onions cook, put the potatoes in a medium pot and cover with water. Bring to a boil, then salt the water and cook to tender, 12 to 15 minutes. Drain and return the potatoes to the hot pot. Mash the potatoes with the cream and Parmesan and season with salt and pepper, to taste.\nPreheat the broiler.\nArrange the mashed potatoes in individual gratin dishes or 1 shallow casserole. Top the potatoes with the onions and Gruyere cheese. Put them on a sheet pan and brown under a hot broiler until bubbly, about 2 minutes. Remove from the oven and serve hot.",
        "ingredients": [
            "2 tablespoons butter",
            "1 large or 2 medium sweet onions, such as Vidalia, thinly sliced",
            "Salt and freshly ground black pepper",
            "1/2 teaspoon ground thyme",
            "1 bay leaf, fresh or dried",
            "2 pounds baby Yukon gold potatoes or fingerling potatoes",
            "1/2 to 2/3 cup heavy cream",
            "1/2 cup grated Parmigiano-Reggiano",
            "1/2 pound brick Gruyere or Swiss cheese, shredded"
        ],
        "title": "Sweet Onion Potatoes Au Gratin",
        "picture_link": "hP5lEXNfE.cuQfAiI/O.7xsscTMRx4e"
    },
    "CugcnJwqowtoQQLj0t.2NexzTSQXQhu": {
        "instructions": "Puree banana with yogurt and season with some superfine sugar and a dash of rum. Spoon into the bottom of wine glasses and spoon grapes over the top; garnish with mint or pistachios.",
        "ingredients": [
            "1 ripe small banana, peeled and sliced",
            "1/2 cup plain whole milk yogurt",
            "Superfine sugar to taste",
            "Dash of rum",
            "1 1/2 cups red seedless grapes, rinsed and halved",
            "Mint leaves, or chopped pistachio nuts for garnish"
        ],
        "title": "Grapes with Yogurt Sauce",
        "picture_link": null
    },
    "IOgMb0ZUmQZ6MUkBMyfr8rk.u4FA9Rq": {
        "ingredients": [
            "2 teaspoon Sherry vinegar (available at specialty foods shops and supermarkets)",
            "1 teaspoon Dijon-style mustard",
            "1/4 teaspoon sugar",
            "1 teaspoon water",
            "3 tablespoons olive oil",
            "1 bunch of chicory, rinsed, spun dry, and torn into pieces (about 4 cups packed)",
            "1/2 cup coarsely grated carrot"
        ],
        "picture_link": null,
        "instructions": "In a bowl whisk together the vinegar, the mustard, the sugar, the water, and salt and pepper to taste, add the oil in a stream, whisking, and whisk the dressing until it is emulsified. Add the chicory and the carrot and toss the salad well.\nIn a bowl whisk together the vinegar, the mustard, the sugar, the water, and salt and pepper to taste, add the oil in a stream, whisking, and whisk the dressing until it is emulsified. Add the chicory and the carrot and toss the salad well.",
        "title": "Chicory and Carrot Salad "
    },
    "2drTWa2AH69DHskFfm7rBbf.Am1THg6": {
        "instructions": "Preheat oven to 350 degrees. Whip eggs, sugar and salt until tripled in volume. Fold in flour. Pour mixture into parchment lined 9 by 11-inch baking pan and bake for 25 to 30 minutes. Set aside to cool.\nRemove parchment paper and return cake to pan. With a fork, poke holes all over the top of the cake. Combine remaining ingredients and pour over cake. Allow liquid to soak in for 2 hours. Serve with fresh fruit and whipped cream.",
        "ingredients": [
            "6 eggs",
            "1 cup sugar",
            "1/8 teaspoon salt",
            "1 cup flour",
            "1 can sweetened condensed milk",
            "1 can evaporated milk",
            "2 cups whole milk, scalded",
            "1 teaspoon almond extract",
            "2 teaspoons vanilla extract"
        ],
        "title": "Tres Leches",
        "picture_link": null
    },
    "KdYehYQhh0dykb/4sNC.CjGQqacJ9QW": {
        "instructions": "Bring stock to a boil in a nonreactive saucepan (do not use aluminum which will react with eggs which come into play later on).\nAdd bay leaf, sage, thyme and garlic cloves and cook, covered, at a bare simmer for 30 minutes.\nStrain broth and discard herbs; pass and press garlic through to liquid and season to taste with salt. In a mixing bowl combine the cheese with egg and yolk, olive oil and pepper to taste. Everything can be done in advance up to this point.\nJust before serving, reheat the soup and drizzle a ladleful of hot soup into the egg and oil mixture to temper the eggs. Pour this tempered mixture back into the soup and whisk continuously over low heat until the soup thickens slightly. Take care not to over heat or the eggs will curdle.\nSet a piece of French bread crouton in center of soup plate and ladle soup over the top. Garnish with parsley.",
        "ingredients": [
            "1 quart chicken stock, preferably homemade or half of stock and water",
            "1 bay leaf",
            "Pinch dried sage",
            "1/2 teaspoon dried thyme",
            "1/2 head of garlic cloves, peeled",
            "Salt",
            "1 ounce each of freshly grated Parmesan and Swiss cheese",
            "1 egg mixed with 1 egg yolk",
            "1/4 cup good quality olive oil",
            "Freshly ground black pepper",
            "4 toasted bread croutons made of sliced French bread, optional",
            "1 to 2 tablespoons chopped parsley for garnish"
        ],
        "title": "Garlic Soup",
        "picture_link": null
    },
    "yQ8v1XJGSTndZVq1RBC3P7ev6Wy9k1i": {
        "instructions": "Whisk together mustards and wine. Pour over chicken; cover, refrigerate, and marinate 24 hours.\nTo prepare salsa combine grapes, pine nuts, red onion, green onion, parsley, oil, vinegar, and sugar; mix well. Season with salt and pepper.\nPreheat grill.\nSeason each chicken breast half with salt and pepper.\nGrill or broil chicken until firm and juices run clear, 8 to 10 minutes, turning once.\nPlate chicken and top with 1/2 cup grape salsa.\nCalories 261; Protein 28g; Fat 10g; Calories from Fat 36%; Carbohydrate 13g; Cholesterol 66mg; Fiber 1.6g; Sodium 510mg",
        "ingredients": [
            "1 1/4 cups Dijon-style mustard",
            "1 1/4 cups whole grain Dijon-style mustard",
            "1/2 cup dry white wine or chicken stock",
            "40 breast halves, 4 oz. each boneless, skinless chicken",
            "3 lbs., 12 oz. California seedless grapes, halved",
            "12 oz. pine nuts, toasted",
            "10 oz. red onion, chopped",
            "8 oz. green onion, chopped",
            "2 1/2 oz. (1 1/4 cups) fresh Italian parsley, chopped",
            "1/2 cup extra virgin olive oil",
            "1/2 cup red wine vinegar",
            "1/4 cup sugar",
            "Salt and fresh ground pepper, as needed"
        ],
        "title": "Dijon Chicken with Grape and Pine Nut Salsa",
        "picture_link": "26eF91k0CbNL3oBrLg0DW0YQC7DNKsW"
    },
    "cxolreYbSit742p.KPucwra1WcsfYXa": {
        "instructions": "In a large soup pot, heat the oil over high heat. Reduce the heat to medium-high, add the carrot, celery and onion and saute for 5 minutes. Add the garlic and saute for another 1 to 2 minutes.\nAdd the cabbage to the pot and cook, covered, stirring regularly to prevent burning, until softened, 6 to 8 minutes. Add the kielbasa and mustard and then add the chicken broth. Bring to a simmer and cook until the carrots are tender, 15 to 20 minutes.\nIn a bowl, mix together the butter and flour to form a buerre manier. Whisk the buerre manier into the soup and simmer for 20 minutes. Season with salt and pepper.",
        "ingredients": [
            "1/4 cup grapeseed oil",
            "2 cups diced carrot",
            "2 cups diced celery",
            "2 cups diced yellow onion",
            "2 tablespoons chopped garlic",
            "1 small head green cabbage, shredded",
            "1 pound Polish kielbasa, diced",
            "1/4 cup whole-grain mustard",
            "3 quarts chicken broth",
            "6 tablespoons unsalted butter",
            "3 ounces all-purpose flour",
            "Kosher salt and black pepper"
        ],
        "title": "Smoked Sausage and Cabbage Soup",
        "picture_link": "AiO5HIUGOm2hXt036yywuBjTAd.ex1m"
    },
    "gubwfcAt5nl3NDXlsVnMv6csja7R.xG": {
        "instructions": "Preheat oven to 425 degrees. Wash potatoes and poke 2 or 3 vent holes in each with a fork. Bake potatoes in oven until done, about 1 hour. (Poke with a fork and if fork goes in easily they are done). Remove potatoes from oven and allow to cool for 10 minutes. Slice potatoes in 1/2 lengthwise and scoop pulp into mixing bowl being careful not to break skin. Mash potatoes with butter, cheese, milk, and chives. Taste-test and adjust seasoning if necessary with salt and pepper. Spoon mashed potatoes back into skins and place in a 9 by 13-inch dish. Return to oven and heat thoroughly.",
        "ingredients": [
            "4 large baking potatoes",
            "1 stick butter",
            "1 cup grated Cheddar cheese",
            "3/4 cup milk, plus more if needed",
            "2 tablespoons chopped chives, optional",
            "Salt and pepper, to taste"
        ],
        "title": "Stuffed Baked Potatoes",
        "picture_link": null
    },
    "x4u3GoNtt7XGvajTWXjI9/p4Zok9FMq": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 350 degrees F.\nCombine the corn and eggs in blender and puree until thick and smooth. Transfer the puree to a bowl. Add the butter, sugar and milk and fold gently to incorporate well. Stir in the mozzarella cheese and bacon. Add the smoked paprika, cayenne, salt and pepper. The mixture should be thick and creamy.\nPour the corn mixture into a greased souffle dish and sprinkle with the Parmesan and parsley. Bake until browned, about 45 minutes. Let cool for about 15 minutes before serving. Serve warm.",
        "ingredients": [
            "2 1/2 cups corn kernels, fresh or frozen and thawed",
            "5 eggs",
            "2 tablespoons unsalted butter, cubed small",
            "2 tablespoons sugar",
            "1/2 cup milk",
            "1/2 cup grated mozzarella cheese",
            "6 slices bacon, cooked crisp and crumbled",
            "1 tablespoons smoked paprika",
            "1 teaspoon cayenne pepper",
            "1 1/2 tablespoons salt",
            "1 tablespoon cracked black pepper",
            "1/4 cup Parmesan",
            "3 tablespoons chopped parsley leaves"
        ],
        "title": "Big Daddy's Sweet Corn Spoon Bread",
        "picture_link": "118JP89m0QemIeBfUfD4Gd3KdcPmcde"
    },
    "kbu7COjjaZxUbReTuZA1Lop1vrd05ze": {
        "instructions": "Bring a large pot of salted water to a boil over medium heat. Add the potatoes and cook until just tender. Drain and turn out onto a cutting board. Smash the potatoes with the side of a large knife or spatula.\nHeat a large cast iron skillet over medium-high heat and add the olive oil. When the pan is very hot, but not smoking, add the cipollini onions, and cook until starting to caramelize, about 4 to 5 minutes Add in the drained artichokes and season with salt and pepper, to taste. Cook for 2 to 3 minutes before turning them so that they will caramelize. Add the potatoes and cook until the potatoes are starting to brown, then stir in the garlic and the thyme. Slowly pour in the chicken stock, scraping up the bits from the bottom of the pan. Sprinkle with the vinegar and adjust seasoning with salt and pepper, if necessary. Transfer to a platter and garnish with chopped parsley.",
        "ingredients": [
            "Salt",
            "8 medium fingerling potatoes, halved lengthwise",
            "3 tablespoons olive oil",
            "6 cipollini onions, peeled, sliced in half along equator",
            "1 (15-ounce) jar artichokes, (not marinated), with stems, drained, roughly chopped",
            "Freshly ground black pepper",
            "5 garlic cloves, smashed",
            "2 sprigs thymes, leaves chopped",
            "1/2 cup chicken stock",
            "1 tablespoon apple cider vinegar",
            "Chopped parsley leaves, for garnish"
        ],
        "title": "Artichoke, Onion, and Potato Hash",
        "picture_link": null
    },
    "u4Zrx7hrhmvkLLQtA6ttiYMf4CvUsLa": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 450 degrees.\nHalve the sweet potatoes lengthwise and cut each half into 3 long spears. Place them on a sheet pan and toss with the olive oil. Spread the potatoes in one layer. Combine the brown sugar, salt, and pepper and sprinkle on the potatoes. Bake for 15 minutes and then turn with a spatula. Bake for another 5 to 10 minutes, until lightly browned. Sprinkle lightly with salt and serve hot.",
        "ingredients": [
            "2 medium sweet potatoes, peeled",
            "2 tablespoons good olive oil",
            "1 tablespoon light brown sugar",
            "1/2 teaspoon kosher salt, plus extra for sprinkling",
            "1/2 teaspoon freshly ground black pepper"
        ],
        "title": "Baked Sweet Potato \"Fries\"",
        "picture_link": "VbdmgkaJL7FvMbP0z0fq9Jf/6BGDSFi"
    },
    "6bgIr8uUoogBnFgcJgTwexH4lfWd51W": {
        "instructions": "Cook the garlic in olive oil in a large skillet over medium-high heat, stirring occasionally, until golden brown and crispy, about 3 minutes; take care that the garlic doesn't get too brown or it will be bitter. Using a slotted spoon, transfer the garlic chips to a paper towel. Add the onions and red pepper (add a little more if you like things spicy) to the skillet and cook, stirring, until light brown, about 10 minutes. When the onions are almost done, add the greens in batches and cook, uncovered, just until tender, about 2 minutes. Cover and cook, stirring occasionally, until tender, about 5 minutes. Transfer to a serving dish. Top with the reserved garlic chips and garnish with cheese.",
        "ingredients": [
            "8 cloves peeled garlic, thinly sliced",
            "1/4 cup extra-virgin olive oil",
            "2 medium yellow onions, halved and sliced (3 to 4 cups)",
            "1/8 teaspoon crushed red pepper",
            "Kosher salt",
            "18 cups torn greens, such as mustard, kale, chard, escarole, or a mix (about 3 large bunches)",
            "Grated pecorino Romano or Parmesan"
        ],
        "title": "Spicy Greens with Garlic",
        "picture_link": null
    },
    "20D558WpBfZd4Da4Af.6KHtbZPfgm0i": {
        "instructions": "Preheat the oven to 375 degrees F. Lightly butter 6 (6-ounce) ramekins.\nWhisk the oats, flour, brown sugar, pecans, and salt in a medium bowl. Rub in the butter with your fingertips until it is in even, pea-size pieces. Peel, core, and coarsely chop the apples and divide evenly among the ramekins. Scatter the crisp topping evenly over the fruit in each ramekin.\nTransfer the ramekins to a baking sheet and cook until the fruit bubbles around the sides and the top is golden, about 30 minutes.\nPreheat a broiler. Place the crisps about 4 inches from the broiler and cook until golden brown, about 30 seconds. Let cool about 15 minutes before serving. Serve warm with whipped cream, if using.\nIn our diabetic-friendly desserts, we use small amounts of sweeteners in accordance with guidelines set up by the American Diabetic Association. As with all sweets, moderation is important.",
        "ingredients": [
            "2/3 cup rolled oats",
            "1/3 cup all-purpose flour",
            "1/3 cup dark brown sugar",
            "1/3 cup pecans, toasted, chopped",
            "Pinch fine salt",
            "6 tablespoons cold unsalted butter, cut into bits",
            "4 medium baking apples, such as Braeburn, Rome, or Golden Delicious,",
            "Unsweetened whipped cream, optional"
        ],
        "title": "Apple Crisp",
        "picture_link": "QJONeS883DRJULt9eyRvCfjqoEkbOzK"
    },
    "V3/Zwl0rqsryvoD6cO.kmPG/vhCaBVq": {
        "ingredients": [
            "2 1/2 pounds green cabbage (preferably Savoy), quartered, cored, and thinly sliced (14 cups)",
            "3/4 pound sugar snap peas, trimmed and thinly sliced diagonally (4 cups)",
            "3/4 cup well-shaken buttermilk",
            "1/2 cup sour cream",
            "1/4 cup chopped fresh dill",
            "2 garlic cloves, minced",
            "1 3/4 teaspoons salt",
            "1/2 teaspoon black pepper",
            "1 tablespoon white distilled vinegar"
        ],
        "picture_link": null,
        "instructions": "Toss together cabbage and peas in a large bowl. Whisk together remaining ingredients and pour over slaw, stirring to combine well. Add salt to taste, then chill, covered, at least 2 hours.\nToss together cabbage and peas in a large bowl. Whisk together remaining ingredients and pour over slaw, stirring to combine well. Add salt to taste, then chill, covered, at least 2 hours.",
        "title": "Sugar Snap Pea and Cabbage Slaw "
    },
    "dBZRzO3P0Cgm0jGcJB55Ru3YN1ftVH6": {
        "instructions": "Boil salted water. Have ice water ready on the side. Poach shrimp for just 30 seconds and cool in ice water and drain. Combine with fish and toss with onion, ginger, garlic, hot pepper, celery, salt, and black pepper. Allow to cool in the refrigerator at least 30 minutes up to 2 hours.\nAdd juices and refrigerate 1 hour. Finish with cilantro and corn, check seasoning and serve in a martini glass.",
        "ingredients": [
            "1 pound medium shrimp (16/20 per pound), peeled and cleaned",
            "2 pounds meaty white fish, like sea bass, boned, and cut into large dice",
            "1 red onion, minced",
            "1 piece ginger, peeled, minced",
            "1 clove garlic, minced",
            "1/4 habanero or Scotch bonnet, minced (no seeds or ribs)",
            "1 celery rib, minced",
            "Salt and black pepper",
            "5 lemons, juiced",
            "5 limes, juiced",
            "1 bunch cilantro, chopped",
            "2 ears of corn, grill with husk on"
        ],
        "title": "Peruvian Fish and Shrimp Ceviche",
        "picture_link": null
    },
    "VGqUohOSPqQz4gbbCpyb0bj9zZtKwFS": {
        "instructions": "Cut tuna into strips 1-inch high by 1-inch wide. Chill tuna in the fridge to air dry a bit.\nToast coriander seeds and fenugreek in a dry skillet. Grind with peppercorns in a coffee grinder or spice grinder. Place mix in a pie plate.\nMeanwhile make the garnishes. For the chutney: in a food processor combine onion, cilantro, ginger, chili peppers, lemon juice and season with salt and fresh pepper. Blend til well combined. Cut pita bread into triangles and fry in hot oil. Drain on paper towel.\nHeat a skillet til very hot. Roll tuna in the spice mix. Add a little oil to the pan. Sear the tuna on all 4 sides. Slice thin and serve with pita triangles and chutney. Sprinkle with more chopped cilantro.",
        "ingredients": [
            "Center cut, sushi quality tuna, (you'll need about 3 pounds to yield some choice pieces)",
            "3 tablespoons each coriander and fenugreek seeds",
            "2 tablespoons pepper corns",
            "1 onion, chopped",
            "1/2 cup cilantro, chopped",
            "2 tablespoons chopped ginger",
            "2 green chili peppers",
            "3 tablespoons lemon juice",
            "Salt and Pepper",
            "1 package pita bread",
            "Oil for frying"
        ],
        "title": "Seared Coriander and Fenugreek Crusted Tuna with Onion Chutney and Pita Crisps",
        "picture_link": null
    },
    "AnEiRwfe2SQEyjL2hkOqpzljhXpqqI6": {
        "instructions": "Blanch broccoli rabe in a large pot of boiling salted water for 2-3 minutes. Drain and shock in ice bath. Drain and wrap in a dry towel, squeezing out any excesss water. In a large saute pan, cook garlic and crushed red pepper flakes for 1 minute. Add broccoli rabe and cook and stir until heated through. Stir in breadcrumbs and toss all together. Season to taste with salt and pepper.",
        "ingredients": [
            "2 heads broccoli rabe",
            "1/4 cup olive oil",
            "3 cloves garlic, chopped",
            "1/2 tsp. crushed red pepper flakes",
            "1/4 cup dry breadcrumbs",
            "salt and pepper to taste"
        ],
        "title": "Sauteed Broccoli Rabe With Garlic",
        "picture_link": null
    },
    "9aBH8i0cc2ltGa/Elf3VOY0WTWQi7DG": {
        "instructions": "In a saute pan, heat the olive oil over medium heat. Add the shallots, garlic, red pepper and quickly saute being careful to avoid browning or burning. Add the mushrooms, season with salt and pepper and saute together for 5 minutes. Add the cream, reduce the heat to prevent the cream from scorching and cook for several minutes while the pasta cooks.\nBring the water to a rolling boil in a large pot and add the salt. Add the pasta to the boiling water.\nTo the mushrooms, add the basil, pine nuts and Parmesan cheese. The pasta will cook in several minutes after returning to the boil. Add the cooked pasta to the sauce and serve.",
        "ingredients": [
            "2 tablespoons extra virgin olive oil",
            "2 tablespoons chopped shallots",
            "1 tablespoon chopped garlic",
            "1/4 teaspoon red pepper flakes",
            "2 ounces dried porcini mushrooms, washed and rehydrated",
            "1/2 pound cremini mushrooms, cleaned and sliced",
            "Salt and freshly ground pepper to taste",
            "1/2 cup heavy cream",
            "6 to 8 quarts water",
            "2 tablespoons salt",
            "1 pound pasta, such as fettucine",
            "2 tablespoons shredded fresh basil leaves",
            "3 tablespoons pine nuts, toasted",
            "1/4 cup freshly grated Parmesan cheese"
        ],
        "title": "Fresh Homemade Pasta with Wild Mushrooms",
        "picture_link": null
    },
    "4PcWtOT.N1UgTnsSD.yuQjphpBC1LQC": {
        "instructions": "Watch how to make this recipe.\nFor the lime curd: Combine the lime juice, sugar and butter in a medium saucepan and cook on a low flame until the butter melts. Beat the eggs, add to the saucepan and stir until combined. Bring to a simmer. Stir constantly and cook until the mixture is a thick and creamy consistency, 5 to7 minutes. Pass through a mesh strainer. Chill for 2 hours in the fridge.\nFor the crust: Add the sugar and graham crackers to a food processor. Pour in the melted butter and pulse to combine.\nFor the topping: Whip the cream with the sugar until stiff.\nTo assemble, layer the crumb mixture into the bottom of a serving cup, followed by the lime curd. Top with the whipped cream mixture and garnish with lime zest.",
        "ingredients": [
            "1 cup lime juice",
            "2 cups sugar",
            "2 sticks unsalted butter",
            "14 eggs",
            "1/3 cup sugar",
            "12 whole graham crackers",
            "1/3 cup unsalted butter, melted",
            "1 1/2 cups whipping cream",
            "1/2 cup powdered sugar",
            "Lime zest, for garnish"
        ],
        "title": "Individual Key Lime Pies",
        "picture_link": "pkNtENpEwnlk2lZFDRe9u6zusdWBuYm"
    },
    "CFmg1ebkr19unzjojLkVtxTt5aAnTl.": {
        "instructions": "Warm a griddle or nonstick pan over medium-high heat. Then add 1 tablespoon butter until warmed. Next, add the bread in batches to the griddle and allow to brown or crisp on the first side, 1 to 2 minutes. After browning, flip the bread and repeat the process on the second side. Season with salt and pepper. Remove after browning and serve.",
        "ingredients": [
            "1/4 cup clarified unsalted butter",
            "6 slices fresh thick-sliced Texas toast (BBQ sliced bread)",
            "Kosher salt and freshly ground black pepper"
        ],
        "title": "Griddled Texas Toast",
        "picture_link": null
    },
    "SEPPYQEjdsq7glmcXfxh/0q938IhMHG": {
        "instructions": "Preheat the oven to 350 degrees F. Whisk the olive oil, Worcestershire sauce, hot sauce, garlic powder, cumin, onion powder, cayenne and 1/2 teaspoon salt in a bowl.\nCombine the rice cereal squares, cornflakes, pita chips and pepitas in a bowl. Toss with the spice mixture and spread on a baking sheet. Bake, stirring occasionally, until golden, about 40 minutes.\nPer serving (1/3 cup): Calories 100; Fat 5 g (Saturated 1 g); Cholesterol 0 mg; Sodium 220 mg; Carbohydrate 13 g; Fiber 2 g; Protein 3 g\n;",
        "ingredients": [
            "3 tablespoons extra-virgin olive oil",
            "1 tablespoon Worcestershire sauce",
            "1 teaspoon hot sauce",
            "1/2 teaspoon garlic powder",
            "1/2 teaspoon ground cumin",
            "1/2 teaspoon onion powder",
            "1/4 teaspoon cayenne pepper",
            "Kosher salt",
            "3 cups rice cereal squares 1 cup cornflakes",
            "2/3 cup whole-grain pita chips, broken into small pieces",
            "1/2 cup unsalted pepitas (hulled pumpkin seeds)"
        ],
        "title": "Spicy Cereal Mix",
        "picture_link": null
    },
    "/lOG04P1lUxpXf24kHk3f63Lqb9XldO": {
        "instructions": "Heat the oil in a large saucepan over medium heat. Add the leeks and garlic and cook, stirring, until softened, about 3 minutes. Add the tarragon and cook 1 minute, until fragrant. Add the potatoes and broth and bring to a simmer. Partially cover the pan and simmer until the potatoes are fork-tender, 8 to 10 minutes. Stir in the salmon and milk and simmer 2 minutes to heat through. Remove from the heat, season to taste with salt and pepper, and serve.",
        "ingredients": [
            "2 teaspoons olive oil",
            "2 leeks (white part only), rinsed well and chopped",
            "2 cloves garlic, minced",
            "1 teaspoon dried tarragon",
            "2 medium-size Yukon gold potatoes, peeled and cut into 1-inch cubes",
            "4 cups reduced-sodium chicken or vegetable broth",
            "1 1/2 cups leftover salmon broken into pieces",
            "1 (12-ounce) can evaporated fat-free milk or lowfat milk",
            "Salt and freshly ground black pepper"
        ],
        "title": "Salmon Chowder with Yukon Gold Potatoes",
        "picture_link": null
    },
    "bLgC4pThFFhOzwl564q6ijx9vAABtzu": {
        "instructions": "Place the potatoes in a large pot and cover with cold water by at least a couple inches. Salt the water generously, bring to a boil and cook until the potatoes are fork tender, about 20 minutes. Drain and rinse under cold water.\nBring another pot of salted water to a boil and throw the beans in just for a minute or two until they turn bright green. Strain them and run them under cold water to stop the beans from cooking.\nIn a mixing bowl combine the remaining ingredients and whisk until smooth.\nCut the potatoes in half lengthwise and then into roughly 1 inch chunks. Cut beans in half. Toss the potato chunks in the dressing and then toss in the green beans and the parsley.",
        "ingredients": [
            "3 pounds Yukon or baby white potatoes",
            "1 pound green beans, trimmed",
            "1/2 cup mayonnaise",
            "2 tablespoons whole grain Dijon mustard",
            "1 shallot minced",
            "3 tablespoons red wine vinegar",
            "30 grinds black pepper",
            "1/3 cup packed finely chopped flat-leaf parsley"
        ],
        "title": "Warm Dijon Potato Salad with Green Beans",
        "picture_link": "gR/o.yBUmUhUcSE544hp.pWWKUqy45m"
    },
    "ZY3Lh1euLbh1aSnW8O1T6l7PLmDQIPO": {
        "ingredients": [
            "1 3/4 pounds medium-size red-skinned potatoes, cut into 3/4-inch pieces",
            "6 medium carrots, peeled, cut into 2-inch pieces",
            "8 large shallots, peeled",
            "3 tablespoons olive oil",
            "1 tablespoon finely chopped fresh rosemary or 1 1/2 teaspoons dried"
        ],
        "picture_link": null,
        "instructions": "Preheat oven to 400°F. Combine potatoes, carrots, shallots and oil in large bowl. Sprinkle with salt and pepper. Toss to coat. Transfer vegetables to roasting pan. Roast until vegetables are almost tender, stirring occasionally, about 45 minutes. Add rosemary and roast until vegetables are golden brown and tender, about 15 minutes longer. Transfer vegetables to bowl.\nPreheat oven to 400°F. Combine potatoes, carrots, shallots and oil in large bowl. Sprinkle with salt and pepper. Toss to coat. Transfer vegetables to roasting pan. Roast until vegetables are almost tender, stirring occasionally, about 45 minutes. Add rosemary and roast until vegetables are golden brown and tender, about 15 minutes longer. Transfer vegetables to bowl.",
        "title": "Roasted Potatoes, Carrots and Shallots with Rosemary "
    },
    "MyVs644WGiLkQNKL28htiDca9jzvZr6": {
        "instructions": "In a bowl, combine 1-ounce bread crumbs, hot pepper sauce, Worcestershire, mayonnaise, parsley, peppers, egg white, scallion, lemon juice, old bay, dry mustard, onion powder, and Dijon mustard. Once combined, gently fold in crabmeat. Once fully incorporated, form into 2 to 3 inch cakes. Dredge in remaining bread crumbs. Pan fry in hot oil until golden brown on both sides.;",
        "ingredients": [
            "4 ounces bread crumbs, unseasoned",
            "3 dashes hot pepper sauce",
            "3 dashes Worcestershire sauce",
            "2 ounces mayonnaise",
            "4 sprigs parsley, roughly chopped",
            "1/4 green pepper, fine dice",
            "1/4 red pepper, fine dice",
            "1 egg white",
            "1 scallion, thinly sliced",
            "4 tablespoons freshly squeezed lemon juice",
            "1/4 teaspoon crab boil seasoning",
            "1/4 teaspoon dry mustard",
            "1/4 teaspoon onion powder",
            "2 ounces Dijon mustard",
            "1 pound jumbo lump Maryland crabmeat",
            "Oil, for pan frying"
        ],
        "title": "Crabcakes",
        "picture_link": null
    },
    "zcT4K/ySxvq/FQqDtgq/DWyC95JyQd.": {
        "instructions": "Heat the oven to 350 degrees F.\nUsing 1 tablespoon butter, grease the bottom and sides of an 8 by 8-inch baking pan.\nTo make the topping: In a small bowl, mash together the peanuts, flour, brown sugar, and a pinch of salt. Using your fingertips, mix in the butter. Set aside.\nTo make the bars: In a stand mixer, blend the butter, peanut butter, and brown sugar until light and creamy. Add the egg, vanilla extract, baking powder, and 1/2 teaspoon of salt in order, scraping down the sides as needed. Slowly blend in the flour then fold in the chocolate chips and shredded coconut. Press into the bottom of the prepared dish, then spread the jelly over the entire dish.\nSprinkle the reserved peanut topping over the top and bake until the edges and topping are golden brown, about 30 to 35 minutes. Allow it to cool before slicing.",
        "ingredients": [
            "1 cup salted peanuts, gently chopped",
            "2 tablespoons flour",
            "2 tablespoons light brown sugar",
            "3 tablespoons cold butter, cubed",
            "Kosher salt",
            "1 stick, plus 1 tablespoon butter, at room temperature",
            "3/4 cup creamy peanut butter",
            "3/4 cup light brown sugar",
            "1 egg",
            "1/2 teaspoon vanilla extract",
            "1/2 teaspoon baking powder",
            "1 1/2 cups flour",
            "1/2 cup chocolate chips",
            "1/2 cup sweetened coconut flakes",
            "1 cup strawberry jam"
        ],
        "title": "Sunny's Pantry Bars",
        "picture_link": "U.BFyDDVsbrZktcdMQXJRVpXFc89VZO"
    },
    "RV.cVIeWiwqOwMkTbzCHj.OACoN/Np.": {
        "instructions": "Watch how to make this recipe.\nPlace the yogurt in a cheesecloth or paper towel-lined sieve and set it over a bowl. Grate the cucumber and toss it with 1 tablespoon of kosher salt; place it in another sieve, and set it over another bowl. Place both bowls in the refrigerator for 3 to 4 hours so the yogurt and cucumber can drain.\nTransfer the thickened yogurt to a large bowl. Squeeze as much liquid from the cucumber as you can and add the cucumber to the yogurt. Mix in the sour cream, vinegar, lemon juice, olive oil, garlic, dill, 1/2 teaspoon salt, and pepper. You can serve it immediately, but I prefer to allow the tzatziki to sit in the refrigerator for a few hours for the flavors to blend. Serve chilled or at room temperature.",
        "ingredients": [
            "1 pound (1 pint) plain yogurt (whole milk or low fat)",
            "1 hothouse cucumber, unpeeled and seeded",
            "1 tablespoon plus 1/2 teaspoon kosher salt",
            "1/2 cup sour cream",
            "1 tablespoon Champagne vinegar or white wine vinegar",
            "2 tablespoons freshly squeezed lemon juice (1 lemon)",
            "1 tablespoon good olive oil",
            "1 1/2 teaspoons minced garlic",
            "1 1/2 teaspoons minced fresh dill",
            "Pinch freshly ground black pepper"
        ],
        "title": "Tzatziki",
        "picture_link": "CsDQqs20YCaejQN/tw9iDpvzBqbPubO"
    },
    "eSFDib/rN0RosovRFRFvtria7SsjjHO": {
        "instructions": "Shred the cabbage and julienne the carrot (cut into thin slivers). Combine in a bowl with the mayonnaise, ginger and garlic and mix well.\nHeat the butter in a medium skillet over a medium flame. Add the raisins and cook until soft and golden brown, about 2 minutes. Mix the warm raisins into the slaw and add the vinegar and salt, sugar and pepper to taste. Cover and refrigerate until ready to serve.",
        "ingredients": [
            "1 small head savoy cabbage, cored",
            "1 large carrot",
            "3 tablespoons mayonnaise",
            "1 tablespoon finely minced ginger (from one 1-inch piece)",
            "1 1/2 teaspoons finely minced garlic (from 1 small clove)",
            "1 tablespoon unsalted butter",
            "1/4 cup golden raisins",
            "1 tablespoon sherry vinegar",
            "Fine sea salt",
            "Sugar",
            "Freshly ground black pepper"
        ],
        "title": "Gingered Coleslaw with Golden Raisins",
        "picture_link": "ycnKe6H/ohz0mIfi8nTK0eV./RZU2u2"
    },
    "y0rfGIs9f061mFxk7t/u1xFyYmeWvAe": {
        "instructions": "Mix the ricotta, confectioners' sugar and liqueur in a bowl. Fold in the chocolate chips. Serve with strawberries and wonton triangles, pita chips or cookies for dipping.",
        "ingredients": [
            "2 cups whole milk ricotta",
            "1 1/2 cups confectioners' sugar",
            "1 tablespoon orange liqueur",
            "3/4 cup mini chocolate chips",
            "Strawberries, crispy wonton triangles, cinnamon pita chips or your favorite cookies, for serving"
        ],
        "title": "QuickNoli Dip - Quick Cannoli Dip",
        "picture_link": "iADJ/qvyaTpgd.uExJf4hNq0MgZbZYm"
    },
    "R//7gThdV5WRKMPuh/iL/HBZxR09GVu": {
        "instructions": "Preheat the oven to 450 degrees F.\nCut the wings tips off the wings and reserve for another use, such as stock. Cut the wings in 1/2 at the joint.\nIn a bowl, whisk together the mayonnaise, mustard, vinegar, and salt. Add the wings and toss them until coated well. In another bowl, toss together the breadcrumbs and caraway seeds and coat the wings with the crumb mixture.\nBake the wings on a rack in a shallow roasting pan, turning once, until lightly browned, about 30 to 35 minutes.",
        "ingredients": [
            "4 pounds chicken wings",
            "2/3 cup mayonnaise",
            "1/2 cup Dijon mustard",
            "1/4 cup cider vinegar",
            "1/4 teaspoon salt",
            "2 cups fine fresh rye bread crumbs",
            "2 teaspoons caraway seeds"
        ],
        "title": "Mustard Caraway Chicken Wings",
        "picture_link": "ubA/qTikBU82P2sysFY1C7Pd00TlMRG"
    },
    "TkalFSNe0Si.af01ow4ZHQf7p3riu86": {
        "ingredients": [
            "1 1/2 pounds plum tomatoes, seeded, chopped",
            "3/4 cup chopped onion",
            "1/2 cup chopped fresh cilantro",
            "3 tablespoons fresh lime juice",
            "3 tablespoons minced seeded jalapeño chilies (about 2 medium)",
            "1 garlic clove, minced"
        ],
        "picture_link": null,
        "instructions": "Mix all ingredients in medium bowl. Season with salt and pepper. (Can be made 4 hours ahead. Cover; chill.)\nMix all ingredients in medium bowl. Season with salt and pepper. (Can be made 4 hours ahead. Cover; chill.)",
        "title": "Pico de Gallo "
    },
    "z3TnCrh7lu7HiFp3.wda647GTAk5kZO": {
        "instructions": "In a large pan, cook eggs in butter sunny-side up or over easy. When eggs are just about done, divide tortillas between 2 plates and top with the cheese. Heat in microwave until cheese is melted. Top each tortilla with an egg and top the whole thing with black beans and Creole Sauce.\nSaute the garlic, peppers, and onion in olive oil until translucent. Add the remaining ingredients and simmer for about 1/2 hour or until all the flavors have blended to your liking. You'll have extra sauce to use for other recipes. It only gets better with age!",
        "ingredients": [
            "4 eggs",
            "Butter, for frying",
            "4 corn tortillas",
            "1/2 cup shredded cheddar",
            "Canned or homemade black beans",
            "Creole sauce, recipe follows",
            "5 garlic cloves, chopped",
            "1/2 green pepper, chopped",
            "1/2 red pepper, chopped",
            "1/2 onion, chopped",
            "1/4 cup olive oil",
            "1 teaspoon chopped fresh oregano leaves",
            "1/2 teaspoon ground cumin",
            "1 (#10)* can tomato sauce",
            "1 (#10)* can water",
            "Salt and pepper"
        ],
        "title": "Ranchero Cubano",
        "picture_link": null
    },
    "4g5P0as8PAbgAE/6e1x7nNH8ogv4Aym": {
        "instructions": "Heat a skillet over medium heat and add the canola oil. When the oil is hot, cook the ham, red onion, and bell peppers until softened, 4 to 5 minutes. Remove from the pan and set aside.\nIn a small bowl, whisk together the eggs and salt and pepper.\nCoat the skillet with cooking spray and put it over medium-low heat. Add the beaten eggs and gently stir with a spatula or wooden spoon. Cook the eggs until they set, 4 to 5 minutes. Put the cooked ham and vegetables back into the pan and stir to combine.\nWrap the tortillas in a damp towel and microwave for 30 seconds to warm them. Put a tortilla on a plate, add half the egg mixture, and top with half the cheese. Wrap the ends of the tortilla up and then fold in the sides. Repeat for second burrito and serve warm.",
        "ingredients": [
            "1 tablespoon canola oil",
            "Reserved ham, from Ham and Egg Tea Sandwiches",
            "Half reserved red onion, from Crispy Wonton Cups with Tuna Salad, diced",
            "1/4 cup diced green bell pepper",
            "4 large eggs",
            "Kosher salt and freshly ground black pepper",
            "Nonstick cooking spray",
            "1/4 cup shredded Cheddar",
            "2 flour tortillas"
        ],
        "title": "Online Round 2 Recipe - Ham and Cheese Breakfast Burrito",
        "picture_link": "CDZtGMREY14XjgCrp2ciPyLWvi5Z/CG"
    },
    "L08kBgJINGwvoEATZmZQIUcm8k3AVAW": {
        "instructions": "Peel kohlrabi with a vegetable peeler and cut into 2-inch long julienne strips. Discard coarse stems from watercress. In a large heavy skillet, heat butter and reserved duck fat over moderately high heat until foam subsides and saute kohlrabi, stirring, until crisp-tender, 5 to 10 minutes. Add lemon juice and saute kohlrabi, stirring, 1 minute more. Remove skillet from heat and immediately stir in watercress. Season vegetables with salt and pepper.;",
        "ingredients": [
            "1 pound small kohlrabi bulbs (about 1 bunch)",
            "1 bunch watercress",
            "1 tablespoon unsalted butter",
            "1 tablespoon rendered duck fat or 1 additional tablespoon unsalted butter",
            "2 tablespoons fresh lemon juice",
            "Salt and freshly ground black pepper"
        ],
        "title": "Sauteed Kohlrabi and Watercress",
        "picture_link": null
    },
    "6WRKmDEa0cupW3DfhKBQI/bt/01rbCK": {
        "instructions": "Preheat a grill to medium heat with all of the coals on 1 side.\nGrill over indirect heat (meat side down) for approximately 2 hours, turning once, until internal temperature reaches 185 degrees F.\nBaste ribs on both sides during cooking with 3 parts water to 1 part BBQ sauce. Once the ribs reach 185 degrees F, baste again with full strength BBQ sauce and sprinkle liberally with dry rib seasoning.",
        "ingredients": [
            "One 2- to 2 3/4-pound slab raw St. Louis cut pork spare ribs",
            "1 1/2 cups water (3 parts)",
            "1/2 cup favorite BBQ sauce (1 part), plus more for basting (recommended: Corky's)",
            "Favorite dry rib seasoning (recommended: Corky's)"
        ],
        "title": "Memphis Style Dry Ribs: Corky's Ribs",
        "picture_link": "vJKuEDuOhIO1QPfruV7UG55KgM1kkUO"
    },
    "PyNqCVPqCtlJsVGSaVSmeA90PSDpWXa": {
        "instructions": "Fold all ingredients together in a mixing bowl.",
        "ingredients": [
            "1 pint sour cream",
            "1 teaspoon Dijon mustard",
            "1/2 cup freshly grated horseradish",
            "2 tablespoons chopped chives",
            "Salt and pepper, to taste"
        ],
        "title": "Horseradish-Chive Sauce",
        "picture_link": null
    },
    "DRbWCRa7L7.Aw5evinPeJjqu2DHun16": {
        "instructions": "Heat oven to 450 degrees F. Lightly grease and flour a popover tin. In a large bowl, whisk together flour and salt. In a separate, medium bowl, whisk together the eggs, milk, and 1 tablespoon warm butter. Pour over flour mixture, and fold until just blended. Fill the popover cups 2/3 to 3/4 full. Transfer cups to oven, and bake for 15 minutes. Reduce the temperature to 350 degrees F, and bake 20 minutes more, until well browned and crusty. Remove popovers from the oven, and unmold onto a rack. Puncture the sides with a sharp knife to let steam escape, and serve immediately.;",
        "ingredients": [
            "1 tablespoon unsalted butter, melted, plus more for greasing tin",
            "1 cup all-purpose flour",
            "1/2 teaspoon salt",
            "2 large eggs",
            "1 1/4 cups milk"
        ],
        "title": "Popovers",
        "picture_link": null
    },
    "W1cTtgjYMjfb6DomMUNBqb5rnmGhjv2": {
        "instructions": "If the ham comes with the skin still attached, remove most of it with a sharp knife, leaving a layer of fat and a collar of skin around the shank bone. Trim the fat, leaving a layer about 1/3-inch thick, and score the layer remaining into diamonds. Bake the ham on a rack in a roasting pan in a preheated 350 degree oven for 55 minutes. In a blender blend together the ginger, the brown sugar, and the rum, spoon the glaze over the ham, spreading it, and bake the ham for 30 to 35 minutes more, or until the glaze is brown and bubbly. Transfer the ham to a platter, garnish the platter with the parsley, and let the ham stand for 15 minutes before carving.",
        "ingredients": [
            "1 (7 to 8 pound) half (shank end) of a fully cooked cured ham",
            "1/3 cup chopped preserved ginger in syrup",
            "3 tablespoons firmly packed brown sugar",
            "3 tablespoons dark rum",
            "Parsley sprigs for garnish if desired"
        ],
        "title": "Ginger Rum-Glazed Ham",
        "picture_link": null
    },
    "/QFiu9bDV5QCbE9DnGBG4bFtpQ9WpSW": {
        "instructions": "Watch how to make this recipe.\nPlace the Brussels sprouts in the feed tube of the food processor fitted with a large slicing disc. (There is no need to core them.) Process the Brussels sprouts until they're all sliced.\nPlace the butter and olive oil in a large (12-inch) saute pan and heat it over medium heat. Add the sliced Brussels sprouts, 1 1/2 teaspoons salt, and 1/2 teaspoon pepper and saute them, stirring frequently, for about 4 to 5 minutes, until tender but still bright green. Stir in the balsamic vinegar, season to taste, and serve hot.",
        "ingredients": [
            "2 (12-ounce) packages Brussels sprouts, ends and brown leaves trimmed",
            "2 tablespoons unsalted butter",
            "2 tablespoons good olive oil",
            "Kosher salt and freshly ground black pepper",
            "1 tablespoon syrupy balsamic vinegar"
        ],
        "title": "Sauteed Shredded Brussels Sprouts",
        "picture_link": "d4QfX8a4RYQINDjfqvLDGEAs.UhD09e"
    },
    "uDTbbZXdxWMAii4Ho6BHXOToCtkDLjS": {
        "instructions": "Special Equipment: 8 sets of chopsticks, soaked in water for 30 minutes\nPreheat an outdoor grill.\nPut the beef, onion, parsley, tomato paste, cumin, and paprika in a large bowl and season generously with salt and pepper. Mix everything together with your hands until it is well combined.\nTake about 1/2 cup (4 ounces) of the meat mixture and form it into a 5 or 6-inch long hot dog shape on a chopstick. When you have them all made, spray them with the cooking spray and grill them, turning frequently, until cooked through, about 8 to 10 minutes. (Alternately, cook them in a large nonstick skillet over medium-high heat until cooked through, about 8 to 10 minutes.) Serve on pita bread.",
        "ingredients": [
            "2 pounds ground beef",
            "1 medium onion, finely chopped, about 1 cup",
            "1/2 bunch fresh parsley, leaves finely chopped, about 1/4 cup",
            "2 tablespoons tomato paste",
            "1 teaspoon ground cumin",
            "1 teaspoon paprika",
            "Kosher salt",
            "Freshly ground black pepper",
            "Vegetable cooking spray",
            "Pita bread, for serving"
        ],
        "title": "Loole Kebabs",
        "picture_link": null
    },
    "Mwj5mBFFuw5STa.Ad2PMdl37APXfldm": {
        "instructions": "Whisk the butter, milk, and pepper together in a medium saucepan over medium heat. Taste and add salt, if desired. Heat until sauce is warmed through. Serve over grilled chicken, pork, or rice.\nPlace the honey in a microwave-safe container and heat in the microwave for 15 seconds. Remove from the microwave and add the oil to the container. Place the nuts and salt in the bowl of a food processor and pulse for 5 seconds. Then, while the processor is running, very slowly drizzle in the honey and oil. Process until an emulsion is formed and the mixture is smooth; this will take approximately 45 seconds to 1 minute. If the mixture is too thick and doesn't spread easily, add a little more oil.",
        "ingredients": [
            "1/2 cup cashew butter, recipe follows",
            "3/4 cup coconut milk",
            "1/4 teaspoon cayenne pepper",
            "Salt, optional",
            "2 tablespoons honey",
            "1/3 cup walnut oil",
            "10 ounces (approximately 2 cups) roasted cashews",
            "1/2 teaspoon salt"
        ],
        "title": "Cashew Sauce",
        "picture_link": null
    },
    "6hOjn/lsXDUJd/6Hj.8Xh2y5XO7Mwdy": {
        "instructions": "Heat butter and olive oil in a medium saute pan. Add onions and sugar and cook slowly until soft and caramelized. Heat olive oil in a large saute pan over high heat. Add the mushrooms and saute until golden brown and cooked down. Season with salt and pepper to taste. Preheat grill. Flatten the dough, brush liberally with olive oil and throw on the grill. Grill on one side until golden brown, turn over spread with the mozzarella, onions and mushrooms and blue cheese.",
        "ingredients": [
            "1 tablespoon unsalted butter",
            "1 tablespoon olive oil",
            "3 tablespoons olive oil",
            "1 pound assorted wild mushrooms (portobello, shiitake, chanterelle, porcini)",
            "Salt and freshly ground pepper",
            "3 Spanish onions, sliced thinly",
            "1 teaspoon sugar",
            "1 ricipe flatbread",
            "1/2 cup fresh mozzarella",
            "1 cup crumbled blue cheese"
        ],
        "title": "Caramelized Onions, Cabrales Blue Cheese and Wild Mushroom Flatbread",
        "picture_link": null
    },
    "xhiyRsxAhpnjg/p2WvbTX5riVnZDx4O": {
        "instructions": "In medium bowl stir together cheese, ham, green onions and flour. Add mayonnaise, mustard and caraway seeds. Mix until combined. Spread in 9-inch pie plate.\nBake, uncovered, at 350 degrees F about 25 minutes or until heated through and bubbly around edges.\nServe warm with Keebler Town House Flipsides Original Crackers.\n- or - .",
        "ingredients": [
            "2 cups (8 oz.) shredded Swiss cheese",
            "1 1/2 cups finely chopped ham (6 oz.)",
            "1/2 cup sliced green onions",
            "2 tablespoons all-purpose flour",
            "1/2 cup reduced-fat mayonnaise",
            "2 tablespoons spicy brown mustard",
            "1 1/2 teaspoons caraway seeds, slightly crushed",
            "56 Keebler Town House Flipsides Original Crackers",
            "56 Keebler Town House Flipsides Cheddar Crackers"
        ],
        "title": "Hot Ham and Swiss Dip",
        "picture_link": "w1oQ1OHHZTvNHW9BDqgKfAp/v1L0o8a"
    },
    "TpKDOPvidNSyhv2.WTUSOxX17bvEI9C": {
        "instructions": "In a blender combine ginger, yogurt, orange juice and the frozen peaches. Blend until smooth.",
        "ingredients": [
            "1 (1-inch) piece fresh ginger, peeled and grated",
            "2 cups plain yogurt",
            "3/4 cup orange juice",
            "2 cups sliced frozen peaches"
        ],
        "title": "Peach Power Up",
        "picture_link": "5oRzErWHmvxsfehUirhu96pn7l9Uy2G"
    },
    "5pM6Qx8PAq9b8ziMr/49POamnZBP3mC": {
        "instructions": "Special equipment: 8 wooden skewers that have been soaked in water or 8 metal skewers\nMix the butter, brown sugar, chili powder, cumin, orange zest, 1 tablespoon salt, and 1 teaspoon pepper together in a bowl. Add the beef, toss to coat evenly. Cover and refrigerate for 15 minutes or up to 1 hour.\nPreheat a grill over high heat. Thread the beef, onions, and peppers onto 8 long skewers leaving 1/4-inch space between the meat and vegetables. Lightly brush the grill grates with oil. Arrange the skewers on the hot grill and grill, turning until the meat is medium-rare, about 2 to 3 minutes on each of the 4 sides. Transfer the kebabs to the platter and serve.",
        "ingredients": [
            "2 tablespoons unsalted butter, melted",
            "2 tablespoons light brown sugar",
            "1 tablespoon chili powder",
            "2 teaspoons cumin",
            "1 teaspoon finely grated orange zest",
            "Kosher salt and freshly ground pepper",
            "1 1/2 pounds beef tri-tip, cut into 1 1/2-inch cubes",
            "1 large sweet onion, cut into 1 1/2 to 2-inch dice",
            "12 assorted color baby bell peppers, cored and halved",
            "Vegetable oil, for grill"
        ],
        "title": "Cowboy Steak and Pepper Kebabs",
        "picture_link": null
    },
    "2ClfR2RpVhLHVcV3714mh1k6pfjrxQa": {
        "instructions": "Put the chicken in a medium pot with just enough water to cover; add 1 tablespoon salt. Bring to a gentle simmer over medium heat and cook until the chicken is firm to the touch, about 15 minutes. Meanwhile, prepare a bowl of salted ice water. Drain the chicken and plunge into the ice water for about 30 seconds to stop the cooking. Drain again. Grate the ginger and shallot into a small bowl. Stir in 3 tablespoons peanut oil, the sesame oil and 1/4 teaspoon each sugar and salt. Toss the cucumber and radishes with the chili sauce, 3/4 teaspoon salt, the remaining 1 tablespoon peanut oil and the remaining 1/4 teaspoon sugar in a large bowl. Add the watercress and toss. Divide the salad among plates. Slice the chicken and add to the plates, then top with the ginger mixture. Drizzle with the lime juice.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "4 boneless, skinless chicken breasts (1 3/4 to 2 pounds)",
            "Kosher salt",
            "1 2-inch piece ginger, peeled",
            "1 large shallot",
            "4 tablespoons peanut oil",
            "1 tablespoon toasted sesame oil",
            "1/2 teaspoon sugar",
            "1 English cucumber, halved lengthwise, seeded and thinly sliced",
            "1 bunch radishes, thinly sliced, or 1 small daikon radish, peeled and cut into matchsticks",
            "1 teaspoon Asian chili sauce (such as sambal oelek)",
            "1 bunch watercress, trimmed",
            "Juice of 1 lime"
        ],
        "title": "Poached Ginger Chicken",
        "picture_link": "aqM.PkVxKjUd6iKikohNYSAm9AzlW5e"
    },
    "cCkG6ahLaNTGEUH1hqvvDZZPpEx4Yqy": {
        "instructions": "Watch how to make this recipe.\nPreheat grill to medium.\nIn a small saucepan add butter, brown sugar, apple cider, cinnamon, ginger, and salt. Place onto grill until butter melts. Mix together until well combined.\nPlace pears directly onto grill for 2 to 4 minutes. Turn and cook on the other side. Brush both sides of the pears with the butter mixture to glaze. Immediately take pears off the grill after glazing and place on a plate.\nScoop ice cream into 4 serving bowls. Top with pears, pecans and whipped cream. Drizzle the remaining butter mixture on top and serve.",
        "ingredients": [
            "4 tablespoons unsalted butter",
            "4 tablespoons brown sugar",
            "2 tablespoons apple cider",
            "1/2 teaspoon ground cinnamon",
            "1/4 teaspoon ground ginger",
            "Pinch kosher salt",
            "2 pears, stemmed, cored, and sliced lengthwise 1/2 inch thick",
            "Ice cream",
            "Pecans, for topping",
            "Whipped cream, for topping"
        ],
        "title": "Grilled Pear Sundae",
        "picture_link": "8Wyqc.5TaF7I2NavwVtdYNm/gkvNvcu"
    },
    "JmjpCw5RtZjvJZhTRJeotbT2XDnY1fy": {
        "instructions": "Preheat a grill to medium high. Soak 8 wooden skewers in water, about 15 minutes. Meanwhile, make the dressing: Mix the olive oil, vinegar, oregano, shallot, garlic, red pepper flakes and 1 1/4 teaspoons salt in a large bowl. Drizzle the cut sides of each piece of romaine with about 1 teaspoon of the dressing. Add the chicken to the bowl with the remaining dressing and toss. Add the breadcrumbs and toss to coat. Thread the chicken onto the skewers, leaving space between each piece. Grill the chicken skewers, turning occasionally, until cooked through, 8 to 10 minutes. Meanwhile, grill the romaine, turning once, until marked and slightly wilted, 1 to 2 minutes. Transfer the romaine to plates and drizzle with olive oil and vinegar. Season with salt. Serve with the chicken skewers and sprinkle with the parmesan.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "1/4 cup extra-virgin olive oil, plus more for drizzling",
            "2 teaspoons red wine vinegar, plus more for drizzling",
            "2 tablespoons chopped fresh oregano",
            "1 tablespoon minced shallot or red onion",
            "1 teaspoon minced garlic",
            "1/4 teaspoon red pepper flakes",
            "Kosher salt",
            "1 head romaine lettuce, quartered lengthwise",
            "1 1/2 pounds skinless, boneless chicken breasts or thighs, cut into chunks",
            "1 1/2 cups breadcrumbs",
            "1/4 cup grated parmesan cheese"
        ],
        "title": "Chicken Skewers With Grilled Romaine",
        "picture_link": "j7rOOM/41HbpCMEmxjCvlOux6grWe72"
    },
    "IYDo2XCom6BcYzio15pLhUQkXQn1VCS": {
        "instructions": "Soak the beans overnight in cold water to cover.\nDrain the beans and transfer them to a large saucepan. Cover with 3 cups cold water, the coconut water and 2 teaspoons salt, set over medium heat and bring to a boil. Boil for 2 minutes, then turn the heat down to low, cover and cook until tender; depending upon the age of the beans, this will take between 30 and 45 minutes (older beans take longer).\nWhen tender, add the coconut oil and lime juice and season with salt and pepper. Pour into a serving dish and garnish with the green onions.",
        "ingredients": [
            "2 cups dried black beans, rinsed",
            "2 cups coconut water",
            "Salt and freshly ground black pepper",
            "1 tablespoon coconut oil",
            "1 lime, juiced",
            "2 green onions, greens only, sliced"
        ],
        "title": "Coconut Lime Black Beans",
        "picture_link": "D0AkYMln1YJzOae3i7giYgYt73o8EwG"
    },
    "tb.AA9k7hEH8dhQHBSvfM0Af4o/Ur/2": {
        "instructions": "Watch how to make this recipe.\nPreheat oven to 350 degrees F. Combine olive oil and all spices in a large bowl. Add pita wedges and toss to coat, Spread in 1 layer on a baking sheet and bake for 25 to 30 minutes, tossing once, until pita is brown and crisp. Cool completely before serving.",
        "ingredients": [
            "3 whole-wheat pita breads, cut into eighths",
            "2 tablespoons olive oil",
            "1/2 teaspoon ground cumin",
            "1/2 teaspoon ground coriander",
            "1/2 teaspoon ancho chili powder",
            "1/2 teaspoon garlic powder",
            "1/4 teaspoon freshly ground black pepper",
            "1/4 teaspoon salt",
            "Pinch cayenne pepper"
        ],
        "title": "Chili Chips",
        "picture_link": "yEUty/IKWppFn58X/argi/9Qg2bnRe2"
    },
    "A3UZW3J/h219TGYmRqmYgnqEbOKm3Sq": {
        "instructions": "Place chocolate in a double boiler on the stove. When melted, add the cream and stir until soupy. Remove from the heat and serve in a fondue pot with a low flame or preheated ceramic dish. Serve with berries and other fruit.",
        "ingredients": [
            "1 pound chocolate, milk, dark or semisweet",
            "3/4 cup heavy cream"
        ],
        "title": "Fruit and Chocolate Fondue",
        "picture_link": null
    },
    "1uwbZUnK3TGxePwRij8fUlyu9r//Qb2": {
        "instructions": "Combine the lime juice, celery seed, and horseradish in a pitcher. Muddle the mixture with the end of a wooden spoon to blend and break up the celery seeds. Pour in the tomato juice, hot sauce, and Worcestershire sauce; season with salt and pepper. Stir everything together to combine.\nDivide the vodka among 6 tall, chilled glasses filled with ice. Fill the glasses with the Bloody Mary mix, stick in the celery and cucumber and garnish with the cilantro. Give the Bloody Mary a good stir and serve.",
        "ingredients": [
            "6 limes, juiced",
            "1 tablespoon celery seeds",
            "3 tablespoons grated fresh or prepared horseradish",
            "2 quarts tomato juice, chilled",
            "2 tablespoons hot sauce",
            "1 tablespoon Worcestershire sauce",
            "Kosher salt and freshly ground black pepper",
            "1 1/2 cups pepper vodka, chilled in the freezer",
            "Celery stalk, for serving",
            "Cucumber spears, for serving",
            "Handful fresh cilantro, for garnish"
        ],
        "title": "Pitcher Of Bloody Marys",
        "picture_link": "/5h1hQMdbjYWhxSSOyN4nG/OKrUF3Om"
    },
    "wTAtOCmFqRTtw4OTwoNlVynkjPJnad.": {
        "instructions": "Chimichurri: Combine garlic, aji, and salt in a mortar. Add vinegar, water, and drizzle in oil.\nSteak: Marinate steak in all but 1 tablespoon chimichurri for about 1 hour, covered and refrigerated.\nIn a large pot, cover beans with water and cook with bacon and onion, without salt. Allow to simmer until tender, about 1 1/2 hours. Strain the beans, reserving the cooking liquid. Remove and discard the bacon and onion. Put back the cooking liquid on the stove, allow to boil until cooking liquid is starchy and thick. Reserve 1 cup.\nGrill steak until medium rare, about 2 to 3 minutes on each side.\nSlice steak into 2-inch pieces. Mix into the beans add all the other ingredients, including the reserved chimichurri and reduced cooking liquid. Season and serve at room temperature.",
        "ingredients": [
            "1 red pepper, roasted, peeled, and cut into julienne",
            "1 yellow pepper, roasted, peeled, and cut into julienne",
            "1/4 cup chopped parsley",
            "1 tablespoon Dijon mustard",
            "4 cloves garlic",
            "1 tablespoon aji molido (Argentine ground pepper)",
            "Pinch coarse sea salt",
            "1/4 cup white wine vinegar",
            "1/4 cup water",
            "Olive oil",
            "2 (1 1/2 pound) skirt steaks, cleaned of silver skin",
            "2 cups dry white beans, allow to soak in water 24 hours before cooking",
            "1 strip smoked bacon",
            "1 yellow onion, halved",
            "1 bunch scallions, sliced thinly",
            "1 cup red teardrop tomatoes, halved",
            "1 cup yellow teardrop tomatoes, halved"
        ],
        "title": "White Bean and Churrasco Salad",
        "picture_link": null
    },
    "aWAJd31oNb0DaVBNjGPpe8EeJ1hD0SS": {
        "instructions": "Put the cream cheese and heavy cream in a small mixing bowl and blend with a rubber spatula until smooth. Fold in the dill, lemon zest, salt and pepper until evenly combined.\nUsing a butter knife or offset spatula, spread the dill cream cheese on 1 side of each pumpernickel slice. Put a slice of smoked salmon on 12 of the pumpernickel slices. Top each sandwich with remaining bread. Arrange on a serving platter and serve immediately.\nCopyright 2009, Television Food Network, G.P., All Rights Reserved",
        "ingredients": [
            "8 ounces cream cheese, softened to room temperature",
            "2 tablespoons heavy cream",
            "1/4 cup chopped fresh dill",
            "1/2 teaspoon finely grated lemon zest",
            "1 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "24 slices mini pumpernickel bread",
            "6 slices ( about 4 ounces) smoked salmon, halved"
        ],
        "title": "Smoked Salmon Tea Sandwich",
        "picture_link": null
    },
    "ojC9xfgZJRPJLaPr2vstydyCLcFb8ye": {
        "instructions": "Into 6 large mugs pour equal amounts of coffee and milk and garnish each serving with cinnamon sticks.;",
        "ingredients": [
            "4 cups hot coffee",
            "4 cups scalded milk",
            "6 cinnamon sticks"
        ],
        "title": "Cafe au Lait",
        "picture_link": null
    },
    "HBwyJIakylXnYEKvziy4u.YGi4Cis0C": {
        "instructions": "Prepare a large bowl of ice water. Set aside.\nTrim the Brussels sprouts and peel off 1 outer layer of leaves. Cut the sprouts in half lengthwise, larger sprouts can be quartered. Place the sprouts in a large saucepan, cover with cold water and add about 2 tablespoons of salt. Bring the sprouts to a boil and drain immediately. Transfer the sprouts to the bowl of ice water. (This will stop the cooking and preserve their color.) Drain well.\nHeat a large skillet over medium-high heat, add the butter. When the butter is melted, add the Brussels sprouts. Cook for 1 minute then add the sliced cabbage. Cook until the cabbage has softened and the sprouts are warmed through. Season with salt and pepper and serve warm.",
        "ingredients": [
            "1 pound Brussels sprouts",
            "2 tablespoons unsalted butter",
            "1 small red cabbage or 1/2 large cabbage, finely sliced",
            "Coarse salt and freshly ground black pepper"
        ],
        "title": "Sauteed Brussels Sprouts and Red Cabbage",
        "picture_link": "ZUFfwz8PLVEqYbkckS9BfPvNm5NxANG"
    },
    "pP3sxHCwSJe5HG1YinKBH.d.3NNmhoK": {
        "instructions": "Place 2 Champagne flutes into the freezer to chill for 10 minutes.\nRemove the glasses from the freezer.\nTo each glass add: 1 tablespoon pomegranate seeds, 4 ounces Champagne, 1 ounce pear juice, and 1 ounce pomegranate juice.",
        "ingredients": [
            "2 tablespoons fresh pomegranate seeds",
            "8 ounces Champagne or sparkling wine",
            "2 ounces pear juice",
            "2 ounces pomegranate juice"
        ],
        "title": "Christmas Cocktail",
        "picture_link": null
    },
    "1sNYkg8cq5EAy/56MQ1tTDupLnC4/0S": {
        "instructions": "Combine sugar and water and allow to dissolve. Add remaining ingredients and mix well. Serve cold or over ice.",
        "ingredients": [
            "1/3 cup sugar",
            "1 1/2 cups water",
            "2/3 cup lime juice",
            "2/3 cup orange juice",
            "1 tablespoon lemon juice"
        ],
        "title": "Margarita",
        "picture_link": null
    },
    "oxEriZTu5Dna6Sags/rnEK86hPvw.iu": {
        "instructions": "Chill salad plates when you begin preparing your entree.\nWhen your entree is almost ready to serve, combine arugula and romaine leaves and separate onto 4 chilled salad plates. Scatter toasted walnuts evenly among the salads. Pour vinegar into a small bowl and whisk in extra-virgin olive oil in a slow stream to combine dressing. Season dressing with salt and pepper, then stir in blue cheese crumbles. Ladle dressing evenly over top of salad plates and serve.",
        "ingredients": [
            "2 cups arugula leaves, washed and trimmed",
            "2 hearts romaine lettuce, coarsely chopped",
            "1 cup walnut halves, lightly toasted",
            "3 tablespoons balsamic vinegar",
            "1/2 cup extra-virgin olive oil, eyeball it",
            "1/2 teaspoon salt",
            "1 teaspoon coarse black pepper",
            "6 ounces, (1 cup) blue cheese crumbles"
        ],
        "title": "Arugula and Romaine Salad with Walnuts and Blue Cheese Vinaigrette",
        "picture_link": "JJiMuEqJZ.fGjMnByUm3xt3nhpt7C8i"
    },
    "PpDntrQucYDjjU.SC6p/Hu7FvubqdpG": {
        "instructions": "Set a rimmed baking sheet on an oven rack and preheat to 425 degrees F.\nAdd the broccoli, oil, garlic, shallots, 3/4 teaspoon salt and red pepper flakes to a large bowl and toss to coat. Transfer to the preheated baking sheet and spread out in a single layer. Roast until the broccoli florets are browned on the ends, the stalks are crisp-tender and the shallots are caramelized, about 20 minutes, tossing about halfway through. Immediately sprinkle with the Asiago and lemon zest. Season with some salt if needed. Transfer to a serving platter.",
        "ingredients": [
            "8 cups broccoli florets (2 to 3 large heads)",
            "5 tablespoons extra-virgin olive oil",
            "4 large cloves garlic, roughly chopped",
            "2 large shallots, roughly chopped",
            "Kosher salt",
            "1/8 to 1/4 teaspoon crushed red pepper flakes",
            "1/4 cup finely shredded aged Asiago cheese",
            "Zest of 1 lemon (about 2 teaspoons)"
        ],
        "title": "Asiago Roasted Broccoli",
        "picture_link": "lBtuy/BInM6kv/RXHGVHP6v4MIiGXEq"
    },
    "rwafuOiJk2/GPN3caqS8WY8Iwh6Q6EO": {
        "ingredients": [
            "1 small onion, finely chopped",
            "1 medium carrot, thinly sliced",
            "1 medium celery rib, thinly sliced",
            "1 3/4 cups reduced-sodium chicken broth",
            "2 cups water",
            "1 pound frozen peas (3 3/4 cups)",
            "1/4 cup store-bought basil pesto plus additional for serving"
        ],
        "picture_link": null,
        "instructions": "Simmer onion, carrot, and celery in broth and water with 1/2 teaspoon salt and 1/4 teaspoon pepper in a medium saucepan, covered, until tender, about 6 minutes. Add peas and simmer, uncovered, until bright green and tender, about 3 minutes. Stir in pesto, then purée soup in 2 batches in a blender until smooth (use caution when blending hot liquids). Season with salt.\nSimmer onion, carrot, and celery in broth and water with 1/2 teaspoon salt and 1/4 teaspoon pepper in a medium saucepan, covered, until tender, about 6 minutes. Add peas and simmer, uncovered, until bright green and tender, about 3 minutes. Stir in pesto, then purée soup in 2 batches in a blender until smooth (use caution when blending hot liquids). Season with salt.",
        "title": "Pesto Pea Soup "
    },
    "61dNLEGlIGO7ESk.iu2kEA0GDCEn0gy": {
        "instructions": "Cream butter and sugar. Add milk and egg and beat until smooth. Sift together flour, baking powder and salt. Add to creamed mixture. Mix until moistened. Toss blueberries with flour and fold into batter. Fill a well-greased muffin pan 2/3 full with the batter. Bake at 400 degrees for 20 minutes.;",
        "ingredients": [
            "3/4 cup butter",
            "1 cup sugar",
            "3/4 cup milk",
            "1 egg",
            "1 3/4 cup sifted flour",
            "2 1/2 teaspoons baking powder",
            "1/2 teaspoon salt",
            "1 cup blueberries",
            "1 tablespoon flour"
        ],
        "title": "Blueberry Muffins",
        "picture_link": null
    },
    "9c.inzwsDcjU9GM6pHNBScc1w2DdZBu": {
        "instructions": "Preheat the oven to 375 degrees. Combine all the vegetables, garlic, and rosemary in a large mixing bowl. Sprinkle on the salt, pepper, and 1/3 cup olive oil and toss to coat thoroughly. (The vegetables may be prepared to this point up to 4 hours in advance.)\nDrop the vegetables into a shallow 2 1/2 quart ovenproof casserole and press them down evenly. Bake 45 minutes.\nTo make the topping, break up the bread and make coarse crumbs in a food processor. Scrape them into a small bowl and drizzle on the 1 tablespoon olive oil. Use your fingers to rub the oil evenly into the crumbs.\nRemove the tian from the oven. Sprinkle the crumbs all over the top. Return the dish to the oven and bake 15 more minutes, or until the vegetables are very tender. Let sit 10 minutes before serving.",
        "ingredients": [
            "1 red onion, cut vertically into sixths, sections separated",
            "1 green bell pepper, cut into 1 1/2inch chunks",
            "12 ounces mushrooms, large ones quartered, medium ones halved",
            "2 plum tomatoes, cored and cut into sixths",
            "3 mediumlarge sweet potatoes or yams, peeled, quartered lengthwise, and sliced 1/4inch thick",
            "4 garlic cloves, thinly sliced",
            "2 teaspoons chopped fresh rosemary, or 3/4 teaspoon crumbled dried",
            "1/2 teaspoon salt",
            "Generous seasoning freshly ground black pepper",
            "1/3 cup olive oil",
            "3 slices homemadetype white bread",
            "1 tablespoon olive oil"
        ],
        "title": "Sweet Potato and Vegetable Tian",
        "picture_link": null
    },
    "y7iee12zAQ1IXmoXxOZ/tG0x0u/zqjS": {
        "instructions": "Combine the flour, salt, and sugar in food processor. Add butter; process until mixture resembles coarse meal, about 8 to 10 seconds. For hand method, place dry ingredients in large bowl. Add butter; blend with pastry cutter until mixture resembles coarse meal.\nAdd ice water in a slow steady stream through feed tube of food processor with machine running, until the dough holds together for no longer than 30 seconds. For hand method, mix dough with a wooden spoon, adding water until dough just holds together.\nTurn dough onto piece of plastic wrap. Press into a disk, and. wrap in plastic wrap. Refrigerate at least 1 hour. May be frozen, double wrapped in plastic, for several months.",
        "ingredients": [
            "2 1/2 cups all-purpose flour",
            "1 teaspoon salt",
            "1 teaspoon sugar",
            "1 cup (2 sticks) cold unsalted butter, cut into small pieces",
            "1/4 to 1/2 cup water"
        ],
        "title": "Pie Crust 101",
        "picture_link": null
    },
    "2vh8HJrremzool6rXg0/1os/UB/gzfW": {
        "ingredients": [
            "4 cups water",
            "1 1/2 cups short-grain brown rice",
            "3 tablespoons unsalted butter",
            "1 1/4 cups mixed nuts, chopped",
            "1/4 teaspoon grated nutmeg"
        ],
        "picture_link": "haVy8YMg62rdlZ.cD9suNkhZuINWds6",
        "instructions": "Bring water to a boil in a heavy medium saucepan. Add rice and 1/4 teaspoon salt, then reduce heat to low and simmer, uncovered, until rice is tender, about 40 minutes. Drain in a sieve. Heat butter in a large heavy skillet over medium heat until foam subsides. Add nuts and cook, stirring, until butter and nuts are golden brown, about 4 minutes. Add rice and nutmeg to skillet and toss to coat.\nBring water to a boil in a heavy medium saucepan. Add rice and 1/4 teaspoon salt, then reduce heat to low and simmer, uncovered, until rice is tender, about 40 minutes. Drain in a sieve.\nHeat butter in a large heavy skillet over medium heat until foam subsides. Add nuts and cook, stirring, until butter and nuts are golden brown, about 4 minutes.\nAdd rice and nutmeg to skillet and toss to coat.",
        "title": "Nutty Brown Rice "
    },
    "K1MKqFeQ2N3JU8thDaSCqlI4pYTb6bi": {
        "instructions": "Preheat oven to 350 degrees.\nCombine the heavy cream and chipotle puree in a small bowl. In an 8 by 8-inch baking dish, arrange a fourth of the sweet potatoes. Season to taste with salt and pepper and pour a fourth of the cream over it. Repeat with the remaining potatoes and cream, forming 4 layers.\nBake for 1 hour or until the cream has been absorbed and the potatoes are browned. Remove from the oven and let sit 10 minutes before serving.",
        "ingredients": [
            "2 1/2 cups heavy cream",
            "1 tablespoon chipotle puree",
            "3 medium sweet potatoes, peeled and sliced thin",
            "Salt and freshly ground pepper"
        ],
        "title": "Sweet Potato Gratin with Smoked Chiles",
        "picture_link": null
    },
    "TB9yG4OFm/mZmeiXFs211e3us7vQ.0e": {
        "ingredients": [
            "2 tablespoons cornstarch",
            "1 cup water",
            "3 cups low-sodium low-fat chicken broth (24 fl oz)",
            "2 teaspoons finely grated fresh lemon zest",
            "1/2 teaspoon salt",
            "1 large egg, lightly beaten",
            "1 cup firmly packed shredded spinach leaves"
        ],
        "picture_link": null,
        "instructions": "Stir together cornstarch and 1/4 cup water until smooth. Bring broth and remaining 3/4 cup water to a boil in a 2- to 3-quart heavy saucepan over high heat, then reduce heat to moderately high and add zest and salt. Stir cornstarch mixture and add to soup, whisking until smooth. Simmer, whisking, 2 minutes, then add egg in a slow stream, stirring with a spoon. Stir in spinach and return to a boil, then remove from heat. Season with salt.\nStir together cornstarch and 1/4 cup water until smooth.\nBring broth and remaining 3/4 cup water to a boil in a 2- to 3-quart heavy saucepan over high heat, then reduce heat to moderately high and add zest and salt.\nStir cornstarch mixture and add to soup, whisking until smooth. Simmer, whisking, 2 minutes, then add egg in a slow stream, stirring with a spoon. Stir in spinach and return to a boil, then remove from heat. Season with salt.",
        "title": "Stracciatella Soup "
    },
    "b7D2NhCHvPETFzJA2bCB2N.0gspLl5W": {
        "instructions": "Preheat the oven to 425 degrees.\nWell in advance of cooking the fish, prepare the stuffing. Combine the sage, softened butter, lemon juice, spice and seasonings, bread crumbs, pine nuts, jalapenos, garlic and coriander in the bowl of a food processor, pulsing to combine well. Remove and place in a bowl. Keep refrigerated until ready to use.\nSeason the trout with salt and pepper and rub the trout with olive oil.\nDivide the stuffing between the 4 fish evenly and spread an even layer inside the cavity of the fish. Divide the shrimp in the same way and add the shrimp in a layer in top of the herb butter. Close the fish to seal in the stuffing.\nLay the fish on an oiled rack and set in a roasting pan.\nPlace the fish in the oven and roast for 12 minutes on each side. Remove and serve immediately.",
        "ingredients": [
            "3 tablespoons chopped fresh sage",
            "1/4 cup unsalted butter, softened to room temperature",
            "Juice of 1 lemon",
            "1/2 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper",
            "1/2 teaspoon paprika",
            "3 scallions, finely chopped",
            "1/2 cup dry bread crumbs",
            "1/4 cup pine nuts",
            "2 fresh jalapeno peppers, seeded and diced",
            "1 clove garlic, finely chopped",
            "1 tablespoon toasted, ground coriander seed",
            "Salt and freshly ground black pepper to taste",
            "4 butterflied rainbow trout, whole, skin on, bones removed (ask your fish dealer to do this for you)",
            "Olive oil",
            "1/2 pound cleaned and shelled rock shrimp"
        ],
        "title": "Roasted Rainbow Trout with Rock Shrimp and Sage Butter Stuffing",
        "picture_link": null
    },
    "ggBUgm6f58apV5jiJMcGNbjT1hReCim": {
        "instructions": "Trim the fat of the flank steak and cut into thin pieces against the grain. Marinate the meat for 1 hour in a mix of egg, cornstarch, and 2 tablespoons oil.\nIn large wok, cook the rice noodles in 2 inches of hot oil for just a few seconds, or until they puff up. Drain the noodles and set to the side. Heat up the wok again with 3 cups of oil to 350 degrees F and add the cut up flank steak. Stir for 3 to 4 minutes, and then remove from the heat and drain well.\nHeat the wok up again and add 2 teaspoons oil, ground garlic, all the cut up scallions, and the marinated beef. Cook for 2 to 3 minutes. Now add the sugar, black pepper, and soy sauce and cook for another 3 to 4 minutes. Remove from the heat and serve over the rice noodles.",
        "ingredients": [
            "One 16-ounce flank steak",
            "1 egg",
            "1 teaspoon cornstarch",
            "3 cups plus 2 tablespoons plus 2 teaspoons vegetable oil, plus more for frying",
            "5 ounces cooked rice noodles",
            "1 tablespoon ground garlic",
            "3/4 cup (3/4-inch long) scallion slices, green and white parts",
            "1/4 cup sugar",
            "1 teaspoon ground black pepper",
            "3 teaspoons soy sauce"
        ],
        "title": "Mongolian Beef",
        "picture_link": "SaD.N6POH2quqQKWaMBOvrO5stANYDi"
    },
    "ECZnGgKuRW.ZU7W/nRHkWKlDNChdfGq": {
        "instructions": "Combine parsley, garlic, lime juice, and extra virgin olive oil and set aside. This is your mojo sauce. In a large pot with oil heated to at least 350 degrees, fry yuca until golden brown season with salt and pepper when hot. Serve yuca with the mojo sauce on top.",
        "ingredients": [
            "1/2 cup chopped parsley",
            "1 teaspoon chopped garlic",
            "1 tablespoon lime juice",
            "2 tablespoons of extra virgin olive oil",
            "2 pound blanched Yuca, cut into steak fry size"
        ],
        "title": "Yuca con Mojo",
        "picture_link": null
    },
    "vbDEoMKCLRji3TdhUnE3qBFctp5wBpC": {
        "ingredients": [
            "4 boneless, skinless chicken breasts",
            "1/4 cup balsamic vinegar",
            "3 tablespoons honey",
            "2 tablespoons soy sauce",
            "2 garlic cloves, minced"
        ],
        "picture_link": "z53dF7cZrq2EfrLltoxjM7kTkblD1XS",
        "instructions": "1. Preheat oven to 350°F. 2. In a 9x13 glass baking dish, whisk together the balsamic vinegar, honey, soy sauce, and minced garlic. 3. Place the chicken breasts on top of the mixture and turn to coat. 4. Bake, uncovered, for 30–40 minutes, depending on the size of the chicken breasts, until cooked through. Baste the chicken with the sauce half way through cooking.\n1. Preheat oven to 350°F.\n2. In a 9x13 glass baking dish, whisk together the balsamic vinegar, honey, soy sauce, and minced garlic.\n3. Place the chicken breasts on top of the mixture and turn to coat.\n4. Bake, uncovered, for 30–40 minutes, depending on the size of the chicken breasts, until cooked through. Baste the chicken with the sauce half way through cooking.\nDo Ahead The chicken can be marinated up to 8 hours.\nThe chicken can be marinated up to 8 hours.",
        "title": "Sweet Balsamic Glazed Chicken "
    },
    "gk439KdK2Dq12tY9sRL9K61Gkk894za": {
        "instructions": "Spread all of the bread slices generously with the ginger butter. Place slices of smoked salmon in an even layer on half of the bread slices. Top with remaining bread slices. Using a 2-inch flower-shaped cookie cutter, cut out the tea sandwiches. Remove the top slice of bread from each flower. Using a 3/4 to 7/8-inch round biscuit cutter, cut a circle from the center of each, discard the circle. Replace the slice, butter-side down, on the flower.\nPlace butter, cream cheese, ginger, lime juice, cilantro and salt in the bowl of a food processor. Pulse just until ingredients are combined, about 30 seconds.\nTransfer mixture to a sheet of parchment or waxed paper. Roll into a 1 1/2-inch wide log. Refrigerate until ready to use.",
        "ingredients": [
            "24 slices thin white bread",
            "4 ounces Ginger-Cilantro Lime Butter, recipe follows",
            "8 ounces thinly sliced smoked salmon",
            "8 tablespoons (1 stick) unsalted butter, at room temperature",
            "2 ounces (1/4 cup) cream cheese, at room temperature",
            "1 tablespoon grated fresh ginger",
            "1 tablespoon fresh lime juice",
            "3 tablespoons chopped fresh cilantro",
            "1 teaspoon kosher salt"
        ],
        "title": "Smoked Salmon Tea Sandwiches",
        "picture_link": null
    },
    "Ftox4vCdsk9lCvCkdJYx58B7Z9oolWy": {
        "instructions": "Slice eggs in half crosswise. Separate the whites from the yolks. Slice the egg whites into ringlets and set aside.\nIn a bowl, whisk together the yolks and cold water until the yolks are dissolved. Whisk in the oil, salt, sugar, and mustard until combined well. Add the vinegars.\nToss the greens with the dressing. Transfer to a serving bowl. Place scallions around the outside and top with the egg white ringlets.",
        "ingredients": [
            "2 eggs, hard-boiled",
            "2 tablespoons cold water",
            "2 tablespoons oil",
            "Salt to taste",
            "1 teaspoon powdered sugar",
            "1 teaspoon mustard",
            "2 teaspoons white vinegar",
            "2 teaspoons tarragon vinegar",
            "1 pound mixed greens (lettuce, chervil, watercress, etc.)",
            "1 cup scallions, sliced on the diagonal"
        ],
        "title": "Garden Salad",
        "picture_link": null
    },
    "HXNUexZT7DRfBxc39bp3rsLTchSQq5m": {
        "instructions": "Heat a clean griddle and brush with 1/2 of the oil. Brush onion slices lightly with remaining oil on both sides, season with salt and pepper and place on griddle. Grill for 3 to 5 minutes on each side, or until softened and lightly charred. Transfer onions to a bowl, drizzle with vinegar and sprinkle with rosemary. Toss to separate rings and season with more salt and pepper as needed.",
        "ingredients": [
            "1 tablespoon olive oil",
            "2 pounds red onions, cut crosswise into 1/2inch thick slices",
            "Coarse salt",
            "Freshly ground black pepper",
            "2 tablespoons balsamic vinegar",
            "1 teaspoon chopped fresh rosemary"
        ],
        "title": "Grilled Red Onions with Balsamic Vinegar",
        "picture_link": null
    },
    "RGCvYjXM5yw/AypJri5tqAz/9MnJQai": {
        "instructions": "In a saucepan on medium-high heat, add the butter, chicken stock and thyme. Simmer until the thyme wilts slightly, about 8 minutes. Add the corn and stir to break up any chunks. Simmer for about 10 minutes. Remove from the heat, remove the sprigs of thyme, add the sour cream and season with salt and pepper. Stir to blend, and then serve with a dash of cayenne pepper.",
        "ingredients": [
            "2 tablespoons butter",
            "1/2 cup low-sodium chicken stock",
            "6 sprigs fresh thyme",
            "1 (12-ounce) package frozen corn",
            "1/4 cup sour cream",
            "Salt and freshly ground black pepper",
            "Cayenne pepper, for garnish"
        ],
        "title": "Natina Corn",
        "picture_link": "lLpEUOvw7EsuwYJzD4Ba.LFqc6FdGiW"
    },
    "SzPugeBhz.RdHmCA0ebOse7ukqpHjpO": {
        "instructions": "Preheat oven to 350 degrees F. Lightly coat a baking sheet with canola oil.\nIn a large mixing bowl, cream butter, cream cheese, and brown sugar on low speed with an electric mixer. Add egg yolks and vanilla and mix on low until just combined.\nIn a medium bowl, combine remaining ingredients. Add to butter mixture and mix by hand until combined. Portion heaping teaspoonfuls (or use a 3/4 ounce scoop) onto baking sheet about 1 1/2 inches apart. Bake for 7 minutes. Lightly flatten cookies with finger. Rotate baking sheet and bake an additional 3 minutes.",
        "ingredients": [
            "Canola oil",
            "1/4 cup butter",
            "1/3 cup low-fat cream cheese",
            "1 cup packed brown sugar",
            "2 egg yolks",
            "3/4 teaspoon vanilla extract",
            "1 cup all-purpose flour",
            "1/3 cup whole-wheat flour",
            "3/4 teaspoon baking soda",
            "1/2 teaspoon salt",
            "1 package semi-sweet chocolate chips, about 6 ounces"
        ],
        "title": "Chocolate Chip Cookie",
        "picture_link": null
    },
    "3qMpOy2M19G9ShlnvFk5fGh8JPXHzWe": {
        "instructions": "Place the chocolate chips in a blender. Crack in the eggs, and then add the orange liqueur and salt. Pulse until the chocolate chips are partially pulverized, 5 to 7 times.\nWith the blender running, carefully pour in the coffee in a steady stream through the small opening in the lid. The coffee will melt the chocolate and turn it into a smooth mixture. Turn off the blender when the mixture is very smooth. Pour the mixture into small mason jars, pretty wine glasses or demitasse cups.\nPlace the jars on a tray and refrigerate them until firm, at least 2 or 3 hours. Yum!\nWhip the cream with the sugar and generously plop it onto the top of each glass. Cut a strip of orange peel, cut into strips and decorate with the orange peel twists.",
        "ingredients": [
            "12 ounces semisweet chocolate chips",
            "4 eggs, at room temperature",
            "2 to 3 teaspoons orange liqueur, such as Grand Marnier",
            "1 pinch salt",
            "8 ounces VERY hot strong coffee",
            "1 cup heavy cream",
            "2 tablespoons sugar",
            "Orange peel, for garnish"
        ],
        "title": "Pots de Creme a L'Orange",
        "picture_link": "ZYsfVuAbRD96qpMKKrvudtdzrIFY1jW"
    },
    "TI/u4oHJHb1WcOx0a4/amlQI9CUpr9q": {
        "instructions": "Watch how to make this recipe.\nFor the cake: Preheat the oven to 350 degrees F. Grease a 9-by-13-inch baking pan with butter.\nAdd the flour, baking powder, cinnamon and salt to a medium bowl and stir to combine. Set aside.\nCream together the butter and sugar with an electric mixer. Add the egg and mix until combined. Mix in the vanilla. Add the flour mixture and milk alternately and mix until totally incorporated. Do not over-beat. Stir in the blueberries until evenly distributed. Pour the batter into the prepared pan.\nFor the topping: Combine the flour, sugar, butter, cinnamon and salt in a medium bowl and cut together using 2 knives or a pastry cutter. Sprinkle over the top of the batter.\nBake until the cake is golden brown, 40 to 45 minutes. Sprinkle with sugar. Cut into squares and serve with softened butter.",
        "ingredients": [
            "5 tablespoons salted butter, softened, plus more for greasing the pan",
            "2 cups all-purpose flour",
            "2 heaping teaspoons baking powder",
            "1/2 teaspoon ground cinnamon",
            "1/2 teaspoon salt",
            "3/4 cup sugar",
            "1 large egg",
            "1/2 teaspoon vanilla extract",
            "3/4 cup whole milk",
            "2 cups fresh blueberries",
            "1/2 cup all-purpose flour",
            "1/2 cup sugar",
            "6 tablespoons salted butter",
            "1/2 teaspoon cinnamon",
            "1/4 teaspoon salt",
            "Sugar, for sprinkling",
            "Softened butter, for serving"
        ],
        "title": "Blueberry Coffee Cake",
        "picture_link": "2NoUOQ78ix9OVD6cBAB8hZyKkL5IH7e"
    },
    "RQPa4eqENRs/Krec9ZdILfognQuV6xK": {
        "instructions": "Whisk together the pineapple juice, soy sauce, coconut oil, ginger, honey, garlic and sesame oil in a medium bowl. Use as a marinade for pork tenderloin or chops before grilling.",
        "ingredients": [
            "1/2 cup pineapple juice",
            "1/2 cup soy sauce",
            "2 tablespoons coconut oil",
            "2 tablespoons minced fresh ginger",
            "2 tablespoons honey",
            "1 tablespoon minced garlic",
            "1 tablespoon dark sesame oil"
        ],
        "title": "Tropical Teriyaki Pork Marinade",
        "picture_link": "0kO1OtIV0zfML2fsGLisjebMQ0FZU9e"
    },
    ".2F6sJEOphrSkpUlhl65zQsDgSMXTvi": {
        "instructions": "Put the sorbet in a medium microwave-safe bowl and heat until melted. Stir in the condensed milk and let cool.\nPut the cream in another medium bowl and beat with an electric mixer until it is thick and holds a ribbony shape when you run the beaters through it (do not let it form soft peaks), 2 to 3 minutes. Gently stir the thickened cream into the lemon sorbet mixture and pour into the pie crust. Smooth out into an even layer. Cover loosely with plastic wrap and freeze until set, about 2 hours or up to overnight.",
        "ingredients": [
            "1 cup lemon sorbet",
            "3/4 cup sweetened condensed milk",
            "2/3 cup heavy cream",
            "One 9-inch graham cracker pie crust"
        ],
        "title": "4-Ingredient Frozen Lemonade Pie",
        "picture_link": "qAGalhosxPIq/645mGvIzEqOB5ehKKe"
    },
    "QqXga3DWAZm8nygVWNFM0KYuF5Xi.22": {
        "instructions": "In a mixing bowl or standing mixer cream together the butter and sugar until light. Beat in 1 egg and mix in the molasses, orange juice, and zest. Sift together the dry ingredients and stir them into the wet ingredients to make a soft, smooth dough, adding more flour if dough is too sticky. Knead the dough three times on a lightly floured board.\nShape the dough into 3 logs, about 8-inches long, wrap in plastic wrap and refrigerate at least 1 hour or overnight.\nPreheat oven to 350 degrees F. Slice logs into thin circles, less than 1/8-inch thick. Place on lightly greased baking sheets.\nBake cookies for about 8 to 10 minutes. Remove from oven and transfer cookies to a rack to cool.",
        "ingredients": [
            "1 1/2 sticks unsalted butter",
            "1 cup brown sugar",
            "1 large egg",
            "2 tablespoons plus 1 teaspoon molasses",
            "1 tablespoon orange juice",
            "1 tablespoon finely grated orange zest",
            "2 3/4 to 3 cups flour",
            "1 teaspoon baking soda",
            "1/2 teaspoon ground cloves",
            "2 teaspoons ground cinnamon",
            "2 teaspoons ground ginger"
        ],
        "title": "Swedish Orange Gingersnaps",
        "picture_link": "BEcJ5AKw0kIw5ytOsyB55L7WBKhttNy"
    },
    "xHoNfM1ELzWDaD3indIUuFEnn68BDjm": {
        "instructions": "Preheat a grill or grill pan to medium high. Slice the chicken breasts 1/2 inch thick and toss with 2 tablespoons peanut sauce, 1/2 tablespoon vegetable oil, 1/4 teaspoon salt, and pepper to taste in a bowl. Grill the chicken until just cooked through, about 2 minutes per side. Transfer to a plate.\nWhisk the remaining 5 tablespoons peanut sauce and 2 1/2 tablespoons vegetable oil, the lime juice and 2 tablespoons water in a large bowl. Add the lettuce, cucumber, carrot, bell pepper and cilantro and toss. Season with salt and pepper and divide among bowls. Top with the chicken, peanuts and more cilantro.\nPer serving: Calories 363; Fat 20 g (Saturated 2 g); Cholesterol 66 mg; Sodium 208 mg; Carbohydrate 15 g; Fiber 5 g; Protein 32 g\nPhotograph by Andrew Purcell",
        "ingredients": [
            "2 skinless, boneless chicken breasts (about 1 pound)",
            "7 tablespoons (about 1/2 cup) Thai peanut sauce",
            "3 tablespoons vegetable oil",
            "Kosher salt and freshly ground pepper",
            "2 tablespoons fresh lime juice",
            "1 head romaine lettuce, sliced",
            "1/2 English cucumber or 2 Persian cucumbers, cut into matchsticks",
            "1 medium carrot, halved lengthwise and thinly sliced",
            "1 red bell pepper, thinly sliced",
            "1/4 cup roughly chopped fresh cilantro, plus more for topping",
            "3 tablespoons chopped roasted salted peanuts"
        ],
        "title": "Chicken Satay Salad",
        "picture_link": "R.0qPcCDOlMmBclNFRDjMsSouYmR/4K"
    },
    "Q7D2waURRRQTyQHR76tiSPgQpxMRR2u": {
        "instructions": "Special equipment: 2 thick straws\nLine a plate with parchment paper or spray with nonstick cooking spray.\nHeat the chocolate chips in a bowl in the microwave for 30 seconds, then stir very well. Continue to microwave in 20-second increments, stirring, until melted and smooth. While warm, using the back of spoon, coat one end of a straw with melted chocolate, making sure the chocolate sticks. Shake off any excess. Sprinkle the peanuts evenly over the wet chocolate and place onto the prepared plate; repeat for the second straw. Transfer the plate with the straws to the freezer to set, about 5 minutes. Place 2 glasses in the freezer to chill, 3 to 5 minutes.\nIn the base of a blender, add the milk, vanilla extract, salt and vanilla ice cream and liquefy until smooth. Pour into the chilled glasses, top with whipped cream and serve with a dipped straw!",
        "ingredients": [
            "Nonstick cooking spray, for spraying the plate, optional",
            "1/4 cup white chocolate chips",
            "2 tablespoons crushed toasted and salted peanuts",
            "1 cup whole milk",
            "1 teaspoon vanilla extract",
            "Generous pinch kosher salt",
            "4 to 5 large scoops premium vanilla bean ice cream",
            "Whipped cream, for serving"
        ],
        "title": "Love Me a Vanilla Milkshake with Chocolate Peanut Straws",
        "picture_link": "4notBAM6hEZVLAnHmabKjNPrhQGmE.C"
    },
    "JmFNXmGQMUUP655F1vvLV9WXhoSR5Hq": {
        "instructions": "WHISK olive oil, vinegar, garlic, Italian seasoning, salt and pepper until blended. Combine marinade with 1 to 1 1/2 pounds meat, chicken or seafood in 1-gallon resealable plastic bag.\nMARINATE in refrigerator, turning several times: meat, 1 hour; chicken or seafood, 30 minutes. Remove meat, chicken or seafood from marinade. Discard marinade. Grill or cook as desired.",
        "ingredients": [
            "2/3 cup Crisco Pure Olive Oil or 2/3 cup Crisco Puritan Canola Oil with Omega-3 DHA",
            "1/4 cup red wine vinegar",
            "2 tsps. minced garlic",
            "2 1/2 tsps. Italian seasoning or dried basil leaves",
            "1 tsp. salt",
            "1/2 tsp. fresh ground black pepper"
        ],
        "title": "Easy Seasoned Marinade",
        "picture_link": null
    },
    "J4EQpXYTdSJn3kCcryAOH78RRzii2k6": {
        "instructions": "Watch how to make this recipe.\nBring a large pot of water to a boil and cook the pasta according to the package directions. Set aside.\nMelt the coconut oil in a high-sided 10-inch saute pan over medium heat. Stir in the flour and cook until golden brown, about 2 minutes. Slowly whisk in the milk. Reduce to low heat, bring to a simmer and cook until it becomes a thin gravy, about 5 minutes. Add the white pepper and ground mustard and stir to combine. Add the cream cheese and stir until fully incorporated. Stir in the Cheddar, American cheese and wine, if using, and cook until fully incorporated. Taste and add salt as needed.\nAdd the cooked pasta to the cheese sauce and stir to thoroughly combine. Taste again and salt as needed before serving.",
        "ingredients": [
            "1 pound medium pasta shells",
            "2 tablespoons unrefined coconut oil",
            "2 tablespoons all-purpose flour",
            "2 cups unsweetened almond milk or whole milk",
            "1/2 teaspoon freshly ground white pepper",
            "1/4 teaspoon ground mustard",
            "One 8-ounce block cream cheese, at room temperature",
            "8 ounces sharp white Cheddar, shredded",
            "8 ounces white American cheese, shredded if from a block, otherwise diced",
            "2 tablespoons white wine, optional",
            "Kosher salt"
        ],
        "title": "White Mac 'n' Cheese",
        "picture_link": "Nmji0ZVMqP2y26do5MqWo14G/wXOpDm"
    },
    "0X7bZyV4kQVdSrE57gLHW/WlP8Vxjjm": {
        "instructions": "Watch how to make this recipe.\nPreheat oven to 375 degrees F.\nIn a small bowl, stir together flour, baking soda, and baking powder. Set aside.\nIn a large bowl, cream together butter and sugar until smooth. Beat in the egg and vanilla. Gradually blend in dry ingredients. Add enough of the buttermilk to moisten the dough and make it soft, not wet.\nRoll rounded teaspoons of dough into balls and place on a ungreased cookie sheet. With a brush or fingers, moisten the top of each cookie with the remaining buttermilk and slightly flatten the top of each cookie. Sprinkle with raw sugar or colored sprinkles.\nBake for 8 to 10 minutes or until slightly golden. Let stand for 2 minutes before removing to cool on a rack.",
        "ingredients": [
            "2 3/4 cups all-purpose flour",
            "1 teaspoon baking soda",
            "1/2 teaspoon baking powder",
            "1 cup softened butter",
            "1 1/2 cups white sugar",
            "1 egg",
            "1 teaspoon vanilla extract",
            "3 to 4 tablespoons buttermilk",
            "Sprinkles or colored sugar, for decorating"
        ],
        "title": "Chewy Sugar Cookies",
        "picture_link": "MU9O90a3gjEAH8TKF2ARjMAO8KdQRpK"
    },
    "zH0g.YmGmGP0GJcluYOmS5vsYyfIn0e": {
        "instructions": "Preheat the oven to 400 degrees F. Whisk the cornmeal, flour, sugar, baking powder, baking soda and salt in a medium bowl.\nCook 6 tablespoons butter in an 8-inch cast-iron skillet over medium heat until browned, about 5 minutes; remove from the heat. Whisk the eggs and honey in a bowl, then whisk in the milk, sour cream and browned butter. Add to the flour mixture and stir with a wooden spoon until just combined.\nHeat the remaining 2 tablespoons butter in the skillet over medium heat until it foams. Remove from the heat and add the batter. Transfer to the oven; bake until the cornbread springs back when pressed, 20 to 30 minutes. Let cool 15 minutes in the skillet before slicing.\nPhotograph by Con Poulos",
        "ingredients": [
            "1 1/3 cups yellow cornmeal",
            "1 1/3 cups all-purpose flour",
            "3 tablespoons sugar",
            "2 teaspoons baking powder",
            "1/8 teaspoon baking soda",
            "2 teaspoons kosher salt",
            "1 stick unsalted butter",
            "2 large eggs",
            "2 tablespoons honey",
            "3/4 cup whole milk",
            "3/4 cup sour cream"
        ],
        "title": "Sweet Skillet Cornbread",
        "picture_link": "Vay6cyv4tXscc0SGSoBhDb/T5bywiJa"
    },
    "GJt0JaneB9SsC/MKqAvOsxmv9LlvSBe": {
        "instructions": "In a 2 quart saucepan, over a medium low heat, place the oil, onion, rice, and pinon nuts. Saute until the nuts turn golden. Add the water and salt. Cover and simmer for 20 to 25 minutes, until the rice is cooked and the water is absorbed.\nToss the green onion on top of the rice to garnish.",
        "ingredients": [
            "2 tablespoons peanut oil",
            "1/2 small yellow onion, diced",
            "1 cup uncooked white rice, rinsed",
            "3/4 cup pinon nuts",
            "2 cups water",
            "1/2 teaspoon sea salt",
            "1 green onion, sliced finely"
        ],
        "title": "Pinon Rice",
        "picture_link": null
    },
    "oBibMkEDCyBQdgZkzDbahVjP1lYzS/K": {
        "ingredients": [
            "6 tablespoons (3/4 stick) butter, room temperature",
            "1 1/2 tablespoons fresh lemon juice",
            "1 1/2 tablespoons minced, seeded jalapeño chili",
            "1 1/2 teaspoons finely grated lemon peel",
            "8 thin slices whole wheat bread or other whole grain bread",
            "1 large bunch watercress (about 6 ounces), tough ends trimmed"
        ],
        "picture_link": null,
        "instructions": "Mix first 4 ingredients in small bowl until well blended. Season with salt and pepper. Spread chili-lemon butter on 1 side of each bread, dividing equally. Top buttered side of 4 bread slices generously with watercress. Cover with remaining 4 bread slices, buttered side down, pressing slightly to adhere. Cut sandwiches in half and serve immediately.\nMix first 4 ingredients in small bowl until well blended. Season with salt and pepper.\nSpread chili-lemon butter on 1 side of each bread, dividing equally. Top buttered side of 4 bread slices generously with watercress. Cover with remaining 4 bread slices, buttered side down, pressing slightly to adhere. Cut sandwiches in half and serve immediately.",
        "title": "Watercress Sandwiches with Chili-Lemon Butter "
    },
    "uPTSxtJQdYEr6lJLEYasRZ5Q4EFPbcC": {
        "instructions": "Place both types sugar and the cream in a heavy saucepan and bring to a boil over medium heat, stirring constantly. When the temperature reaches 228 degrees on candy thermometer, stir in the butter and pecans and continue to cook, stirring constantly, until the mixture reaches 236 degrees. Remove the pan from the heat and allow the mixture to cool for 5 minutes. Beat the mixture with a wooden spoon until the candy coats the pecans but does not lose its gloss. Drop the pralines 1 tablespoon at a time onto a well-greased piece of aluminum foil or a slab of confectioner's marble. Allow the pralines to cool. They can be eaten as is, stored in tins, or crumbled over vanilla ice cream for a New Orleans--style dessert.;",
        "ingredients": [
            "1 cup firmly packed light brown sugar",
            "1 cup granulated sugar",
            "1/2 cup light cream",
            "2 tablespoons salted butter",
            "1 cup pecan halves"
        ],
        "title": "Pecan Pralines",
        "picture_link": null
    },
    "K5WZMZMugK/7qMOprijnP/clbWXNsbC": {
        "instructions": "*Cooks note: A 3-bone-in standing rib roast cooked in a 13 by 9-inch roasting pan will give you enough drippings for the pudding. Prepare the pudding while the roast is resting.\nPreheat oven to 400 degrees F.\nLeave 2 tablespoons of drippings in the roasting pan and place in the oven.\nPlace the flour, salt, eggs, milk and remaining 2 tablespoons of drippings into the bowl of a food processor or blender and process for 30 seconds. Pour the batter into the hot roasting pan and bake for 35 to 40 minutes or until puffed and golden brown. While the pudding is cooking, carve the roast. Serve the pudding with the roast.",
        "ingredients": [
            "9 ounces all-purpose flour, approximately 2 cups",
            "1 1/2 teaspoons kosher salt",
            "4 large eggs, room temperature",
            "2 cups whole milk, room temperature",
            "1/4 cup beef drippings, divided*"
        ],
        "title": "Yorkshire Pudding with Roast",
        "picture_link": "9RuEE64Lb743UPKwaB/6QZ0dD69bfky"
    },
    "IE4A.DZebUFF2bz/Am7nmHYSvY1iwTC": {
        "instructions": "Finely dice the pickles and blend them with the capers, red onion and black olives; let the mixture sit until ready to serve. At the last moment, blend in parsley and olive oil to taste and season with salt and pepper.",
        "ingredients": [
            "1 cup small pickles (\"cornichons\"), drained",
            "1/4 cup each drained capers (if they are large, chop them roughly), finely diced red onion and slivered Kalamata olives",
            "1/2 cup chopped fresh parsley",
            "Olive oil to taste",
            "Salt and freshly ground black pepper"
        ],
        "title": "Pickle and Caper Sauce",
        "picture_link": null
    },
    "f6LsIomXvYinpiOZdSEtGWf8uYSSozq": {
        "ingredients": [
            "8 garlic cloves",
            "2 dried guindilla or New Mexico chiles",
            "2 teaspoons smoked paprika",
            "1 teaspoon ground cumin",
            "1 teaspoon kosher salt",
            "1 cup extra-virgin olive oil",
            "1 teaspoon Sherry vinegar"
        ],
        "picture_link": "eDQz9a.ayWcsfWJj88mYwXmoGXhtPnK",
        "instructions": "Process 8 garlic cloves, 2 dried guindilla or New Mexico chiles, 2 teaspoons smoked paprika, 1 teaspoon ground cumin, and 1 teaspoon kosher salt in a food processor, occasionally scraping down sides of bowl, until a smooth paste forms. With machine running, drizzle in 1 cup extra-virgin olive oil and process until well blended. Add 1 teaspoon Sherry vinegar and 1 teaspoon water and process to blend. Season with salt.\nProcess 8 garlic cloves, 2 dried guindilla or New Mexico chiles, 2 teaspoons smoked paprika, 1 teaspoon ground cumin, and 1 teaspoon kosher salt in a food processor, occasionally scraping down sides of bowl, until a smooth paste forms. With machine running, drizzle in 1 cup extra-virgin olive oil and process until well blended. Add 1 teaspoon Sherry vinegar and 1 teaspoon water and process to blend. Season with salt.",
        "title": "Mojo Rojo "
    },
    "RGsWiBaieb4z0d5.95sYb0o1WtWLqOa": {
        "instructions": "In a pan over high heat add 2 tablespoons vegetable oil. Heat until oil starts to lightly smoke. Add the mushrooms. Cook until lightly brown, stirring frequently. Add 4 tablespoons shallots and season with salt and pepper to taste. Let cool and reserve. In a mixing bowl, add the mushrooms, 2 cups of cooked turkey, tomatoes, chives, bread crumbs, 4 remaining tablespoons shallots, thyme and eggs. Mix well to incorporate. Divide mixture into 4 portions and shape into burgers. Lightly coat burgers with fresh bread crumbs. Heat 2 tablespoons vegetable oil, add burgers and cook until golden brown (approximately 2 minutes on each side.) Serve with a bun and French fries.;",
        "ingredients": [
            "6 tablespoons vegetable oil",
            "1 cup mushrooms, diced",
            "8 tablespoons shallots",
            "2 cups cooked turkey, diced",
            "4 tablespoons tomatoes, diced, seeded",
            "4 tablespoons chives",
            "1 cup fresh bread crumbs",
            "4 teaspoons fresh thyme",
            "3 whole eggs",
            "Salt and pepper"
        ],
        "title": "Turkey Burger",
        "picture_link": null
    },
    "j1ivMPb5930AOnen8UJqmgk90uM/aPO": {
        "instructions": "Place the chocolate chunks in a blender and pulse several times until broken into small pieces. Or grate by hand. Meanwhile, bring the milk to boil in a small pot. Pour the hot milk over the chocolate, cover (with the vent open) and blend until thoroughly combined and frothy. Or whisk with a whip for 3 minutes. Serve immediately.;",
        "ingredients": [
            "1 (3-ounce) tablet Mexican-style chocolate, roughly chopped",
            "3 cups milk"
        ],
        "title": "Mexican Hot Chocolate",
        "picture_link": null
    },
    "OyGx7vpNkgXdqkqmMNedSTo.qEtl4pa": {
        "instructions": "Fill a Collins glass with ice. Pour in the rum, lime juice and orange liqueur. Top with the passion fruit juice. Garnish with a lime wedge.",
        "ingredients": [
            "2 ounces dark rum",
            "3/4 ounce fresh lime juice",
            "1/4 ounce orange liqueur, such as Mandarine Napoleon",
            "3 ounces passion fruit juice",
            "Lime wedge for garnish"
        ],
        "title": "Bermuda Triangle",
        "picture_link": null
    },
    "48bM2O5PBSi4oa8Kz3l.RLGp4PJJv4O": {
        "instructions": "Preheat the oven to 425 degrees.\nCut the potatoes in halves or quarters, depending on their size, and place them on a sheet pan. Remove the ends of the onions, peel them, and cut them in half. Slice them crosswise in 1/4-inch-thick slices to make half-rounds. Toss the onions and potatoes together on the sheet pan. Add the olive oil, mustard, 2 teaspoons salt, and the pepper and toss them together. Bake for 50 minutes to 1 hour, until the potatoes are lightly browned on the outside and tender on the inside. Toss the potatoes from time to time with a metal spatula so they brown evenly.\nServe hot sprinkled with chopped parsley and a little extra salt.",
        "ingredients": [
            "2 1/2 pounds small red potatoes (or small Yukon Gold potatoes)",
            "2 yellow onions",
            "3 tablespoons good olive oil",
            "2 tablespoons whole-grain mustard",
            "Kosher salt",
            "1 teaspoon freshly ground black pepper",
            "1/4 cup chopped fresh flat-leaf parsley"
        ],
        "title": "Mustard-Roasted Potatoes",
        "picture_link": ".QyS5xsszWkhZiRQJPJVVflvMEg9mIW"
    },
    "If18rcswME3Z8oDKmLJKVlXh4pIdltO": {
        "instructions": "Skewer cake, kiwi, banana and pear onto wooden picks. Arrange on outer edge of serving plate. Cover with plastic wrap; refrigerate while making fondue.\nCombine milk and chocolate in small nonstick saucepan. Place over medium heat, stirring often, for 3 to 4 minutes or until chocolate is bubbly. Continue to heat 3 to 4 minutes longer, until chocolate is melted, mixture smooth and thick. Stir in mint extract. Pour into small dipping cup. Place in center of fruit plate. Serve while chocolate is hot.",
        "ingredients": [
            "2 thin slices angel food cake, cut into cubes",
            "2 kiwis, peeled, halved lengthwise and cut crosswise into 1/4-inch-thick slices",
            "1 banana, cut into 1/4-inch-thick slices",
            "1 pear, sliced lengthwise into 1/6's",
            "1/2 cup evaporated skim milk",
            "4 ounces (scant 2/3 cup) reduced-fat semisweet baking chips",
            "1/4 teaspoon mint extract"
        ],
        "title": "Chocolate Fondue",
        "picture_link": "7sS9nNQ068FHH1rYRcX1t.w2PZQ.b1K"
    },
    "V6qqYx2hXyQnTSUOBcG0EPOLKMlCVKS": {
        "instructions": "Heat a large griddle or cast-iron skillet over medium heat.\nPrepare the sandwiches by spreading 4 slices of the bread with preserves. Top with a slice of cheese, 2 slices of folded prosciutto, then another slice of cheese. Spread the remaining bread slices with Dijon and set in place over the cheese.\nIn a large shallow bowl, beat the eggs with the milk or cream, Parmesan, and parsley. Nest the butter in a paper towel and wipe it across the hot pan. Dip the sandwiches into the egg mixture and cook the sandwiches until deep golden, about 3 to 4 minutes on each side.\nToss the arugula with the lemon juice, extra-virgin olive oil, and salt and pepper, to taste, in a large serving bowl. Cut the sandwiches from corner to corner and serve alongside the salad.",
        "ingredients": [
            "8 slices good quality white bread",
            "1/2 cup fig or plum preserves",
            "8 slices mild provolone or fontina cheese",
            "8 slices prosciutto cotto with rosemary (recommended: Citterio)",
            "1/4 cup Dijon mustard",
            "3 eggs",
            "1/2 cup milk or cream",
            "1/2 cup grated Parmigiano-Reggiano, a couple handfuls",
            "1/4 cup chopped fresh flat-leaf parsley",
            "1 tablespoon butter",
            "6 cups arugula or baby arugula",
            "1 lemon, juiced",
            "2 tablespoons extra-virgin olive oil, eyeball it",
            "Salt and freshly ground black pepper"
        ],
        "title": "Italian-Style Monte Cristo Sandwiches",
        "picture_link": "/5c4ZwM7JcqukKxa1J./gRT6MQ6PyIu"
    },
    "9OYYmsqRNU.ynZVZACbWgx7unGIveUu": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 325 degrees F.\nCombine the coconut, condensed milk, and vanilla in a large bowl. Whip the egg whites and salt on high speed in the bowl of an electric mixer fitted with the whisk attachment until they make medium-firm peaks. Carefully fold the egg whites into the coconut mixture.\nDrop the batter onto sheet pans lined with parchment paper using either a 1 3/4-inch diameter ice cream scoop, or 2 teaspoons. Bake for 25 to 30 minutes, until golden brown. Cool and serve.",
        "ingredients": [
            "14 ounces sweetened shredded coconut",
            "14 ounces sweetened condensed milk",
            "1 teaspoon pure vanilla extract",
            "2 extra-large egg whites, at room temperature",
            "1/4 teaspoon kosher salt"
        ],
        "title": "Coconut Macarons",
        "picture_link": "/JoANMuX9ipdw0LaPbc09V0yXAvujEa"
    },
    "grVBhkcsFk0BkpIj2den1TbJSnHk966": {
        "instructions": "Bring water to a boil for pasta. Salt water and boil pasta for 10 minutes or until \"al dente.\" Meanwhile in the bottom of a mixing bowl combine about 1/3 cup extra virgin olive oil, rind and juice of a lemon, mustard to taste and season with salt and crushed red pepper.\nMince some garlic, halve or quarter cherry tomatoes and add to bottom of mixing bowl. Cut arugula into chiffonade ( not necessary with watercress). When pasta is done, drain it and return to pasta pot and toss with chiffonade of arugula; add dressing and toss until well combined.",
        "ingredients": [
            "8 ounces penne or short fusilli pasta",
            "1 juicy lemon",
            "1/3 cup extra virgin olive oil",
            "Grated rind and puree of a lemon",
            "Dijon Mustard",
            "Garlic",
            "10 yellow or red cherry tomatoes, halved or quartered (depending upon how large they are)",
            "Nice bunch arugula or watercress; well washed, stemmed",
            "Salt and crushed red pepper"
        ],
        "title": "Penne with Salad Stuff",
        "picture_link": null
    },
    "aS88GtS0TzlZNV58L4LeRJXjPpkFYF.": {
        "instructions": "Preheat the oven to 450 degrees F.\nStir together the corn, flour, salt, sugar, and butter. Beat the eggs well. Mix in the milk, then stir in the corn, and pour the mixture into a greased 8 by 8-inch baking dish. Bake for about 40 to 45 minutes.",
        "ingredients": [
            "2 cups white whole kernel corn, or fresh corn, cut off the cob",
            "8 tablespoons flour",
            "1 teaspoon salt",
            "4 rounded teaspoons sugar",
            "4 tablespoons butter, melted",
            "4 eggs",
            "1 quart milk"
        ],
        "title": "Beaumont Inn's Corn Pudding",
        "picture_link": null
    },
    "zFwRLjink3tGHAnECKSQ1t4pa724fjW": {
        "instructions": "Preheat oven to 225 degrees. Have egg whites at about 70 degrees. Beat until foamy in an electric mixer or by hand. Add vanilla. While continuing to beat, add sugar one tablespoon at a time. When the mixture stands in stiff peaks on the beater, it is ready for baking. Fill a pastry bag with mixture and pipe onto parchment covered baking sheet, using star tip to create kisses. Bake about 1 hour or longer, depending on the size. Do not remove from the oven at once, but turn off the oven, open the door and leave them for at least 5 minutes. Cool gradually, away from a draft. Remove them from the sheet when cool.\nTo prepare chocolate ganache, pour hot, scalded cream over chocolate. Blend until smooth. Cool.\nTo fill meringues, crush the bottom lightly with the thumb while still warm. Fill the hollows with chocolate ganache.",
        "ingredients": [
            "4 egg whites",
            "1 teaspoon pure vanilla extract",
            "1 cup super fine sugar",
            "6 ounces bittersweet chocolate, broken into pieces",
            "1/2 cup scalded whipping cream"
        ],
        "title": "Meringues (Plain and Chocolate Filled)",
        "picture_link": null
    },
    "R//L6SFfbopn/ZyyI8XaLXOXQyZAEk6": {
        "instructions": "Preheat an electric or gas grill to 250 degrees F.\nRub all sides of the pork with the seasoned salt and lemon pepper seasoning. Put the rib sections on the grill. Prepare Fred's Special Spray by mixing the lemon juice, vinegar and Worcestershire sauce. Put this mixture in a food-safe spray bottle. Spray the ribs with Fred's Special Spray. Cook the ribs until they are browned, about 1 1/2 hours, spraying often with the sauce. Put the ribs in a 4-inch-deep stainless steel pan with a lid. Spray the ribs once more and close the lid completely. Increase the grill temperature to 300 degrees F. and cook the covered ribs for 3 hours more.",
        "ingredients": [
            "6 pounds meaty pork rib slabs",
            "4 tablespoons seasoned salt (with onion and garlic)",
            "4 tablespoons lemon pepper seasoning",
            "1 cup lemon juice",
            "1 cup apple cider vinegar",
            "2 tablespoons Worcestershire sauce"
        ],
        "title": "Fred's Barbequed Pork Ribs",
        "picture_link": "YlRtfR.SI5i.CRZ3A6jB44xdlph1OsO"
    },
    "V0To8Yd8.mzUavhJSOwnx1o1CrmkgM.": {
        "instructions": "Dice the tuna, against grain, into 1/4-inch cubes. In a bowl combine the lemon juice, lime juice and sugar. Stir in the vinegar and whisk until incorporated. Add the diced tuna, the ginger, red onion, green onion and herbs. Allow the tuna to marinate* for up to 1 hour.\nDrain the excess liquid from the tuna, scoop into cones and serve.\n*The marinating of the tuna with the fresh juices and sugar will be the cooking or curing process for the tuna",
        "ingredients": [
            "8 to 10 ounces fresh sushi grade tuna",
            "1 lemon, juiced",
            "1 lime, juiced",
            "1 tablespoon sugar",
            "2 teaspoons rice wine vinegar",
            "1 teaspoon minced ginger",
            "3 teaspoons red onion, minced",
            "1 green onion, minced",
            "2 sprigs each, cilantro and parsley, leaves chopped",
            "6 waffle cones, store-bought"
        ],
        "title": "Tuna Ceviche Cone",
        "picture_link": null
    },
    "9YdZ7BvMMWuIxjABlzYSTU32Wsg7cKm": {
        "instructions": "Fill shaker with ice. Add Smirnoff Orange Flavored Vodka and peach schnapps. Shake and strain into a shot glass.;",
        "ingredients": [
            "0.75 oz. Smirnoff Orange Vodka",
            "0.75 oz. peach schnapps"
        ],
        "title": "Orange Fusion",
        "picture_link": null
    },
    "d01cf2kqG2nCK0f4xwMhrj08zITV7Jy": {
        "instructions": "1. Heat the butter in a medium saucepan over medium heat. Add the shallots, cumin and salt. Cook, stirring, until the shallots are tender, 2 to 3 minutes. Stir in the rice until the grains are well coated with the buttery shallot mixture.\n2. Add the broth, orange zest and cinnamon stick. Bring to a boil, cover and reduce the heat to medium-low. Cook until all the liquid has been absorbed and the rice is tender, about 15 minutes. Remove from the heat and let stand for 5 minutes. Fluff with a fork, discarding the zest and cinnamon stick. Transfer to a serving dish and sprinkle with the cashews and scallions.",
        "ingredients": [
            "2 tablespoons unsalted butter",
            "1 large shallot, chopped (about 1/3 cup)",
            "1/2 teaspoon cumin seeds",
            "1/2 teaspoon Kosher salt",
            "2 cups jasmine rice",
            "3 cups low-sodium chicken broth",
            "One 3-inch-long piece orange zest, removed with a vegetable peeler",
            "1/2 cinnamon stick",
            "1/3 cup salted cashews, coarsely chopped",
            "1 scallion, thinly sliced"
        ],
        "title": "Fragrant Jasmine Rice Pilaf",
        "picture_link": "z0MGPSRzy.OxWWAg3mIYxQiCkpOiO/u"
    },
    "wYAOm9oZSdLG.FWLsQEwxoWTSrWc.7G": {
        "instructions": "Slice bread lengthwise and split open. Spread cream cheese liberally on bottom half of bread. Spoon healthy portion of the salsa on top of the cream cheese (be sure to include the \"juices\" of the salsa). Close the bread and press down to ensure the salsa \"juices\" are absorbed. Re-open the sandwich and layer the turkey breast on top of the cream cheese and salsa layers.\nFor a bit of added crunch top with bean sprouts, if desired.\nSide with a plate of tortilla chips and remaining salsa.",
        "ingredients": [
            "1 12-inch baguette, French or Italian bread, or sub roll",
            "8 ounces sliced low fat or fat free turkey breast (or chicken breast)",
            "4 ounces cream cheese (or reduced fat Neufchatel cheese)",
            "Small container of peach mango medium heat salsa (or other fruit based Salsa)",
            "bean sprouts (optional)",
            "tortilla Chips (optional)"
        ],
        "title": "The Carnegie Pepe Sandwich",
        "picture_link": null
    },
    "twmGaDdFfNUwjyDfaPW3dGyafZkotJ.": {
        "ingredients": [
            "1 garlic clove, finely grated",
            "1 cup mayonnaise",
            "1/2 cup finely chopped mixed tender herbs (such as basil, chives, parsley, and/or tarragon)",
            "1 teaspoon finely grated lemon zest",
            "2 tablespoons fresh lemon juice",
            "Kosher salt, freshly ground pepper"
        ],
        "picture_link": "ZQxgI5w64hhQnoyQQ5AYLpDXslGxop6",
        "instructions": "Stir garlic, mayonnaise, herbs, lemon zest, and lemon juice in a small bowl to combine; season with salt and pepper.\nStir garlic, mayonnaise, herbs, lemon zest, and lemon juice in a small bowl to combine; season with salt and pepper.\nDo Ahead Mayonnaise can be made 6 hours ahead. Cover and chill.\nMayonnaise can be made 6 hours ahead. Cover and chill.",
        "title": "Lemon-Herb Mayonnaise "
    },
    "VL9HnEElxJLS86Qx2y53yvS4UACuQRC": {
        "instructions": "Place an oven rack in the center of the oven. Preheat the oven to 375 degrees F. Line a heavy baking sheet with parchment paper. Set aside.\nFor the dressing: In a large bowl, whisk together the olive oil, lemon juice, mustard, thyme, salt, pepper and lemon zest until smooth. Remove 3 tablespoons of the dressing and reserve.\nFor the salad: Add the potatoes to the bowl and toss until coated with dressing. Arrange the potatoes in an even layer on the prepared baking sheet. Season with salt and pepper. Roast until golden and tender, about 40 minutes.\nIn a large bowl, toss together the reserved 3 tablespoons dressing, bell peppers and arugula. Arrange on a platter. Place the roasted potatoes on top and sprinkle with the gorgonzola cheese and chopped walnuts if using.",
        "ingredients": [
            "3 tablespoons extra-virgin olive oil",
            "3 tablespoons fresh lemon juice (about 1 large lemon)",
            "2 tablespoons Dijon mustard",
            "1 tablespoon chopped fresh thyme",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "Zest of 1 large lemon",
            "1 1/2 pounds baby red skinned potatoes, halved",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "1 yellow or red bell pepper, cored, seeded and cut into thin strips",
            "4 cups arugula (about 4 ounces)",
            "1/4 cup (2 ounces) crumbled gorgonzola cheese, optional",
            "1/4 cup chopped walnuts, toasted, optional"
        ],
        "title": "Lemon-Mustard Potato Salad",
        "picture_link": "7GpvKxUlnnbin/8WEmMud/RZn4hphQG"
    },
    "xZZIoAUhuPn6Bhs7LoA1EA3ve2dS6E.": {
        "ingredients": [
            "2 teaspoons chili powder",
            "1 1/2 teaspoons ground cumin, divided",
            "1 teaspoon dried crushed red pepper",
            "1 teaspoon dried oregano",
            "Coarse kosher salt",
            "1 1 1/4-pound top sirloin steak (about 1 inch thick)",
            "2 tablespoons olive oil, divided",
            "1 1-pint container cherry tomatoes",
            "2 garlic cloves, pressed",
            "2 15-ounce cans white beans, drained"
        ],
        "picture_link": "sttq3D0j4NeUsvJJVn4XPL0hfSc3B6y",
        "instructions": "Mix chili powder, 1/2 teaspoon cumin, crushed red pepper, and oregano in small bowl. Sprinkle spices, salt, and pepper all over steak. Heat 1 tablespoon oil in large skillet over medium-high heat. Cook steak to desired doneness, 5 minutes per side for medium-rare. Transfer to cutting board. Wipe out skillet; add 1 tablespoon oil. Add tomatoes; sauté 1 to 2 minutes. Stir in garlic and 1 teaspoon cumin. Add drained beans; stir until heated through, adding water by tablespoonfuls if dry, 3 minutes. Slice steak; serve with beans.\nMix chili powder, 1/2 teaspoon cumin, crushed red pepper, and oregano in small bowl. Sprinkle spices, salt, and pepper all over steak. Heat 1 tablespoon oil in large skillet over medium-high heat. Cook steak to desired doneness, 5 minutes per side for medium-rare. Transfer to cutting board. Wipe out skillet; add 1 tablespoon oil. Add tomatoes; sauté 1 to 2 minutes. Stir in garlic and 1 teaspoon cumin. Add drained beans; stir until heated through, adding water by tablespoonfuls if dry, 3 minutes.\nSlice steak; serve with beans.",
        "title": "Spice-Rubbed Steak with White Beans and Cherry Tomatoes "
    },
    "ikGrtM2xDEQUcZECIPotlyOFMB2oHOi": {
        "instructions": "Make the dough.\nWhisk the flour, sugar, yeast and salt in the bowl of a stand mixer. Add the egg but don't stir it in yet.\nHeat the milk and coconut oil in a saucepan until a thermometer reads 110 degrees F. (If the milk is too hot when you add it to the flour mixture, it will kill the yeast.)\nPour the milk mixture into the flour mixture. Avoid pouring it directly on the egg-you don't want the hot milk to cook it.\nUsing the dough hook, mix on medium speed until the dough comes together and starts to pull away from the sides of the bowl, 3 to 4 minutes. Scrape down the sides with a rubber spatula, if needed. The dough will look a little irregular in texture.\nKnead the dough.\nTurn out the dough onto a lightly floured surface and knead until smooth, soft and elastic, 3 to 4 minutes. Shape into a ball and place in a large bowl lightly oiled with coconut oil; rub the top of the dough with a little more coconut oil. Cover with plastic wrap and let rise in a warm place until doubled in size, 1 to 2 hours.\nForm the muffins.\nSprinkle 2 baking sheets with cornmeal and set aside. After the dough rises, punch it down and divide into 16 equal pieces. Roll each piece into a ball, then flatten into a 3-inch disk. Place the disks on the baking sheets.\nCook the muffins.\nHeat a 12-inch cast-iron skillet over medium heat. Coat the skillet with cooking spray and liberally sprinkle with cornmeal. Working in batches, cook the muffins until they are deep golden brown, 5 to 9 minutes per side. If they start to rise in a domed fashion, flatten them with a spatula. Let the English muffins cool completely, then split open, toast and serve with butter and jam.\nPhotograph by Penny De Los Santos",
        "ingredients": [
            "4 1/2 cups bread flour, plus more for kneading",
            "3 tablespoons sugar",
            "1 1/4-ounce packet instant yeast (2 1/4 teaspoons)",
            "2 teaspoons salt",
            "1 large egg",
            "1 3/4 cups whole milk",
            "2 1/2 tablespoons coconut oil, plus more for the bowl and dough",
            "Coarse cornmeal, for sprinkling",
            "Nonstick cooking spray",
            "Butter and jam, for serving (optional)"
        ],
        "title": "English Muffins",
        "picture_link": "q7MI2H.LRJZQxuHHtlVU2y.1CGFwgs2"
    },
    "ji.G2pcLOrWEp2SAIaNoBXTamGGAXiO": {
        "instructions": "Preheat the oven to 350 degrees F.\nIn the bowl of an electric mixer fitted with a paddle attachment, mix together the butter and 1 cup of sugar on low speed until they are just combined. Add the vanilla. In a medium bowl, sift together the flour and salt, then add them to the butter-and-sugar mixture. Mix on low speed until the dough starts to come together. Dump onto a surface dusted with flour and shape into a flat disk. Wrap in plastic and chill for 30 minutes.\nRoll the dough 1/2-inch thick and cut with a 4 1/2-inch hammer-shaped cutter. Place the hammer cookies on an ungreased baking sheet and sprinkle with sugar. Bake for 20 to 25 minutes, until the edges begin to brown. Allow to cool to room temperature.\nFor the icing, combine the confectioners' sugar and corn syrup in a bowl with a wire whisk until it is a thick paste. Gradually add enough lemon juice until the mixture is a good consistency for piping.\nWith an extra fine pastry tip, pipe individual names on the hammer cookies. Let the icing set before serving.",
        "ingredients": [
            "3/4 pound unsalted butter at room temperature",
            "1 cup sugar, plus extra, for sprinkling",
            "1 teaspoon pure vanilla extract",
            "3 1/2 cups all-purpose flour, plus more, for dusting",
            "1/4 teaspoon salt",
            "1 pound confectioners' sugar",
            "1/4 cup corn syrup",
            "1/4 cup freshly squeezed lemon juice"
        ],
        "title": "Shortbread Hammer Placecards",
        "picture_link": null
    },
    "Ti7H/6unNkELp0xocABIp6Z5AZr9hDu": {
        "instructions": "Place the flour, salt, and butter in a food processor and whiz or pulse briefly. Add half the beaten egg and continue to whiz. You might add a little more egg, but not too much as the mixture should be just moist enough to come together.\nIf making by hand, rub the butter into the flour until it resembles coarse bread crumbs. Then, using your hands, add just enough egg to bring the dough together. With your hands, flatten out the ball of dough, until it is about 3/4-inch thick, and then wrap in plastic wrap, or place in a plastic bag, and leave in the refrigerator for at least 30 minutes or, if you are pushed for time, in the freezer for 10 to 15 minutes.\nVariations:\nSweet shortcrust pastry: In place of the pinch of salt, use 1 tablespoon of icing sugar.\nSour cream shortcrust pastry: Replace the egg with 2 tablespoons of sour cream or creme fraiche, adding just enough to bring the dough together.",
        "ingredients": [
            "7 ounces all-purpose flour, sifted",
            "Pinch of salt",
            "7 tablespoons chilled butter, cubed",
            "1/2 to 1 medium egg, beaten"
        ],
        "title": "Shortcrust Pastry",
        "picture_link": null
    },
    "XRoH0scNq/lm9tKlqT43e3eaHj.o4Wy": {
        "instructions": "Bring a pot of water to a boil, 3 or 4 inches deep. Add lobster tails to the water and boil 7 to 8 minutes. Drain and shock under cold water to cool. Use kitchen scissors to cut away soft underside of tails. Remove meat and save the shells, arranging them in a shallow casserole dish. Chop the cooked meat on an angle into chunks.\nPreheat your broiler to high.\nHeat a medium skillet and a small saucepot over medium heat. To the small saucepot, melt 2 tablespoons butter. Add finely chopped onion and cook 3 to 5 minutes until very soft. To the skillet, add remaining 2 tablespoons butter. When the butter melts, add chopped lobster meat and saute.\nAdd flour to sauce pot with onions and cook together another 1 to 2 minutes. Whisk in wine or sherry, then milk. Remove sauce from heat and stir in cheddar cheese and paprika or crab boil. Season sauce with salt and pepper. Pour sauce over lobster meat and stir to combine. Pour lobster into and over the shells in a casserole dish and top with Parmesan and bread crumbs. Broil on high until golden, 2 or 3 minutes. Serve each tail, spilling over with lobster bits in sauce, on a bed of mixed baby greens and parsley with wedges of lemon along side.\nTo make this dish with jumbo shrimp, cut up peeled, deveined raw shrimp. Saute the shrimp in butter, as with cooked lobster. Cook until pink and firm and proceed with method. Place the shrimp and sauce into a small casserole, then spoon completed shrimp Thermidor over bed of greens and parsley leaves.",
        "ingredients": [
            "4 (6 to 8-ounce) packaged lobster tails, shell jumbo shrimp or prawns can be substituted",
            "4 tablespoons butter, divided",
            "1 small white onion, finely chopped",
            "2 tablespoons all-purpose flour",
            "Splash dry white wine or dry sherry",
            "1/2 cup milk, eyeball it",
            "1/3 cup grated white cheddar",
            "1/2 teaspoon paprika or crab boil seasoning, recommended: Old Bay",
            "2 tablespoons Parmesan",
            "2 tablespoons bread crumbs",
            "Handful parsley leaves mixed with 2 cups baby greens, for plate garnish",
            "Lemon wedges, for garnish"
        ],
        "title": "Lobster Tails Thermidor",
        "picture_link": "xMRBowe66fFGz4ykje98JJRqjnqAsyK"
    },
    "hXayIqzoiDZd2f5VPjh1t/l35dz4x4q": {
        "ingredients": [
            "1 cup graham cracker crumbs from about 8 (2 1/4-inch by 4 3/4-inch) crackers",
            "1 cup honey-nut cereal crumbs, such as crushed Honey Nut Cheerios",
            "1/4 cup packed light brown sugar",
            "7 tablespoons salted sweet cream butter, melted",
            "1/2 teaspoon ground cardamom",
            "6 large egg yolks",
            "1 (14-ounce) can sweetened condensed milk",
            "1 cup vanilla ice cream, softened",
            "1/2 cup fresh or bottled Key lime juice",
            "1 cup heavy cream",
            "3 tablespoons confectioners' sugar",
            "Special equipment: 9-inch pie plate, nonstick vegetable-oil spray, stand mixer fitted with the whisk attachment"
        ],
        "picture_link": null,
        "instructions": "Make the graham cracker and cereal crust: Arrange a rack in the middle of the oven and preheat to 350°F. Spray a 9-inch pie plate liberally with nonstick vegetable-oil spray. In a medium bowl, stir together the graham cracker crumbs, honey-nut cereal crumbs, and brown sugar. Drizzle with the melted butter and stir until well combined. Press the mixture evenly onto the bottom and up the sides of the prepared pie plate and refrigerate for 30 minutes.\nArrange a rack in the middle of the oven and preheat to 350°F.\nSpray a 9-inch pie plate liberally with nonstick vegetable-oil spray.\nIn a medium bowl, stir together the graham cracker crumbs, honey-nut cereal crumbs, and brown sugar. Drizzle with the melted butter and stir until well combined. Press the mixture evenly onto the bottom and up the sides of the prepared pie plate and refrigerate for 30 minutes.\nMake the filling: In the bowl of a stand mixer fitted with the whisk attachment, beat the egg yolks for 1 minute. Add the sweetened condensed milk and beat until pale and aerated, about 6 minutes. Add the ice cream and beat until smooth then add the lime juice and beat until combined. Pour the filling into the pie shell and bake until just set in the center, about 12 minutes. Transfer to a wire rack to cool completely then freeze until chilled through, at least 1 hour. DO AHEAD: The pie can be baked and kept in the freezer, well wrapped, up to 3 days.\nIn the bowl of a stand mixer fitted with the whisk attachment, beat the egg yolks for 1 minute. Add the sweetened condensed milk and beat until pale and aerated, about 6 minutes. Add the ice cream and beat until smooth then add the lime juice and beat until combined. Pour the filling into the pie shell and bake until just set in the center, about 12 minutes. Transfer to a wire rack to cool completely then freeze until chilled through, at least 1 hour. DO AHEAD: The pie can be baked and kept in the freezer, well wrapped, up to 3 days.\nGarnish and serve: Remove the pie from the freezer and thaw in the refrigerator for 20 minutes prior to serving. In a medium bowl, combine the heavy cream and sugar and whip until soft peaks form. Cut the pie into slices and top each with a dollop of whipped cream.\nRemove the pie from the freezer and thaw in the refrigerator for 20 minutes prior to serving.\nIn a medium bowl, combine the heavy cream and sugar and whip until soft peaks form. Cut the pie into slices and top each with a dollop of whipped cream.",
        "title": "The Ultimate Key Lime Pie "
    },
    "Y3zNiFFDNzcwPke8hWS9U8PjcUkKYD2": {
        "ingredients": [
            "3 duck breasts",
            "3 young zucchini",
            "salt",
            "1 3/4 oz dried cep mushrooms ('champagne cork' or bouchon) or porcini",
            "2 tablespoons coarsely ground black pepper",
            "1 tablespoon herbes de Provençe (usually marjoram, oregano, rosemary, thyme)"
        ],
        "picture_link": "LAZCqRbuVkd9rnLrtohDdA2k7r5vONy",
        "instructions": "For the mushroom powder, process the dried cep mushrooms until finely ground, combine them with the pepper and herbes de Provençe. Cut the duck breasts lengthways into 3 mm (⅛ inch) wide strips. Lay out the strips of duck two by two on top of each other, alternating layers of fat and lean. Cut the zucchini into strips using a vegetable peeler. Lay the strips of zucchini on top of the duck, season with the mushroom powder and season with salt. Roll up the strips tightly to make tournedos and tie with string. Make 6 tournedos in this way. Cook over gentle heat 5 minutes each side.\nFor the mushroom powder, process the dried cep mushrooms until finely ground, combine them with the pepper and herbes de Provençe.\nCut the duck breasts lengthways into 3 mm (⅛ inch) wide strips.\nLay out the strips of duck two by two on top of each other, alternating layers of fat and lean. Cut the zucchini into strips using a vegetable peeler. Lay the strips of zucchini on top of the duck, season with the mushroom powder and season with salt. Roll up the strips tightly to make tournedos and tie with string. Make 6 tournedos in this way. Cook over gentle heat 5 minutes each side.",
        "title": "Duck Breast & Zucchini Tournedos "
    },
    "o0hr06Ag.LmShWvxxIvFW/De2LXi1De": {
        "instructions": "Soak the corn husks in a bowl of hot water, using a plate to keep them submerged, until pliable, 1 hour.\nMeanwhile, make the dough: Mix the masa harina and 1 teaspoon salt in the bowl of a stand mixer. Add 10 tablespoons butter and 3/4 cup warm water and mix with the paddle attachment until combined. Add the granulated sugar, 1/4 cup brown sugar, the almond and vanilla extracts and ground cinnamon; mix until combined, about 1 more minute. Cover and refrigerate.\nMake the filling: Simmer 1/2 cup water and the cinnamon stick in a saucepan until slightly reduced, about 10 minutes. Melt the remaining 4 tablespoons butter in a skillet over medium-high heat. Add the remaining 2 tablespoons brown sugar and cook, stirring to dissolve, about 1 minute. Add the pineapple, honey and cinnamon water, including the cinnamon stick; cook, stirring, until the mixture is almost dry, about 5 minutes.\nRemove the pan from the heat. Add the rum, then return to medium heat. Tilt the pan so the rum ignites (or hold a lit match near the sauce to ignite it). Cook until the pineapple is slightly caramelized, about 3 minutes. Stir in the pecans; set aside to cool.\nDrain the husks and pat dry. Tear each husk lengthwise into a 3 1/2-inch-wide piece. Tear some of the excess husks into 18 thin strips for ties; reserve the husk scraps. Lay the 3 1/2-inch-wide husks on a clean surface. Starting 1/2 inch from the wide end, spread 1 tablespoon of the dough down a husk, leaving a 1/2-inch border on the sides. Spoon 1 tablespoon of the pineapple filling down the center of the dough. Roll lengthwise into a tight cylinder. Fold up the narrow end; tie with a strip of corn husk to secure. Repeat with the remaining husks, dough and filling.\nSet a steamer basket in a large pot filled with 1 to 2 inches of water. Set a small bowl upside down in the basket, then arrange the tamales standing up in the steamer, folded-side down, leaning against the bowl. Cover with husk scraps, then lay a damp kitchen towel on top. Bring the water to a boil over medium-high heat, cover and steam until the tamales pull away from the husks, about 40 minutes. Remove from the steamer and let cool slightly before unwrapping.\nPhotograph by Kat Teutsch",
        "ingredients": [
            "18 dried corn husks",
            "2 cups masa harina (instant corn flour)",
            "Kosher salt",
            "14 tablespoons unsalted butter, softened",
            "1/4 cup granulated sugar",
            "1/4 cup plus 2 tablespoons packed dark brown sugar",
            "1/2 teaspoon almond extract",
            "1/2 teaspoon vanilla extract",
            "1/2 teaspoon ground cinnamon",
            "1 cinnamon stick",
            "1 pineapple, peeled, cored and finely diced",
            "2 teaspoons honey",
            "1/4 cup coconut rum",
            "1/4 cup pecans, toasted and chopped"
        ],
        "title": "Pineapple, Pecan and Coconut-Rum Tamales",
        "picture_link": "2FTPnYfleE.hHZDIDdOd.8l.6m8OWI."
    },
    "J3zVAIQbMmNpFf3H3Moik/PholJhFfK": {
        "instructions": "Puree the persimmons in a mini food processor or blender until smooth; set aside.\nWhisk the flour, baking soda, cinnamon, cloves, nutmeg and salt in a medium bowl. Beat the butter and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 2 minutes. Beat in the egg and vanilla until combined, then beat in 3/4 cup of the persimmon puree until combined. (The mixture may look curdled.) Reduce the mixer speed to low; gradually add the flour mixture, beating until just incorporated. Fold in the raisins with a rubber spatula. Cover and refrigerate until firm, about 30 minutes.\nPosition racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Scoop heaping tablespoonfuls of dough about 2 inches apart on the prepared baking sheets. Bake, switching the pans halfway through, until the cookies are golden brown, about 13 minutes. Let cool completely on the baking sheets.\nMake the glaze: Whisk the confectioners' sugar and milk in a small bowl. Spoon about 1 teaspoon of the glaze over each cookie, then sprinkle with the pistachios. Let set, 10 minutes.\nPhotograph by Ryan Dausch",
        "ingredients": [
            "2 very ripe Fuyu persimmons, peeled, seeded and diced",
            "2 cups plus 2 tablespoons all-purpose flour",
            "1 teaspoon baking soda",
            "1 teaspoon ground cinnamon",
            "1/2 teaspoon ground cloves",
            "1/2 teaspoon ground nutmeg",
            "1/2 teaspoon salt",
            "1 1/2 sticks (12 tablespoons) unsalted butter, at room temperature",
            "1 cup granulated sugar",
            "1 large egg, at room temperature",
            "1 teaspoon pure vanilla extract",
            "2/3 cup golden raisins",
            "1 1/4 cups confectioners' sugar",
            "2 tablespoons milk",
            "2 tablespoons finely chopped pistachios"
        ],
        "title": "Persimmon Spice Cookies",
        "picture_link": "s4pyTT4IpDPNaPbYax8MU6WI2Ad1o.K"
    },
    "2uQPXCdnFPlGm9hNf8hkQQgI0.EX6ay": {
        "ingredients": [
            "1/2 tablespoon whole white peppercorns",
            "1/2 tablespoon whole coriander seeds",
            "2 tablespoons plus 3/4 teaspoon ground cinnamon",
            "2 tablespoons coarse sea salt (preferably gray crystals)",
            "1 tablespoon plus 2 1/4 teaspoons unsweetened cocoa powder",
            "1 teaspoon ground nutmeg",
            "1/2 teaspoon ground cloves",
            "6 tablespoons extra-virgin olive oil",
            "3 3/4 to 4 pounds onions, thinly sliced",
            "1 1/2 tablespoons chopped fresh sage",
            "1 1/2 cups water",
            "1 5-pound pork shoulder butt with bone"
        ],
        "picture_link": "3HgAfe6Xm/0a.//Aew07mDwAvo..M.a",
        "instructions": "For spice rub: Stir peppercorns and coriander in small skillet over medium heat until spices are darker in color,about 5 minutes. Transfer toasted spices to spice grinder; grind finely. Place in small bowl; mix in remaining ingredients. DO AHEAD: Can be made 1 week ahead. Cover and let stand at room temperature.\nStir peppercorns and coriander in small skillet over medium heat until spices are darker in color,about 5 minutes. Transfer toasted spices to spice grinder; grind finely. Place in small bowl; mix in remaining ingredients. DO AHEAD: Can be made 1 week ahead. Cover and let stand at room temperature.\nFor pork and onions: Heat oil in large pot over medium heat. Add onions and sage; sprinkle with salt and pepper. Sauté10 minutes. Add 1 1/2 cups water; cover and cook until onions are soft, about 15 minutes. Uncover; continue to cook until onions are beginning to brown and water has evaporated, about 30 minutes. Meanwhile, preheat oven to 300°F. Sprinkle spice rub on large sheet of foil. Roll pork in rub, pressing to coat (some of rub will be leftover). Set pork on rack in large roasting pan. Top pork with 1/3 of onions; scatter remaining onions around pork in pan. Roast pork and onions until onions are deep brown, stirring occasionally, about 3 hours. Transfer onions from pan to medium bowl. Continue to roast pork until very tender and thermometer inserted into center registers 165°F, about 2 1/2 hours longer. Transfer pork to platter. Rewarm onions in microwave at 10 second intervals and season with salt and pepper; spoon around pork.\nHeat oil in large pot over medium heat. Add onions and sage; sprinkle with salt and pepper. Sauté10 minutes. Add 1 1/2 cups water; cover and cook until onions are soft, about 15 minutes. Uncover; continue to cook until onions are beginning to brown and water has evaporated, about 30 minutes.\nMeanwhile, preheat oven to 300°F. Sprinkle spice rub on large sheet of foil. Roll pork in rub, pressing to coat (some of rub will be leftover). Set pork on rack in large roasting pan. Top pork with 1/3 of onions; scatter remaining onions around pork in pan.\nRoast pork and onions until onions are deep brown, stirring occasionally, about 3 hours. Transfer onions from pan to medium bowl. Continue to roast pork until very tender and thermometer inserted into center registers 165°F, about 2 1/2 hours longer. Transfer pork to platter. Rewarm onions in microwave at 10 second intervals and season with salt and pepper; spoon around pork.\nWHAT TO DRINK: Seghesio 2005 Sangiovese (Sonoma, $25). Its hints of spice and dark fruit flavors are a slam-dunk with pork.\nSeghesio 2005 Sangiovese (Sonoma, $25). Its hints of spice and dark fruit flavors are a slam-dunk with pork.",
        "title": "Cocoa and Spice Slow-Roasted Pork with Onions "
    },
    "O4SuxbJizMr.Ap.VsHOec94D4Ios5ga": {
        "ingredients": [
            "1 pound Yukon gold potatoes, peeled, washed, and quartered",
            "2 leeks, trimmed, cleaned, and cut into 1-inch pieces",
            "2 tablespoons unsalted butter",
            "1/2 cup whole milk"
        ],
        "picture_link": null,
        "instructions": "1. In a large pot with water just to cover, boil the potatoes and leeks forabout 30 minutes, until the potatoes are tender and easily pierced with the tip of a knife. Drain, reserving the water, and remove the potatoes. Pass them through a ricer. Set aside. 2. Transfer the leeks to a food processor fitted with a steel blade and purée. 3. Melt the butter in a heavy saucepan over medium heat. Add the riced potatoes. Gradually stir in the milk, beating with a wooden spoon until creamy. Stir in the puréed leeks. Stir in some of the reserved potato water for a more liquid consistency. 4. Serve immediately. Freeze leftover purée that won't be eaten the next day.\n1. In a large pot with water just to cover, boil the potatoes and leeks forabout 30 minutes, until the potatoes are tender and easily pierced with the tip of a knife. Drain, reserving the water, and remove the potatoes. Pass them through a ricer. Set aside.\n2. Transfer the leeks to a food processor fitted with a steel blade and purée.\n3. Melt the butter in a heavy saucepan over medium heat. Add the riced potatoes. Gradually stir in the milk, beating with a wooden spoon until creamy. Stir in the puréed leeks. Stir in some of the reserved potato water for a more liquid consistency.\n4. Serve immediately. Freeze leftover purée that won't be eaten the next day.",
        "title": "Potato and Leek Purée "
    },
    "V5C0HXKyzZwlTyFvuytMtHvrlTkj5MK": {
        "ingredients": [
            "1 cup finely chopped onion",
            "1/2 cup crumbled feta cheese",
            "1/2 cup grated Edam cheese",
            "1/4 cup crumbled Roquefort cheese",
            "2 tablespoons chopped fresh dill",
            "2 tablespoons fresh breadcrumbs",
            "1 large egg yolk",
            "3 tablespoons olive oil",
            "2 10-ounce packages ready-to-use spinach, coarsely chopped"
        ],
        "picture_link": null,
        "instructions": "Preheat oven to 350°F. Lightly butter 11 x 7 x 2-inch baking dish. Mix first 7 ingredients in large bowl. Heat oil in large pot over medium-high heat. Add spinach; sauté until wilted and juices evaporate, about 3 minutes. Transfer spinach to strainer; drain well. Arrange spinach over bottom of prepared dish. Sprinkle with cheese mixture. Bake until heated through, about 20 minutes. Preheat broiler. Broil spinach and cheese until cheese is golden on top, watching closely, about 2 minutes.\nPreheat oven to 350°F. Lightly butter 11 x 7 x 2-inch baking dish. Mix first 7 ingredients in large bowl.\nHeat oil in large pot over medium-high heat. Add spinach; sauté until wilted and juices evaporate, about 3 minutes. Transfer spinach to strainer; drain well. Arrange spinach over bottom of prepared dish. Sprinkle with cheese mixture. Bake until heated through, about 20 minutes.\nPreheat broiler. Broil spinach and cheese until cheese is golden on top, watching closely, about 2 minutes.",
        "title": "Baked Spinach with Three Cheeses "
    },
    "Tka.D27fAdMoG.EnVenzdVo9JnOPhte": {
        "instructions": "Special equipment: A small star cookie cutter\nAdjust 2 racks to the top and bottom thirds of the oven and preheat to 425 degrees F. Put a baking sheet or pizza stone on the bottom rack.\nCombine the sugar with 4 cups of the blueberries in a medium saucepan. Bring to a simmer over medium heat, crushing up the berries with a wooden spoon to release their juices, and cook, stirring occasionally, until thick and reduced by half, 15 to 20 minutes. Remove from the heat and stir in the flour and the remaining 2 cups blueberries. Transfer to a bowl and cool completely, about 45 minutes.\nMeanwhile, fit one of the pie crusts into a 9-inch pie plate and fold and crimp the edges as desired. Refrigerate while you wait for the filling to cool.\nLine a baking sheet with parchment. Cut out as many stars as you can from the second pie crust. Arrange on the baking sheet. Bake on the upper rack until golden, about 10 minutes. Set aside to cool.\nStir the cooled filling once and pour into the dough-lined pie plate; spread it out into an even layer. Place the pie on the preheated baking sheet, turn the oven down to 375 degrees F and bake until the crust in golden and the edge of the filling is bubbly, 55 to 60 minutes. Remove to a rack to cool. Press the stars into the filling, standing them up slightly. Let cool at least 2 hours before serving.",
        "ingredients": [
            "2 refrigerated rolled pie crusts (homemade or store-bought)",
            "3/4 cup sugar",
            "6 cups blueberries",
            "3 tablespoons all-purpose flour"
        ],
        "title": "4-Ingredient Blueberry Pie",
        "picture_link": "qAGalhosxPIq/645mGvIzEqOB5ehKKe"
    },
    "PTplxKMy5c1b6l94nOILpNU10XKRYUq": {
        "instructions": "Preheat oven to 400 degrees F. Peel the shallots, keeping the root ends intact. Place them in a bowl, and mix well with 1/4 teaspoon of nutmeg and 2 teaspoons of olive oil. Make a bed of coarse salt in a roasting pan, and spread the shallots out in a single layer over the salt. Roast in the oven for about 20 minutes, basting with additional olive oil to prevent the outer layer of the shallots from toughening. The shallots are done when they're browned outside and just soft inside. Keep warm.\nRinse the sorrel and the greens. Dry well, and keep cool. Prepare the vinaigrette: Place the mustard in a bowl. Whisk in the vinegar. Add 1/2 cup of the olive oil slowly, in a thin stream. Add 1/2 teaspoon nutmeg, and season with salt and pepper to taste.\nLay out the monkfish fillets. Cut 1/4-inch notches all around the perimeter of each fillet. (This prevents the fillets from curling up in the pan.) Dredge the fillets well in flour, seasoned with salt and pepper. Place the remaining 1/4 cup of olive oil in a saute pan over medium-high heat. When the oil is very hot, saute the monkfish quickly, about 1 minute per side, until golden brown and just cooked. Remove from pan, and brush each fillet very lightly with a bit of the vinaigrette.\nAssemble the salad: Place the dried greens in a large bowl. Cut the warm shallots in half, lengthwise, and toss with the salad. Add the vinaigrette, and mix well. Divide the salad among four plates, and nestle two monkfish fillets into the salad on each plate. Grate about 1/8 teaspoon of nutmeg over each salad.\nSuggested wines: '93 Chablis; Sancerre Rouge; and/or an Alsatian Pinot Noir",
        "ingredients": [
            "20 medium-sized shallots",
            "1 1/4 teaspoons freshly grated nutmeg",
            "2 teaspoons plus 1/4 cup olive oil",
            "6 tablespoons coarse salt",
            "2 cups sorrel leaves, thick ribs removed",
            "6 cups assorted greens, such as mache, Italian chicory, Bibb lettuce",
            "1 tablespoon Dijon mustard",
            "8 teaspoons white wine vinegar",
            "Salt and freshly ground black pepper, to taste",
            "10 ounces monkfish, cut into 8 thin fillets",
            "Flour for dredging"
        ],
        "title": "Nutmeg-Scented Sorrel Salad with Roasted Shallots and Monkfish",
        "picture_link": null
    },
    "vDfXwen0kbrrjQ.8xvUquLBBMMrnEBm": {
        "ingredients": [
            "2 1/2 sticks (1 1/4 cups) cold unsalted butter",
            "3 1/4 cups all-purpose flour",
            "1 teaspoon salt",
            "1 1/4 cups well-chilled sour cream",
            "4 to 6 tablespoons ice water"
        ],
        "picture_link": null,
        "instructions": "Cut butter into 1/2-inch cubes.\nCut butter into 1/2-inch cubes.\nTo blend by hand: In a bowl with your fingertips or a pastry blender blend together flour, butter, and salt until most of mixture resembles coarse meal with remainder in small (roughly pea-size) lumps. Stir in sour cream with a fork just until incorporated. Drizzle 4 tablespoons ice water over mixture and gently stir just until incorporated. Test mixture by gently squeezing a small handful: When it has proper texture it should hold together without crumbling apart. If necessary, add enough remaining water, 1 tablespoon at a time, stirring until incorporated and testing, to give mixture proper texture. (If you overwork mixture or add too much water, pastry will be tough.)\nIn a bowl with your fingertips or a pastry blender blend together flour, butter, and salt until most of mixture resembles coarse meal with remainder in small (roughly pea-size) lumps. Stir in sour cream with a fork just until incorporated. Drizzle 4 tablespoons ice water over mixture and gently stir just until incorporated. Test mixture by gently squeezing a small handful: When it has proper texture it should hold together without crumbling apart. If necessary, add enough remaining water, 1 tablespoon at a time, stirring until incorporated and testing, to give mixture proper texture. (If you overwork mixture or add too much water, pastry will be tough.)\nTo blend in a food processor: In a food processor pulse together flour, butter, and salt until most of mixture resembles coarse meal with remainder in small (roughly pea-size) lumps. Add sour cream and pulse just until incorporated. Drizzle 4 tablespoons water over mixture and pulse just until incorporated. Test mixture by gently squeezing a small handful: When it has proper texture it should hold together without crumbling apart. If necessary, add enough remaining water, 1 tablespoon at a time, pulsing until incorporated and testing, to give mixture proper texture. (If you overwork mixture or add too much water, pastry will be tough.)\nIn a food processor pulse together flour, butter, and salt until most of mixture resembles coarse meal with remainder in small (roughly pea-size) lumps. Add sour cream and pulse just until incorporated. Drizzle 4 tablespoons water over mixture and pulse just until incorporated. Test mixture by gently squeezing a small handful: When it has proper texture it should hold together without crumbling apart. If necessary, add enough remaining water, 1 tablespoon at a time, pulsing until incorporated and testing, to give mixture proper texture. (If you overwork mixture or add too much water, pastry will be tough.)\nTo form dough after blending by either method: Turn mixture out onto a work surface and divide into 4 portions. With heel of hand smear each portion once in a forward motion to help distribute fat. Gather dough together and form it, rotating it on work surface, into a disk. Chill dough, wrapped in plastic wrap, until firm, at least 1 hour, and up to 1 day.\nTurn mixture out onto a work surface and divide into 4 portions. With heel of hand smear each portion once in a forward motion to help distribute fat. Gather dough together and form it, rotating it on work surface, into a disk. Chill dough, wrapped in plastic wrap, until firm, at least 1 hour, and up to 1 day.",
        "title": "Sour Cream Pastry Dough "
    },
    "X/lTtcZtIsWJjh1zx4oIEK4OPjv699a": {
        "ingredients": [
            "3 pints firm small mixed cherry and grape tomatoes",
            "1/2 cup vodka",
            "3 tablespoons white-wine vinegar",
            "1 tablespoon superfine granulated sugar",
            "1 teaspoon grated lemon zest",
            "3 tablespoons kosher salt",
            "1 1/2 tablespoons coarsely ground black pepper"
        ],
        "picture_link": null,
        "instructions": "Cut a small X in bottom of each tomato. Blanch tomatoes, 5 at a time, in a saucepan of boiling water 3 seconds. Immediately transfer with a slotted spoon to an ice bath to stop cooking. Drain and peel, transferring to a large shallow dish. Stir together vodka, vinegar, sugar, and zest until sugar has dissolved, then pour over tomatoes, gently tossing to coat. Marinate, chilled, at least 30 minutes and up to 1 hour. Stir together salt and pepper and serve with tomatoes for dipping.\nCut a small X in bottom of each tomato. Blanch tomatoes, 5 at a time, in a saucepan of boiling water 3 seconds. Immediately transfer with a slotted spoon to an ice bath to stop cooking.\nDrain and peel, transferring to a large shallow dish.\nStir together vodka, vinegar, sugar, and zest until sugar has dissolved, then pour over tomatoes, gently tossing to coat. Marinate, chilled, at least 30 minutes and up to 1 hour.\nStir together salt and pepper and serve with tomatoes for dipping.",
        "title": "Vodka-Spiked Cherry Tomatoes with Pepper Salt "
    },
    "R66fCRHVKMoVPl/63ZUSB/JfiCM7kzO": {
        "ingredients": [
            "2 pounds thin asparagus",
            "2 large yellow bell peppers",
            "3 shallots",
            "1 medium zucchini",
            "3 scallions",
            "1 tablespoon unsalted butter",
            "10 large eggs",
            "1/2 cup heavy cream",
            "3 tablespoons chopped fresh flat-leafed parsley leaves",
            "1 1/2 teaspoons salt",
            "1/4 teaspoon freshly ground black pepper"
        ],
        "picture_link": "CpTcWioPq6/jMDf2CIjlDFST7E4vpuy",
        "instructions": "Preheat oven to 350°F. and butter a 13 x 9 x 2-inch glass baking dish (3-quart). Trim asparagus and diagonally cut into 1/4-inch-wide slices. Cut bell peppers into 1/4-inch-wide strips and mince shallots. Halve zucchini lengthwise and diagonally cut both zucchini and scallions into thin slices. Have ready a bowl of ice and cold water. In a large saucepan of boiling salted water blanch asparagus 1 minute and drain in a colander. Immediately transfer asparagus to ice water to stop cooking. Drain asparagus well in colander and pat dry. In a large skillet cook bell peppers and shallots in butter over moderately low heat, stirring occasionally, until peppers are softened, about 10 minutes. In a large bowl whisk together eggs, cream, parsley, salt, and pepper. Stir in asparagus, bell pepper mixture, zucchini, and scallions. Pour custard into baking dish and bake in middle of oven until golden and set, about 35 minutes. Cool frittata on a rack. Frittata may be made 1 day ahead and chilled, covered. Bring frittata to room temperature before serving. If desired, loosen frittata from edges of pan and slide onto a platter.\nPreheat oven to 350°F. and butter a 13 x 9 x 2-inch glass baking dish (3-quart).\nTrim asparagus and diagonally cut into 1/4-inch-wide slices. Cut bell peppers into 1/4-inch-wide strips and mince shallots. Halve zucchini lengthwise and diagonally cut both zucchini and scallions into thin slices.\nHave ready a bowl of ice and cold water. In a large saucepan of boiling salted water blanch asparagus 1 minute and drain in a colander. Immediately transfer asparagus to ice water to stop cooking. Drain asparagus well in colander and pat dry.\nIn a large skillet cook bell peppers and shallots in butter over moderately low heat, stirring occasionally, until peppers are softened, about 10 minutes. In a large bowl whisk together eggs, cream, parsley, salt, and pepper. Stir in asparagus, bell pepper mixture, zucchini, and scallions. Pour custard into baking dish and bake in middle of oven until golden and set, about 35 minutes. Cool frittata on a rack. Frittata may be made 1 day ahead and chilled, covered. Bring frittata to room temperature before serving. If desired, loosen frittata from edges of pan and slide onto a platter.",
        "title": "Baked Asparagus and Yellow Pepper Frittata "
    },
    "jBu0sZeipZW..KvLVh8skS4AYPDi2Sy": {
        "instructions": "Cook beets in water to cover until tender, about 40 to 45 minutes. Drain the beets and set aside to cool.\nFor the dressing, whisk together olive oil, shallot, half the lemon juice, the thyme, salt and pepper. Set aside.\nWhile the beets are cooling, wash the watercress and trim the thicker stems from the leaves. Spread the trimmed watercress out over some paper towels to dry.\nWhen the beets are cool enough to handle, use a paring knife to peel off the beets skins, they should come off very easily.\nCut the beets into quarters lengthwise and then those pieces in half crosswise.\nPlace the beets and watercress in separate bowls. Divide the dressing between the 2 bowls. Toss the watercress and beets until evenly coated with the dressing.\nSpread the watercress out on a serving platter to make a bed for the beets. Crumble the cold cheese into the beets and toss gently. Spread the beets over the bed of watercress and sprinkle with remaining lemon juice. Serve immediately.",
        "ingredients": [
            "8 medium or 12 small beets",
            "1/3 cup olive oil",
            "1 large shallot, finely chopped",
            "Juice of 1 lemon",
            "Leaves from about 10 sprigs thyme",
            "3 good pinches salt",
            "10 grinds fresh black pepper",
            "1 large bunch watercress",
            "4 tablespoons cold goat cheese"
        ],
        "title": "Beet Salad with Goat Cheese, Watercress and Shallot Thyme Dressing",
        "picture_link": null
    },
    "/LFSTwt8AlN0mXwfO7CcXFo5v8u3KtG": {
        "instructions": "Whisk the water, lime juice, sugar, and fish sauce in a small bowl until the sugar dissolves. Stir in the sambal oelek and garlic.\nCut the chicken thighs into 2-inch cubes. Toss cubes in a medium bowl with about 1/4 cup of the sauce and 1 teaspoon vegetable oil. Set aside for 15 minutes. Stir a heaping tablespoon of grated carrot into reserved sauce. Set aside.\nHeat a grill pan or outdoor grill to medium-high heat. Thread 2 to 3 pieces of chicken on each skewer and lay skewers on a baking sheet or large plate. Season with salt and pepper. Working in batches, grill the satays, without moving them, until browned on the first side, about 3 minutes. Turn the satays and grill until the second side is browned and the meat is opaque at the edges, about 3 minutes more. Transfer to a large clean platter.\nArrange the lettuce, mint, cilantro, cucumber, scallions, and the rest of the carrot on the platter with the satays. To serve, slip the chicken from a skewer and wrap each piece in a lettuce leaf with some of the herbs and vegetables and dip in the sauce",
        "ingredients": [
            "1/3 cup water",
            "1/3 cup freshly squeezed lime juice (about 2 to 3 limes)",
            "3 tablespoons sugar",
            "2 tablespoons fish sauce",
            "1 teaspoon sambal oelek or other hot chile paste",
            "1 clove garlic, minced",
            "4 boneless skinless chicken thighs (about 1 pound)",
            "1 teaspoon vegetable oil",
            "Kosher salt and freshly ground black pepper",
            "1 small whole carrot, finely grated",
            "1 head Boston or Bibb lettuce leaves",
            "1 bunch fresh mint leaves",
            "1 bunch fresh cilantro",
            "1 Kirby cucumber, cut in matchsticks",
            "4 scallions (white and green parts), sliced in 1-inch pieces",
            "8 skewers (if wood, soak in water for 15 minutes)"
        ],
        "title": "Spicy Chicken Satays with Herbs and Vegetables",
        "picture_link": null
    },
    "WKMHKxKA6GEyymTNT7TI/4JsSF2YBxK": {
        "ingredients": [
            "1 1/2 cups finely grated fresh Parmesan (about 1/4 pound)",
            "3/4 cup all-purpose flour",
            "1 teaspoon freshly grated lemon zest",
            "3/4 teaspoon coarsely ground black pepper plus additional for sprinkling the crackers",
            "1/2 stick (1/4 cup) cold unsalted butter, cut into bits",
            "1 tablespoon plus 2 teaspoons water",
            "1 teaspoon fresh lemon juice"
        ],
        "picture_link": null,
        "instructions": "In a bowl stir together the Parmesan, the flour, the zest, and 3/4 teaspoon of the pepper and with a pastry blender blend in the butter until the mixture resembles coarse meal. Make a well in the center, add the water and the lemon juice, and combine the mixture with fork until it just forms a dough. On a work surface knead the dough until it is just combined, transfer it to a sheet of wax paper, and using the wax paper as a guide form it into an 11- by 1 1/2-inch squared-off log. Chill the dough, wrapped in the wax paper, for 1 hour, or until it is firm enough to slice. (The dough may be made 2 days in advance and kept wrapped well and chilled.) Preheat the oven to 375°F. Cut the dough into 1/4-inch-thick slices, arrange the slices 1 inch apart on baking sheets, and bake them in batches in the middle of the oven for 10 minutes, or until they are golden around the edges. Transfer the crackers carefully with a spatula to a rack, let them cool, and sprinkle them with the additional pepper.\nIn a bowl stir together the Parmesan, the flour, the zest, and 3/4 teaspoon of the pepper and with a pastry blender blend in the butter until the mixture resembles coarse meal. Make a well in the center, add the water and the lemon juice, and combine the mixture with fork until it just forms a dough. On a work surface knead the dough until it is just combined, transfer it to a sheet of wax paper, and using the wax paper as a guide form it into an 11- by 1 1/2-inch squared-off log. Chill the dough, wrapped in the wax paper, for 1 hour, or until it is firm enough to slice. (The dough may be made 2 days in advance and kept wrapped well and chilled.)\nPreheat the oven to 375°F. Cut the dough into 1/4-inch-thick slices, arrange the slices 1 inch apart on baking sheets, and bake them in batches in the middle of the oven for 10 minutes, or until they are golden around the edges. Transfer the crackers carefully with a spatula to a rack, let them cool, and sprinkle them with the additional pepper.",
        "title": "Lemon-Pepper Parmesan Crackers "
    },
    "XRxBUvpIEssgvUmAP3apO4Snb1ewasq": {
        "instructions": "1. Heat oil in a large skillet over medium heat. Add sausage, and cook, turning occasionally until browned, about 10 minutes. Remove sausage to a plate and reserve pan and sausage drippings.\n2. Meanwhile, bring a large pot of cold water to a boil over high heat. Add a large pinch of salt and broccoli rabe and cook, uncovered, until broccoli rabe is bright green and tender but still slightly crisp, about 5 minutes. Immediately transfer broccoli rabe using tongs to a colander (reserve boiling water) and rinse under cold running water. Chop into bite-sized pieces and set aside.\n3. Add pasta to reserved boiling water and cook, stirring occasionally, until al dente (tender but not mushy), about 12 minutes. Meanwhile, heat reserved pan and drippings over medium heat. Add garlic and cook, stirring frequently, until it is golden brown, about 5 minutes. Add broccoli rabe, pepper flakes, and 1 1/2 teaspoons of salt; increase heat to medium-high, and cook, continually stirring, until broccoli rabe is hot and tender, about 5 minutes. Slice sausage into 1/4-inch thick coins and add to pan and mix well cook until sausage is warmed through, about 5 more minutes.\n4. Drain pasta in a colander in sink, reserving 1/4 cup of cooking liquid. Toss pasta and liquid with broccoli rabe mixture. Transfer pasta to a serving dish or individual bowls, garnish with Parmesean and serve.",
        "ingredients": [
            "1/2 teaspoon crushed red pepper flakes, or to taste",
            "Shaved Parmesan, for garnish",
            "3 tablespoons extra-virgin olive oil",
            "1 pound sweet Italian sausage",
            "Kosher salt to taste, plus 1 1/2 teaspoons",
            "2 pounds broccoli rabe, stems trimmed",
            "1 pound orecchiette pasta",
            "4 cloves garlic, sliced"
        ],
        "title": "Orecchiette with Broccoli Rabe and Sausage",
        "picture_link": null
    },
    "Bh69d7wY9nIFOzj3jRtibuFD3OxSK0m": {
        "ingredients": [
            "1 tablespoon olive oil",
            "5 cipollini onions, peeled and cut into quarters",
            "1/2 medium shallot, minced",
            "Salt",
            "5 tablespoons heavy cream",
            "3 tablespoons walnut oil",
            "2 ounces fresh chanterelle mushrooms, cleaned and trimmed",
            "2 ounces fresh black trumpet mushrooms, cleaned and trimmed",
            "2 ounces fresh royal trumpet mushrooms, cleaned, trimmed, and cut into quarters",
            "4 sprigs fresh sage",
            "Salt",
            "8 medium red beets, trimmed and scrubbed",
            "8 medium golden beets, trimmed and scrubbed",
            "1/4 cup olive oil",
            "Zest and juice of 1 Meyer lemon",
            "2 tablespoons minced fresh chives",
            "Salt",
            "1/4 cup pumpkin seeds",
            "2 tablespoons walnut oil",
            "Salt",
            "20 English peas, shelled",
            "Salt",
            "1/4 cup goat cheese"
        ],
        "picture_link": "j5wiyy/6iYNiTk0bvrJKLsm2fuJwjYC",
        "instructions": "Make the onion purée: In a medium sauté pan over moderate heat, warm the oil. Add the onions and shallot and sauté, stirring occasionally, until soft. Season with salt, add the heavy cream, and continue to cook, stirring occasionally, about 5 minutes. Transfer the onion mixture to a food processor or blender and process until smooth.\nIn a medium sauté pan over moderate heat, warm the oil. Add the onions and shallot and sauté, stirring occasionally, until soft. Season with salt, add the heavy cream, and continue to cook, stirring occasionally, about 5 minutes. Transfer the onion mixture to a food processor or blender and process until smooth.\nMake the mushrooms: In a medium sauté pan over high heat, warm the walnut oil. Add the mushrooms, in batches if necessary, and sauté, stirring occasionally, until the liquid released by the mushrooms is evaporated, about 5 minutes. Add the sage, season with salt, and continue to cook, stirring occasionally, until the mushrooms are golden and tender.\nIn a medium sauté pan over high heat, warm the walnut oil. Add the mushrooms, in batches if necessary, and sauté, stirring occasionally, until the liquid released by the mushrooms is evaporated, about 5 minutes. Add the sage, season with salt, and continue to cook, stirring occasionally, until the mushrooms are golden and tender.\nRoast the beets: Preheat the oven to 425°F. Arrange the beets in a large, deep baking dish and drizzle with the oil. Add enough water to reach about 1/4 inch up the sides of the baking dish. Cover with foil and roast until the beets are tender, about 45 minutes. Once the beets are cool enough to handle, peel them and cut them into quarters. Transfer the beets to a medium bowl, add lemon zest, lemon juice, and chives, season with salt, and toss to combine.\nPreheat the oven to 425°F.\nArrange the beets in a large, deep baking dish and drizzle with the oil. Add enough water to reach about 1/4 inch up the sides of the baking dish. Cover with foil and roast until the beets are tender, about 45 minutes. Once the beets are cool enough to handle, peel them and cut them into quarters. Transfer the beets to a medium bowl, add lemon zest, lemon juice, and chives, season with salt, and toss to combine.\nToast the pumpkin seeds: Preheat the oven to 375°F. Arrange the pumpkin seeds on a large, rimmed baking sheet, drizzle with walnut oil, and toss to combine. Roast until toasted, about 10 minutes, then toss with salt.\nPreheat the oven to 375°F.\nArrange the pumpkin seeds on a large, rimmed baking sheet, drizzle with walnut oil, and toss to combine. Roast until toasted, about 10 minutes, then toss with salt.\nCook the peas: Fill a large bowl with ice water. In a large pot of boiling salted water, blanch the peas until just tender. Drain, then immediately plunge the peas into the ice water to stop cooking. Drain the peas again and pat them dry.\nFill a large bowl with ice water.\nIn a large pot of boiling salted water, blanch the peas until just tender. Drain, then immediately plunge the peas into the ice water to stop cooking. Drain the peas again and pat them dry.\nTo serve: In a large bowl combine the mushrooms, beets, peas, goat cheese, and onion purée and toss to combine. Divide the salad among 4 plates, sprinkle with toasted pumpkin seeds, and serve.\nIn a large bowl combine the mushrooms, beets, peas, goat cheese, and onion purée and toss to combine. Divide the salad among 4 plates, sprinkle with toasted pumpkin seeds, and serve.",
        "title": "Wild Mushroom, Roasted Beet, and Goat Cheese Salad with Onion Purée "
    },
    "yhYRCK5wPuvMyC4rHGV9aLsSQRh6xyy": {
        "ingredients": [
            "2 heads cauliflower",
            "3 garlic cloves",
            "2 shallots",
            "2 tablespoons olive oil",
            "3 cups chicken broth",
            "1 cup water",
            "1 teaspoon finely chopped fresh thyme leaves",
            "1 bay leaf",
            "2 cups heavy cream"
        ],
        "picture_link": null,
        "instructions": "Preheat oven to 425°F. Cut cauliflower into 1-inch flowerets (about 10 cups). In a large baking pan toss cauliflower, garlic, and shallots with oil to coat and roast in middle of oven about 30 minutes, or until golden. In a 4-quart kettle simmer broth, water, roasted cauliflower mixture, and herbs 30 minutes, or until cauliflower is very tender. Discard bay leaf and in a blender puree soup in batches until smooth (use caution when blending hot liquids), transferring to a bowl. Return soup to kettle and stir in cream and salt and pepper to taste. Heat soup over moderate heat until just heated through.\nPreheat oven to 425°F.\nCut cauliflower into 1-inch flowerets (about 10 cups). In a large baking pan toss cauliflower, garlic, and shallots with oil to coat and roast in middle of oven about 30 minutes, or until golden.\nIn a 4-quart kettle simmer broth, water, roasted cauliflower mixture, and herbs 30 minutes, or until cauliflower is very tender. Discard bay leaf and in a blender puree soup in batches until smooth (use caution when blending hot liquids), transferring to a bowl. Return soup to kettle and stir in cream and salt and pepper to taste. Heat soup over moderate heat until just heated through.",
        "title": "Roasted Cauliflower Soup "
    },
    "xZEXjZbbpmaoPXRkhnP3YZ2LvVSzR1O": {
        "ingredients": [
            "1 or 2 gingersnap cookies, crumbled (about 1/3 cup of crumbs)",
            "1 teaspoon honey",
            "1 (2-inch) piece fresh ginger, peeled",
            "1/2 cup heavy cream",
            "2 tablespoons sugar",
            "3 tablespoons freshly squeezed lemon juice",
            "A handful of blackberries, blueberries, or raspberries"
        ],
        "picture_link": "mlTNI6xOJG5ZyA0AV9vmtLxiqTLFwFC",
        "instructions": "Sprinkle the crumbled cookie into the bottom of a large ramekin, small glass jar, or small shallow bowl. Drizzle the crumbs with honey, then use a fork to combine the two and then to lightly pack down the mixture. Transfer to the freezer while you make the custard. Grate the ginger, then press the grated ginger through a fine-mesh strainer into a small bowl. You should have about a teaspoon of ginger juice. Pour the cream into a small saucepan set over medium heat, stir in the sugar, and bring the mixture to a boil. Let it boil for about 5 minutes, then remove from the heat and stir in the ginger juice and lemon juice. Let the mixture cool in the saucepan for about 20 minutes. Pour the warm cream mixture into the ramekin over the crumbs, and refrigerate until the cream has set, at least 30 minutes but possibly longer, depending on the depth of the container and the fat content of the cream. (Or you can make it the day before; cover it with a piece of plastic wrap pressed tightly on the surface of the cream.) The custard will be softly set, like a pudding, not firm like a flan. Top with the berries and eat.\nSprinkle the crumbled cookie into the bottom of a large ramekin, small glass jar, or small shallow bowl. Drizzle the crumbs with honey, then use a fork to combine the two and then to lightly pack down the mixture. Transfer to the freezer while you make the custard.\nGrate the ginger, then press the grated ginger through a fine-mesh strainer into a small bowl. You should have about a teaspoon of ginger juice.\nPour the cream into a small saucepan set over medium heat, stir in the sugar, and bring the mixture to a boil. Let it boil for about 5 minutes, then remove from the heat and stir in the ginger juice and lemon juice. Let the mixture cool in the saucepan for about 20 minutes.\nPour the warm cream mixture into the ramekin over the crumbs, and refrigerate until the cream has set, at least 30 minutes but possibly longer, depending on the depth of the container and the fat content of the cream. (Or you can make it the day before; cover it with a piece of plastic wrap pressed tightly on the surface of the cream.) The custard will be softly set, like a pudding, not firm like a flan.\nTop with the berries and eat.",
        "title": "Faux Tart with Instant Lemon Ginger Custard "
    },
    "E6NcbjRqMzU.cjYtPUkpMiGzDIca3wC": {
        "instructions": "Beat the cream cheese, butter, granulated sugar, grated ginger and salt in a large bowl with a mixer until light and fluffy. Add the flour and mix until combined. Turn the dough out onto a sheet of plastic wrap and pat into a 1-inch-thick rectangle. Wrap in the plastic wrap and refrigerate until firm, about 1 hour.\nLine 2 baking sheets with parchment paper. On a lightly floured surface, roll out the dough into a 1/8-inch-thick rectangle, then fold into thirds like a letter. Roll out again to about 1/3 inch thick. Cut into stars using 1 1/2-to-2-inch cookie cutters and place 1 inch apart on the prepared baking sheets. Reroll the scraps and repeat. (Refrigerate the dough if it gets too soft.)\nBeat the egg and 1 tablespoon water in a small bowl. Lightly brush the cookies with the egg wash, then sprinkle with the crystallized ginger and coarse sugar. Refrigerate the cookies until firm, about 20 minutes.\nPreheat the oven to 350 degrees F. Bake until the cookies are slightly puffed and golden brown, 15 to 20 minutes. Let cool 2 minutes on the baking sheets, then transfer to a rack to cool completely. Store in an airtight container up to 3 days.\nPhotograph by Steve Giralt",
        "ingredients": [
            "8 ounces cream cheese, softened",
            "2 sticks unsalted butter, softened",
            "1/3 cup granulated sugar",
            "2 teaspoons grated peeled fresh ginger",
            "Pinch of salt",
            "2 cups all-purpose flour, plus more for dusting",
            "1 large egg",
            "1/2 cup minced crystallized ginger",
            "Coarse sugar crystals, for decorating"
        ],
        "title": "Ginger Stars",
        "picture_link": "TRbJtwH5AXGxMss4.Dm0FfJhO7ViKz2"
    },
    "2EDvI33vjgRp8FQ21Umue102ACP3mQa": {
        "instructions": "Preheat the broiler. Place the red peppers on a foil lined baking sheet.\nPlace the red peppers under the boiler. Turning every 2 to 3 minutes cook the peppers until the skin is blistered, about 8 to 9 minutes total. Place the blistered peppers in a plastic bag. Seal the bag and allow the peppers to sit for 10 minutes to allow the skin to separate and to let cool.\nMeanwhile, bring a large pot of salted water to a boil over high heat. Add the potatoes and cook until tender, about 10 to 12 minutes. Remove the potatoes to a cutting board. Add the green beans to the pot. Cook the green beans until tender, about 3 minutes. Remove the green beans to a large bowl. Slice the potatoes in half while still warm and combine them with the green beans in the large bowl. Remove the peppers from the plastic bag. Peel off the skin from the peppers. Slice the pepper flesh into wide strips and remove the seeds and veins. Place them in the bowl with the potatoes. Add the scallions, parsley, and garlic\nand toss to combine.\nIn a small bowl combine the oregano, lemon juice and zest, and white wine vinegar. Whisk in the olive oil. Stir in the salt and pepper. Toss the warm vegetables with the herb vinaigrette. Serve immediately.",
        "ingredients": [
            "2 whole red peppers",
            "1 1/2 pound assorted red and white new potatoes",
            "3/4 pounds green beans, trimmed and halved",
            "1 bunch scallions, sliced",
            "1/2 cup chopped fresh flat-leaf parsley",
            "2 cloves garlic, minced",
            "2 tablespoons chopped oregano leaves",
            "1 lemon, zested and juiced",
            "2 tablespoons white wine vinegar",
            "1/2 cup extra-virgin olive oil",
            "1 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper"
        ],
        "title": "Warm Vegetable Salad",
        "picture_link": "ZbBGsjxvfe/7ZYmz4/0G/PpjVoDm7Bu"
    },
    "1WIgRweTAmyu0nR.FD.Hmry5SFnADpq": {
        "instructions": "In a 4 quart pot, heat 1/4 cup of the canola oil over medium heat. Add the jalapenos and saute for 1 minute. Stir in the ground pork and cook until evenly brown. Remove the pork and jalapenos from the pot to a bowl and set aside. In the same pot used to cook the meat, add the remaining 1/4 cup of the canola oil, butter, and onion. Cook for 2 minutes or until the onion starts to soften. Stir in the salt, cumin, paprika, cayenne, and black pepper and cook until the onion is soft. Mix in the garlic and cook for 1 minute. Reduce the heat to low. Sprinkle the flour over the onion and garlic and cook, stirring, for 3 minutes. Slowly pour the enchilada sauce into the onion mixture, whisking constantly to prevent lumps from forming. Mix in the green salsa and water. Return the cooked pork and jalapenos to the pot. Increase the heat to medium and slowly bring the chili to a boil. When the chili boils, reduce the heat and simmer for 30 minutes. Before serving remove from heat and stir in the chopped cilantro and lime juice. The consistency should be thick enough to coat the back of a spoon, if not simmer longer or thicken with a little cornstarch slurry.\nServe with cooked rice.",
        "ingredients": [
            "1/2 cup canola oil, divided",
            "2 fresh jalapeno peppers, stems removed",
            "1 pound ground pork",
            "1 tablespoon butter",
            "1 medium white onion, diced",
            "1 teaspoon kosher salt",
            "1/2 teaspoon ground cumin",
            "1/2 teaspoon sweet paprika",
            "1/4 teaspoon ground cayenne pepper",
            "1/4 teaspoon ground black pepper",
            "3 cloves garlic, minced",
            "1/2 cup all-purpose flour",
            "1 (28-ounce) can green enchilada sauce",
            "1 (7-ounce) can green salsa",
            "1 quart water",
            "1/2 bunch fresh cilantro, leaves chopped",
            "1/2 lime, juiced",
            "2 tablespoons cornstarch mixed with 2 tablespoons water, for slurry, if needed",
            "Cooked rice, for serving"
        ],
        "title": "Green Pork Chili",
        "picture_link": null
    },
    "b5TnZ.h4fczOja24rv3I7LISTPZhwVG": {
        "instructions": "Preheat oven to 350 degrees. Dredge ribs in flour, knocking off excess. Heat bacon fat in a 6-quart heavy ovenproof kettle over moderately high heat until hot but not smoking. Brown the short ribs in batches in a single layer without crowding. Transfer short ribs as browned with tongs to a large plate.\nPour off all but about 2 tablespoons bacon fat remaining in kettle and in it cook garlic, onions, carrots, and rosemary with salt and pepper to taste over moderate heat, stirring, until browned lightly. Deglaze the kettle with red wine. Add the beef broth to the vegetable mixture and bring to a boil, stirring. Return ribs to the kettle, squeezing them to fit in a single layer, if possible, and cover kettle with a lid. Braise ribs in oven until tender, about 2 hours.\nTransfer ribs with tongs to a platter and keep warm. Pour cooking liquid through a fine sieve set over a saucepan, discarding solids, and skim fat. If necessary, boil liquid to thicken it slightly, and spoon sauce over ribs. Serve with boiled new potatoes.",
        "ingredients": [
            "5 pounds beef short ribs, cut into 1-rib pieces if necessary",
            "All-purpose flour seasoned with salt and pepper for dredging",
            "1/4 cup rendered bacon fat",
            "4 garlic cloves, chopped",
            "6 small onions (about 1 pound total), unpeeled but chopped",
            "6 carrots, sliced",
            "1/2 teaspoon dried rosemary, crumbled",
            "1 cup red wine",
            "3 cups beef broth"
        ],
        "title": "Braised Beef Short Ribs",
        "picture_link": null
    },
    "2a3N3nvtqPP14eQuaWpwWXc./SBT92a": {
        "ingredients": [
            "4 ounces 1/4- to 1/3- inch-thick slices pancetta (Italian bacon) or thick-cut bacon slices, cut into 1/4- to1/3-inch cubes",
            "5 1/2 cups 1-inch broccoli florets (from 1 pound broccoli crowns)",
            "9 ounces fresh or dried fettuccine",
            "1/4 cup (1/2 stick) butter, melted",
            "1/4 cup olive oil",
            "1 tablespoon finely grated lemon peel",
            "2 teaspoons fresh lemon juice",
            "2 teaspoons fresh thyme leaves",
            "1/2 cup freshly grated Parmesan cheese"
        ],
        "picture_link": "P1F1oviljajGmaTBQ1m.B8ayEGSkIa6",
        "instructions": "Sauté pancetta in heavy medium skillet over medium-high heat until almost crisp and brown. Transfer to paper towels. Cook broccoli in large pot of boiling salted water until crisp-tender but still bright green, about 3 minutes. Using slotted spoon, transfer broccoli to medium bowl. Add pasta to same boiling water; cook until tender, stirring occasionally. Drain pasta; return to same pot. Add next 5 ingredients. Toss over low heat to coat. Add pancetta, broccoli, and cheese; toss to blend. Season pasta with pepper.\nSauté pancetta in heavy medium skillet over medium-high heat until almost crisp and brown. Transfer to paper towels.\nCook broccoli in large pot of boiling salted water until crisp-tender but still bright green, about 3 minutes. Using slotted spoon, transfer broccoli to medium bowl. Add pasta to same boiling water; cook until tender, stirring occasionally.\nDrain pasta; return to same pot. Add next 5 ingredients. Toss over low heat to coat. Add pancetta, broccoli, and cheese; toss to blend. Season pasta with pepper.",
        "title": "Lemon Fettuccine with Broccoli and Pancetta \"Croutons\" "
    },
    "e6UdluI8F48NobVeZ4YS62wiK7AI88q": {
        "ingredients": [
            "2 tablespoons (1/4 stick) unsalted butter",
            "4 large carrots, thinly sliced",
            "1 large onion, chopped",
            "1 1/4 teaspoons dill seeds",
            "4 cups (or more) canned low-salt chicken broth",
            "1 cup packed coarsely chopped fresh dill",
            "2 tablespoons pine nuts",
            "2 tablespoons olive oil"
        ],
        "picture_link": null,
        "instructions": "Melt butter in heavy large saucepan over medium heat. Add carrots, onion and dill seeds and sauté until onion is translucent and tender, about 10 minutes. Add 4 cups broth and bring to boil. Reduce heat and simmer until carrots are very tender, about 35 minutes. Transfer soup to blender in batches and puree. Thin with more broth if desired. Season to taste with salt and pepper. Combine fresh dill and pine nuts in processor and chop finely using on/off turns. With processor running, slowly add oil and process until well blended. Season to taste with salt and pepper. (Soup and pesto can be prepared 1 day ahead. Cover separately and refrigerate.) Rewarm soup. Ladle into bowls. Divided dill pesto among bowls. Using knife, swirl pesto into soup.\nMelt butter in heavy large saucepan over medium heat. Add carrots, onion and dill seeds and sauté until onion is translucent and tender, about 10 minutes. Add 4 cups broth and bring to boil. Reduce heat and simmer until carrots are very tender, about 35 minutes. Transfer soup to blender in batches and puree. Thin with more broth if desired. Season to taste with salt and pepper.\nCombine fresh dill and pine nuts in processor and chop finely using on/off turns. With processor running, slowly add oil and process until well blended. Season to taste with salt and pepper. (Soup and pesto can be prepared 1 day ahead. Cover separately and refrigerate.)\nRewarm soup. Ladle into bowls. Divided dill pesto among bowls. Using knife, swirl pesto into soup.",
        "title": "Carrot Soup with Dill Pesto "
    },
    "AdislvHAQuh7EB2LU4U8nKFVpn2PkC6": {
        "ingredients": [
            "1 pound skinless boneless chicken breast halves, cut into 3/4- to- 1-inch cubes",
            "1 tablespoon hot sauce",
            "4 cups low-salt chicken broth",
            "1/3 cup creamy peanut butter (do not use natural or old-fashioned)",
            "2 tablespoons tomato paste",
            "5 tablespoons butter",
            "1 1/2 cups chopped onion",
            "2 medium zucchini, trimmed, cut into 1/2-inch cubes",
            "2 tablespoons all purpose flour",
            "1 cup drained canned diced tomatoes in juice"
        ],
        "picture_link": null,
        "instructions": "Combine chicken cubes and hot sauce in medium bowl and toss to coat well. Sprinkle with salt and pepper and toss again. Whisk chicken broth, peanut butter, and tomato paste in another medium bowl to blend. Melt butter in large pot over medium-high heat. Add chopped onion and zucchini; sauté until tender, about 8 minutes. Add chicken and sauté until no longer pink on outside, about 3 minutes. Sprinkle with flour and cook 1 minute, stirring occasionally. Add broth mixture and tomatoes to pot. Simmer until chicken is cooked through and flavors blend, about 5 minutes. Season soup to taste with salt and pepper. Serve.\nCombine chicken cubes and hot sauce in medium bowl and toss to coat well. Sprinkle with salt and pepper and toss again. Whisk chicken broth, peanut butter, and tomato paste in another medium bowl to blend.\nMelt butter in large pot over medium-high heat. Add chopped onion and zucchini; sauté until tender, about 8 minutes. Add chicken and sauté until no longer pink on outside, about 3 minutes. Sprinkle with flour and cook 1 minute, stirring occasionally.\nAdd broth mixture and tomatoes to pot. Simmer until chicken is cooked through and flavors blend, about 5 minutes. Season soup to taste with salt and pepper. Serve.",
        "title": "Spicy Peanut Soup with Chicken "
    },
    "cASbuyp.gqbbtUVZxSIgEcFRbDHen0i": {
        "ingredients": [
            "12 ounces fettuccine or penne",
            "3 ounces pancetta or bacon, chopped",
            "1 1/4 pounds asparagus, trimmed, cut on diagonal into 1-inch pieces",
            "2 cups shelled fresh green peas, blanched 1 minute in boiling water, drained, or frozen peas (do not thaw)",
            "1 bunch green onions, thinly sliced, white and pale green parts separated from dark green parts",
            "2 garlic cloves, pressed",
            "1/2 cup finely grated Parmesan cheese plus additional for serving",
            "1/3 cup heavy whipping cream",
            "3 tablespoons extra-virgin olive oil",
            "3 tablespoons fresh lemon juice",
            "1 tablespoon finely grated lemon peel",
            "1/4 cup chopped fresh Italian parsley, divided",
            "1/4 cup thinly sliced fresh basil, divided"
        ],
        "picture_link": "8TXx4U4Gauc7AkM6VlqhrGecGCoa9l.",
        "instructions": "Cook pasta in pot of boiling salted water until just tender but still firm to bite. Drain, reserving 1/2 cup pasta cooking liquid. Return pasta to pot. Meanwhile, cook pancetta in large nonstick skillet over medium heat until crisp. Using slotted spoon, transfer pancetta to paper towels to drain. Pour off all but 1 teaspoon drippings from skillet. Add asparagus to drippings in skillet; sauté 3 minutes. Add peas, white and pale green parts of green onions, and garlic; sauté until vegetables are just tender, about 2 minutes. Remove from heat. Add vegetable mixture, 1/4 cup pasta cooking liquid, dark green parts of green onions, 1/2 cup Parmesan, cream, olive oil, lemon juice, lemon peel, half of parsley, and half of basil to pasta. Toss, adding more cooking liquid by tablespoonfuls if needed. Season with salt and freshly ground black pepper. Transfer to large bowl. Sprinkle pancetta, remaining parsley, and basil over. Serve, passing additional Parmesan cheese.\nCook pasta in pot of boiling salted water until just tender but still firm to bite. Drain, reserving 1/2 cup pasta cooking liquid. Return pasta to pot.\nMeanwhile, cook pancetta in large nonstick skillet over medium heat until crisp. Using slotted spoon, transfer pancetta to paper towels to drain. Pour off all but 1 teaspoon drippings from skillet. Add asparagus to drippings in skillet; sauté 3 minutes. Add peas, white and pale green parts of green onions, and garlic; sauté until vegetables are just tender, about 2 minutes. Remove from heat.\nAdd vegetable mixture, 1/4 cup pasta cooking liquid, dark green parts of green onions, 1/2 cup Parmesan, cream, olive oil, lemon juice, lemon peel, half of parsley, and half of basil to pasta. Toss, adding more cooking liquid by tablespoonfuls if needed. Season with salt and freshly ground black pepper. Transfer to large bowl. Sprinkle pancetta, remaining parsley, and basil over. Serve, passing additional Parmesan cheese.",
        "title": "Fettucine with Peas, Asparagus, and Pancetta "
    },
    "Am0r0S3XzpQf5JSD0JkstjSfrHK9wSy": {
        "instructions": "Preheat a large nonstick skillet over medium high heat with 2 turns of the pan of olive oil, about 2 tablespoons. Add the breakfast sausage and break it up with the back of a wooden spoon into little chunks, brown sausage for 3 minutes. Add the sweet potatoes and 3/4 of the chopped red onion to the sausage, season with chili powder, cumin, coriander, salt and pepper, stir frequently and cook for 10 to 12 minutes, or until the potatoes are nice and tender.\nWhile the hash is cooking, in a small bowl combine the tomatoes, jalapeno, and the remaining chopped red onion, cilantro, lime juice and a little salt and pepper.\nOnce the hash is cooked, add the chopped parsley, stir to combine and transfer hash to a serving platter. Sprinkle with the cheese and cover with aluminum foil, the cheese will melt while you make the fried eggs.\nWipe clean the skillet you made the hash in, return it to the cook top over medium-high heat and add the butter. Once the butter has melted, crack each of the eggs into the skillet, season with a little salt and pepper and fry to desired doneness. Eggs may, of course, be scrambled as well. As you like!\nTransfer the fried eggs to the top of the hash, sprinkle with the fresh tomato salsa and serve.",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil, 2 turns of the pan",
            "1/2 pound bulk breakfast sausage, such as maple sausage",
            "1 medium sweet potato, scrubbed clean, cut in 1/2 lengthwise, thinly sliced into 1/2 moons",
            "1 large red onion thinly sliced, divided",
            "2 teaspoons chili powder, 2/3 palm full",
            "1 teaspoon ground cumin, 1/3 palm full",
            "2 teaspoons ground coriander, 2/3 palm full",
            "Salt and pepper",
            "3 yellow vine ripe tomatoes, seeded and diced",
            "1 small jalapeno pepper, seeded and chopped",
            "2 to 3 tablespoons chopped fresh cilantro, a palm full",
            "1 lime, juiced",
            "1/2 cup chopped flat-leaf parsley, a few handfuls",
            "1 cup grated manchego or extra-sharp Cheddar",
            "1 tablespoon butter",
            "4 large eggs"
        ],
        "title": "Chili Sweet Potato Hash with Fried Eggs and Fresh Tomato Salsa B, L or D meal: good for Breakfast, Lunch or Dinner",
        "picture_link": null
    },
    "7G3E3vZb.W0W0WBsTDpt618RNh9Mn4.": {
        "instructions": "Whisk the flour, baking powder and salt in a medium bowl. Beat the butter and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Beat in the egg and vanilla until incorporated. Reduce the mixer speed to low; add the flour mixture and beat until just combined. Remove half of the dough and wrap in plastic wrap. Add the cinnamon extract, cocoa powder and food coloring to the remaining dough and beat until incorporated; wrap in plastic wrap. Refrigerate both pieces of dough until firm, about 1 hour.\nDust the dough with flour and roll out each piece on parchment paper into a 10-by-11-inch rectangle. Flip the red dough on top of the plain dough; remove the top piece of parchment and trim the edges. Sprinkle the ground cinnamon and sanding sugar on top. Starting from a short end, tightly roll up the dough, using the parchment to help; roll the log in sanding sugar. Wrap in plastic wrap and refrigerate until firm, at least 3 hours or overnight.\nPosition racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment. Slice the log crosswise 1/4 inch thick; arrange the slices about 1 1/2 inches apart on the baking sheets. Bake, switching the position of the pans halfway through, until slightly puffed and lightly golden on the bottom, 12 to 15 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool.\nPhotograph by Johnny Miller",
        "ingredients": [
            "2 cups all-purpose flour, plus more for dusting",
            "1/2 teaspoon baking powder",
            "1/4 teaspoon salt",
            "1 1/2 sticks (12 tablespoons) unsalted butter, at room temperature",
            "2/3 cup granulated sugar",
            "1 large egg",
            "1/2 teaspoon vanilla extract",
            "1/4 teaspoon cinnamon extract (optional)",
            "1 teaspoon unsweetened cocoa powder",
            "3/4 teaspoon red food coloring",
            "1 teaspoon ground cinnamon",
            "1 tablespoon sanding sugar (clear or red), plus more for coating"
        ],
        "title": "Cinnamon Pinwheels",
        "picture_link": "ub5ukOfXEiYHQ8fevG1Asjr9SjrCbUK"
    },
    "J0F3JMH82MlVrnOPyaCrdkbN7WqZt.2": {
        "instructions": "Bring a pot of water to a boil over high heat. Reduce the heat to low, then add your eggs and cook 4 to 5 minutes. Drain, cool in ice water and peel.\nBring a pot of water to a boil over high heat. Reduce the heat to low, then add your eggs and cook 7 to 8 minutes. Drain, cool in ice water and peel.\nPlace your eggs in a pot and cover with cold water by 1 inch. Bring to a boil over medium-high heat, then cover, remove from the heat and set aside 8 to 10 minutes. Drain, cool in ice water and peel.\nTransfer hard-boiled eggs to a bowl of ice water with a slotted spoon and let cool.\nDrain the ice water. One at a time, crack the bottom, wider end of each egg against the bowl, then hold the egg under cold running water and peel.\nSlice the eggs in half lengthwise. Scoop the yolks into a bowl and make your filling.\nFill the egg-white halves with the yolk mixture using a spoon, piping bag or resealable plastic bag with a corner snipped.\nPhotograph by Levi Brown",
        "ingredients": [
            "Eggs"
        ],
        "title": "Hard Boiled Eggs",
        "picture_link": "E.MvMyRylZBwRKnlEmTpXV2naoSvBRS"
    },
    "r6FJrv1Jk211EvHNACr8K.uTxXorj5e": {
        "ingredients": [
            "10 pounds meaty veal bones",
            "8 quarts plus 1 cup water",
            "1 pound carrots",
            "1 pound onions",
            "4 large leeks",
            "4 fresh thyme sprigs (optional)",
            "4 large fresh flat-leafed parsley sprigs (optional)",
            "2 Turkish bay leaves or 1/2 California bay leaf",
            "1 tablespoon black peppercorns (optional)",
            "1 tablespoon tomato paste (optional)"
        ],
        "picture_link": null,
        "instructions": "Preheat oven to 450°F and lightly oil 2 large shallow roasting pans. Remove meat from bones where possible and cut into 1-inch pieces. If using breast bones, cut apart. In roasting pans arrange bones and meat in one layer and roast in upper and lower thirds of oven, switching pans halfway through roasting, until bones are golden brown, 30 to 45 minutes. Into a 14-quart stockpot put bones, meat, and 8 quarts water. (Alternatively, divide bones, meat, and 8 quarts water between two 7- to 8-quart kettles.) Discard fat from roasting pans. Immediately add 1/2 cup water to each pan, scraping up brown bits, and add to stockpot or kettles. Bring liquid to a tremble, about 190°F., and cook at 190°F. (skim froth frequently during first hour of cooking) 12 to 14 hours. While stock is cooking, separately cut carrots, onions, and white and pale green parts of leeks into 1-inch pieces. In a bowl of cold water wash leeks well and lift from water into a colander to drain. In an oiled large shallow roasting pan arrange carrots, onions, and leeks in one layer and roast in middle of oven until golden brown, 20 to 30 minutes. Cool vegetables and chill, covered. Add roasted vegetables and remaining ingredients to stock during last 2 hours of cooking. Pour stock in batches through a large fine sieve into an 8-quart kettle and discard solids. Skim off fat. (Alternatively, cool stock, uncovered, and chill, covered. Scrape congealed fat from chilled stock.) Gently simmer stock, skimming froth occasionally, until reduced to about 2 quarts, about 1 hour. Cool stock, uncovered, and chill, covered. Stock keeps, covered and chilled, 1 week or, frozen in airtight containers, 3 months. If desired, pour cooled stock into ice-cube trays with 1-ounce cups and freeze. Frozen cubes keep in heavy-duty sealable plastic bags 3 months.\nPreheat oven to 450°F and lightly oil 2 large shallow roasting pans.\nRemove meat from bones where possible and cut into 1-inch pieces. If using breast bones, cut apart. In roasting pans arrange bones and meat in one layer and roast in upper and lower thirds of oven, switching pans halfway through roasting, until bones are golden brown, 30 to 45 minutes.\nInto a 14-quart stockpot put bones, meat, and 8 quarts water. (Alternatively, divide bones, meat, and 8 quarts water between two 7- to 8-quart kettles.) Discard fat from roasting pans. Immediately add 1/2 cup water to each pan, scraping up brown bits, and add to stockpot or kettles. Bring liquid to a tremble, about 190°F., and cook at 190°F. (skim froth frequently during first hour of cooking) 12 to 14 hours.\nWhile stock is cooking, separately cut carrots, onions, and white and pale green parts of leeks into 1-inch pieces. In a bowl of cold water wash leeks well and lift from water into a colander to drain. In an oiled large shallow roasting pan arrange carrots, onions, and leeks in one layer and roast in middle of oven until golden brown, 20 to 30 minutes. Cool vegetables and chill, covered.\nAdd roasted vegetables and remaining ingredients to stock during last 2 hours of cooking.\nPour stock in batches through a large fine sieve into an 8-quart kettle and discard solids. Skim off fat. (Alternatively, cool stock, uncovered, and chill, covered. Scrape congealed fat from chilled stock.) Gently simmer stock, skimming froth occasionally, until reduced to about 2 quarts, about 1 hour. Cool stock, uncovered, and chill, covered. Stock keeps, covered and chilled, 1 week or, frozen in airtight containers, 3 months. If desired, pour cooled stock into ice-cube trays with 1-ounce cups and freeze. Frozen cubes keep in heavy-duty sealable plastic bags 3 months.",
        "title": "Brown Veal Stock "
    },
    "zUKMIc8RwLtmKNiJkljgPETzffqnKp6": {
        "instructions": "Combine the soy sauce, lemon juice, scallions, garlic, and 1/4 teaspoon pepper in a resealable plastic bag. Add the chicken pieces; seal and toss well to coat. Place in the refrigerator and marinate overnight.\nPrepare a grill for indirect-heat cooking or preheat a grill pan over medium heat. Preheat an oven to 450 degrees F. Combine the brown sugar, ginger, water, and hoisin sauce in a glass bowl as a basting sauce.\nRemove the chicken from the marinade and pat dry. Place on the grill, skin-side down and cook until the skin is well marked, 6 to 8 minutes, keeping a close eye. Turn the chicken and basting constantly, cook the chicken for another 5 minutes. Transfer the chicken, skin-side up, to a baking sheet.\nGenerously brush the chicken with the sauce and cook in the hot oven until the skin is crispy and the chicken is cooked through, about 15 to 20 minutes.\nLet rest under a foil tent for 10 minutes, then it's \"nom-nom\" time.",
        "ingredients": [
            "1/2 cup soy sauce",
            "Juice of 1 lemon",
            "2 scallions, cut into 1-inch pieces",
            "2 cloves garlic, minced",
            "Freshly ground pepper",
            "4 chicken quarters or 8 bone-in chicken thighs",
            "2 tablespoons packed light brown sugar",
            "1 teaspoon grated fresh ginger",
            "1/2 cup water",
            "1/4 cup hoisin sauce"
        ],
        "title": "Crispy-Skin Hoisin BBQ Chicken",
        "picture_link": null
    },
    "aguAwpJZSwKh8Y4T0kMkw1p8NRjD1Tq": {
        "instructions": "Mix the eggs, water, flour and 1/2 cup sugar. Strain through a metal sieve to remove any lumps that might remain. Spoon 5 tablespoons batter into an 8-inch diameter non-stick skillet over low heat. Spread the batter out to the edge of the pan, making a round pancake shape that is thin and smooth. Cook over medium heat until the batter has turned a light brown throughout; then add 1/2 tablespoon of butter on top of the pancake and let it melt. With a spatula, turn the pancake and let it cook until both sides are lightly crisp. Combine 3 tablespoons of peanut butter with reamaining 1/2 cup sugar mixture on the center of the pancake. Now cover the peanut butter filling by first folding over the left third of the pancake over the center third; then fold the right side over the fold, to form a vertical shape. Use a bit of batter to seal the edges. Next, fold the top and bottom of the pancake in the same fashion, making a roughly 5-inch by 4-inch rectangle. Using the spatula, lightly pat the folded pancake a few times to flatten out the filling. Continue to pan-fry for 4 more minutes until both sides are crispy and light brown. To serve: Place the pancake on a plate and cut into 6 squares. Serve warm as is or with a topping of lightly whipped cream;",
        "ingredients": [
            "4 eggs, beaten",
            "3 cups water",
            "3 cups all-purpose flour",
            "7 tablespoons unsalted butter",
            "1 cup sugar",
            "1/2 pound smooth peanut butter"
        ],
        "title": "Hua Shen Bin (Peanut Butter/Pancake",
        "picture_link": null
    },
    "xwe9KgiWikcPSi3ae/eNK26l/GK.kGG": {
        "instructions": "1. In medium bowl toss together cheddar cheese, Colby cheese and\ncornstarch. Set aside.\n2. In medium saucepan whisk together cider and mustard. Cook over\nmedium-high heat until boiling. Slowly add the cheese mixture, a little at\na time, stirring constantly until smooth. Remove from heat. Stir in\njalapeno peppers and red pepper.\n3. Transfer to 1-quart slow cooker or fondue pot. Keep warm over very\nlow heat. Serve with KEEBLER TOWN HOUSE FLIPSIDES Original\ncrackers.\n*Note: Hard cider, the fermented version of sweet apple cider, can be found near the beer section of your local grocery or liquor store.\nEntwine Pairing: Chardonnay (apple notes and rich cheese are a match made in heaven)\nNutrition Information:\nServing Size: 1/4 cup cheese mixture plus 4 crackers; Calories 290, Calories From Fat 180, Saturated Fat 10g, Trans Fat 0g, Total Fat 20g, Cholesterol 50mg, Sodium 590mg, Total Carbohydrates 15g, Sugars 2g, Dietary Fiber 0g, Protein 12g, Vitamin A 10%, Vitamin C 0%, Calcium 30%, Iron 2%",
        "ingredients": [
            "2 cups (8 oz.) shredded extra sharp, yellow cheddar cheese",
            "2 cups (8 oz.) shredded Colby Cheese",
            "2 tablespoons cornstarch",
            "1 cup hard cider*",
            "1 tablespoon Dijon mustard",
            "3 tablespoons coarsely chopped, pickled jalapeno peppers",
            "1/8 teaspoon ground red pepper",
            "60 Keebler Town House Flipsides Original crackers"
        ],
        "title": "Pub Cheese Dip",
        "picture_link": null
    },
    "69tu53WZnRXzqHqsB48ImJ6ep8ZtCx6": {
        "ingredients": [
            "1/2 cup plain whole-milk yogurt",
            "1/4 cup vinegar-based hot sauce (such as Crystal)",
            "4 finely chopped garlic cloves",
            "1 tablespoon finely chopped fresh oregano",
            "2 tablespoons olive oil",
            "1 teaspoon freshly ground black pepper",
            "1/2 teaspoon garam masala",
            "Dai Due's Master Brined Chicken , backbone removed",
            "Vegetable oil for grilling"
        ],
        "picture_link": "20HD621YS3zeFeTZ/Jlw9AWxTcmZgCe",
        "instructions": "Combine 1/2 cup plain whole-milk yogurt, 1/4 cup vinegar-based hot sauce (such as Crystal), 4 finely chopped garlic cloves, 1 tablespoon finely chopped fresh oregano, 2 tablespoons olive oil, 1 teaspoon freshly ground black pepper, and 1/2 teaspoon garam masala in a large resealable plastic bag. Add 1 Dai Due's Master Brined Chicken, backbone removed, and turn to coat. Seal bag, pressing out air; chill chicken 8–24 hours. Prepare grill for medium heat; lightly brush grate with vegetable oil. Remove chicken from marinade, wiping off any excess, and grill, skin side down, until skin is lightly charred and releases from grate without tearing, 10–15 minutes. Give bird a quarter turn and continue to grill until skin is nicely charred and crisp and thighs are starting to firm up (they should be springy when pressed), 15–20 minutes. Turn chicken over and grill until an instantread thermometer inserted into the thickest part of thigh registers 165°F, 10–15 minutes. Place chicken on a platter skin side up; let rest 10 minutes before carving.\nCombine 1/2 cup plain whole-milk yogurt, 1/4 cup vinegar-based hot sauce (such as Crystal), 4 finely chopped garlic cloves, 1 tablespoon finely chopped fresh oregano, 2 tablespoons olive oil, 1 teaspoon freshly ground black pepper, and 1/2 teaspoon garam masala in a large resealable plastic bag. Add 1 Dai Due's Master Brined Chicken, backbone removed, and turn to coat. Seal bag, pressing out air; chill chicken 8–24 hours.\nPrepare grill for medium heat; lightly brush grate with vegetable oil. Remove chicken from marinade, wiping off any excess, and grill, skin side down, until skin is lightly charred and releases from grate without tearing, 10–15 minutes. Give bird a quarter turn and continue to grill until skin is nicely charred and crisp and thighs are starting to firm up (they should be springy when pressed), 15–20 minutes. Turn chicken over and grill until an instantread thermometer inserted into the thickest part of thigh registers 165°F, 10–15 minutes. Place chicken on a platter skin side up; let rest 10 minutes before carving.",
        "title": "Yogurt Marinated Grilled Chicken "
    }
}