{
    "U9NOrQsq7huBVorsQ/M99Ot0DLCnE6S": {
        "instructions": "Steam the clams in the stock. Remove the clams, chop the meat, and reserve. Strain the steaming liquid through cheesecloth. Reserve. Render the bacon. Add the onions and celery and saute until transulent. Add the stock, potatoes, sage, thyme, bay leaves, tobasco and worcesterchire. Simmer until the potatoes are tender. Combine the evaporated skimmed milk and the arrowroot. Gradually stir this mixture into the soup and continue to simmer for a few minutes, until thickened. Add the scallions. Add the reserved chopped clams and fresh herbs just before serving.",
        "ingredients": [
            "16 cherrystone clams, fresh, in the shell",
            "2 cups fish stock",
            "1 strip bacon, julienne",
            "1/4 cup onions, medium diced",
            "1/4 cup celery, medium diced",
            "1/2 cup Idaho potatoes, peeled, medium dice",
            "1 sage leaf, fresh",
            "1/4 teaspoon thyme, dried leaves",
            "1 bay leaf",
            "3 drops tobasco sauce",
            "1/2 teaspoon white worcestershire sauce",
            "1/2 cup evaporated skimmed milk",
            "2 tablespoons arrowroot",
            "1/4 cup scallions, sliced",
            "Chives, fresh, sliced",
            "Parsley, fresh, chopped"
        ],
        "title": "Clam Chowder",
        "picture_link": null
    },
    "7ctzc/4yOu0Oz9/f1fxqPSZcvq6b5fW": {
        "instructions": "Low-Sodium Recipe\n1. Heat an 8 inch sauté pan or wok over medium heat.\n2. Add 1/2 Tbsp. of oil and toss with garlic, ginger and scallions. Stir fry quickly and remove to a bowl.\n3. Add remaining 1 Tbsp. of oil to pan. Stir fry chicken strips until cooked through. Add reserved partially cooked vegetable mix, Mrs. Dash and finish cooking all together.",
        "ingredients": [
            "2 Tbsp. Mrs. Dash® Original Seasoning Blend",
            "2 Tbsp. peanut oil",
            "2 garlic cloves, slivered",
            "2 tsp. ginger, grated",
            "3 scallions cut into 1 inch lengths, white and green parts",
            "2 boneless, skinless chicken breasts, cut into 1/4 inch wide strips"
        ],
        "title": "Chicken Stir Fry",
        "picture_link": "GNSOYX4AAENEy1YyWycDfedsGcoKSXu"
    },
    "./jMGho5ehQe7Fv/uesndDNvCF2VEJO": {
        "instructions": "Combine lettuce, onions and tomatoes in a salad bowl.\nIn a small bowl, combine ketchup and vinegar. Whisk in extra-virgin olive oil in a slow stream. Stir relish into dressing then pour dressing over salad and toss. Season the salad with salt and pepper and serve.",
        "ingredients": [
            "1 head iceberg lettuce, core removed and lettuce chopped",
            "1 small red onion, thinly sliced",
            "2 vine ripe tomatoes, halved and thinly sliced",
            "3 tablespoons ketchup",
            "2 tablespoons red wine vinegar, eyeball it",
            "1/4 cup extra-virgin olive oil",
            "3 tablespoons dill pickle relish",
            "Salt and pepper"
        ],
        "title": "Drum Roll Mixed Salad with Dill Pickle Relish Dressing",
        "picture_link": null
    },
    "1hiPj9tTyF8wQBWUzLjo.DazDiqBNpa": {
        "instructions": "In a large saucepan, combine all ingredients, except the cornstarch mixture and pineapple, and whisk to blend. Bring the mixture to a boil and stir in the cornstarch slurry to thicken. Fold in chopped pineapple.",
        "ingredients": [
            "1 cup soy sauce",
            "1 medium orange, juiced",
            "1/2 cup mirin",
            "1/2 cup water",
            "1/4 cup brown sugar",
            "1 1/2 teaspoons minced garlic",
            "1 1/2 teaspoons minced ginger",
            "1 tablespoon cornstarch mixed with 1 tablespoon water",
            "1 cup fresh pineapple, grilled and chopped"
        ],
        "title": "Pineapple Teriyaki Sauce",
        "picture_link": null
    },
    "tHkvVLph.kWBac0cbc4Bc/WmWmTvgIm": {
        "instructions": "1. Spray grate of outdoor grill with grilling spray. Preheat grill to medium heat according to manufacturer's directions. Meanwhile, set aside 1/3 cup drained tomatoes. Mix together beef, remaining drained tomatoes, salt and pepper in medium bowl. Shape into 4 patties, about 1/2-inch thick.\n2. Grill patties 10 minutes or until cooked through (160 degrees F), turning once. Top each patty with 1 slice cheese; melt slightly.\n3. Place patties on bottom halves of buns. Top each patty with 3 or 4 avocado slices and a generous tablespoon of reserved tomatoes. Close with tops of buns. Serve immediately.",
        "ingredients": [
            "PAM® Grilling Spray",
            "1 can (10 oz each) Ro*Tel® Original Diced Tomatoes & Green Chilies, drained",
            "1 pound ground sirloin beef (90% lean)",
            "1/4 teaspoon salt",
            "1/8 teaspoon ground black pepper",
            "4 slices Pepper Jack cheese",
            "4 hamburger buns",
            "1 avocado, peeled, pitted and sliced"
        ],
        "title": "Zesty Salsa Burgers",
        "picture_link": "UxmmOkevWLrUiDrJjlTTbDb6Mb3WBhS"
    },
    "tbNPvoGM2RwulD5MqG3nuJ03GrjTu5q": {
        "instructions": "In a large saute pan, heat a small amount of olive oil and brown eggplant quickly on all sides. Continue to cook in batches until all eggplant is done. In a separate pot (large enough to hold all the eggplant), heat 2 tablespoons olive oil and sweat garlic and onions until translucent. Add eggplant, tomatoes, honey and spices. Reduce until all liquid is evaporated. Stir occasionally, making sure the bottom does not burn. Remove from heat; add vinegar and check seasoning. Before serving add herbs. Let cool to room temperature before serving.",
        "ingredients": [
            "Olive oil for sauteing",
            "4 medium eggplants, diced into 1-inch cubes and salted for 1 hour",
            "2 to 3 cloves garlic, chopped",
            "2 medium onions, peeled and diced medium",
            "5 to 6 ripe plum tomatoes peeled, seeded and diced",
            "2 tablespoons honey",
            "1 cinnamon stick",
            "2 tablespoons ground cumin",
            "1 tablespoon tumeric",
            "1 tablespoon paprika",
            "4 tablespoons red wine vinegar",
            "Salt and pepper to taste",
            "2 tablespoons cilantro, chopped",
            "1 tablespoons parsley, chopped"
        ],
        "title": "Eggplant Salad",
        "picture_link": null
    },
    "U8Nl6uLl.hZkNhi50J8tjZz3Jfls6pC": {
        "instructions": "Warm tortillas over a gas flame, in a low temperature oven, or in the microwave. In the middle of each tortilla, place 3 ounces grilled chicken, 1/2 cup black beans, 1 cup lettuce, 1 tablespoon each pumpkin seeds, feta, and red peppers. Top with Caesar dressing and roll up. Serve immediately.\nAdd all ingredients to a blender. Blend until smooth. Refrigerate until ready to use.",
        "ingredients": [
            "4 (6-inch) tortillas",
            "12 ounces grilled chicken breast, cubed (about 2 large breasts)",
            "2 cups cooked black beans",
            "4 cups shredded lettuce (mixture of romaine and green leaf)",
            "4 tablespoons pumpkin seeds",
            "4 tablespoons crumbled feta cheese",
            "4 tablespoons roasted red peppers",
            "Caesar Dressing, recipe follows",
            "1/3 cup non-fat plain yogurt",
            "2 tablespoons lemon juice",
            "1 tablespoon vegetable oil",
            "2 teaspoons Worcestershire sauce",
            "2 teaspoons red wine vinegar",
            "1 teaspoon Dijon mustard",
            "1/4 teaspoon black pepper",
            "1/4 teaspoon salt",
            "1/2 teaspoon minced garlic"
        ],
        "title": "Caesar Chicken Wrap",
        "picture_link": "122N6ZHmgVKWgJCTG5nLM9fpBd03L3y"
    },
    "Kz6Oz92JJgsIfkEIXbIM47vEOjdH5nO": {
        "instructions": "In a large stockpot, bring water to a boil and then reduce to a simmer. Add whole octopus, and simmer for 1 hour. Remove octopus from boiling water, and let cool at room temperature for 15 minutes. Cut the tentacles from the head, and discard the head. Chop the tentacles into small pieces. Heat a large saute pan with olive oil over medium heat, add the octopus, green pepper, tomatoes, olives, oregano, and vinegar. Saute for 10 minutes. Serve immediately.",
        "ingredients": [
            "6 to 7 pound whole octopus, cleaned",
            "2 tablespoons olive oil",
            "1 green bell pepper, stems, seeds, and ribs removed, julienned",
            "2 plum tomatoes, sliced into 1/2 moons",
            "1/4 pound pitted green olives, sliced",
            "2 tablespoons fresh oregano leaves, chopped",
            "2 teaspoons cider vinegar"
        ],
        "title": "Sauteed Octopus with Oregano",
        "picture_link": null
    },
    "cLLJLJLsMzIXl3BI2H8IVmE/mUH9BvG": {
        "instructions": "Brown the beef in oil. Add the onion, garlic, and chicken broth and simmer one hour.\nAfter 1 hour, add the second ingredient group, and simmer for 1 more hour.\nAfter 2 total hours of cooking time, add the third ingredient group (spices) and cook for 45 minutes.\nAfter 2 hours and 45 minutes, add the fourth ingredient group and simmer 15 more minutes.",
        "ingredients": [
            "44 ounces beef, cut into 1/4-inch cubes",
            "Vegetable oil",
            "3/4 cup finely chopped onion",
            "5 medium garlic cloves, pressed",
            "1 (14 1/2-ounce) can chicken broth",
            "2 medium whole green seeded and finely chopped chile peppers",
            "8 ounces beef broth",
            "4 ounces Mexican hot-style tomato sauce",
            "4 ounces tomato sauce",
            "1 teaspoon hot red pepper sauce",
            "1 1/4 tablespoons ground cumin",
            "10 1/4 tablespoons chili powder (8 tablespoons California and 2 1/4 tablespoons New Mexico)",
            "1 teaspoon salt",
            "1/2 teaspoon arbol chile powder",
            "1/2 teaspoon New Mexico chile powder",
            "1/4 teaspoon monosodium glutamate",
            "Pinch brown sugar",
            "Pinch jalapeno powder"
        ],
        "title": "Swick and Swick Chili",
        "picture_link": null
    },
    "5//wa.CNZcUo6m/Z4Y8ttSGN8gQG.0C": {
        "instructions": "Pop the popcorn according to package directions. Place the popped corn in a large brown paper bag. Add the curry powder, Creole seasoning and butter. Shake to coat.",
        "ingredients": [
            "1 cup popcorn kernels",
            "2 tablespoons mild curry powder",
            "2 teaspoons Creole seasoning",
            "4 tablespoons melted butter"
        ],
        "title": "Curried Popcorn",
        "picture_link": null
    },
    "wwU3lVklXQbWlVmx4qn4tZYh7r3Nqwa": {
        "instructions": "Preheat oven to 400F. In a large saucepan set over moderate heat, heat oil until hot, and add the onion and cook it, stirring occasionally for 4 minutes. Add the garlic and cook for 3 to 4 minutes more, or until the onion and garlic are golden in color. Now add the tomatoes, oregano, red pepper flakes and salt and pepper to taste and simmer the tomatoes for 6 to 8 minutes, or until lightly thickened. Add the basil and shrimp and cook, stirring gently, for 1 to 2 minutes, or until the shrimp are just turning pink. Place cooked pasta in a large bowl, gently stir in shrimp and tomato mixture, 2 tablespoons of the parsley and half of the feta cheese. Transfer to an oiled 3 quart shallow baking dish and sprinkle with the remaining feta cheese and parsley. Cover loosely with foil, place in the oven and bake for 20 minutes, or until bubbling. Run under the broiler until golden.",
        "ingredients": [
            "2 Tbsp olive oil plus enough for coating your baking dish",
            "1 onion, sliced thin",
            "2 large cloves garlic, sliced thin",
            "3 cups drained chopped canned plum tomatoes",
            "2 tsp minced fresh oregano, or 1 tsp dried & crumbled",
            "1/2 tsp dried red pepper flakes",
            "salt & freshly ground pepper to taste",
            "2 Tbsp minced fresh basil ( I need a dry substitute)",
            "1 lb large shrimp, shelled & deveined",
            "1/4 cup minced fresh parsley leaves",
            "3/4 lb ziti, cooked & drained according to package directions",
            "1/2 lb feta cheese, crumbled"
        ],
        "title": "Ziti Baked with Shrimp and Feta Cheese - Greek Style",
        "picture_link": null
    },
    "PtVLVZ/Aqul3ALEeC87icRnP43ojlYa": {
        "instructions": "In a non-stick pan heat the oil until hot and pan sear the striped bass skin side down for approximately 1 to 2 minutes or until crisp. Turn and finish cooking on the other side. Remove the fish and pour off the excess oil and deglaze the pan with the white wine and add the remaining the ingredients. Spoon the mixture over the fish once the butter has melted.\nWhisk together the heavy cream, eggs, garlic, salsify and salt and pepper until well combined. Using 2-ounce or 3-ounce ramekin molds, sprayed with non-stick spray, pour the mixture into the the ramekins. Place the ramekins in a water bath and cover with buttered waxed paper. Bake in a 325 degree oven until ramekins are done. Approximately 20 minutes.\nToss the potatoes with the olive oil, garlic, salt and pepper. Roast in a 450 degree oven for approximately 1/2 hour or until done. Toss with the chopped parsley and whole butter",
        "ingredients": [
            "2 tablespoons canola oil",
            "2 - 8 ounce skin on wild Striped Bass fillets",
            "3 tablespoons white wine",
            "1 tablespoon capers",
            "1 teaspoon chopped shallots",
            "1 tablespoon butter",
            "Salt and pepper to taste",
            "1 tablespoon chopped parsley",
            "1/2 cup heavy cream",
            "2 eggs",
            "1/4 teaspoon minced garlic",
            "1/4 cup cooked salsify, pureed",
            "1 bunch asparagus, trimmed and blanched",
            "10 ounces Creamer potatoes (approximately 8 potatoes)",
            "1 teaspoon olive oil",
            "1 teaspoon minced garlic",
            "1 teaspoon chopped parsley",
            "1 tablespoon whole butter"
        ],
        "title": "Striped Bass with Salsify Flan, Asparagus and Oven Roasted Creamer Potatoes",
        "picture_link": null
    },
    "N80nsLfJ6foLl/fTl/aiJfJnnixghEC": {
        "instructions": "Place a large pot over medium-high heat and add the oil. When it is hot add the onions, garlic, curry leaves, garam masala, mustard seeds, paprika and turmeric and cook for about 3 minutes, stirring occasionally. Add the tomatoes and tomato paste and season with salt and pepper. Stir and simmer for 5 minutes, and then add the sweet potatoes, vegetable broth and yogurt. Cover and continue to cook until the sweet potatoes are tender, 20 to 25 minutes. Add the mussels and replace the lid. Cook until the mussels have opened, 5 to 8 minutes. Serve the mussels with lots of the curry on rice, roti or toasted bread.",
        "ingredients": [
            "3 tablespoons grapeseed oil",
            "1 cup thinly sliced onions",
            "2 cloves garlic, minced",
            "10 curry leaves",
            "1 tablespoon garam masala",
            "1 teaspoon black mustard seeds",
            "1 teaspoon smoked paprika",
            "1 teaspoon turmeric",
            "2 cups chopped fresh tomatoes",
            "2 tablespoons tomato paste",
            "A pinch of salt",
            "A pinch of pepper",
            "2 cups chopped sweet potatoes",
            "2 cups vegetable broth",
            "1 cup yogurt",
            "2 pounds mussels, cleaned and debearded",
            "Steamed rice, roti or toasted bread, for serving"
        ],
        "title": "Sweet Potato Curry with Mussels",
        "picture_link": null
    },
    ".P5Q36mK5d5piq1RDzk8uwplLZuwIgu": {
        "instructions": "Cook pasta in large, deep pot of lightly salted water until al dente, firm yet tender, following package directions. Drain; rinse with cold water; drain.\nMeanwhile, in large bowl, whisk oil, vinegar, garlic, paprika and salt. Add tomatoes with their juice, green pepper, celery and cucumber; toss to mix. Add pasta; toss to coat.\nGarnish with parsley, if desired. Serve immediately or refrigerate, covered, 30 minutes to chill.",
        "ingredients": [
            "8 ounces medium-size shaped pasta, such as pipette or cavatappi",
            "3 tablespoons olive oil",
            "2 tablespoons red-wine vinegar",
            "3 medium-size cloves garlic, finely chopped",
            "1/2 teaspoon paprika",
            "1/2 teaspoon salt",
            "1 can (14.5 ounces) diced tomatoes with jalapeno chiles",
            "1 large sweet green pepper, cored, seeded and cut into 1/2-inch pieces (about 1 cup)",
            "2 medium-size ribs celery, cut into 1/2-inch pieces (about 1 cup)",
            "1/2 seedless cucumber, peeled, quartered lengthwise and sliced crosswise into 1/2-inch-thick pieces (about 1 1/4 cups)",
            "Chopped fresh parsley leaves, optional"
        ],
        "title": "Gazpacho Pasta Salad",
        "picture_link": "IwEKifepJ9ibk4qB.B7cdf.cc1PyYXi"
    },
    "/98ZJxeG/uHy650WpCyegilQhBeQzhG": {
        "instructions": "Spread the bread with butter, cut into 12 (2-inch) squares, and press the buttered side of the bread gently into the parsley to coat it. In a small bowl combine well the radish and the onion and divide the mixture among the bread squares. Roll up each herring strip into a coil and arrange the herring and the capers decoratively on the bread.\nThe canapes may be made 30 minutes in advance and kept covered and chilled. Arrange the canapes on a platter.",
        "ingredients": [
            "6 slices of rye bread",
            "3 tablespoons unsalted butter, softened",
            "1/2 cup minced fresh parsley leaves",
            "2 tablespoons minced radish",
            "2 tablespoons minced onion",
            "12 (4-inch) strips of bottled pickled herring fillet, patted dry",
            "24 drained bottled capers"
        ],
        "title": "Pickled Herring Canapes",
        "picture_link": null
    },
    "YdWqRNi.LQmX17rQ/OA6E5RRE7ae7/a": {
        "instructions": "Preheat the oven to 350 degrees. Use 2 tablespoons of the butter to grease a 2 1/2-inch deep 10-inch baking dish and set aside.\nPlace 2 cups of corn kernels in the bowl of a food processor along with the eggs, cream, milk, flour, salt, pepper, and sugar and process for 10 seconds. Transfer the puree to a bowl; fold in the remaining corn kernels and thyme and pour the pudding into the buttered baking dish.\nPlace the baking dish in a roasting pan and add very hot water to reach halfway up the sides of the dish. Dot the top of the pudding with the remaining butter, place in the oven and bake for 1 hour, or until the pudding is firm but still quivering.",
        "ingredients": [
            "4 tablespoons sweet butter",
            "4 cups freshly shucked corn kernels",
            "6 eggs",
            "1 cup heavy cream",
            "1 cup milk",
            "1/2 cup all-purpose flour",
            "1 teaspoon salt",
            "Freshly ground black pepper",
            "2 tablespoons sugar",
            "2 teaspoons freshly chopped thyme"
        ],
        "title": "Corn Pudding",
        "picture_link": null
    },
    "mEDQbeosi85L7I/F6dD5Ps5je1ZTLOC": {
        "instructions": "Place all ingredients in salad bowl. Toss gently, season with salt and pepper, cover and refrigerate for 1 hour. Serve in a family style bowl.",
        "ingredients": [
            "3 cups canned sliced beets, drained",
            "1 red onion, sliced julienne",
            "1/4 cup chopped fresh parsley leaves",
            "1/4 cup red wine vinegar",
            "1/4 salad or grapeseed oil",
            "Salt and pepper"
        ],
        "title": "Beet Root Salad",
        "picture_link": "vpwezuaxmuMwfr8jK8oSY5w4AWw5vpm"
    },
    "O2PldRUfnW.fTADISuw6cGsoZ/zTtvq": {
        "instructions": "In a carafe, combine the prosecco and peach puree.\nDivide the frozen diced peaches and cherry liqueur among 6 Champagne glasses. Top with the prosecco mixture and garnish with fresh peach slices.",
        "ingredients": [
            "1 bottle prosecco",
            "4 ounces peach puree",
            "1 cup diced fresh peaches (about 4 peaches), frozen, plus 6 fresh peach slices",
            "2 ounces cherry liqueur, such as Cherry Heering"
        ],
        "title": "Frozen Peach Bellini",
        "picture_link": "36B/QofC5Y6GzR0iHMA4U7NgLPOI7k2"
    },
    "zbBd/ZnPEBL9Cb4e5vH8qh9.Z1NxWrW": {
        "instructions": "Bring a large pot of salted water to a boil over high heat.\nHeat a large skillet over medium-low heat. Add the olive oil, garlic, shallots and salt. Cook, stirring often, until the shallots are beginning to turn golden, 5 to 6 minutes. Add the chile flakes and cook an additional 2 minutes.\nAdd the ravioletti to the boiling water and cook for 7 minutes, or 2 minutes less than package instructions.\nMeanwhile, add the wine to the pan with the shallot mixture and reduce by half, about 2 minutes. Stir in the tomato puree and cream and simmer for 5 minutes, stirring occasionally. Using a slotted spoon or spider, remove the ravioletti from the water and add them straight to the skillet. Before stirring, sprinkle with 3/4 cup of the Parmesan. Stir the ravioletti into the sauce.\nTop with the basil and the remaining 1/4 cup Parmesan before serving.",
        "ingredients": [
            "3 tablespoons extra-virgin olive oil",
            "2 cloves garlic, peeled and smashed",
            "2 shallots, chopped",
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon chile flakes",
            "One 13-ounce package cheese ravioletti",
            "1/2 cup dry white wine, such as pinot grigio",
            "1 cup tomato puree, such as Mutti",
            "1/3 cup heavy cream, room temperature",
            "1 cup freshly grated Parmesan",
            "1/2 cup fresh basil, chopped"
        ],
        "title": "Cheese Ravioletti in Pink Sauce",
        "picture_link": "gpCZ8DsQTu2SIq5aEVjeozaDqQBjsL6"
    },
    "8RJVc35Bn51YwfLerpdHO2ZaWSst09C": {
        "instructions": "Place the ice cubes in a highball glass. Add the Campari, orange juice, and sparkling water. Add a slice of fresh orange and serve ice cold.",
        "ingredients": [
            "6 ice cubes",
            "1/4 cup Campari",
            "1/2 cup freshly squeezed orange juice",
            "1 1/2 cups sparkling water (recommended: San Pelligrino)",
            "Orange slice, halved"
        ],
        "title": "Campari Orange Spritzer",
        "picture_link": "czs4OVDPjD3BKyaaQsGeqixy2Gk7RZe"
    },
    ".9rKCMuSXioaS3bXLWD1uz/pWvJ4q76": {
        "instructions": "Preheat oven to 350 degrees F.\nBake the mushrooms for 10 minutes after seasoned with salt, pepper and a dab of butter, reserve. Cook the bacon with sliced shallots until the bacon is crispy, reserve. Spread the potatoes in the bottom of a casserole dish. Add salt, pepper, and thyme. Add the cubed tuna. Add the bacon and shallots and blanched green beans. Add the mushrooms. Sprinkle parsley and bread crumbs over dish. Mix heavy cream and egg yolks until well blended and add. Top with crushed potato chips. Bake for 45 minutes.",
        "ingredients": [
            "2 large portobellos",
            "Salt and pepper",
            "Dab of butter",
            "1 cup bacon, and Sauteed crispy and diced",
            "1/2 cup sliced shallots",
            "1 cup thinly sliced red bliss potatoes",
            "Fresh thyme",
            "1 1/2 pounds cubed yellowfin tuna",
            "1 cup sliced and blanched green beans",
            "1/2 cup parsley",
            "1 cup bread crumbs",
            "2 cups heavy cream",
            "3 egg yolks",
            "1/2 cup crushed potato chips"
        ],
        "title": "Updated Tuna Casserole II",
        "picture_link": null
    },
    "Mq1a.de1VlIfedP/hZ8pB5YISmuJw8a": {
        "instructions": "Dissolve yeast and 2 tablespoons of sugar in milk, and let sit for 10 minutes. Sift flour, place on a board, and make a well. Add the yeast, yolks, salt, remaining sugar, and cinnamon. Kneed well until elastic. Cover and let rise over night. Next day roll dough into 1/8 inches. Cut out with a glass into round about 2 inches in diameter. Cover and let rise 15 minutes or more. With your hand, form a pouch and fill with 1/2 teaspoon of preserves and seal completely. Heat oil to 375 degrees and fry until golden brown. Roll in granulated sugar before serving.",
        "ingredients": [
            "2 tablespoons yeast, dry active",
            "4 tablespoons granulated sugar",
            "3/4 cup whole milk, warm",
            "2 cups flour",
            "2 large eggs, yolks only",
            "Pinch salt",
            "1 teaspoon cinnamon",
            "1 1/2 tablespoons softened butter",
            "2 cups plum preserves",
            "Oil, for frying"
        ],
        "title": "Jelly Donuts",
        "picture_link": null
    },
    "MhgSYi5JMOKa90JsDHn9YlLvaS5sozi": {
        "instructions": "For the Calabaza Fritters: Combine dry ingredients. Add egg and seltzer. Fold in onion and calabaza. Fry at 350 degrees F until golden.\nFor the Mango-Sour Orange Sauce: Stir all ingredients together and serve as a dipping sauce.",
        "ingredients": [
            "1 cup flour",
            "1 tablespoon curry powder",
            "2 teaspoons baking powder",
            "1 teaspoon salt",
            "1 egg, beaten",
            "1/2 cup seltzer",
            "1/2 finely chopped Spanish onion",
            "1 cup diced calabaza, blanched",
            "Oil, for frying",
            "1 mango, flesh pureed",
            "1 tablespoon minced garlic",
            "1/4 cup finely chopped red onion",
            "1 jalapeno, minced",
            "1 sour orange, juiced or 1 lime, juiced",
            "Salt, to taste",
            "Black pepper, to taste"
        ],
        "title": "Calabaza Fritters with Mango-Sour Orange Sauce",
        "picture_link": null
    },
    "y92bybQBpHjbMnywWzVdfzUmvVP8qc2": {
        "instructions": "Watch how to make this recipe.\nFill a food processor with ice. Process until the ice is very fine, like snow. Add the mangoes and strawberries and pulse to blend. Pile the crushed ice into dessert glasses or dishes and squeeze over the lime juice. Garnish with lime wedges; serve immediately.",
        "ingredients": [
            "Ice",
            "2 mangoes, peeled and chopped",
            "1 pint strawberries, hulled and sliced",
            "1 lime juiced, plus wedges for garnish"
        ],
        "title": "Mango Strawberry Snow Cones",
        "picture_link": "XJvFShh/F5/zH3ZN.H0k8xPagYOgcPW"
    },
    "WOB2vjmUQLEEBWgVkyH/FSj.TRfL2DG": {
        "instructions": "Mix pineapple juice, white parts of scallions, ginger, soy sauce, sesame oil, brown sugar, pepper and salt in large, resealable bag. Add chops, seal bag and refrigerate for 2 to 10 hr. Remove chops from marinade and pat off excess marinade with paper towels. Discard remaining marinade.\nPrepare a medium-hot fire in grill. Brush grill grate clean and lightly oil grate. Grill chops directly over heat, 8 to 10 min., turning once, until internal temperature on a thermometer reads 145 degrees F, followed by a 3-min. rest.",
        "ingredients": [
            "4 bone-in pork loin chops, cut 3/4-in. thick",
            "2 cans (6 oz. each) unsweetened pineapple juice (1 1/2 c.)",
            "3 scallions, white parts sliced into thin rounds",
            "3 tbsp. peeled and minced ginger",
            "3 tbsp. reduced-sodium soy sauce",
            "2 tbsp. Asian dark sesame oil",
            "2 tbsp. light brown sugar",
            "3/4 tsp. freshly ground black pepper",
            "1/2 tsp. coarse salt"
        ],
        "title": "Grilled Bone-in Pork Chops with Hawaiian Marinade",
        "picture_link": "7oMSpWZgHosEZiGBDsXk26sM.BOLEVO"
    },
    "Su2A1MXZ.HhTWIkbqspe7WO5fyAfRGS": {
        "instructions": "For the wings: Marinate the wings overnight in the refrigerator in the hot sauce, peanut oil and pureed chiles and garlic. Pour enough peanut oil in a large frying pan to float the wings in. Heat to 350 degrees F. Deep fry the wings for 15 minutes. Mix the Sriracha and Jamaican jerk seasoning to taste to make a sauce. Toss the wings in the sauce.\nFor the blue cheese sauce: Cream the Roquefort cheese with the mayonnaise and mix in peppers. Season with salt and pepper. Serve with the wings.",
        "ingredients": [
            "16 jumbo wangs (chicken wings)",
            "1/4 cup hot sauce of your choice",
            "1/4 cup peanut oil, plus more for frying",
            "6 dried ghost chile peppers, boiled and then pureed",
            "3 fresh habaneros, pureed",
            "3 cloves garlic, pureed",
            "Sriracha sauce",
            "Jamaican seasoning (ground scotch bonnet peppers, paprika, coriander, cinnamon)",
            "8 ounces Roquefort cheese",
            "4 cups mayonnaise",
            "4 dried chipotle peppers, reconstituted and pureed",
            "4 fresh ghost chile peppers, pureed",
            "Salt and freshly ground black pepper"
        ],
        "title": "Wangs 'n' Heat",
        "picture_link": "S2lkkguzhmhSA1y9q4WJMKTZm.CI/Xm"
    },
    "qzePriVXoptZXmqqu4lXDtAgSE97Z8m": {
        "instructions": "Combine half of dry ingredients into a food processor. Add half of butter pieces into mixture and pulse until it resembles coarse meal. Turn out into a bowl. Rpeat with remaining half of ingredients. Add ice water to bowl with dough. Press together and divide corn crust into 2 equal parts. One will be used for this pie, and the other refrigerate for future use. Press 3/4 of crust into a pie dish and refrigerate for 20 minutes. Rest of crust will be for crumbling on top of pie later.;\nCombine all of the ingredients for the filling, except butter, and pour into pie crust. Crumble rest of crust mixture over the top and dot with unsalted butter. Bake in a preheated oven at 375 degrees for 35 to 50 minutes, until top is golden and bubbling Yield: 10 servings;",
        "ingredients": [
            "3 cups corn flour",
            "2 1/3 cups flour",
            "1/3 cup sugar",
            "2 teaspoons salt",
            "4 sticks unsalted butter, very cold and cut into pieces",
            "3/4 cup cold (iced) water",
            "6 golden delicious apples, peeled, cored, wedged",
            "3/4 cup sugar",
            "1 teaspoon cinnamon",
            "1/2 teaspoon ground ginger",
            "Pinch nutmeg",
            "Pinch cumin",
            "Juice and zest of 1 lemon",
            "1/4 teaspoon salt",
            "1/4 stick unsalted butter"
        ],
        "title": "Chef's Apple Pie",
        "picture_link": null
    },
    "0dJGLnj9.uJ9vp3nimeZPGRgSnvWijC": {
        "instructions": "Heat the blackberries, sugar and 1 tablespoon water in a small pot over medium-high heat. While warming, smash with a potato masher until a thick even consistency is reached, about 8 minutes.\nPour the blackberries through a sieve into a bowl, pushing some flesh through with the juices and making sure to catch the seeds. Cool in the refrigerator for at least 10 minutes.\nFill a cocktail shaker with 2 tablespoons of the blackberry puree, 2 tablespoons of the mint leaves, 2 ounces of gin, 1 tablespoon lime juice and a handful of ice. Shake vigorously 5 to 6 times until the drink is ice cold. Strain the mixture into a tall glass. Top with 6 ounces of ginger ale and stir lightly. Repeat for the remaining 3 servings. Finish and serve with a scoop of sorbet or ice cream in each.",
        "ingredients": [
            "1 pint blackberries",
            "2 tablespoons sugar",
            "1/2 cup roughly chopped fresh mint leaves",
            "8 ounces gin",
            "1/4 cup fresh lime juice",
            "24 ounces ginger ale",
            "1 pint blackberry sorbet or vanilla ice cream"
        ],
        "title": "Sunny's Blackberry Gin Fizz Float",
        "picture_link": null
    },
    "dACFu2tjijILhj1Y1Nvk0uBRH5l8yf.": {
        "instructions": "Place round cake in the center of sheet cake. Place 4 cupcakes on the top of the layer cake so that they touch in the center; then add 1 more cupcake on top of the 4 cupcakes. Place the 4 remaining cupcakes on the corners of the sheet cake. Decorate with cookies around cakes pressing gently into frosting and/or inserted into the cupcakes.",
        "ingredients": [
            "1 bakery-bought half-sheet cake, frosted yellow",
            "1 bakery-bought 8-inch round single or layer cake, frosted white",
            "9 bakery-bought cupcakes with white and yellow frosting",
            "12 daffodil decorated cookies",
            "2 tubes writing frosting"
        ],
        "title": "No-Bake Daffodil Cake",
        "picture_link": "3PgXVdaKN/nzhCbZfjurghWTGEo2m4m"
    },
    "yBbf8UbF788qFVPFpW92lC32XvbKiZ6": {
        "instructions": "Mix the cucumber, yogurt, cilantro, 1/2 teaspoon salt, and pepper to taste in a bowl. Set aside while you make the burgers.\nCombine the beef, onion, garlic, curry powder, 1/2 teaspoon salt and 1/8 teaspoon pepper in a bowl and mix with your hands until just combined. Form into four 4-inch-wide patties, about 1/2 inch thick.\nHeat the olive oil in a large cast-iron skillet over medium-high heat. Add the burger patties and cook, turning once, until cooked through, 7 to 8 minutes for medium.\nPlace the burgers on the buns. Stir the cucumber-yogurt mixture and spoon on top. Serve the burgers with sweet potato chips and pickled okra.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "1/2 seedless cucumber, peeled and finely chopped",
            "1/2 cup low-fat plain Greek yogurt",
            "1 tablespoon chopped fresh cilantro",
            "Kosher salt and freshly ground pepper",
            "1 1/4 pounds 90 percent lean ground beef",
            "1/4 cup finely chopped red onion",
            "1 clove garlic, finely grated",
            "1 1/2 teaspoons red or yellow curry powder",
            "1 tablespoon extra-virgin olive oil",
            "4 hamburger buns, split, toasted",
            "Sweet potato chips, for serving (optional)",
            "Pickled okra or other pickled vegetables, for serving (optional)"
        ],
        "title": "Spiced Burgers With Cucumber Yogurt",
        "picture_link": "d2BW.McYIFog4huCI9w27IPMx5mJ7E6"
    },
    "0NCd/bOpDF/U5M.jZxFWI1fGiz5l45W": {
        "instructions": "Stuff each peppadew pepper with crumbles of BelGioioso Gorgonzola. Toss the spinach with the olive oil and balsamic vinegar. Serve stuffed peppadews on a bed of dressed spinach leaves. Serve as an appetizer.",
        "ingredients": [
            "16 peppadew peppers, marinated",
            "8 oz. BelGioioso Crumbled Gorgonzola cheese",
            "2 cups fresh baby spinach leaves",
            "1/4 cup extra virgin olive oil",
            "1 Tbsp. balsamic vinegar"
        ],
        "title": "Gorgonzola Stuffed Peppadews",
        "picture_link": null
    },
    "IpBiyWKrf2KQ3nS1otWRGW7upAwlw/a": {
        "instructions": "For the mayo: Mix the hot sauce, relish, sugar, ginger and red pepper flakes in large bowl until the sugar dissolves. Once dissolved, add the mayonnaise.\nFor the poblanos: Halve the poblanos lengthwise. Core and remove the seeds, keeping the stems in place for presentation. Heat the oil in a deep-fryer to 350 degrees F. Fry the peppers in the hot oil for 2 minutes. Remove from the oil, drain and cool to remove the skin.\nMix the crab meat, mayonnaise, Cheddar, onions, hot sauce in a large mixing bowl. Season with the seafood seasoning and black pepper. Divide the crab mixture evenly and fill the poblanos. Place on a baking sheet and sprinkle with panko. Broil until golden brown, 3 to 5 minutes.\nTo serve, place small amount of Jamaican mayo on top of the peppers.",
        "ingredients": [
            "1 tablespoon hot sauce",
            "1 tablespoon Jamaican relish",
            "1 tablespoon sugar",
            "1/4 teaspoon ground ginger",
            "Pinch red pepper flakes",
            "3/4 cup mayonnaise",
            "4 poblano peppers",
            "4 cups canola oil",
            "1 pound fresh crab meat",
            "1 cup mayonnaise",
            "1/2 cup shredded Cheddar",
            "3 tablespoons diced red onion",
            "1 tablespoon hot sauce",
            "Seafood seasoning, as needed (recommended: Old Bay)",
            "Freshly ground black pepper",
            "Panko"
        ],
        "title": "Crab Stuffed Poblanos with Jamaican Mayonnaise",
        "picture_link": null
    },
    "waCcyM1VQxFBLlpW./xHm4ZP18/Zioe": {
        "instructions": "In a food processor, chop first four ingredients. To this mixture, add olive oil, cheese, salt and pepper. Mix and serve.",
        "ingredients": [
            "1 1/2 to 2 cups basil leaves",
            "1 1/2 to 2 cups collard greens",
            "3 cloves garlic",
            "2 ounces parsley",
            "3/4 cup olive oil",
            "1 cup grated Italian cheese",
            "Salt and pepper to taste"
        ],
        "title": "Pesto with a Southern Bite",
        "picture_link": null
    },
    "VKTM4tjhujZcuVNBtCF8c6MIS2ybk.S": {
        "instructions": "Add all ingredients, except coconut flakes and honey, in a cocktail shaker with ice. Pour honey onto a plate. Lay out coconut on a plate. Dip the rims of chilled glasses into honey and roll in coconut. Shake and pour into chilled martini glasses to serve.\nNote: For a non-alcoholic version, omit the vodka and the banana Schnapps and substitute the ice with 1 banana. Puree the mixture in a blender.",
        "ingredients": [
            "2 parts pineapple-coconut juice (recommended: Kern's)",
            "1 splash bottled lime juice (recommended: Rose's)",
            "1 part vanilla vodka",
            "1/2 part half-and-half",
            "1/2 part banana Schnapps",
            "Ice cubes",
            "1/4 cup honey",
            "1/4 cup sweetened coconut flakes (recommended: Baker's)"
        ],
        "title": "Put the Lime in the Coconut",
        "picture_link": "Gn1YQA2/BumyU2rTkMiMGBZPAvjWWzO"
    },
    ".cyP7uJMkEkpa2FTPOzRl6VZDfpXGPW": {
        "instructions": "Heat oil in a large deep frying pan adding chopped onions and fry for 4 to 5 minutes on a medium heat or once the onions are slightly brown. Add the garlic and ginger and cook for a further 1 or 2 minutes. Add the tomatoes, salt, chili powder, green chili, ground cumin and turmeric.\nTurn up the heat and further cook for another 1 minute then put in the chicken. It is very crucial that spices are mixed within the pan at this point to ensure that the chicken cooks with texture and flavor. Add water after stirring the chicken into the spices.\nTurn down the heat slightly and stir in the garam masala and fenugreek and cook for a further 5 minutes, also adding in the bell pepper stirring now and again. Serve sprinkled with green coriander.",
        "ingredients": [
            "6 tablespoons vegetable oil",
            "1 onion, chopped",
            "2 cloves garlic, chopped",
            "1 teaspoon ginger, julienne",
            "2 to 3 fresh tomatoes, diced",
            "1 teaspoon salt",
            "1/2 teaspoon chili powder",
            "1 green chili, finely chopped",
            "1 teaspoon ground cumin",
            "1 teaspoon turmeric",
            "1 pound chicken, cooked",
            "1 cup water",
            "1 1/2 teaspoons garam masala",
            "1/2 teaspoon dried fenugreek",
            "1/2 green bell pepper, chopped",
            "1 tablespoon finely chopped green coriander"
        ],
        "title": "Chicken Karahi",
        "picture_link": null
    },
    "nqkiDPh9xr2sJTuJxC0rTSeOR/R3Js.": {
        "instructions": "Pat dry the potatoes and onions.\nIn a large, nonstick skillet set over moderate heat, heat 2 tablespoons of the oil until hot. Add the potatoes and salt and pepper and cook, stirring, for 1 minute. Add the onion and cook, stirring occasionally, until golden brown and just tender. Transfer to a plate.\nIn a bowl, combine the eggs, Locatelli-Romano, and salt and pepper. Add the vegetable mixture and gently stir to combine.\nAdd 1 to 2 tablespoons of oil to the skillet and heat it over moderate heat until hot. Add the vegetable and egg mixture and cook it over moderately low heat until golden brown and set on the underside. Invert a plate over the skillet and flip the frittata onto the plate.\nAdd another tablespoon of oil to the skillet and slide the frittata back in, uncooked side down. Cook until completely set.\nTransfer to a plate and cut into wedges. Sprinkle with parsley.",
        "ingredients": [
            "3 large red potatoes, peeled and cut into 1/2-inch cubes",
            "1 cup diced onion",
            "Salt and freshly ground black pepper",
            "4 to 5 tablespoons olive oil, or to taste",
            "6 large eggs",
            "2 to 3 tablespoons freshly grated Locatelli-Romano",
            "Minced fresh parsley leaves"
        ],
        "title": "Potato Frittata",
        "picture_link": "Z/RaZyKxr95XmgBPYg5xyZEtQfs5BP."
    },
    "sPWxiZw9a73vmbPeR8mHsOzM22H1Aom": {
        "instructions": "Preheat the oven to 350 degrees F. Grease a 9 by 13-inch casserole dish.\nSlowly bring the half-and-half, 2 tablespoons butter and salt to a boil. Slowly whisk in the grits, stirring constantly for several minutes. Add all the cheeses and allow to melt. Temper the eggs into the grits and stir together. Pour into casserole dish and bake for 25 to 35 minutes. Top with additional grated cheese if desired.",
        "ingredients": [
            "4 cups half-and-half",
            "4 tablespoons butter",
            "2 teaspoons salt",
            "1 cup quick-cook grits",
            "8 ounces grated Cheddar, plus more for garnish, optional",
            "8 ounces grated Monterey Jack cheese, plus more for garnish, optional",
            "4 ounces cream cheese",
            "2 eggs"
        ],
        "title": "Plantation Grits",
        "picture_link": "tyydZS6aFtloa0Og7bnVGBbeHalshC."
    },
    "uHXXnCoYtCbLBSUhOC4/9mN0G/1YtBG": {
        "instructions": "In a large skillet heat 1 tablespoon oil over medium high heat. Stir in corn, mushrooms, scallions, and bell pepper. Cook for 3-4 minutes. Add garlic, cumin and cayenne and cook for 30 seconds. Remove from heat and stir in spinach. Add carrot and potato and stir to combine. Add egg white and season with salt and pepper. Stir in enough bread crumbs so that the mixture holds together. Shape mixture into 6 disks and place on a plate. Chill for 1 hour.\nHeat 2 tablespoons olive oil in non-stick skillet and cook veggie burgers until golden on each side. In a small bowl mix together yogurt and mint",
        "ingredients": [
            "3 tablespoons olive oil",
            "3/4 cup fresh corn kernels or frozen, thawed",
            "6 mushrooms, finely chopped",
            "2 scallions, finely chopped",
            "1/2 red bell pepper, finely chopped",
            "1 clove garlic, finely chopped",
            "1 teaspoon cumin",
            "Dash cayenne pepper",
            "1/2 cup chopped fresh spinach",
            "1 carrot, peeled and grated",
            "1 small potato, peeled and grated",
            "1 egg white",
            "Salt and pepper",
            "1/2 cup fresh bread crumbs",
            "1 cup plain yogurt",
            "2 tablespoons chopped fresh mint"
        ],
        "title": "Veggie Burger",
        "picture_link": null
    },
    "LQoRdojD9cBaRX3iwQ99JjpS0RjRqFK": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 425 degrees F.\nIf the parsnips and carrots are very thick, cut them in half lengthwise. Slice each diagonally in 1-inch-thick slices. The vegetables will shrink while cooking, so don't make the pieces too small. Place the cut vegetables on a sheet pan. Add the olive oil, salt, and pepper and toss well. Roast for 20 to 40 minutes, depending on the size of the vegetables, tossing occasionally, until the parsnips and carrots are just tender. Sprinkle with dill and serve hot.",
        "ingredients": [
            "2 pounds parsnips, peeled",
            "1 pound carrots, unpeeled",
            "3 tablespoons good olive oil",
            "1 tablespoon kosher salt",
            "1 1/2 teaspoons freshly ground black pepper",
            "2 tablespoons minced fresh dill or parsley"
        ],
        "title": "Roasted Parsnips and Carrots",
        "picture_link": "TCT2glJ8OokL4z.s2LWt/f5FMrCzUbS"
    },
    "8ef15S2bxUy3s/n5Vvgni8N7MnQXWGu": {
        "instructions": "In a large bowl, combine Peanut Butter, confectioners' sugar, graham cracker crumbs, and butter. Mash together until combined. Form the mixture into balls. Transfer to the refrigerator until hardened, about 30 minutes. Dip the peanut butter balls into the melted chocolate and set inside mini paper cupcake forms. Let the chocolate set before serving.\nIn the bowl of a food processor, grind the peanuts until smooth. With the motor of the food processor running, add peanut oil if necessary, and puree until the peanuts are the consistency of peanut butter.",
        "ingredients": [
            "18 ounces Peanut Butter, recipe follows",
            "One 16-ounce box confectioners' sugar",
            "1 1/3 cups graham cracker crumbs",
            "3/4 cup (1 1/2 sticks) unsalted butter, softened",
            "12 ounces milk chocolate, melted",
            "3 cups peanuts, shelled, unsalted and dry roasted",
            "Peanut oil, if necessary"
        ],
        "title": "Peanut Butter Balls",
        "picture_link": "9DDxLjn1zKf/9Z0mUNzXcLdVW21JlbO"
    },
    "Wn2.3Fso1PwYGRVloVvy42Ya4v1Xk4y": {
        "instructions": "Preheat the oven to 350 degrees F. Spread the french fries on a baking sheet and bake until golden and warmed through, about 10 minutes.\nPut the garlic, almonds and olive oil in a food processor and pulse until finely ground. Add the french fries, lemon juice, 1 1/4 cups water and 1/2 teaspoon salt and pulse until almost smooth. Season with salt and pepper. Transfer to a bowl and drizzle with olive oil. Serve with pita chips and/or vegetables.\nPhotograph by Charles Masters",
        "ingredients": [
            "4 cups frozen curly french fries (about 12 ounces)",
            "6 to 8 cloves garlic, chopped",
            "1/4 cup blanched almonds",
            "3/4 cup extra-virgin olive oil, plus more for drizzling",
            "2 tablespoons fresh lemon juice",
            "Kosher salt and freshly ground pepper",
            "Pita chips and/or vegetable sticks, for dipping"
        ],
        "title": "French Fry Skordalia",
        "picture_link": "ZI3lLzvKk.7a7EBMFQbKQTn/KbzXGxK"
    },
    "cx.Fe83iZLF6FYciLrrRBbTHHxza3vS": {
        "instructions": "Bring water to a boil and cook pasta until almost completely cooked; add corn and boil for another minute or so to heat through.\nMeanwhile, in a bowl combine ham and salsa. When pasta and corn are done, drain and pat dry and toss with ham and salsa. Toss to combine and serve with grated cheese or other toppings.",
        "ingredients": [
            "8 ounces Fusilli",
            "10 to 11 ounce jar salsa, hot, medium, or mild (to taste)",
            "10 ounce package thawed frozen corn",
            "4 ounce black forest or other smoked ham, cut into thin strips",
            "Optional toppings: grated sharp cheddar cheese, sour cream, jalapeno peppers, cilantro"
        ],
        "title": "Pantry Pasta Tex Mex Style",
        "picture_link": null
    },
    "IRe45l9nrv6DnY13WSqwarGuEVxaZh6": {
        "instructions": "Preheat oven to 350 degrees. Make several slashes along the surface of the pork butt. Rub with salt, then liquid smoke. Prepare ti leaves by removing the rib. Lay out a large piece of heavy-duty aluminum foil, and place 4 ti leaves on top. Place pork on leaves and wrap them around the pork. Cover with remaining leaves in the opposite direction until pork is completely wrapped. Wrap the foil tightly around the pork to make a watertight seal.\nPlace package in a large roasting pan. Fill with two inches of water and cover pan tightly with foil. Bake at 350 degrees for 1 hour. Lower temperature to 325 degrees F and cook for 3-3 1/2 hours or until tender. Unwrap pork from package and shred before serving.",
        "ingredients": [
            "4-5 lb pork butt",
            "3 tablespoons Hawaiian salt or kosher salt",
            "2 tablespoons liquid smoke",
            "8 ti leaves (or 2-3 banana leaves)"
        ],
        "title": "Oven Kalua Pork",
        "picture_link": null
    },
    "FA6ehInR1e3Me7G0g..vDczTo5zjod2": {
        "instructions": "Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs, adding the snap peas during the last 2 minutes of cooking. Reserve 1 cup of the cooking water, then drain.\nMeanwhile, heat 2 tablespoons butter in a large skillet over medium-high heat. Add the shallot and cook, stirring, until slightly softened, about 2 minutes. Add the salmon; season with 3/4 teaspoon salt and a few grinds of pepper. Cook, turning once, until the salmon is just cooked through, about 3 minutes. Transfer to a plate.\nAdd the pasta and snap peas to the skillet along with 1/2 cup of the reserved pasta cooking water, the remaining 2 tablespoons butter, the herbs and lemon juice. Cook, tossing and adding more of the reserved cooking water if necessary, until the pasta is coated, about 1 more minute. Season with salt and pepper. Top with the salmon.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "Kosher salt",
            "12 ounces fettuccine",
            "8 ounces snap peas, strings removed, cut into thirds",
            "4 tablespoons unsalted butter",
            "1 shallot, thinly sliced",
            "1 12-ounce skinless wild salmon fillet, cut into 2-inch pieces",
            "Freshly ground pepper",
            "1/4 cup chopped mixed herbs (such as dill, parsley and/or chives)",
            "Juice of 1/2 lemon"
        ],
        "title": "Fettuccine with Salmon and Snap Peas",
        "picture_link": "OR0cC2/SQlgojJz//n8XpUVphfPUuIi"
    },
    "Dwq6uHMCLq9r4Jta0Ll8ZOsJoREnhvq": {
        "instructions": "In a large bowl, whisk together vinegar, honey and mustard. Whisk in olive oil in a stream and season to taste. Gently toss sweet potato slices and scallions with vinaigrette.",
        "ingredients": [
            "2 tablespoons white wine vinegar",
            "1 teaspoon honey",
            "1 tablespoon dijon mustard",
            "1/3 cup olive oil",
            "Salt and pepper",
            "2 roasted sweet potatoes, peeled and 1/2 slices",
            "2 sliced scallions"
        ],
        "title": "Sweet Potato Vinaigrette",
        "picture_link": null
    },
    "3GB/b/Xxld4R95O2YTZ3nLZ58kZYoYO": {
        "instructions": "In three separate pans, heat 1/4 cup of olive oil. Sear veal, pork, lamb. Combine in one pan. Deglaze the other two pans with red wine and combine with meats. Add all of the remaining ingredients (dry and liquid), stir well, let all simmer on low heat, covered, for 2 hours. Stir occasionally, and serve over grilled fennel.",
        "ingredients": [
            "3/4 cup olive oil",
            "1/2 pound veal, cut into 1-inch squares",
            "1/2 pound pork, cut into 1-inch squares",
            "1/2 pound lamb, cut into 1-inch squares",
            "4 rosemary leaves",
            "1/2 tablespoons oregano",
            "1/4 tablespoons dry basil",
            "1/4 teaspoon dry fennel",
            "1/4 teaspoon powdered cumin",
            "1/4 teaspoon red pepper flakes",
            "1 can diced tomatoes",
            "1/2 cup red wine",
            "1/2 cup brandy",
            "1/2 cup orange juice",
            "1/2 lemon (juice and peel)",
            "Salt and pepper",
            "1 pound fennel"
        ],
        "title": "D'Abrigini",
        "picture_link": null
    },
    "Gbl97iZusu7r9zHe.ErUzMk4itO5Luq": {
        "instructions": "Preheat oven to 450 degrees F. If you have a baking stone, preheat it now.\nUsing a minimum amount of flour to keep the dough from sticking roll out the pizza dough, getting it as thin as you can. You can make the dough into either a rectangle or a round.\nPlace the dough on a slightly oiled baking sheet or on a pizza peel if you are using baking stone.\nWhisk together the fromage blanc, creme fraiche, egg yolk, and seasonings and spread this mix thinly over the dough leaving a 1/2-inch border around the edges. Sprinkle the onions and bacon over the tart and slide directly into the oven.\nBake for approximately 5 minutes or until the dough is fully cooked and golden.\nCheck the underside of the tart. Slice and serve very hot.",
        "ingredients": [
            "8 ounces basic pizza dough",
            "1/4 cup fromage blanc or quark",
            "1/4 cup creme fraiche",
            "1 egg yolk",
            "1 teaspoon salt",
            "Pinch white pepper",
            "Pinch nutmeg",
            "2 ounces white onion, thinly sliced and blanched in boiling water",
            "2 ounces smoked bacon, cut into fine slivers"
        ],
        "title": "Tarte Flambee",
        "picture_link": null
    },
    "F9yn4DMpHBn8JnP1L0jsZrfcwdJO0.i": {
        "instructions": "Heat butter in a large saucepan over medium-high heat. Add onions and garlic and cook until soft. Add remaining ingredients and cook for 15 minutes. Place mixture in a blender and blend until smooth. Return to the saucepan and cook an additional 15 to 20 minutes, or until thickened. Preheat grill. Brush chicken with vegetable oil and season with salt and pepper to taste. Grill chicken for 6 to 7 minutes on each side or until golden brown and cooked through. Remove chicken from the grill and brush with the sauce.",
        "ingredients": [
            "2 tablespoons unsalted butter",
            "1/2 cup finely diced onion",
            "2 cloves garlic, finely diced",
            "6 plum tomatoes, coarsely chopped",
            "1/4 cup ketchup",
            "1/4 cup water",
            "2 tablespoons Dijon mustard",
            "2 tablespoons dark brown sugar",
            "3 tablespoons molasses",
            "2 tablespoons tamarind concentrate",
            "1 teaspoon cayenne",
            "1 tablespoon ancho chile powder",
            "1 tablespoon paprika",
            "1 tablespoon Worcestershire sauce",
            "4 bone in chicken breasts",
            "4 chicken thighs",
            "Vegetable oil",
            "Salt and freshly ground pepper to taste"
        ],
        "title": "Fire Roasted Chicken with Tamarind-Molasses Glaze",
        "picture_link": null
    },
    "po4jFT9zls44c.JggoMWBgINtd76Jgu": {
        "instructions": "In a large bowl, finely mash the black beans with a potato masher or your hands. Add the shallots, red pepper flakes, smoked paprika, Worcestershire, hot sauce, cilantro, egg white, flour, salt and pepper. Mix well with a wooden spoon. Form into 4 patties and arrange on a platter.\nIn a large saute pan over medium-high heat, add the oil. Sear patties for 3 to 4 minutes on each side until they have a nice crust. Remove the patties to a paper towel lined platter. Assemble the sandwiches with a patty, some spinach, roasted red peppers and red onion on the multi-grain rolls. Top with a good drizzle of Szechuan Tomato Dressing and serve.\nIn a small bowl, add the Szechuan sauce, tomatoes and cilantro. Whisk in the olive oil and season with salt and pepper, to taste. Use as a dressing for the black bean sandwiches.",
        "ingredients": [
            "2 (15-ounce) cans black beans, drained and rinsed",
            "2 shallots, minced",
            "1 teaspoon red pepper flakes",
            "1 teaspoon smoked paprika",
            "1 teaspoon Worcestershire sauce",
            "1 teaspoon hot sauce",
            "1 teaspoon freshly chopped cilantro leaves",
            "1 egg white, slightly beaten",
            "3 tablespoons whole-wheat flour",
            "1/2 tablespoon kosher salt",
            "1 tablespoon cracked black pepper",
            "3 tablespoons olive oil",
            "Spinach",
            "Sliced roasted red peppers, jarred",
            "Sliced red onion",
            "4 multi-grain rolls",
            "Szechuan Tomato Dressing, recipe follows",
            "1/4 cup Szechuan sauce",
            "1/4 cup chopped sun-dried tomatoes",
            "1 tablespoon freshly chopped cilantro leaves",
            "1/4 cup olive oil",
            "Salt and freshly ground black pepper"
        ],
        "title": "Deluxe Black Bean Burger",
        "picture_link": null
    },
    "SfNEp9my4rAJG8F5R6p2ZLTqh9hC04G": {
        "instructions": "Place the hearts of palm and avocado in a large bowl. Drizzle over lime juice and olive oil. Season with paprika, salt and pepper.;",
        "ingredients": [
            "2 cans hearts of palm or 4 to 6 ounces fresh hearts of palm, cut into 1/2-inch rounds",
            "6 avocados, peeled and cut into 1/2-inch slices",
            "2 limes, juiced",
            "2 tablespoons extra-virgin olive oil",
            "1 teaspoon paprika",
            "Coarse salt and freshly ground black pepper"
        ],
        "title": "Hearts of Palm Salad and Avocado Salad",
        "picture_link": null
    },
    ".62kfDxPj/t3/L3FoM8DXR8otCAdHQK": {
        "instructions": "In a wooden bowl combine the sliced avocado and lime juice and mash the avocado with the back of a spoon. Add the garlic, mustard, vinegar, jalapeno and salt and combine the mixture\nuntil creamy. Add half the olive oil and stir to incorporate.\nAdd the Romaine lettuce leaves and coat them completely. Add the remaining olive oil by pouring in a very patient, slow, steady stream to produce a smooth, creaminess to the salad. Add the anchovies by mixing in evenly the chopped bits. Season with freshly ground black pepper to taste.\nAdd the jack cheese and the grilled tortilla slices and toss the salad again to coat the greens evenly.",
        "ingredients": [
            "1 head Romaine lettuce, cleaned of coarse outer leaves, torn by hand into bite size pieces, and carefully washed and dried",
            "1/2 ripe avocado, peeled, pitted and sliced",
            "1 lime juiced about 2 tablespoons",
            "2 large cloves garlic, peeled and finely chopped",
            "2 tablespoons Dijon mustard",
            "2 tablespoons white wine vinegar",
            "1 fresh jalapeno pepper, seeded, chopped (about 1 tablespoon)",
            "1/4 teaspoon salt",
            "1/2 cup extra virgin olive oil",
            "2ounce can anchovy fillets, drained and finely chopped",
            "Freshly ground pepper to taste",
            "1/4 cup freshly grated Monterey jack cheese",
            "4 flour tortillas, grilled and sliced"
        ],
        "title": "Better and Hotter Tijuana Caesar",
        "picture_link": null
    },
    "a2Xwg./veXViWVZN1RRqcuOOGrwXN/u": {
        "instructions": "For the jam:\nIn a small saucepan, combine the sugar, water, figs, and brandy (or apple juice) over medium heat. Bring to a boil, reduce the heat, and simmer for 5 minutes, stirring occasionally, until the sugar has dissolved.\nRemove the pan from the heat and allow the syrup to cool slightly, about 10 minutes. Pour into a food processor and add the hazelnuts. Blend until smooth and thick.\n*Cook's Note: To toast the hazelnuts: preheat a 350 degree F oven. Arrange the nuts in a single layer on a baking sheet. Bake for 8 to 10 minutes, until lightly toasted. Cool completely before using.",
        "ingredients": [
            "1/2 cup sugar",
            "1/2 cup water",
            "12 dried black mission figs",
            "3 tablespoons brandy or apple juice",
            "1/2 cup hazelnuts, toasted * see Cook's Note"
        ],
        "title": "Fig Jam",
        "picture_link": null
    },
    "vNw8yw78Jcjx0aDoame2GhxWjZUlOpi": {
        "instructions": "Whisk 2 cups flour, 1/4 cup sugar, 3/4 teaspoon baking soda and 1/2 teaspoon kosher salt in a bowl. Work in 2 tablespoons cold diced butter with your fingers. Stir in 1 beaten egg, 3/4 cup buttermilk, 1/4 cup chopped walnuts and 1/2 teaspoon grated lemon zest. Pat into a buttered 8-inch ovenproof skillet using floured hands and score an X in the top. Bake at 375 degrees F until cooked through, 30 to 35 minutes.\nPhotograph by Justin Walker",
        "ingredients": [],
        "title": "Skillet Soda Bread",
        "picture_link": "ArsaPi6QKqE0A/vmFpMPgIi/o/ikBSa"
    },
    "N5Rmd/D.nazvIIl06pEWK8G6agc0yqG": {
        "instructions": "Watch how to make this recipe.\nCombine the blueberries, sugar, rum and vanilla bean seeds in a bowl, let sit at room temperature for 10 minutes. Lightly mash the mixture with a fork and let sit 10 minutes longer.\nPut the milk and the blueberry mixture in a blender and blend until smooth. Add the ice cream and blend until smooth. Divide between 2 tall glasses and serve with a straw. Garnish with a few blueberries.",
        "ingredients": [
            "1 cup ripe blueberries, plus more for garnish",
            "1/4 cup granulated sugar",
            "1/4 cup dark rum",
            "1/2 vanilla bean, seeds scraped",
            "1/4 cup whole milk",
            "11 ounces premium vanilla ice cream (recommended: Haagen Dazs - make sure that it is really well frozen)"
        ],
        "title": "Blueberry-Rum Milkshake",
        "picture_link": "G4zWxy.ramYT4H1oEYffBWsJ5.WSmFi"
    },
    "fAthD1lgJNwXdTag2Z8b4gi1gRni9wa": {
        "instructions": "Combine all ingredients except for the rind in a small saucepot, simmer for 5 minutes. Add rind, let steep for 5 minutes. Pour into a bowl and cool over an ice bath.;\nIn a small sauce pan heat the vinegar and add the mint sprigs. Reduce by half. Add the remaining ingredients, except the oil and cool. Remove the mint sprigs.When cool whisk in the oil.;\nToss the watermelon and rum together, set aside. Toss the crab in half of the vinaigrette. Toss the greens and radishes in 1/3 to 1/2 of the vinaigrette. Place the greens and watermelon on the plate, sprinkle with pickled watermelon rind, and top with the crabmeat.\nThis recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
        "ingredients": [
            "1 1/2 cups apple cider vinegar",
            "1/2 cup sugar",
            "1 star anise",
            "1 teaspoon coriander leaves",
            "1 teaspoon fennel seeds",
            "1 teaspoon cloves",
            "1 teaspoon black peppercorns",
            "1 teaspoon pink peppercorns",
            "1 teaspoon salt",
            "1/2 stick cinnamon",
            "Pinch red pepper flakes",
            "1/2 cup small diced watermelon rind",
            "1/2 cup white balsamic vinegar",
            "3 sprigs mint",
            "2 tablespoons shallot, minced",
            "1 teaspoon freshly chopped mint leaves",
            "1 teaspoon freshly chopped cilantro leaves",
            "Salt and freshly ground black pepper",
            "1/4 cup grapeseed oil",
            "1 small watermelon rind peeled, flesh cut into medium dice",
            "1/4 cup rum (recommended: Sailor Jerry)",
            "6 ounces jumbo lump blue crabmeat",
            "3/4 pounds mizuna",
            "3 radishes, shaved"
        ],
        "title": "Watermelon and Crab Salad",
        "picture_link": null
    },
    "akYChgwKeK4I70i6rhYsOWKSKIhX9om": {
        "instructions": "Serving suggestions: sour cream and shredded iceberg or Romaine lettuce\nCombine the cheeses in a small bowl. Using a paring knife, make an incision the length of each jalapeno (don't cut the peppers in half). Remove the seeds then carefully fill each pepper with cheese. Dip the stuffed peppers in buttermilk then roll them in flour. (If you prefer a thicker crust, repeat the process.)\nFill a large frying pan with about 3 inches of oil and heat over medium-high until a thermometer registers a temperature of 350 degrees F. (The oil temperature can also be tested by dripping a little water into the oil. If the oil sizzles immediately, the oil is hot enough.)\nWorking in batches, fry the peppers, turning them once or twice, until they are crisp and golden. Drain the peppers on paper towels. Let them cool for about 10 minutes then serve them on a bed of shredded lettuce topped with sour cream.",
        "ingredients": [
            "1 cup grated Monterey Jack cheese",
            "1 cup, grated extra-sharp yellow Cheddar",
            "1 (16-ounce) can whole pickled jalapenos",
            "2 cups buttermilk",
            "2 to 3 cups all-purpose flour, seasoned with salt and pepper",
            "Canola or peanut oil, for frying"
        ],
        "title": "Fried Pickled Jalapenos",
        "picture_link": "5ONM/hIhmVPa783qJ8efaP3D3bMs3LK"
    },
    "PZloTdSftH3LkSBNRt49WpnD5XhO1sG": {
        "instructions": "Trim away outer layer of fennel, reserving tender stalks and any feathery tops. Quarter bulb lengthwise and cut each quarter lengthwise into very thin slices. Cut reserved stalks crosswise into very thin slices. To make fennel very crisp and slightly curled, soak in ice and cold water to cover water 1 hour, chilled.\nChop reserved fennel tops. In a bowl toss together fennel slices, fennel tops, lemon juice, oil and freshly ground black pepper to taste. Arrange salad on a platter and chill, covered up to 3 hours.\nIf feta is very salty, rinse under cold water and pat dry. Cut feta into 1- x 1/4-inch slices and arrange on top of salad.",
        "ingredients": [
            "3/4 - 1 pound fennel bulb",
            "1/4 cup fresh lemon juice, or to taste",
            "1 1/2 tablespoons extra-virgin olive oil",
            "Freshly ground black pepper",
            "6 - 8 ounces mild feta, drained if necessary, at cool room temperature"
        ],
        "title": "Lemon-Marinated Fennel with Feta",
        "picture_link": null
    },
    "jd3KlrUwAOK.HfBVpoAtIFTRwXTBlt6": {
        "instructions": "In a large saucepan, stir together the sugar, corn syrup, water, salt, and glycerin with a wooden spoon. Cook over medium heat, stirring now and then until a candy thermometer reads 255 degrees F. Stir in the butter. Pour the mixture onto a greased flat pan and fold over the edges with a spatula to keep them from hardening.\nWhen the candy is cool enough to handle, brush with lemon juice. Kids grease their hands with butter, take a lump of taffy, and pull and stretch it until it is light and slightly firm. The longer they stretch, pull, and twist the candy, the more air it will have and the closer to beach taffy it will get. The lump can then be cut with scissors into bite-size pieces. When cool, wrap in waxed paper.",
        "ingredients": [
            "1 1/2 cups sugar",
            "3/4 cup light corn syrup",
            "2/3 cup water",
            "3/4 teaspoon salt",
            "1 teaspoon vegetable glycerin (sold at most party or natural food stores)",
            "2 tablespoons butter",
            "2 teaspoons lemon juice"
        ],
        "title": "Taffy Pull",
        "picture_link": null
    },
    "6zkKmu0fh8ybyea/7ZCl.xG1/Bjjnp6": {
        "instructions": "Saute the shrimp in olive oil briefly until they start to color. Add the andouille sausage and tasso. Deglaze the pan with white wine. Let wine reduce until almost completely evaporated. Reduce the heat and slowly whisk in the butter until all incorporated. It is important at this stage not to let the sauce boil or the butter will break out of the sauce. It should also be noted that this sauce can not be reheated or kept warm for very long, therefore, it should be made right before serving. Finish with freshly chopped chives.\nDivide the warm Grits evenly between 2 warm plates. Divide the shrimp evenly over the Grits. Spoon over the sauce, making sure that each plate gets the sausage and ham. Serve immediately.\nBring milk, butter, and salt to boil. Add grits. Reduce heat to low and cook 25 minutes, stirring constantly. Remove from heat and keep warm.",
        "ingredients": [
            "12 extra large shrimp, preferably with heads-on",
            "2 tablespoons olive oil",
            "1/2 cup andouille sausage, small dice",
            "1/2 cup tasso, small dice",
            "2 ounces white wine",
            "4 ounces butter, diced",
            "1 tablespoon fresh chives, chopped finely",
            "Warm Grits, recipe follows",
            "2 cups whole milk",
            "2 ounces unsalted butter",
            "1 tablespoon salt, to taste",
            "1/2 cup stone-milled grits"
        ],
        "title": "Sauteed Heads-on Gulf Shrimp with Andouille Sausage and Tasso Ham Served Over Creamy Stone-Milled Grits",
        "picture_link": null
    },
    "YOrceVtlDCdCylZxdI1ocQ7MInJASHa": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 400 degrees F. Use a knife to lop the top and bottom off the squash. Slice the skin off the sides, then cut the squash in half lengthwise and remove the seeds. Chop into small pieces. Divide the squash between 2 baking sheets.\nTrim the Brussels sprouts, then cut them in half if desired (or you can leave them whole). Arrange on the baking sheets with the squash. Break the quartered onions apart and add them to the baking sheets.\nDrizzle the vegetables with the olive oil. Season with salt and pepper, sprinkle with the chili powder and toss. Roast 30 to 35 minutes, or until browned.\nTake the vegetables out of the oven and tip into a serving dish. Drizzle with the pomegranate molasses and sprinkle on the pomegranate seeds. Toss and serve immediately.\nPhotograph by Dave Malosh",
        "ingredients": [
            "1 large butternut squash (about 2 1/2 pounds)",
            "2 pounds Brussels sprouts (about 5 cups)",
            "4 red onions, quartered",
            "1/2 cup olive oil",
            "Kosher salt and freshly ground pepper",
            "2 teaspoons chili powder",
            "1/4 cup pomegranate molasses",
            "1 cup pomegranate seeds"
        ],
        "title": "Brussels Sprouts with Butternut Squash and Pomegranate Seeds",
        "picture_link": "CJ4iC6F08i9zpbLSjoVvT3htLR62Ife"
    },
    "QJYl/I1hJ0/zLJ4k4AXLZdMeH6UG.Wa": {
        "instructions": "Watch how to make this recipe.\nFor the buttermilk dressing: Combine the buttermilk, mayo, sour cream, vinegar, hot sauce, garlic and some salt and pepper in a mason jar, screw on the lid and shake to combine.\nFor the salad: Combine the carrots, lettuce, cucumbers and tomatoes in a bowl, pour over the dressing and toss to combine.",
        "ingredients": [
            "1/2 cup buttermilk",
            "1/2 cup mayonnaise",
            "1/2 cup sour cream",
            "1 teaspoon white vinegar",
            "Few shakes hot sauce",
            "1 clove garlic, pressed",
            "Salt and freshly ground black pepper",
            "2 carrots, peeled and finely diced",
            "1 head iceberg lettuce, diced",
            "1/2 cucumber, finely diced",
            "1/2 cup halved cherry tomatoes"
        ],
        "title": "Mini Chopped Salad with Buttermilk Dressing",
        "picture_link": "AJf2WgM9mjM3zvcxSIgbWMtfPIgjpEi"
    },
    "zll6XhYNpTj1fkrceMHIaVF2HKbQO1a": {
        "instructions": "For the daikon pickles: Place the daikon and carrots in a glass pickling jar. Mix the vinegar, brown sugar and 1 cup water together, stirring until the sugar is fully dissolved. Pour over the daikon and carrots. Cover and refrigerate for 24 hours.\nFor the jerk chicken: Preheat the oven to 350 degrees F.\nIn a mixing bowl, mix together the allspice, cinnamon, chile flakes, cloves, garlic, powder, ginger, onions powder, oregano, pepper, salt and thyme. Sprinkle the rub all over the chicken thighs.\nIn a large skillet over medium heat, sear the thighs in the coconut oil, 2 to 3 minutes per side. Transfer to the oven to finish cooking, about 20 minutes. Let rest for 10 minutes before slicing.\nAssemble the banh mi: Spread the hoagie rolls with avocado (it takes the place of pate here). Add sliced chicken, and top with 4 sprigs cilantro, 4 slices cucumber and 1/4 cup pickled daikon.",
        "ingredients": [
            "1 1/4 cups rice vinegar",
            "1/4 cup brown sugar",
            "1 pound daikon radish, julienned",
            "12 ounces carrot, julienned",
            "2 tablespoons ground allspice",
            "2 tablespoons ground cinnamon",
            "2 tablespoons crushed red chile flakes",
            "2 tablespoons ground cloves",
            "2 tablespoons garlic powder",
            "2 tablespoons ground ginger",
            "2 tablespoons onion powder",
            "2 tablespoons dried oregano",
            "2 tablespoons ground black pepper",
            "2 tablespoons kosher salt",
            "2 tablespoons dried thyme",
            "10 to 15 boneless chicken thighs",
            "3 tablespoons coconut oil",
            "10 hoagie rolls (8-inch), split",
            "6 avocados",
            "40 sprigs cilantro",
            "40 slices julienned cucumber"
        ],
        "title": "Jerk Chicken Banh Mi with Daikon Pickles",
        "picture_link": "y.DX4VwawcOATuWjR5uojIXIRfLmI4G"
    },
    "dZT1aBhal7VJgsSQf4b.npZlBuFIupG": {
        "instructions": "Using the food processor, grate the potatoes and place in a large bowl. Toss with the onion, salt and pepper. In a large skillet, heat the bacon drippings. Place the potato mixture in the pan, press down, cover, and cook for 10 minutes. As the potatoes cook, give the pan a gentle shake to make sure they do not stick. Using a spatula, turn the cake over. Continue to cook until golden brown.",
        "ingredients": [
            "1 1/2 pounds potatoes, about 4 cups, peeled",
            "1/4 cup minced onion",
            "1 teaspoon salt",
            "1/8 teaspoon pepper",
            "3 tablespoons bacon drippings, butter, or cooking oil"
        ],
        "title": "Hashed Brown Potatoes",
        "picture_link": null
    },
    "tDj8uI68GspityhCS1cZZL2AUKOBEQ6": {
        "instructions": "In a large, deep pot, heat 4 inches of oil until it reaches 350 degrees F. Bring milk to a boil in a large saucepan with butter, salt, cayenne, and white pepper. Slowly add flour, whisking constantly and vigorously until the mixture begins to pull away from the sides of the pan, about 5 minutes.\nCover an 11 by 17-inch baking sheet with plastic wrap. Pour mixture onto 3/4 of the prepared baking sheet, spreading evenly with an offset spatula. Cover with plastic wrap, and transfer to refrigerator to chill until firm, about 1 hour.\nRemove plastic wrap, and cut crosswise into 3-inch strips. Cut strips crosswise into 1/2-inch fries. Transfer fries to heated oil, and fry in batches until golden, about 2 minutes. Remove from oil, and season with salt and cayenne pepper. Repeat with remaining fries. Serve immediately.",
        "ingredients": [
            "Vegetable oil, for frying",
            "4 1/2 cups plus 2 tablespoons milk",
            "Salt",
            "Cayenne",
            "Freshly ground white pepper",
            "4 tablespoons unsalted butter",
            "2 1/4 cups chickpea flour"
        ],
        "title": "Chickpea Fries",
        "picture_link": null
    },
    "d.cQbJxSwCFf7i0zj53d/WenRMObnsG": {
        "instructions": "Heat the milk in a medium stainless-steel saucepan over medium heat and bring almost to a boil. Remove from the heat.\nBeat the egg yolks and sugar on medium-high speed in the bowl of an electric mixer fitted with the paddle attachment until pale and thick, about 5 minutes. With the mixer on low speed, sprinkle on the cornstarch. Beat on medium-low speed until combined, scraping down the bowl with a rubber spatula.\nWith the mixer on low speed, slowly pour the hot milk mixture into the egg mixture. Pour the mixture back into the pan. Cook over low heat, stirring constantly, until the mixture thickens, 5 to 7 minutes. (Pay attention because it will thicken and then quickly become scrambled eggs!)\nImmediately, pour the mixture through a fine sieve into a large bowl. Stir in the vanilla, Cognac, butter, and heavy cream. Place plastic wrap directly on the custard and refrigerate until cold.",
        "ingredients": [
            "3 cups milk",
            "10 extra-large egg yolks, at room temperature",
            "1 cup sugar",
            "4 tablespoons sifted cornstarch",
            "1 teaspoon pure vanilla extract",
            "1 teaspoon Cognac",
            "2 tablespoons unsalted butter",
            "1 tablespoon heavy cream"
        ],
        "title": "Cognac Cream",
        "picture_link": "fjbiPAE0Kn.OKY5QSVVWQ0OlMUDlcdG"
    },
    "L7uvDosV4NnR.eoI8KM7b0rjdTNHwHG": {
        "instructions": "Preheat oven to 350 degrees F.\nSaute onions with butter until the onions are translucent. Add flour and cream. Temper yolks by beating them with a small amount of the heated onion, flour cream mixture. Add yolks to mixture. Grind half the corn using a hand held stick blender. Add all the corn to the rest of the mixture and heat until thickened. Add spices, to taste.\nWhip egg whites and fold them into the mixture. Pour into a baking dish and bake the mixture in the oven until the pudding temperature is 160 degrees F on an instant-read thermometer.",
        "ingredients": [
            "1 cup minced onion",
            "2 ounces butter",
            "3 ounces all-purpose flour",
            "1 quart heavy cream",
            "9 egg yolks",
            "1 quart corn kernels",
            "Salt and pepper",
            "Ground nutmeg",
            "Paprika",
            "Cayenne pepper",
            "9 egg whites"
        ],
        "title": "Corn Pudding",
        "picture_link": null
    },
    "glwLcPljsYHBjQ8KlPzZimO1ipFq/Ym": {
        "instructions": "Preheat the grill to medium-high heat.\nToss the broccolini, olive oil, pinch of red pepper flakes, salt and pepper, to taste, together on a sheet tray. Place the broccolini on the hot grill and cook, while turning, until tender and slightly charred, 7 to 8 minutes. Place on a platter and add a squeeze of lemon and shaved Parmesan.",
        "ingredients": [
            "1 large bunch broccolini",
            "2 tablespoons olive oil",
            "Red pepper flakes",
            "Kosher salt and freshly ground black pepper",
            "1/2 lemon",
            "Shaved Parmesan, for garnish"
        ],
        "title": "Grilled Broccolini",
        "picture_link": "6uNfAxykGJndec81G7RBeoRq4WHetnq"
    },
    "XPT8D87JT7U.3cdN4xw8rBmct56yRGG": {
        "instructions": "Combine all ingredients well, using your fingers to toss and coat the carrots thoroughly. Transfer to a travel container or serving dish. As the salad sits, the raisins will plump a bit and carrots will take on citrus taste.",
        "ingredients": [
            "Two 10-ounce bags shredded carrots, available from the produce department",
            "1 cup (3 handfuls) raisins",
            "2 tablespoons poppy seeds (available in the spice aisle)",
            "1 lemon, juiced",
            "2 oranges, juiced",
            "1/2 cup (2 handfuls) light brown sugar",
            "Salt"
        ],
        "title": "Carrot Raisin Salad",
        "picture_link": "xKhXg8b1dzjZu76tQ.q1oQTU9LIXSsi"
    },
    "12Y3f6yTE9RGzruXCyqxMEaxM7620e.": {
        "instructions": "Heat the oil in a 10-inch skillet over medium-high heat. Add the onion, garlic, parsley and black pepper and cook until the onion is tender-crisp, stirring often. Stir the stock in the skillet and heat to a boil. Remove the skillet from the heat.\nPlace the beef in a roasting pan and brush with the stock mixture. Roast at 350 degrees F for 1 hour or to desired doneness, brushing occasionally with the stock mixture. Remove the beef from the roasting pan.\nStir the flour in the skillet. Stir the flour mixture in the roasting pan. Cook and stir over medium heat until the mixture boils and thickens. Serve the gravy with the beef.",
        "ingredients": [
            "2 tablespoons vegetable oil",
            "2 tablespoon chopped onion",
            "3 cloves garlic, minced",
            "1/8 teaspoon dried parsley flakes",
            "1/2 teaspoon ground black pepper",
            "3 1/2 cups Swanson® Beef Stock",
            "1 beef eye round roast (about 3 pounds)",
            "1/3 cup all-purpose flour"
        ],
        "title": "Beef Roast and Onion Gravy",
        "picture_link": "Hw5w68jy.X6mdxcbwIMSzAyOM54VOZu"
    },
    "DEBpatq/1Xz98oE2Yp7n.Zx4UvdSgpS": {
        "instructions": "Watch how to make this recipe.\nPeel and cube the sweet potatoes and put them in a large pot. Cover with water, bring to a boil and boil until tender, about 5 minutes. Drain and set aside to cool.\nWhile the potatoes are cooling, in a medium bowl, mix the mayonnaise, yogurt, scallions, red pepper, chives, orange zest, apple cider vinegar and hot sauce. Add the cooled potatoes to the mixture, and toss until the potatoes are fully coated. Add salt and pepper to taste. Best served chilled.",
        "ingredients": [
            "4 large sweet potatoes",
            "1/2 cup mayonnaise",
            "1/2 cup plain Greek yogurt",
            "1/2 cup diced scallions (about 6)",
            "1 red pepper, finely diced",
            "2 tablespoons minced fresh chives",
            "2 teaspoons orange zest",
            "2 teaspoons apple cider vinegar",
            "1/2 teaspoon hot sauce, such as Tabasco",
            "Salt and pepper"
        ],
        "title": "Sweet Potato Salad",
        "picture_link": "oDBax51IQYwdSt/KayOmlIYAbiYzJza"
    },
    "B.TQLJsEzbq2ik87kMbrZPVhthVIGg2": {
        "instructions": "Pound down the pork pieces on both sides until about 1/4-inch thick using a meat mallet. Whisk together the soy sauce, white pepper, sugar, honey, if using, and 1/4 cup water in a nonreactive bowl. Add the pork pieces, turning to coat completely, and marinate in the refrigerator for at least 4 hours or up to overnight.\nFill a heavy-bottomed pot or deep cast-iron skillet with 2 inches of oil and heat to 350 degrees F over medium-high heat. Shake the excess marinade from the pork pieces, and then carefully slip them into the oil and fry, turning occasionally, until light golden brown, about 5 minutes. Drain on a paper towel-lined plate briefly before serving with rice.",
        "ingredients": [
            "Steamed rice, for serving",
            "Two 6-ounce pieces pork loin, about 1-inch thick",
            "2 teaspoons soy sauce",
            "1 teaspoon white pepper",
            "1 teaspoon sugar",
            "Honey, optional",
            "Vegetable oil, for frying"
        ],
        "title": "Railroad Pork Chop",
        "picture_link": null
    },
    "q1gpC87gpfEaG3Vn9KbzjXD8rzrpdjq": {
        "instructions": "For the mousse, mix together the ricotta, egg yolk, and sugar, beating well. Add the lemon juice and zest and then the finely chopped watercress. Stir in the gelatin and season with salt and pepper. Whisk the egg whites until they are stiff, and fold in. Line small ramekins with plastic wrap and fill with mousse bringing the wrap over the top of the mousse. Chill until the mousse is just set. Unmold and serve.",
        "ingredients": [
            "3 1/2 ounces ricotta cheese",
            "1 egg yolk",
            "1 teaspoon caster sugar (superfine)",
            "1 lemon, juiced, zest grated",
            "7 ounces watercress leaves, finely chopped",
            "1/2 sachet powdered gelatin, dissolved in 4 tablespoons water",
            "Salt and freshly ground black pepper",
            "2 egg whites"
        ],
        "title": "Watercress Mousse",
        "picture_link": null
    },
    "0xP4KfnORYISZQzbLgwp3YLFYmGMXtu": {
        "instructions": "Stir the ketchup, avocado, sour cream, jalapenos and lime juice together in a medium bowl until well combined but still chunky. Serve on a burger or use as a dipping sauce for fries.",
        "ingredients": [
            "1 cup of your favorite ketchup",
            "1/2 cup mashed avocado",
            "1/4 cup sour cream",
            "1/2 jalapeno, minced",
            "1/2 lime, juiced"
        ],
        "title": "Guachup",
        "picture_link": "v/e13EJnttEHHCtqWGBt0rE91O1cp0a"
    },
    "YYiNg0AlM3OHzOw22G4eLB6HUGA0.Mq": {
        "instructions": "In a small skillet over medium low heat, combine oil, butter and garlic. Cook garlic in butter and oil gently for 2 or 3 minutes. Remove garlic butter mixture from heat.\nPlace a large nonstick skillet on the stove over medium high heat. Using a pastry brush, brush 1 side of 4 slices of bread with garlic oil and place buttered side down in skillet. Top each slice with equal amounts of the 4 cheeses, distributing them equally over the 4 slices. Top each sandwich with another slice of bread brushed with garlic butter, buttered side up. Flip the grill cheese sandwiches a few times until cheeses are melted and gooey and bread is toasty and golden. Cut grilled 4 cheese sandwiches from corner to corner and serve.",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil, 2 turns of the pan",
            "3 tablespoons butter",
            "1 clove garlic, cracked away from skin",
            "8 slices crusty Italian semolina bread",
            "1 cup shredded provolone",
            "1 cup shredded mozzarella",
            "1/2 cup grated Parmesan or Romano",
            "1 cup shredded Asiago"
        ],
        "title": "Grilled 4 Cheese Sandwiches",
        "picture_link": "/rZjlWZj0mRz/AU4nccol930Ep97vOK"
    },
    "OpiaaBVrpQdenMadtuizi9AbYcj.4bW": {
        "instructions": "Heat a grill pan or outdoor grill to medium heat. To roast the corn, rub the shucked ears of corn with 1/2 teaspoon olive oil, reserving the remaining oil to dress the salad. Place the corn on the grill and cook, turning often, until the corn is slightly charred and still crisp, 8 to 10 minute. Remove from the heat and cool briefly.\nCut the kernels off the cob and place in a large bowl. (Two cobs of corn should yield 1 1/2 to 2 cups of kernels.) Add the cucumber, tomatoes, red onion, remaining 1 tablespoon olive oil, red wine vinegar, smoked paprika and salt and pepper, to taste. Toss to combine.",
        "ingredients": [
            "2 ears corn, shucked",
            "1 tablespoon plus 1/2 teaspoon olive oil, divided",
            "1 cup seeded and diced English cucumber",
            "1 cup grape tomatoes, halved",
            "1/4 cup finely diced red onion",
            "1 1/2 teaspoons red wine vinegar",
            "3/4 teaspoon smoked paprika",
            "Salt and pepper"
        ],
        "title": "Roasted Corn and Cucumber Tomato Salad",
        "picture_link": null
    },
    "y2.ob4QZ/QawzQWDc6fQZ5gBz3iS5J2": {
        "instructions": "Preheat the oven to 450 degrees F. For the salsa: Heat the olive oil in a small pot, and then add the chiles and fry until bright orange, about 10 seconds, tossing continuously to avoid burning. Immediately remove from the oil. Transfer to a blender with the tomatoes, vinegar, 1/4 cup water, the garlic and tomatillo. Blend until smooth. Pour the blended salsa into a small pot. Bring to a boil, then reduce the heat and simmer for 15 minutes. Season with salt. For the crema: Combine the yogurt, lime juice and salt in a bowl. This may be thinned with water if necessary. For assembly: Heat the chips in the oven for about 2 minutes, and then toss together with the hot salsa in a large stainless-steel bowl until completely covered. Cover the chips with the cotija cheese, onions and cilantro. Garnish on the side with the crema and lime wedges.",
        "ingredients": [
            "2 tablespoons olive oil",
            "1/3 cup chiles de arbol",
            "3 cups organic canned diced tomatoes",
            "1/4 cup white vinegar",
            "1 small clove garlic",
            "1 small fresh tomatillo",
            "Salt",
            "2 cups Greek kefir yogurt",
            "2 tablespoons lime juice",
            "1 teaspoon salt",
            "1 1/2 pounds salted corn tortilla chips",
            "2 cups grated cotija cheese",
            "1 cup small dice white onions",
            "1 cup finely chopped fresh cilantro",
            "8 lime wedges"
        ],
        "title": "Totopos con Chile",
        "picture_link": null
    },
    "KaY8mlGaXMsXjKcCkc10BvP60gD8Kdu": {
        "instructions": "Fill rocks glasses a 1/4 of the way with the blood orange juice, add a shot of campari and top with Prosecco. Garnish with fresh mint sprigs.",
        "ingredients": [
            "1 quart fresh blood orange juice, very cold",
            "4 to 6 shots Campari",
            "1 (750 ml) bottle Prosecco, very cold",
            "Fresh mint sprigs, to garnish"
        ],
        "title": "Blood Orange Campari Prosecco Cocktail",
        "picture_link": null
    },
    "Itlw9oY32BrV66egH1XtHtMvvyTTT1S": {
        "instructions": "In an 8-quart stockpot, melt the butter and oil together over medium-high heat. Add the shallots and garlic. Season with salt and pepper and cook until soft, about 3 to 4 minutes. Add the sweet potatoes, rosemary and chicken broth. Season with salt and pepper, to taste. Bring the mixture to a boil, reduce the heat and simmer until the sweet potatoes are very tender, about 20 to 25 minutes. Turn off the heat and remove the rosemary stems. Using an immersion blender, blend the mixture until smooth and thick. Whisk in the mascarpone cheese and maple syrup until smooth. Season with salt and pepper, to taste. Keep the soup warm over low heat until ready to serve.\nCook's Note: The soup can also be pureed by ladling, in batches, into a food processor or blender and blended until smooth.",
        "ingredients": [
            "3 tablespoons unsalted butter, at room temperature",
            "3 tablespoons olive oil",
            "3 large or 6 small shallots, thinly sliced",
            "2 to 3 cloves garlic, minced",
            "Kosher salt and freshly ground black pepper",
            "2 pounds (about 2 to 3) sweet potatoes, peeled, trimmed and cut into 1/2-inch pieces",
            "2 (6-inch long) stems fresh rosemary",
            "6 cups low-sodium chicken broth",
            "1/2 cup mascarpone cheese, at room temperature",
            "3 tablespoons maple syrup"
        ],
        "title": "Creamy Sweet Potato and Rosemary Soup",
        "picture_link": "zTpsTCeUpqqd9aLx.gx/rwnStrxdlse"
    },
    "R1Qhj6P/YhVOmO35e06nM3zrbq/vIze": {
        "instructions": "Puree the ketchup, peaches, cinnamon and chipotle in a blender until smooth. Refrigerate for up to 1 week.",
        "ingredients": [
            "1 cup ketchup",
            "1 cup diced ripe peaches",
            "1/2 teaspoon ground cinnamon",
            "1 chipotle chile in adobo sauce"
        ],
        "title": "Spiced Peach Ketchup",
        "picture_link": null
    },
    "IsmyQeibC6TZHA0ZNHezfXUjXAoXFWW": {
        "instructions": "Watch how to make this recipe.\nIn a slow-cooker, combine the chicken and all remaining ingredients except the rice. Mix well to combine. Cover and cook on low for 6 to 8 hours or high for 3 to 4 hours. Serve over rice.",
        "ingredients": [
            "1 pound boneless skinless chicken breasts, cut into 2-inch pieces",
            "One 10-ounce package frozen okra, thawed",
            "2 links andouille sausage, diced",
            "1 cup chopped onions",
            "2 celery stalks, chopped",
            "1 green bell pepper, seeded and chopped",
            "1 teaspoon dried thyme",
            "1 teaspoon dried oregano",
            "1/2 teaspoon salt",
            "2 bay leaves",
            "1/2 teaspoon onion powder",
            "1/2 teaspoon garlic powder",
            "1/2 teaspoon mustard powder",
            "1/4 teaspoon cayenne pepper",
            "1/4 teaspoon ground black pepper",
            "2 cups reduced-sodium chicken broth",
            "2 cups reduced-sodium tomato juice",
            "2 cups cooked rice"
        ],
        "title": "Slow-Cooker Chicken Gumbo",
        "picture_link": "YmBp2lzmdwPD1DoZXzkTx.84E7ziVFm"
    },
    "9JnGfWO8tes/AfYQsQpXjsIgJS/h0HS": {
        "instructions": "Watch how to make this recipe.\nAdd the basil leaves, Parmesan, pine nuts, garlic and salt and pepper to taste to a food processor or blender. Turn the machine on, then drizzle in the olive oil while it mixes. Continue blending until combined, adding additional olive oil if needed.",
        "ingredients": [
            "3/4 cup fresh basil leaves",
            "1/2 cup grated Parmesan",
            "3 tablespoons pine nuts",
            "2 cloves garlic, peeled",
            "Salt and freshly ground black pepper",
            "1/3 cup extra-virgin olive oil"
        ],
        "title": "Pesto",
        "picture_link": "llDrD2qcb7qIQ8YAzK0t.sjm2mKQ9A6"
    },
    "/qTTtU6eucKllUczo9e8K3/T5kaZ.fu": {
        "instructions": "Place a piece of apple and a knob of butter inside each bird. Season inside and out with salt and pepper and wrap well in bacon. Stand in 1/2 inch of water in a roasting pan and cover with foil. Roast in a preheated oven at 300 degrees F for 45 minutes.\nRemove the foil and pour the liquid from the pan. Unwrap the bacon. Zap up the oven temperature to 450 degrees and roast for 10 minutes to brown the birds.",
        "ingredients": [
            "1 grouse per person",
            "Apples",
            "Butter",
            "Salt",
            "Black pepper, freshly ground",
            "Streaky bacon rashers"
        ],
        "title": "Duntreath Roast Grouse",
        "picture_link": null
    },
    "BLketu24D1PrEVBx/HXbo/K97OTyt7S": {
        "instructions": "Using a blender, combine all of the dressing ingredients and blend until well combined. Refrigerate until ready to serve. Cut the tomatoes into 4 thick beef-like slices and put 1 slice on each serving plate. Top each tomato with 1/2 cup arugula leaves.\nFold the crabmeat and avocados together in a bowl. Season with salt and freshly ground black pepper, then put 2 tablespoons of the crabmeat mixture on each tomato stack.\nDrizzle with dressing, garnish with a cilantro leaf and serve.",
        "ingredients": [
            "4 tablespoons extra-virgin olive oil",
            "3 tablespoons fresh lime juice",
            "1/2 jalapeno, seeds removed",
            "1/2 cup chopped cilantro leaves",
            "2 tablespoons honey",
            "Pinch salt and freshly ground black pepper",
            "2 heirloom tomatoes",
            "2 cups baby arugula lettuce",
            "3/4 pound fresh crabmeat",
            "2 avocados, halved, pitted and flesh cut into cubes",
            "Salt and freshly ground black pepper",
            "Cilantro leaves, for garnish"
        ],
        "title": "Heirloom Tomato Stack with Chili Lime Dressing",
        "picture_link": null
    },
    "Md3FpUPlIiauX65LPjZ3HhU2SjGIW2y": {
        "instructions": "In a saucepan cook onions in oil over moderate heat until tender. Stir in garlic, red pepper flakes and chile powder and cook for 1 minute. Add ketchup, beer, vinegar, water, brown sugar, mustard, Worcestershire sauce, salt, black pepper, and Tabasco sauce, stirring to combine. Partially cover and simmer until slightly thickened about 15 to 20 minutes. Taste and adjust seasoning, if necessary, with Tabasco sauce. Remove sauce from heat and allow to cool completely. Sauce can be refrigerated for 2 to 3 weeks or frozen for up to 1 month.;",
        "ingredients": [
            "2 tablespoons vegetable oil",
            "1 small onion, finely chopped",
            "2 garlic cloves, finely chopped",
            "1 teaspoon red pepper flakes",
            "1 tablespoon chile powder or paprika",
            "1 1/2 cups ketchup",
            "1/2 cup amber beer or ale",
            "1/4 cup cider vinegar",
            "1/4 cup water",
            "1/4 cup brown sugar",
            "2 tablespoons Dijon-style mustard",
            "2 tablespoons Worcestershire sauce",
            "Salt and ground black pepper",
            "Tabasco sauce, optional or to taste"
        ],
        "title": "Classic Homemade Barbecue Sauce",
        "picture_link": null
    },
    "xANUlnhWlVKuD9FvVQ1uA074vx0gb6y": {
        "instructions": "Shell and clean your shrimp, leaving the heads on. Lay the shrimp out on a plate and squeeze the lemon juice on top, followed by some salt, black pepper, chili flakes, if using, and a good splash of olive oil (this will partially cook the shrimp). Let the shrimp marinate 10 minutes, if desired, or serve immediately. Garnish with fresh parsley.",
        "ingredients": [
            "2 pounds fresh shrimp",
            "Juice of 2 lemons",
            "Kosher salt and freshly ground black pepper",
            "Chili pepper flakes, optional",
            "Extra-virgin olive oil, to taste",
            "Fresh flat-leaf parsley, for garnish"
        ],
        "title": "Marinated Raw Shrimp (Shrimp Ceviche)",
        "picture_link": null
    },
    "ba5zEo/PbFAwQKP8S/pbVPDe74FfMpK": {
        "instructions": "In a medium saucepan heat butter over moderately high heat until foam subsides. Add mushrooms and saute, stirring, until the liquid mushrooms give off is evaporated and the mushrooms begin to brown. Add wine and boil 1 minute. Add 4 cups stock and salt and pepper to taste and simmer 2 minutes. Puree soup in batches in blender and pour back into pot. Add 1/2 cup cream and simmer for another 2 to 3 minutes. Serve soup sprinkled with chives.",
        "ingredients": [
            "4 tablespoons butter",
            "1 1/2 pounds mushrooms, thinly sliced",
            "1/2 cup dry white wine",
            "4 cups chicken stock, see separate recipe",
            "1/2 cup heavy cream",
            "2 tablespoons chopped fresh chives",
            "Salt and pepper, to taste"
        ],
        "title": "Mushroom Soup",
        "picture_link": null
    },
    "tasvwdeABPq3wWc4kYUOmKmVdCKrnE.": {
        "instructions": "Mix all the ingredients together and enjoy!",
        "ingredients": [
            "1 cup mango puree",
            "1/4 cup sweetened condensed milk",
            "1/2 cup orange juice",
            "Diced papaya"
        ],
        "title": "Sweet Soup",
        "picture_link": null
    },
    "le5AYjVMANIckHsqg1EUw5Yl7UG0vVG": {
        "instructions": "Preheat oven to 350 degrees. Lightly score the surface of the ham using a sharp knife and place in baking pan on a rack. Stir together the mustard and maple syrup and coat the ham with the mixture. Press the cloves randomly over the ham. Bake for 1 hour.",
        "ingredients": [
            "One 6- to 8-pound ham",
            "3 tablespoons Dijon mustard",
            "1/3 cup maple syrup",
            "8 cloves"
        ],
        "title": "Glazed Baked Ham",
        "picture_link": null
    },
    "aospnFBlm.4PNAFGciwcQgr8dVJaKiu": {
        "instructions": "Brush corn with olive oil, season with salt, place on the grill and grill until lightly golden on all sides. Heat the butter in a medium skillet and add the lime juice. Add the corn niblets and cook for one minute. Add the black pepper.",
        "ingredients": [
            "4 ears of corn",
            "2 tablespoons olive oil",
            "Salt",
            "3 tablespoons unsalted butter",
            "Juice of 1 lime",
            "1 tablespoon coarsely cracked black pepper"
        ],
        "title": "Grilled Corn Niblets with Lime Butter and Cracked Black Pepper",
        "picture_link": null
    },
    "IYDo2XCom6BcYzio15pLhUQkXQn1VCS": {
        "instructions": "Soak the beans overnight in cold water to cover.\nDrain the beans and transfer them to a large saucepan. Cover with 3 cups cold water, the coconut water and 2 teaspoons salt, set over medium heat and bring to a boil. Boil for 2 minutes, then turn the heat down to low, cover and cook until tender; depending upon the age of the beans, this will take between 30 and 45 minutes (older beans take longer).\nWhen tender, add the coconut oil and lime juice and season with salt and pepper. Pour into a serving dish and garnish with the green onions.",
        "ingredients": [
            "2 cups dried black beans, rinsed",
            "2 cups coconut water",
            "Salt and freshly ground black pepper",
            "1 tablespoon coconut oil",
            "1 lime, juiced",
            "2 green onions, greens only, sliced"
        ],
        "title": "Coconut Lime Black Beans",
        "picture_link": "D0AkYMln1YJzOae3i7giYgYt73o8EwG"
    },
    "EYsnND5T9bvbxFJPInPrSaUU5SK59fG": {
        "instructions": "Juice the carrots, then the orange, following your juicer's specific settings for each. Combine the juices with the orange liqueur and bitters in a cocktail shaker filled with ice. Shake vigorously for 8 to 10 seconds. Strain into a tall glass filled with ice. Garnish with a maraschino cherry.",
        "ingredients": [
            "2 small carrots, peeled",
            "1 medium orange, peel and pith removed",
            "2 ounces orange liqueur",
            "Several dashes (a healthy shake) of orange bitters",
            "Maraschino cherry, for garnish"
        ],
        "title": "Orange You Glad",
        "picture_link": "RH29eCGRigmdqybszRtgzsyHj0w94gC"
    },
    "8EythRhA7Yr7/J71VRNNIeMSd1IsPWi": {
        "instructions": "Preheat oven to 475 degrees F. In a roasting pan toss the asparagus with 3 tablespoons olive oil until coated. Spread asparagus out in a single layer, if possible. Roast asparagus for 10 minutes until tender. Season with salt and pepper and set aside. Rub slices of bread with halved garlic and brush lightly with remaining olive oil. Arrange bread slices on a baking sheet. Bake the bread until lightly toasted about 6 to 8 minutes. When asparagus has cooled sufficiently, cut the stalks on the diagaonal into 2-inch pieces. Arrange toasted bread on serving platter and top each slice with asparagus pieces. Drizzle asparagus with balsamic vinegar and truffle oil. Using a vegetable peeler shave Parmesan over asparagus.;",
        "ingredients": [
            "1 pound fresh asparagus, washed and trimmed",
            "1/4 cup plus 2 tablespoons extra virgin olive oil",
            "Salt and pepper, to taste",
            "1 loaf good-quality baguette cut into 3/4-inch slices",
            "1 clove garlic, halved",
            "1 tablespoon balsamic vinegar",
            "White truffle oil or another favorite flavored olive oil",
            "A piece of Parmesan, to shave over asparagus"
        ],
        "title": "Roasted Asparagus Crostini with Parmesan",
        "picture_link": null
    },
    "FZyNqXpZUz9wpR1EoywLMRGiQgZ4AhG": {
        "instructions": "In a saucepan heat the cranberry-raspberry concentrate, orange juice, pink lemonade concentrate and the white vinegar. Finish the sauce by poaching the fruit in the sauce for 2 or 3 minutes until fruit is soft but not overcooked. Add salt and pepper to taste and garnish with fresh basil.",
        "ingredients": [
            "2 ounces cranberry-raspberry concentrate",
            "4 ounces orange juice",
            "2 ounces pink lemonade concentrate",
            "1-ounce white vinegar",
            "3 ounces seedless green grapes, cut in halves",
            "2 nectarines, pitted and sliced",
            "2 oranges, cut in sections",
            "12 leaves fresh basil"
        ],
        "title": "Tropical Hawaiian Salsa",
        "picture_link": null
    },
    "lwbcEqhx9uXjavdXt/2U7TwtdcCyo42": {
        "instructions": "In a food processor, combine beans, lemon juice, cumin, oregano and tomatoes and puree until smooth. Thin with a few tablespoons of water, if necessary, to get desired consistency. Season with salt and pepper. Spoon into a large shallow bowl and smooth with a spatula.\nStick carrot, celery sticks and sprouts around the edges of 1/2 of the bowl to make \"hair\". Use tomatoes, broccoli, and cauliflower to make a face.",
        "ingredients": [
            "1 (14-ounce) can white beans",
            "1 lemon, juiced",
            "1 teaspoon ground cumin",
            "1 tablespoon fresh oregano leaves",
            "1/4 cup peeled, diced tomatoes (the canned kind)",
            "Salt",
            "Pepper",
            "Carrot sticks",
            "Celery sticks",
            "Bean sprouts",
            "Cherry tomatoes",
            "Broccoli florets",
            "Cauliflower"
        ],
        "title": "Bean Dip with a Vegetable Face",
        "picture_link": null
    },
    "NQGtImJkKWigQ1u94RG71cdpQcf06ou": {
        "instructions": "In a large bowl, whisk together the orange juice, orange zest, peanut butter, sugar, soy, ginger, garlic, and red pepper flakes until smooth and evenly combined. Reserve 1/3 cup of the mixture to serve as a dipping sauce. Put the marinade in a resalable plastic bag, add the chicken, seal the bag and turn to coat evenly. Refrigerate and allow to marinate for 30 minutes to 8 hours.\nHeat a grill to medium heat, (350 degrees F), and rub the grate with a towel dipped in oil. Thread 1 to 2 chicken tenders on each skewer. Grill the chicken until thoroughly cooked, about 2 to 3 minutes per side. Transfer to a serving platter and sprinkle with cilantro and peanuts. Serve hot or at room temperature with the reserved peanut sauce.",
        "ingredients": [
            "1/2 cup freshly squeezed orange juice",
            "1 orange, zested (about 2 teaspoons)",
            "1/2 cup smooth natural peanut butter",
            "2 tablespoons packed dark brown sugar",
            "1/4 cup light soy sauce",
            "2 teaspoons peeled grated fresh ginger",
            "4 medium cloves garlic, minced",
            "1 teaspoon red pepper flakes",
            "1 1/2 pounds boneless chicken thighs, cut into 1-inch wide strips",
            "Oil, for grill grate",
            "Skewers (soaked in water for 20 minutes if wooden)",
            "1/4 cup roughly chopped fresh cilantro leaves, for serving",
            "1/3 cup roughly chopped roasted, salted peanuts, for serving"
        ],
        "title": "Chicken Skewers with Peanut-Ginger Marinade",
        "picture_link": "W7rwyVrftrJO9y3IF5P/mvlcwzQ4Pt."
    },
    "sAK3rPVoesYYC45xJgwR1yQSPwG2qlu": {
        "instructions": "Combine all ingredients in a bowl and store in airtight jar.\nMake the salsa: In a bowl combine all the ingredients and add salt and pepper to taste.\nMake the burgers: Preheat the oven to 400 degrees F.\nIn a non-stick pan cook the onion and red pepper in 1 teaspoon of the oil for 5 minutes and let them cool. Mix the vegetables with the with the seasoning and turkey and form the mixture into 4 patties. In a non-stick pan heat the remaining oil over moderately low heat until it is hot, add the burgers and cook for 5 minutes on each side. Transfer the burgers to a baking pan and bake them in a preheated 400 degrees F oven for 10 minutes or until they are cooked through. Top each burger with salsa.",
        "ingredients": [
            "2 1/2 tablespoons paprika",
            "2 tablespoons salt",
            "2 tablespoons garlic powder",
            "1 tablespoon black pepper",
            "1 tablespoon onion powder",
            "1 tablespoon cayenne",
            "1 tablespoon dried oregano",
            "1 tablespoon dried thyme",
            "5 tablespoons corn, fresh or frozen, defrosted and grilled",
            "1 tablespoon chopped onion",
            "12 cherry tomatoes, seeded and chopped",
            "1 tablespoon fresh lime juice",
            "1 garlic clove put through a press",
            "1 tablespoon chopped fresh coriander",
            "2 teaspoons olive oil",
            "1/3 cup finely chopped onion",
            "1/3 cup finely chopped red pepper",
            "5 teaspoons olive oil",
            "1 tablespoon Creole seasoning, recipe follows",
            "1 pound ground turkey"
        ],
        "title": "Southwestern Turkey Burgers with Tomato Corn Salsa",
        "picture_link": null
    },
    "foxe0yI7yhojkit/qE5GJ1uSvaMwDmu": {
        "instructions": "In a large bowl, combine mayonnaise, sour cream, vinegar, salt and sugar. Add cabbage, parsley and scallions and toss to combine.\nServe immediately. Slaw can be refrigerated for up to 1 day.",
        "ingredients": [
            "1/2 cup mayonnaise",
            "2 tablespoons sour cream",
            "1 teaspoon white vinegar",
            "1/4 teaspoon salt",
            "2 teaspoons sugar",
            "1 (10-ounce) bag finely shredded cabbage",
            "1 cup finely chopped fresh flat-leaf parsley",
            "1/2 cup finely chopped scallion"
        ],
        "title": "Green Parsley Slaw",
        "picture_link": "fG54IsmLOh6zaVRQk6ivTNTmd3HsYt."
    },
    "H2vqbprENx/YuoEJeXqwR/srXcrEmv2": {
        "instructions": "In a large, heavy saucepan heat the oil over medium heat and add the onion and garlic. Saute until they begin to wilt. Add the ketchup and chile paste and saute for 4 minutes. Add all of the remaining ingredients stir and let simmer for 30 to 40 minutes. As the sauce thickens, stir more often so it does not scorch. Remove the sauce from the heat and allow it to cool. Place the sauce in a blender and puree. Store in the refrigerator.\nPlace the ancho and Mexican chiles in a large saucepan and cover them with the chicken stock. Add the onion and garlic. Bring the stock to a boil over high heat, reduce heat and allow to simmer for about 15 minutes or until the peppers have absorbed some liquid and have become soft. Put the pepper mixture, cooking liquid, and chipotle peppers into a blender. Blend on low speed, increasing to high speed as the puree combines.",
        "ingredients": [
            "1 tablespoon canola oil",
            "2 cups diced yellow onion",
            "7 cloves garlic, minced",
            "1 cup ketchup",
            "1 cup chipotle Red Chile Paste, recipe follows",
            "1/2 cup Worcestershire sauce",
            "1/2 cup strong coffee",
            "1/3 cup packed brown sugar",
            "1/4 cup cider vinegar",
            "1/4 cup freshly squeezed lemon juice",
            "1 1/2 teaspoons Dijon mustard",
            "2 teaspoons kosher salt",
            "4 ancho chiles, seeded and stems removed",
            "4 Mexican dried chiles, seeded and stems removed",
            "3 cups chicken stock",
            "1/2 white onion, diced",
            "3 cloves garlic, minced",
            "2 chipotle peppers, seeded and stems removed"
        ],
        "title": "Chipotle BBQ Sauce",
        "picture_link": null
    },
    "RvelM.PNeyMpb3hlrQ8wrVEQvJArDxi": {
        "instructions": "Watch how to make this recipe.\nPlace honey in a heavy stainless steel bowl and place over low heat for just a few seconds to \"loosen\" it up a bit. Remove from the heat and whisk in the sour cream. Serve over anything, from pound cake to fruit. It's darned near universal.\nNote: These amounts can be adjusted to your personal taste.",
        "ingredients": [
            "1/4 cup light honey (alfalfa or any wildflower honey will do nicely)",
            "1 cup sour cream"
        ],
        "title": "Sweet and Sour Dessert Sauce",
        "picture_link": "PyjOpaXrCw7XtCNceVkKpVjsOCIQhka"
    },
    "ZP1BEXQ3Jadh/ryFO1EpZy31oeDF33C": {
        "instructions": "Form the meat into 4 (1/4-inch thick) burgers. Season the meat with salt and pepper on both sides and cook in a saute pan over high heat to medium doneness, about 2 to 3 minutes per side.\nCombine the mayonnaise and roasted garlic in a small bowl and season with salt and pepper, to taste. Spread both sides of each bun with mayonnaise and mustard.\nPlace a slice of cheese on the bottom portion of each bun, place the burger on top of the cheese, then top the burger with a slice of ham then another slice of cheese then the pickle slices. Place the tops of the bun over the pickles and cook on a sandwich press or wrap the burgers in aluminum foil and cook in a hot skillet over high heat with a heavy skillet placed on top of the burger to press the sandwich. Cook until golden brown and cheese has melted.",
        "ingredients": [
            "1 pound ground chuck",
            "Salt and freshly ground black pepper",
            "1/2 cup best quality mayonnaise",
            "3 cloves roasted garlic, pureed",
            "1/4 cup Dijon mustard",
            "4 hamburger buns",
            "4 slices thinly sliced smoked ham",
            "8 slices thinly sliced Swiss cheese",
            "2 dill pickles, sliced into 1/4-inch thick slices"
        ],
        "title": "Pressed Cuban-Style Burger",
        "picture_link": "eWh7To4k3gRcIBSaZoCmPCfRK2pTWaW"
    },
    "ssrUZ5YxwSn/eQ4LRnVySOa2Cjz7M0.": {
        "instructions": "Dress the melon quarters with lime zest, lime juice and mint. Fill each boat with a small scoop of lemon sorbet and serve.",
        "ingredients": [
            "1 honeydew melon, quartered and seeded",
            "1 lime",
            "A handful mint leaves, chopped",
            "1 pint lemon sorbet"
        ],
        "title": "Green Melon with Lime and Lemon Sorbet",
        "picture_link": null
    },
    "Eo2FzZC/n..8ADuVnCYgfr7cL4gCPZe": {
        "instructions": "Heat oven to 400 degrees F. Cook gnocchi as directed on package, omitting salt. Meanwhile, melt butter in large nonstick skillet over medium heat. Add garlic; cook and stir 3 minutes. Add cream; mix well. Gradually add 1 cup of the cheese, stirring after each addition until melted. Add ham, broccoli in sauce, mushrooms and cooked gnocchi; mix well. Spoon into ungreased 9-inch square (1 1/2-quart) glass baking dish. In small bowl, combine bread crumbs and remaining 1/2 cup cheese; mix well. Sprinkle over casserole. Bake at 400 for 30 minutes or until golden brown. Cool 5 minutes before serving.;",
        "ingredients": [
            "1 (16-oz.) pkg. potato gnocchi",
            "1/4 cup butter",
            "1 garlic clove, minced",
            "1 cup whipping cream",
            "6 oz. (1 1/2 cups) shredded fresh Romano cheese",
            "1/4 lb. Cooked ham, coarsely chopped (3/4 cup)",
            "1 (10 oz.) pkg. Green Giant Frozen Broccoli in Cheese Flavored Sauce, thawed",
            "2 (4.5-oz.) jars Green Giant Sliced Mushrooms, drained",
            "1/2 cup Progresso Parmesan Bread Crumbs"
        ],
        "title": "Gnocchi Alfredo Casserole",
        "picture_link": null
    },
    "mubBmwHM.jegIE.RYPX5mHdnWnnm5l6": {
        "instructions": "Heat the oil in a deep fryer to 375 degrees F.\nCook's Notes: If you don't have a deep fryer, heat 2 tablespoons/30 ml oil in a pan at medium-high heat. Carefully place the cheese cubes in pan and lightly fry on both sides until golden, about 1 minute.\nMix the tomatoes, cucumbers, red onion, olives, avocado in a large bowl with the dill, olive oil, red wine vinegar, and lemon juice.\nDeep fry the cheese at 375 degrees F for approximately 2 minutes. The cheese must be served immediately or it will harden again within a couple minutes.\nToss the salad and garnish with fried cheese on top.",
        "ingredients": [
            "2 large tomatoes, cubed",
            "2 Lebanese cucumbers, cubed",
            "1 red onion, thinly sliced",
            "1 cup kalamata olives, pitted and halved",
            "1 ripe avocado, halved, pitted, peeled and cubed",
            "1/2 cup finely chopped fresh dill",
            "1/4 cup extra-virgin olive oil",
            "1 teaspoon red wine vinegar",
            "Juice of 1 lemon",
            "1 cup cubed Kefalotyri or sharp Cheddar cheese"
        ],
        "title": "Greek Salad with Popcorn Cheese",
        "picture_link": null
    },
    "Tt964INHRJSjCy3T8wyqsxSEZ8Ev4B.": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 350 degrees F.\nRemove the legs, thighs, and wings from the turkey (reserve for Round Two Recipe).\nIn a bowl, stir together the oil, rosemary, sage, thyme, garlic powder, chile powder, red pepper flakes, and salt and pepper. Drizzle a spoonful of the herb oil under the skin of the turkey and rub into the breast. Spoon the remaining herb oil on the outside of the turkey breast and rub into the skin.\nPour the broth into the bottom of the roasting pan fitted with a rack. Place the turkey breast onto the rack and roast in the oven for 55 to 60 minutes. Increase the oven temperature to 450 degrees F and cook until the skin is browned and a thermometer inserted in the thickest part reads 165 degrees F, 15 to 20 minutes. Let rest for 15 minutes before carving so the temperature rises to 180 degrees F.",
        "ingredients": [
            "1 (13-pound) frozen turkey, thawed",
            "1/4 cup canola oil",
            "2 teaspoons chopped fresh rosemary",
            "1 tablespoon chopped fresh sage",
            "1 tablespoon chopped fresh thyme",
            "2 teaspoons garlic powder",
            "1/2 teaspoon chile powder",
            "1/2 teaspoon crushed red pepper flakes",
            "Kosher salt and freshly ground black pepper",
            "1 cup chicken broth"
        ],
        "title": "Roasted Turkey Breast with Spicy Herb Oil",
        "picture_link": "SZXjKTbYO02kE3vhrT0K02qRRgFH9Dq"
    },
    "6K/UM1TgI58jlajVrQ731NRRbMm6jEC": {
        "instructions": "Watch how to make this recipe.\nCook bacon in a large skillet over medium-high heat until crispy. Remove to a paper towel-lined plate, then roughly chop. In same pan with bacon fat, melt butter over high heat. Add onions and Brussels Sprouts and cook, stirring occasionally, until sprouts are golden brown, 8 to 10 minutes. Season with salt and pepper, to taste, and toss bacon back into pan. Serve immediately.",
        "ingredients": [
            "4 strips thick-cut bacon",
            "2 tablespoons butter",
            "1 pound Brussels sprouts, halved",
            "1/2 large onion, chopped",
            "Salt and freshly ground black pepper"
        ],
        "title": "Pan Roasted Brussels Sprouts with Bacon",
        "picture_link": "oSJcDBo57w7pSNggXoQINTYgUAPiUEq"
    },
    "gg12Vv6HPoj4ydSzp0.TkNLglyt.MFC": {
        "instructions": "Preheat an oven to 350 degrees. In a small saucepan, mix together the sugar, water and vanilla bean and cook until golden brown. Add the rum, ginger, chiles, banana, passion fruit and mix well. Allow to cool then blend in a food processor. Strain and set aside. Place pineapple in a shallow baking dish and brush on glaze. Bake for 1 1/2 hours, basting every 15 to 20 minutes. Save the warm sauce in the baking dish for plating.",
        "ingredients": [
            "2 cups sugar",
            "1 1/2 cups water",
            "1 vanilla bean split",
            "1/4 cup dark rum",
            "1 tablespoon minced ginger",
            "2 Thai bird chiles",
            "1 banana, chopped",
            "1 tablespoon passion fruit syrup (or 2 tablespoons puree)",
            "1 tablespoon pink peppercorns, for garnish",
            "1 ripe pineapple, peeled (Costa Rican)"
        ],
        "title": "Roasted Spicy Pineapple with Passion Fruit Glaze",
        "picture_link": null
    },
    "8cQDNgrFdFRvuBIwc961wSSN0zbv1.q": {
        "instructions": "Watch how to make this recipe.\nIn a medium bowl, combine cheeses, pimentos and pimento juice, onion, mayonnaise, garlic, paprika, and celery seed. Mix well and season with salt and pepper, to taste. Refrigerate until ready to serve. Transfer the cheese spread to a serving bowl and serve with the bread.",
        "ingredients": [
            "1/2 pound Cheddar cheese, shredded (recommended: Colby)",
            "1/2 pound Pepper Jack cheese, shredded",
            "One 4-ounce jar diced pimentos, plus 2 tablespoons juice",
            "1/2 red onion, diced",
            "1 cup mayonnaise",
            "3 cloves garlic, finely minced",
            "1 teaspoon hot smoked paprika",
            "1/2 teaspoon ground celery seed",
            "Salt and freshly ground black pepper",
            "1 loaf white sandwich bread, sliced into diagonal pieces"
        ],
        "title": "Easy Pimento Cheese",
        "picture_link": "tmbwvJ3fdha4LiAMLhQguIHWfjaMrMe"
    },
    "pfw9BzpQ5DiIwMM1XvCmLKJryLhDwBe": {
        "instructions": "Measure 3/4 cup rum, 3/4 cup brandy, 2 cups wine, and 2 cups Sprite, and pour all into pitcher over ice and stir with a long wooden spoon. Dice a few pieces of apple, remove a few grapes, both green and purple, from stems and cut in 1/2, and dice a few pieces each of lemon and lime. Add diced fruit to pitcher and stir once more. Pour Sangria into tulip glasses.",
        "ingredients": [
            "1 pint bottle rum",
            "1 pint bottle Spanish brandy",
            "1 bottle rose wine",
            "2 liters Sprite",
            "Clear-colored large pitcher filled half-way with ice cubes",
            "Apple slices",
            "Grapes",
            "Lemon slices",
            "Lime slices"
        ],
        "title": "Rose Sangria",
        "picture_link": "bvIag4dEGmUd1y.R73Tja7a2CgTKu2a"
    },
    "T0pZcuy2sKjwLp81RJm0m.NGIE.2ZoW": {
        "instructions": "Preheat grill pan or large nonstick skillet over medium high heat.\nBrush endive on both sides with oil, season with salt and pepper then grill until dark around edges and endives are tender; about 3 minutes on each side. Arrange grilled endives on platter. Sprinkle the endive with white wine vinegar. Keep a finger over the top of bottle to control the flow if the bottle does not have a jigger top. Arrange walnut bits and grapes around the platter and serve.",
        "ingredients": [
            "4 endives, trimmed and halved lengthwise, each half then split and fanned a bit",
            "Walnut, grape seed, or extra-virgin olive oil, for brushing greens",
            "Salt and pepper",
            "2 tablespoons white wine vinegar",
            "2 ounces chopped walnuts, available in small pouches on baking aisle",
            "12 large seedless red grapes, halved"
        ],
        "title": "Warm Endive Salad",
        "picture_link": "/rZjlWZj0mRz/AU4nccol930Ep97vOK"
    },
    "bk3YuZxO22ZWIaSDqFQVSLD4gN5ZSC6": {
        "instructions": "Remove the core from each Brussels sprouts and separate into leaves. In a hot saute pan add your diced bacon and cook until crisp. Pour off half of your excess fat and whisk in lemon juice and mustard. Add your leaves and cook until tender. Check seasoning. Toss with caraway and serve.",
        "ingredients": [
            "2 pounds Brussels sprouts",
            "8 ounces diced slab bacon",
            "3 lemons, juiced",
            "1 tablespoon grain mustard",
            "2 tablespoons toasted caraway",
            "Salt and pepper, to taste"
        ],
        "title": "\"Little\" Cabbage Salad",
        "picture_link": null
    },
    "N2957eL6optgdbTgwQMN3sOty1FF7mO": {
        "instructions": "Make the egg mixture for Perfect French Toast using 1/2 teaspoon ground ginger instead of nutmeg. Spread lemon curd on 4 thick slices brioche, top with blueberries, then another bread slice. Press together; dip in the egg mixture, then fry and bake as directed. Top with confectioners' sugar.\nPhotograph by Kang Kim",
        "ingredients": [],
        "title": "Lemon-Berry French Toast",
        "picture_link": "6cv/33EkDaezGO9SR2bz8eeHVPizc2G"
    },
    "IUT8QiVi7j8A6K8nF9OB.TVJrN.4sdW": {
        "instructions": "Heat 2 tablespoons butter in a large Dutch oven or pot over medium-high heat. Add the chopped celery stalks, endive, shallots, garlic, 1/2 teaspoon salt and a few grinds of pepper; cook, stirring, until the vegetables are softened, 4 to 5 minutes. Increase the heat to high and stir in the mussels and thyme. Add the wine and bring to a boil; cover and cook, shaking the pot occasionally, until the mussels open, 3 to 5 minutes. (Discard any unopened mussels.)\nTransfer the mussels and vegetables to a bowl using a slotted spoon. Whisk the remaining 6 tablespoons butter and the lemon juice into the liquid in the pot. Bring to a boil, then remove from the heat and return the mussels to the pot. Sprinkle with celery leaves and parsley; toss to coat. Serve with toasted baguette.\nPhotograph by Charles Masters",
        "ingredients": [
            "1 stick unsalted butter, cut into small pieces",
            "3 stalks celery, chopped, plus chopped celery leaves, for topping",
            "2 heads Belgian endive, sliced crosswise 1 inch thick",
            "4 large shallots, chopped",
            "3 cloves garlic, crushed",
            "Kosher salt and freshly ground pepper",
            "4 pounds mussels, scrubbed and debearded",
            "4 sprigs thyme",
            "11/2 cups dry white wine",
            "Juice of 1/2 lemon",
            "Chopped fresh parsley, for topping",
            "Toasted sliced baguette, for serving"
        ],
        "title": "Steamed Mussels with Endive",
        "picture_link": null
    },
    "hVW6eQB2Z/FmIZ5t.V2j3ZsxlpdVexC": {
        "instructions": "Place tomatoes in a blender or a food processor fitted with the metal blade and process until liquefied. Set aside.\nHeat oil in a large saucepan or stockpot over moderate heat. Add onion and saute until soft, about 10 minutes. Add garlic and saute for another 2 minutes. Add cumin, oregano and bay leaf and stir to combine. Sprinkle chicken pieces with salt and pepper and add to pan. Brown the chicken lightly. Add the tomatoes and enough water to cover 3/4 of chicken. Bring to a boil, cover, reduce the heat, and simmer for 45 minutes to 1 hour, until chicken is cooked through. About 10 minutes before the chicken is done, add the green pepper and peas. Serve warm.",
        "ingredients": [
            "1 (16 ounce) can chopped tomatoes",
            "1 tablespoon olive oil",
            "1 medium onion, finely chopped",
            "3 cloves garlic, minced",
            "1 teaspoon cumin",
            "1 teaspoon dried oregano",
            "1 bay leaf",
            "10 to 12 small chicken pieces",
            "1 teaspoon coarse salt",
            "1/2 teaspoon freshly ground black pepper",
            "1 green bell pepper, sliced",
            "1 cup green peas"
        ],
        "title": "Peruvian Stewed Chicken",
        "picture_link": null
    },
    "btCH12cz9zJ8yuTX3K1SlWYm7A4jCtW": {
        "instructions": "Preheat a grill. Butter 2 slices of rye bread. Place the bread, buttered side down, on the grill and cook until bread is toasted. Place corned beef on the grill and top with sauerkraut and swiss cheese. Steam all together on the grill. Then when your bread is good and grilled, assemble together. Serve it with Russian Dressing and deli mustard.",
        "ingredients": [
            "2 slices Russian rye bread",
            "Butter",
            "5 ounces corned beef",
            "2 1/2 ounces sauerkraut",
            "2 slices swiss cheese",
            "Russian Dressing",
            "Deli mustard"
        ],
        "title": "Mother's Son Rueben",
        "picture_link": null
    },
    "d9x47SiqfUF2TVlgGt2iyGEicd/gEWa": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 400 degrees F.\nRoll out puff pastry into a rectangle, about 12 by 15 inches. Spread preserves over the dough, to within 1/2-inch of the edges. Fold dough in half lengthwise. Gently roll again to seal edges. Using a sharp knife or pizza cutter, cut dough crosswise into 1/2-inch thick strips. Take each strip by the ends and tie into a knot. Arrange knots on a large baking sheet and press down the ends. Bake 6 to 10 minutes, until puffed up and golden brown.\nScoop frozen yogurt or ice cream into dessert bowls and lay twists over top.",
        "ingredients": [
            "1 sheet frozen puff pastry, thawed according to package directions",
            "1/4 cup apricot preserves",
            "2 cups vanilla frozen yogurt or ice cream"
        ],
        "title": "Apricot Puff Pastry Twists with Vanilla Ice Cream",
        "picture_link": "z22uQhMWsKqJcGCeleFtfoXp4.a26Q2"
    },
    "Fl6O0JThaQEQ.R1WtqjPs/83LGlpJQS": {
        "instructions": "Soak mushrooms in enough boiling water to cover them for about 20 minutes or until they have rehydrated. Squeeze out excess water and chop mushrooms fine. Fold mushrooms into mayonnaise until they are well blended. Season with salt and pepper to taste. Serve with grilled vegetables.",
        "ingredients": [
            "1/2 cup dried Chinese black mushrooms",
            "1 tablespoon chopped parsley",
            "2 tablespoons lemon juice",
            "1 1/2 cups prepared mayonnaise",
            "Salt and pepper"
        ],
        "title": "Mushroom Mayonnaise",
        "picture_link": null
    },
    "5BCRFVyIQYwVfjnP.J7fRD4AsSu3Tkm": {
        "instructions": "Special equipment: food processor\nIn a hot pan saute ground chicken, garlic, ginger and shallots together until the chicken is thoroughly cooked. Drain off the excess fat and mix the chicken together in a bowl with the peanut butter, brown sugar, chili paste, basil and cilantro. Chill the mixture, and then wrap in wonton wrappers. Bring the edges into a corner or simply fold into triangles, using a dab of water to \"glue\" the edges. In a pot fitted with a steamer basket, bring 1 to 2 inches of water to a boil. Steam the pot stickers in the steamer basket for 8 to 10 minutes until the wrappers are translucent, and serve with chili mint dipping sauce.\nPuree ingredients in a food processor for 1 minute. Serve at room temperature.",
        "ingredients": [
            "1 pound ground chicken",
            "2 tablespoons garlic, minced",
            "2 tablespoons fresh ginger, minced",
            "2 tablespoons shallots, minced",
            "1 cup chunky peanut butter",
            "1/4 cup brown sugar",
            "2 tablespoons Thai hot chili paste",
            "2 tablespoons fresh basil leaves, chopped",
            "2 tablespoons fresh cilantro leaves, chopped",
            "30 wonton wrappers",
            "1 small bottle Thai sweet chili sauce",
            "1/4 cup rice wine vinegar",
            "1/2 cup sugar",
            "1/4 cup cilantro leaves, chopped",
            "1/4 fresh mint leaves, chopped",
            "1 teaspoon sesame oil"
        ],
        "title": "Chicken Potstickers",
        "picture_link": "/KFsEyDp6jgPsrGvM34.RyVvgpv3XWm"
    },
    "ZtxcIwRuExydGen774XY/vGzTomcnbS": {
        "instructions": "HEAT oven to 375 degrees F.\nCOMBINE shortening, peanut butter, brown sugar, granulated sugar, eggs and vanilla in large bowl; beat with electric mixer until light and fluffy.\nCOMBINE flour, baking soda and salt in medium bowl. Mix into shortening mixture at low speed until just blended. Stir in peanut butter chips. Drop by rounded teaspoonfuls 2 inches apart onto ungreased baking sheet.\nBAKE 10 to 12 minutes, or until golden brown. Remove to cooling rack.",
        "ingredients": [
            "or 1/2 stick Crisco® Baking Sticks Butter Flavor All-Vegetable Shortening",
            "1/3 cup Jif® Creamy Peanut Butter",
            "1 cup packed brown sugar",
            "1/2 cup granulated sugar",
            "1/2 cup Crisco® Butter Flavor All-Vegetable Shortening",
            "2 large eggs",
            "1 tsp. vanilla extract",
            "1 3/4 cups Pillsbury BEST® All Purpose Flour",
            "3/4 tsp. baking soda",
            "1/4 tsp. salt",
            "1 (6 oz.) pkg. peanut butter flavored chips or semi-sweet chocolate chips, or 1/2 cup of each"
        ],
        "title": "Peanut Butter Chip Cookies",
        "picture_link": "T6v20KGN0QzXZUU7HQO/oG0XRr7g.lC"
    },
    "Y4oKh81QdY0zXbgAdS7XvVzftFuj0cy": {
        "instructions": "Preheat oven to 350 degrees.\nIn a small bowl, mix bread crumbs, olive oil, and a pinch of salt and pepper.\nPeel potatoes and cut in fourths lengthwise. Cover potatoes generously with bread crumb mixture and place slices on thin sheet pan.\nPlace potatoes in the oven and cook for 1 hour. Remove potatoes from the oven and sprinkle shredded mozzarella and grated Parmesan on top of the potatoes and place back in the oven for 5 minutes or until cheese is melted and golden brown.",
        "ingredients": [
            "2 cups bread crumbs",
            "1/2 cup olive oil",
            "Salt and pepper",
            "5 pounds baking potatoes, like russets",
            "2 cups shredded mozzarella",
            "1/4 cup grated Parmesan"
        ],
        "title": "Potato with Mozzarella",
        "picture_link": null
    },
    "zU1G4n0T7XgD17tdTlhnCxKouRJFC5a": {
        "instructions": "Marinate salmon: Season salmon with salt and pepper and place in a nonreactive container. Combine sake, shallot, garlic, sesame seed, and cilantro and pour over fish. Cover and marinate for 2 hours in the refrigerator.\nMake Asian slaw: Combine cabbage, seaweed, bean sprouts, bamboo shoots, leeks, lime juice, and orange juice in a nonreactive bowl and season with black pepper. Cover and refrigerate for 1 hour.\nPrepare wasabi aioli by combining mayonnaise, wasabi powder, garlic powder, and lime juice and chill.\nHeat sesame oil over low heat and poach salmon fillets until fish is just opaque. Drain on paper towels and bring to room temperature.\nArrange a bed of Asian slaw on serving plate, top with poached salmon and spoon a quenelle of wasabi aioli on fish.",
        "ingredients": [
            "6 (4-ounce) czar-cut salmon fillets",
            "Salt and freshly ground black pepper",
            "1 cup sake",
            "2 shallot cloves, minced",
            "2 garlic cloves, lightly crushed with the side of a knife blade and minced",
            "1 tablespoon toasted sesame seeds",
            "1 tablespoon minced fresh cilantro leaves",
            "1 cup sesame oil",
            "1/2 head napa cabbage, sliced chiffonade",
            "1/4 cup dried seaweed",
            "1 pint bean sprouts",
            "1 (6-ounce) can bamboo shoots, drained, rinsed and cut chiffonade",
            "2 leeks, white and tender green parts only, soaked in salt water to remove grit, and very thinly sliced",
            "1 lime, juiced",
            "1 orange, juiced",
            "Freshly ground black pepper",
            "1/3 cup mayonnaise",
            "1 teaspoon wasabi powder",
            "1/2 teaspoon garlic powder",
            "1 teaspoon fresh lime juice"
        ],
        "title": "Chilled Poached Salmon with Asian Slaw and Wasabi Aioli",
        "picture_link": null
    },
    "InkA/CuTOLnMnyviePiFGd6GILLh94W": {
        "instructions": "Adjust an oven rack to the middle position and preheat the oven to 325 degrees F.\nToss together the oats, millet, almonds, coconut flakes, pumpkin seeds, sunflower seeds and sesame seeds in a large bowl.\nWhisk together the olive oil, brown sugar, maple syrup, vanilla and 3/4 teaspoon salt together in a small bowl.\nPour the olive oil mixture into the oat mixture and toss until evenly coated. Spread out on a rimmed baking sheet and bake until golden and toasted, tossing the mixture around about halfway through, 30 to 40 minutes. Let cool completely on the baking sheet, then store at room temperature in an airtight container for up to 1 week.",
        "ingredients": [
            "3 1/2 cups rolled oats",
            "1 1/2 cups puffed millet",
            "1 cup sliced skin-on almonds",
            "1/3 cup unsweetened coconut flakes",
            "1/3 cup roasted unsalted pumpkin seeds",
            "2 tablespoons sesame seeds",
            "1/3 cup extra-virgin olive oil",
            "1/4 cup light brown sugar",
            "1/4 cup pure maple syrup",
            "2 teaspoons pure vanilla extract",
            "Kosher salt"
        ],
        "title": "Healthy Granola",
        "picture_link": "/r6QaXn2OWzB0D7bHnEB9zr.KtcAJwm"
    },
    "PVbndzfZH9mDif53aNX4Fyolpbf0Lgm": {
        "instructions": "Prepare a grill for medium-high heat.\nDust the lemon slices in the sugar, shaking off the excess. Grill until the sugar begins to caramelize and the lemon slices are lightly charred, 1 to 2 minutes per side. Let cool completely.\nTo serve, pour the lemonade into tall glasses with ice. Add a sprig of thyme and a grilled lemon slice. Serve immediately.\nBring 1 bunch thyme and 1 1/2 cups each sugar and water to a simmer in a saucepan over medium heat, stirring until the sugar dissolves. Let cool, then strain the syrup into an ice-filled pitcher. Stir in 2 cups each fresh lemon juice and cold water. Serve over ice with thyme sprigs and lemon slices.\nRecipe courtesy of Food Network Magazine",
        "ingredients": [
            "1 lemon, cut into 1/3-inch-thick rounds",
            "2 tablespoons sugar",
            "6 cups favorite lemonade, such as Thyme Lemonade, recipe follows",
            "Fresh thyme sprigs, for garnish"
        ],
        "title": "Thyme Lemonade with Grilled Lemon Slices",
        "picture_link": "jEU4F2f3HZ10JglRqDVS3.HgqN9bq.i"
    },
    "908KF1poSJsoG.bN5m7/f8HnEFzKBVy": {
        "instructions": "Remove the biscuits from the can and place onto a cutting board. Using a 1/2-inch biscuit cutter or the cap from a water bottle remove the center from each biscuit. Place both the donuts and donut holes onto a sheet pan and allow them to rest and come to temperature, about 15 minutes.\nIn a large bowl combine powdered sugar, pumpkin pie spice and apple juice. Whisk together until smooth and well combined. Set aside.\nHeat the oil, in a medium pot over medium heat, to 350 degrees F.\nFry the donuts, 3 at a time, until golden brown, about 1 minute per side. Remove from oil and place on a sheet tray lined with a paper towel. Repeat with remaining donuts and donut holes.\nDip the top of each donut into the prepared glaze and place on a serving tray. Let glaze set about 5 minutes and serve.",
        "ingredients": [
            "1 (7.5-ounce) can refrigerator biscuits",
            "1 cup powdered sugar",
            "1/2 teaspoon pumpkin pie spice",
            "2 tablespoons apple juice",
            "3 cups canola oil"
        ],
        "title": "Mini Apple Spiced Glazed Donuts",
        "picture_link": null
    },
    "oHKKIQ992CNqwtGo50zB/6owwqE/fNC": {
        "instructions": "Combine the mayonnaise, lemon zest (grated yellow part of lemon) and lemon juice. To get the juice out of a lemon, heat it up in microwave for 10 seconds on high. Cut the lemon across in half. Squeeze the lemon halves while holding them upright over the dressing bowl so that the seeds stay with the lemon halves, not in the dressing! Add pepper to the dressing bowl, too. Whisk the dressing and pour in the extra-virgin olive oil while you whisk. If you pour in a slow, steady stream, 3 tablespoons of extra-virgin olive oil will pour out in a count to the number six. Once the oil is combined with the acid (the lemon juice) and the mayonnaise, you can switch utensils and stir in the cheese and a pinch of salt with a spoon or rubber spatula.\nChop up the lettuce into 2-inch pieces. Place the lettuce in a salad bowl and top with the dressing when you are ready to serve dinner.",
        "ingredients": [
            "3 heaping tablespoons mayonnaise",
            "1 lemon, zested and juiced",
            "1 teaspoon coarse pepper, eyeball the amount in the palm of your hand: 1 teaspoon is equal to about 1/3 of a palm full",
            "3 tablespoons extra-virgin olive oil",
            "1/2 cup grated Parmigiano-Reggiano",
            "Pinch salt",
            "3 hearts romaine lettuce, chopped"
        ],
        "title": "Creamy, Lemony, Pepper-Parmesan Dressing on Romaine Lettuce Salad",
        "picture_link": null
    },
    "N/ZqxY6dlX8IybFP.LBWF/N3vNn6gyu": {
        "instructions": "In a Dutch oven, cook bacon and onion for 5 to 8 minutes until bacon is just cooked through. Add potatoes and cook for an additional 25 minutes, stirring regularly. Add mushrooms and soup, stir thoroughly, and cook for 7 minutes. Remove from heat and spread cheese over top. Let melt and serve.",
        "ingredients": [
            "8 slices bacon, diced",
            "1 medium onion, chopped",
            "5 large baking potatoes, sliced",
            "1 cup mushrooms, chopped",
            "1 (10-ounce) can cream of mushroom soup",
            "1 cup shredded Cheddar",
            "Special equipment: 12-inch Dutch oven"
        ],
        "title": "Dutch Oven Potatoes",
        "picture_link": null
    },
    "tVaYAyWJVaSIrGIQDoyzzSyxwjteF9y": {
        "instructions": "Heat a grill to medium high. Bring a medium pot of water to a boil. Add the noodles and cook as the label directs. Drain and rinse under cold water. Set aside in a colander to drain thoroughly.\nWhisk the lime juice, 3 tablespoons water, the sugar, sambal oelek and fish sauce in a large bowl. Add the cucumber, onion, watermelon and noodles. Season with salt and pepper and toss; set aside.\nSeason the steak with salt and pepper. Brush the grill with vegetable oil. Grill the steak until marked, about 3 minutes per side for medium rare. Transfer to a cutting board and let rest 5 minutes, then thinly slice.\nAdd all but a few tablespoons cilantro to the noodle salad and toss. Top with the steak and the remaining cilantro.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "1/2 8-ounce package rice vermicelli noodles",
            "1/4 cup lime juice (from about 3 limes)",
            "2 tablespoons sugar",
            "2 teaspoons sambal oelek (Asian chile sauce)",
            "1 teaspoon fish sauce",
            "1 English cucumber, halved lengthwise and thinly sliced",
            "1 red onion, thinly sliced",
            "4 cups cubed watermelon",
            "Kosher salt and freshly ground pepper",
            "1 1/2 pounds skirt steak, cut into 4 pieces",
            "Vegetable oil, for brushing",
            "1/2 cup fresh cilantro"
        ],
        "title": "Thai Noodle-Steak Salad",
        "picture_link": "q7tgwdU36bpBWmYAB5s1h/Fqq.KhP5O"
    },
    "b0BqVycJDnQHI8OQebCh6WEW5MD9OfW": {
        "instructions": "Watch how to make this recipe.\nIn a large nonstick saute pan over medium heat, combine the cooked rice and milk. Heat until the mixture begins to boil. Decrease the heat to low and cook at a simmer until the mixture begins to thicken, stirring frequently, approximately 5 minutes.\nIncrease the heat to medium, add the heavy cream, coconut milk, sugar, and cardamom and continue to cook until the mixture just begins to thicken again, approximately 5 to 10 minutes. Use a whisk to help prevent the cardamom from clumping. Once the mixture just begins to thicken, remove from the heat and stir in the raisins and pistachios. Transfer the mixture to individual serving dishes or a glass bowl and place plastic wrap directly on the surface of the pudding. Serve chilled or at room temperature.",
        "ingredients": [
            "1 cup cooked long grain or basmati rice",
            "1 cup whole milk",
            "1/2 cup heavy cream",
            "3/4 cup coconut milk",
            "2 ounces sugar, approximately 1/4 cup",
            "1/4 teaspoon ground cardamom",
            "1 1/2 ounces golden raisins, approximately 1/3 cup",
            "1 1/2 ounces chopped unsalted pistachios, approximately 1/3 cup"
        ],
        "title": "Indian Rice Pudding",
        "picture_link": "VjknqA2g2PiW4ZYalMjjam6NEn/ojIm"
    },
    "1s8P4tcT4rIkI04miCTBFCZvRaMOroK": {
        "instructions": "Have the cream at 60 degrees F. Pour into an 8-quart glass churn and turn the paddle. Do not turn it too quickly. After a while, small balls of butter will begin to form and float in the cream. Soon after that a large chunk will form and all that will be left is the buttermilk. Pour off the buttermilk and pour in some ice cold water and \"rinse\" the butter. Pour out the water. Season with salt, to taste. Store in a re-sealable container in the refrigerator.",
        "ingredients": [
            "4 quarts heavy cream",
            "Ice water, to \"wash\" the butter",
            "Salt"
        ],
        "title": "Homemade Churn Butter",
        "picture_link": "H3nsA.6nU41sT1pYN9Xpl1pg9d2wq3u"
    },
    "AFCLS2wcxFIrJksjye8aSStOCawyhEi": {
        "instructions": "Soak the herring in the milk for at least 12 hours or up to 24 to draw out a lot of the excess salt. Drain the herring, rinse, and pat dry. Cut off the fins and fillet the herring, leaving the skin on. Cut the fillets crosswise into 2-inch strips.\nIn a saucepan, combine the water, sugar, vinegar, allspice, mustard seeds, caraway seeds, and peppercorns. Bring the mixture to a boil, stirring to dissolve the sugar. Remove from the heat and cool the pickling mixture completely.\nArrange the herring fillets, onion, carrots, dill, bay leaves, and horseradish in a glass dish or funky Mason jar. Pour the cooled pickling mixture into the jar so that all the ingredients are completely covered with the liquid. Cover and refrigerate overnight or up to 2 days before serving.",
        "ingredients": [
            "3 to 4 whole salted herrings",
            "2 cups milk",
            "1 1/2 cups water",
            "1 cup white sugar",
            "1 cup white vinegar",
            "2 teaspoons ground allspice",
            "2 teaspoons yellow mustard seeds",
            "1 teaspoon caraway seeds",
            "2 teaspoons whole black peppercorns",
            "2 teaspoons whole white peppercorns",
            "1 small red onion, sliced in rings",
            "2 carrots, cut in thin slices",
            "2 handfuls fresh dill",
            "2 bay leaves",
            "2-inch piece fresh horseradish, cut in big slices"
        ],
        "title": "Pickled Herring",
        "picture_link": null
    },
    "GGdoiQoWfO5lGjWFF.dIXPt3.n19jaq": {
        "instructions": "To an ice filled pint glass, combine all the ingredients, except the lime wedge. Shake quickly and pour into a serving glass. Garnish with a lime wedge and serve.",
        "ingredients": [
            "1-ounce orange vodka",
            "1-ounce mango rum",
            "Fresh lime juice",
            "1 part cranberry juice",
            "1 part orange juice",
            "Lime wedge, for garnish"
        ],
        "title": "Mojave Madras",
        "picture_link": null
    },
    "wphZYZ8L96KnhxqIdGFQoiFvscIZ/m6": {
        "instructions": "Measure out the ketchup and mayonnaise into a bowl and mix together. If you want it spicy, add dashes of hot sauce to taste. Serve with fries!",
        "ingredients": [
            "1/2 cup ketchup",
            "1/2 cup mayonnaise",
            "Hot sauce, for spice, optional"
        ],
        "title": "Fry Sauce",
        "picture_link": "nfWAkElXsty5Rti1j6a/CgWnkXtNN3a"
    },
    "fNQDCH2xlBLhk/7s.BkmbPtmhzQlx6m": {
        "instructions": "Heat a grill or grill pan over medium heat.\nIn a small bowl, combine the canola oil, salt and pepper, to taste.\nWhen the grill is hot, brush the corn with the seasoned oil. Grill on all sides until the corn is charred and tender, about 12 minutes. (Reserve 2 ears for Round 2 Recipe Corn Salsa.)\nWhile the corn is grilling, in a bowl combine the butter, mayonnaise, onion powder, and lime zest.\nWhen the corn is cooked, generously brush on the flavored butter and serve with a wedge of lime.",
        "ingredients": [
            "2 tablespoons canola oil",
            "Kosher salt and freshly ground black pepper",
            "8 ears corn, fresh or frozen and thawed",
            "1 stick unsalted butter, softened",
            "1/4 cup mayonnaise",
            "1/2 teaspoon onion powder",
            "1 lime, zested",
            "Lime wedges, for serving"
        ],
        "title": "Zesty Grilled Corn on the Cob",
        "picture_link": "eo4rEu4UOOydFOSaKwRqpA0hUVvApvO"
    },
    "C3jI9oXU5UZKoclWlG8cBUYzfmpH5KC": {
        "instructions": "Preheat oven to 350 degrees F. In large bowl, mix together cooked rice, salsa, pinto beans, Chipotle Chicken and 1/2 cup of the 3 Pepper Colby Jack™ cheese. Lay sandwich wrap on a clean, flat work surface. Place 1/2 cup of the chicken mixture in center of sandwich wrap and fold up like a package. Repeat with remaining wraps. Spray baking sheet with cooking spray and place burritos on baking sheet; lightly spray burritos with cooking spray. Top with remaining 1/2 cup of 3 Pepper Colby Jack™ cheese. Bake for 6-8 minutes until heated through; serve warm.",
        "ingredients": [
            "1/2 cup Rice, cooked to package directions",
            "1/2 cup Salsa, hot style",
            "1 can (16 ounces) Pinto beans, drained and rinsed",
            "1 cup (6 ounces) Boar's Head Chipotle Chicken, sliced 1/4\" thick, diced",
            "1 cup (6 ounces) Boar's Head 3 Pepper Colby Jack",
            "sub",
            "™",
            "/sub",
            "cheese, shredded",
            "4 Sandwich wraps, sundried tomato flavor",
            "Nonstick cooking spray"
        ],
        "title": "Chipotle Chicken Rice Burritos",
        "picture_link": "f22zHce6ZQhKrG49RbuhzGh/BboxItu"
    },
    "eveDgbJMLDt6vdl8NbXq7WmVHeCFRCu": {
        "instructions": "Preheat the oven to 300 degrees.\nGrate cheese on the small hole side of a 4-sided box grater into a small bowl. Using a tablespoon measure, place cheese in mounds onto a nonstick silicone pad or greased parchment paper-lined cookie sheet. Flatten out mounds with the back of a spoon, making sure mounds are at least 4 inches apart. Season with pepper, paprika, or cayenne, if desired. Bake on the middle rack of the oven for 5 to 6 minutes or until golden.",
        "ingredients": [
            "3 ounces Parmigiano-Reggiano",
            "Freshly ground black pepper, smoked paprika, or cayenne, optional"
        ],
        "title": "Parmesan Crisps",
        "picture_link": null
    },
    "8uWBD9Kezut1uql28/zjwHHfEuV4JmO": {
        "instructions": "Preheat oven to 375 degrees F.\nRemove and discard all of the stems from the Portobello mushrooms and place in a baking dish.\nIn a separate bowl, combine all of the remaining ingredients and mix well. Place a large spoonful of the mixture on top of each mushroom. Place in oven and bake for 20 minutes.\nServe on a bed of lettuce or on a platter and drizzle the Worcestershire sauce around mushrooms.",
        "ingredients": [
            "4 Portobello mushrooms, cleaned, stems removed",
            "1/2 cup olive oil",
            "1 bell pepper, finely diced",
            "1 red onion, finely diced",
            "1 zucchini, finely diced",
            "1 yellow squash, finely diced",
            "4 tablespoons Worcestershire sauce",
            "Lettuce, optional"
        ],
        "title": "Stuffed Portobello Mushroom with Worcestershire Sauce",
        "picture_link": "8CfEw.dqOpkubjTV7snK7zYljr7eR36"
    },
    "6K0qmTWBQes0/DxWCWzHL.ul/qsA9B2": {
        "instructions": "Put the dates, brown sugar and butter in a microwave-safe medium bowl and cover. Microwave on high in 1-minute increments, stirring in between, until the butter has melted.\nTransfer the mixture to a food processor and pulse until smooth. Add the walnuts, orange zest, vanilla, salt and graham crackers and pulse until the mixture comes together into a stiff and slightly tacky ball. Scoop heaping teaspoonfuls of dough and roll them into balls. Refrigerate the balls until firm, about 1 hour.\nRoll the chilled balls in sanding sugar. The sticky toffee balls can be refrigerated for up to 3 days.",
        "ingredients": [
            "1 cup pitted dates (about 5 ounces)",
            "1/4 cup packed light brown sugar",
            "2 tablespoons unsalted butter",
            "1 cup walnuts",
            "1 teaspoon orange zest",
            "1 teaspoon pure vanilla extract",
            "Pinch fine salt",
            "4 whole graham crackers, broken into pieces",
            "Colored sanding sugar, for rolling"
        ],
        "title": "No-Bake Sticky Toffee Balls",
        "picture_link": "IjRO/EAfv5mDDLncf7gIpzk82xQ1JvG"
    },
    "IG/2j03wNnGeKEn9EAjffGTdlqx31R6": {
        "instructions": "Stir together sour cream and horseradish in a small bowl.\nTo assemble, spread a tortilla evenly with 1 heaping tablespoon of the horseradish mixture. Cover with watercress and a quarter of the roast beef, making sure the ingredients don't quite touch the edges. Spread another heaping tablespoon of the horseradish mixture over the top, followed by a quarter of the apples and 1 tablespoon of blue cheese. Roll up the tortilla. Complete the wraps with the remaining ingredients. Cut in half on the bias.\nThese wraps can be made a day ahead, sealed in wax paper or foil and refrigerated. Serve cold or at room temperature.",
        "ingredients": [
            "2/3 cup plain sour cream",
            "2 tablespoons drained bottled horseradish, to taste",
            "4 flour burrito-size tortillas or lavash (an Armenian soft bread)",
            "1 bunch watercress",
            "1 pound sliced roast beef",
            "1 firm apple, like Granny Smith or Cortland, cored and sliced into very thin wedges",
            "4 tablespoons crumbled blue cheese"
        ],
        "title": "Roast Beef Wrap",
        "picture_link": null
    },
    "Tt6B.DqARg97IUwydna7DISV0.a1hNS": {
        "instructions": "Toast nuts in a small skillet over moderate heat in a small pan until aroma develops and nuts crisp a bit, 5 to 6 minutes. Set aside to cool.\nCombine walnuts, celery, onion, grapes and apples in a medium bowl. Whisk lemon juice, honey, vinegar, cardamom, dill and mustead, then whisk in extra-virgin olive oil in a slow stream. When oil becomes incorporated stream in cream, then season the dressing with salt and pepper, to taste.\nDress salad and adjust salt and pepper, to taste. Use 2 large lettuce leaves per serving to form a bed for the salad.",
        "ingredients": [
            "1 cup whole walnut halves",
            "1 heart celery with greens, wiped clean and chopped",
            "1/2 red onion, thinly sliced",
            "1 cup red seedless grapes, split",
            "2 Gala apples, seeded and chopped",
            "1 lemon, juiced",
            "3 tablespoons honey, eyeball it",
            "2 tablespoons apple cider vinegar",
            "1/2 teaspoon ground cardamom, eyeball it",
            "2 tablespoons fresh dill, finely chopped",
            "2 teaspoons Dijon mustard",
            "1/4 cup extra-virgin olive oil, eyeball it",
            "2 to 3 tablespoons cream, eyeball it",
            "Salt and pepper",
            "1 head Bibb lettuce or butter lettuce"
        ],
        "title": "Where's Waldorf? Salad with My Friend Izzy's Epic Dressing",
        "picture_link": "tZMkUjqePjlPYI3HAk8ptnxof4LlMjC"
    },
    "weOLqK2SteMULi/FEJCh9aeK.hcx4NC": {
        "instructions": "Preheat the oven to 450 degrees F. Drizzle the olive oil in a 10-by-15-inch baking dish or on a rimmed baking sheet. Place the balls of dough side by side in the baking dish and pinch the edges together to make one large piece of dough. Press and stretch the dough so it fills the dish. (If using a baking sheet, press and stretch the dough into a 10-by-15-inch rectangle.) Spread the crushed tomatoes over the dough, leaving a 1-inch border around the edge. Top with the red pepper flakes, cheese, sausage and green pepper. Bake the pizza until the crust is golden brown and the sausage is fully cooked, 25 to 30 minutes. Let cool slightly, then cut into squares.\nPhotograph by Christopher Testani",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil",
            "2 1-pound balls prepared pizza dough, at room temperature",
            "2/3 cup canned crushed tomatoes",
            "3/4 teaspoon red pepper flakes",
            "1 1/2 cups shredded mozzarella cheese or Italian cheese blend",
            "1/2 pound sweet Italian sausage, casings removed, crumbled",
            "1 green bell pepper, sliced into rings"
        ],
        "title": "Sicilian Pizza With Sausage and Peppers",
        "picture_link": "rHme2/yXxYd1WdnqM6WPlXfE.k7r/om"
    },
    "i6lnE/xN1PsPevKk68ExFYGUlNm8BI6": {
        "instructions": "Put the gin, grapefruit juice, lemon juice, Simple Syrup, Chartreuse and orange bitters in a cocktail shaker, add large ice and shake vigorously. Double-strain into a Nick and Nora glass (or other cocktail glass) and garnish with a grapefruit peel twist.\nCombine the sugar and 1 cup water in a small saucepan and bring to a boil. Cook, stirring, until the sugar dissolves. Remove from the heat and let cool completely. Keep covered in the refrigerator up to 1 month.",
        "ingredients": [
            "1 1/2 ounces gin, such as Plymouth",
            "1 ounce fresh grapefruit juice",
            "3/4 ounce fresh lemon juice",
            "1/2 ounce Simple Syrup, recipe follows",
            "1/4 ounce Green Chartreuse",
            "2 dashes orange bitters",
            "Grapefruit peel twist, for garnish",
            "1 cup sugar"
        ],
        "title": "Spring Fling",
        "picture_link": "VtKmJwn6DM5jYzIKr366AGxMKlxZcBa"
    },
    "n2tR5QKFTqffrKxeuF9QtyVc49WQCKa": {
        "instructions": "Vinaigrette:\nPlace vinegar in a medium bowl. Slowly whisk in the oil until emulsified. Season with salt and pepper, to taste.\nSteak:\nPreheat the broiler.\nBroil skirt steak until cooked to desired temperature, about 5 minutes. While broiling, baste it occasionally with soy sauce. Remove from heat and let stand while you prepare the salad.\nSalad:\nPlace lettuce in a large bowl. Drizzle with some of the vinaigrette, sprinkle with oregano, and season with salt and pepper, to taste; toss to combine. Add more dressing, if desired. Divide salad among 2 plates. Arrange tomato, onion, olives, and pepperoncini around the plate.\nSlice steak into thin pieces and divide evenly among salads. Serve.",
        "ingredients": [
            "1/2 cup white vinegar",
            "1/2 cup corn oil",
            "Salt and pepper",
            "1 (6-ounce) skirt steak",
            "Soy sauce, for basting",
            "1 large romaine heart, cut into 1 1/2-inch pieces",
            "1 teaspoon dried oregano, crushed",
            "1 tomato, sliced",
            "1 red onion, cut into rings",
            "3 kalamata olives, sliced",
            "2 pepperoncini"
        ],
        "title": "Insalata Mista con Carne",
        "picture_link": null
    },
    "MpZ4hEgnwDOH1KCm92HMUG2gheVeoau": {
        "instructions": "Prepare the rice according to package directions. Set aside.\nHeat the oil in a wok or large deep skillet over high heat. Add the green beans and onions and cook, stirring frequently, until the onions are lightly browned, about 5 minutes.\nAdd the peppers and 1/2 teaspoon salt and stir-fry until the green beans and peppers are crisp-tender, about 3 minutes. Add the broth, scraping up any browned bits. Stir in the shredded chicken, rice, spice blend and 1/2 teaspoon salt and simmer until no excess liquid remains, about 1 minute. Season with salt.\nTransfer to a platter, sprinkle with the parsley and pine nuts and serve.",
        "ingredients": [
            "Two 8.5- to 8.8-ounce packages 90-second, microwave-ready whole grain brown rice, or 4 cups cooked brown rice",
            "1 tablespoon grapeseed or canola oil",
            "8 ounces fresh green beans, trimmed and halved on the diagonal",
            "1 large white onion, thinly sliced",
            "1 large red bell pepper, thinly sliced",
            "Kosher salt",
            "3/4 cup low-sodium chicken broth",
            "10 ounces shredded rotisserie chicken breast meat, about 2 cups (from 1 rotisserie chicken)",
            "3/4 teaspoon Moroccan spice blend (ras el hanout) or ground cinnamon",
            "1/4 cup fresh flat-leaf parsley leaves",
            "3 tablespoons toasted pine nuts"
        ],
        "title": "Middle Eastern-Style Chicken, Veggies and Rice",
        "picture_link": "kYkn0pLeiSkcSaeMUJ6v0ldvXeWw7P."
    },
    "FaCcYlj3MOZy340vJsNF7TldZSxluh2": {
        "instructions": "In a 10 to 12-inch skillet heat 2 tablespoons oil over moderately high heat and brown beef in batches, transferring beef to plate with slotted spoon or tongs.\nAdd 2 tablespoons butter to skillet and cook onion with salt and pepper, to taste, over moderate heat, stirring, until softened. Add mushrooms and cook, stirring, until tender and liquid they give off is evaporated. Sprinkle flour over vegetables and cook, stirring 1 minute. Add wine and boil until cooking liquid is almost evaporated Add broth and simmer 1 minute. Stir in sour cream and Worcestershire sauce.\nReturn beef to skillet and gently simmer carefully, stirring occasionally, until beef is warmed through about 3 to 5 minutes. Stir in parsley, and season with salt and pepper, to taste.\nServe stroganov with buttered noodles.",
        "ingredients": [
            "2 tablespoons olive oil",
            "4 (5 to 6-ounce) tail of filet or filet mignon pieces, cut crosswise into 1/4-inch-thick pieces",
            "2 tablespoons unsalted butter",
            "1 1/2 cups finely chopped onion",
            "Salt and freshly ground black pepper",
            "1/2 pound fresh shiitakes, stems discarded and caps thinly sliced (about 2 cups)",
            "1/2 pound white mushrooms, trimmed and thinly sliced (about 2 cups)",
            "2 tablespoons all-purpose flour",
            "1 cup dry red wine",
            "1 1/2 cups beef broth",
            "1/2 cup sour cream",
            "1 tablespoon Worcestershire sauce, or to taste",
            "1/4 cup finely chopped fresh parsley leaves",
            "Serving suggestion: buttered egg noodles"
        ],
        "title": "Shiitake Beef Stroganov",
        "picture_link": "fgcoVKx9yibHuq79/eRoVazbkpBVdAy"
    },
    "iyupNDxYYX0N.ya7aEQJekcrjFlA.Qi": {
        "instructions": "In large glass bowl combine vegetables. Add remaining ingredients and mix well. Add half the mixture to a food processor and blend until smooth. Combine puree with original mixture. Chill for 4 hours and serve.",
        "ingredients": [
            "2 cucumbers, diced",
            "3 large tomatoes, diced",
            "1 red pepper, chopped",
            "1 green pepper, chopped",
            "1 red onion, chopped",
            "3 garlic cloves, minced",
            "1/4 cup red wine vinegar",
            "2 1/2 cups tomato juice",
            "Salt",
            "Pepper",
            "1/4 cup fresh parsley, chopped",
            "1/4 cup fresh basil, chopped",
            "Juice of 1 lime",
            "Tabasco"
        ],
        "title": "Gazpacho",
        "picture_link": null
    },
    "ZH0Z0rLjvmufFDJzQ1nsOMfCzuZKBNG": {
        "instructions": "Mix together sauce ingredients and reserve.\nBring pasta water to a boil, salt water and cook spaghetti to al dente.\nWhile pasta cooks, heat a tablespoon of vegetable oil in a large, nonstick skillet over high heat. When oil ripples, add beaten eggs and scramble them to light golden brown, remove and reserve.\nSeason the meat with salt, pepper and coriander. Heat the remaining vegetable oil to a ripple, then add meat and stir-fry 4 minutes, push meat to the side and add ginger, garlic and veggies. Stir-fry veggies 2 minutes, then drain and add pasta and eggs back to skillet. Pour sauce over the spaghetti and toss to combine. Turn off pan. Toss 30 seconds and let the liquids absorb.",
        "ingredients": [
            "3 rounded tablespoons hoisin sauce",
            "3 tablespoons dark soy, eyeball it",
            "3 tablespoons water, eyeball it",
            "2 teaspoons hot sauce, eyeball it",
            "1 pound spaghetti",
            "Salt",
            "1/4 cup vegetable oil, divided",
            "2 large eggs, beaten",
            "3 chicken breast cutlets, thinly sliced into strips",
            "3 thin cut pork chops, thinly sliced into strips",
            "Black pepper",
            "2 teaspoons ground coriander",
            "2 inches fresh ginger, chopped or grated",
            "4 cloves garlic, finely chopped",
            "6 scallions, cut into 3-inch lengths then sliced lengthwise",
            "1/2 pound shiitake mushrooms, chopped",
            "1 red bell pepper, cut into quarters, seeded, then sliced",
            "1 small can sliced water chestnuts",
            "2 cups fresh bean sprouts, 4 generous handfuls or 1/2 pound shredded cabbage, your choice"
        ],
        "title": "Everything Lo Mein",
        "picture_link": null
    },
    "UpfB3Ag6MlUfmfP1Milb5Ygj.mhwciC": {
        "instructions": "Toss cooked spinach tortellini, grape tomatoes and mini mozzarella balls with pesto, olive oil, salt and pepper. Thread onto skewers.",
        "ingredients": [],
        "title": "Tortellini Kebabs",
        "picture_link": "jinVTvilmJSzYfv6Lc2zzrgEfSejOFe"
    },
    "VRczbC6C2ajn9RG3Sq.q3Bi3/XIZhte": {
        "instructions": "Watch how to make this recipe.\nPut all ingredients, except mint, into blender. Puree until well blended.\nServe with sprig of mint.",
        "ingredients": [
            "1 cup peeled, chopped Florida guava",
            "1 mango, peeled, chopped",
            "1/4 cup sugar",
            "1 tablespoon coconut cream",
            "1 lemon, juice only",
            "2 cups low-fat milk",
            "1/2 cup crushed ice",
            "Mint sprigs, for garnish"
        ],
        "title": "Guava and Mango Shake",
        "picture_link": "eMD5MXrnkUUMWZcZXalgD3cp2C5Uaie"
    },
    "UELeDoi/QeWoRxWn1tLsnlbklB9FSNS": {
        "instructions": "Microwave all ingredients in microwaveable bowl on HIGH 5 min. or until VELVEETA is completely melted and mixture is well blended, stirring after 3 min.\nServe with tortilla chips and cut-up fresh vegetables.\nCut ingredients in half; combine in microwaveable bowl. Microwave on HIGH 3 to 4 min. or until VELVEETA is completely melted and mixture is well blended, stirring after 2 min. Serve as directed. Makes 2 cups or 16 servings, 2 Tbsp. each.",
        "ingredients": [
            "1 pkg. (10 oz.) frozen chopped spinach, thawed, drained",
            "1 lb. (16 oz.) VELVEETA Pasteurized Prepared Cheese Product, cut into 1/2-inch cubes",
            "4 oz. (1/2 of 8-oz. pkg.) PHILADELPHIA Cream Cheese, cubed",
            "1 can (10 oz.) RO*TEL Diced Tomatoes & Green Chilies, undrained",
            "8 slices OSCAR MAYER Bacon, cooked, crumbled"
        ],
        "title": "Cheesy Spinach and Bacon Dip",
        "picture_link": "dN0u0nnlMvfRNDRQkZo4XofFp1xf8ni"
    },
    "VpAk3rcKyNmwoiuMMDHRnXGGsi6eNpe": {
        "instructions": "Preheat grill to medium.\nWith a fork prick the potatoes 4 to 5 times, smear them with a little butter and sprinkle each potato with salt. Wrap in foil. Place the potatoes on the grill and cook for 40 to 45 minutes turning every so often.\nIn a mixing bowl add butter, garlic, chives and pepper. Whip together until well incorporated. Take a piece of plastic wrap and lay it on the counter. Place the butter mixture on the plastic wrap and shape into a log or place the bowl in refrigerator covered to firm it back up. When your potatoes are cooked take butter out of the refrigerator, slice open the potatoes and top with herb butter.",
        "ingredients": [
            "2 large russet potatoes",
            "1 stick butter, softened, plus more for brushing",
            "Salt and pepper",
            "2 garlic cloves, mashed into a paste",
            "1 tablespoon finely chopped chives",
            "Pinch salt and freshly ground black pepper"
        ],
        "title": "Baked Potatoes with Herb Butter",
        "picture_link": "KMMwlpgGVCt1CQmCjmB0rZzyaxZ8qaG"
    },
    "MvuR2bN.0NrkPlW.s6N7aczfUDc6YwO": {
        "instructions": "Cook 1 pound sugar snap peas in boiling salted water until crisp-tender, about 4 minutes.\nDrain and toss with 2 tablespoons chopped tarragon, 1 tablespoon olive oil, and salt and pepper.\nPhotograph by Antonis Achilleos",
        "ingredients": [],
        "title": "Tarragon Snap Peas",
        "picture_link": "aqM.PkVxKjUd6iKikohNYSAm9AzlW5e"
    },
    "jA.lApUBbVfNuN4ATnhoXEqAl9XMHUS": {
        "instructions": "In a large saute pan, heat sesame oil over high heat and add shrimp when it quivers. Toss for approximately 1 minute, then add garlic, jalapenos, lime juice and soy sauce. Cook just until shrimp are slightly firm, a total of 3 to 4 minutes. Remove with slotted spoon and place in a bowl.\nHeat a medium saute pan over high heat and add tortillas. Do not add any oil. Cook for approximately 5 seconds on both sides. Repeat with the number of tortillas desired for guests.\nLay out tortillas for assembly on a sheet tray. Begin with spinach to establish a layer between shrimp mixture as it is moist. Next apply black eyed peas, scallions, tomatoes, cilantro and top with cheese. Flash under broiler until cheese is melted. Remove from broiler, fold in half, cut into wedge pieces and arrange on plate. Top with chipotle sauce and scallions.",
        "ingredients": [
            "1 tablespoon sesame oil",
            "10 to 12 medium shrimp, peeled, deveined and sliced laterally in half",
            "1 tablespoon chopped garlic",
            "1 fresh jalepeno, seeds and membranes removed, diced small",
            "Juice of one lime",
            "1 tablespoon soy sauce",
            "1 package of 6-inch flour tortillas",
            "2 cups fresh spinach, chiffonade",
            "1 cup black eyed peas, canned or frozen can be used, cooked until warm and tender",
            "1 cup sliced scallions",
            "2 tomatoes rough small chop",
            "1/8 cup fine chiffonade cilantro for garnish",
            "1 1/2 cups shredded mozzarella or Monterey Jack cheese"
        ],
        "title": "Mini Shrimp and Black Eyed Pea Quesadillas",
        "picture_link": null
    },
    "jiYQuPtA0R8xaimxcmr.8mDukycqGaO": {
        "instructions": "Layer Belle de Brillet (pear flavored liqueur) first.\nThen top with Baileys Coffee Irish Cream.\nGarnish with nutmeg, a grind of 4 seasoned peppers and enjoy.",
        "ingredients": [
            "1.5 oz. Baileys Coffee Irish Cream",
            "1 oz. Belle de Brillet (pear flavored liqueur)",
            "1 sprinkle nutmeg",
            "1 grind 4 seasoned pepper"
        ],
        "title": "Baileys Spiced Coffee",
        "picture_link": "OshofYME7oqoBSaQzr51RC/FYw6bi8S"
    },
    "e5WIQUvFElKbH/zgR8indkkTnwhh18y": {
        "instructions": "Cook pasta to al dente, with a bite to it, then cold shock it to stop the cooking process by running it under cold water in colander. Drain the pasta very well.\nIn the bottom of a large bowl, whisk together soy, peanut butter, vinegar, oil, sesame oil, and hot sauce. Add noodles and veggies and toss to combine the noodles and coat them evenly with sauce. Sprinkle scallions and sesame seeds throughout the salad and serve.",
        "ingredients": [
            "1/2 pound spaghetti",
            "1/4 cup Tamari dark soy, eyeball it",
            "1/4 rounded cup smooth peanut butter, softened in microwave 15 seconds on high",
            "2 tablespoons cider or rice wine vinegar",
            "1 tablespoon dark sesame oil, eyeball it",
            "2 tablespoons hot sauce",
            "2 cups shredded cabbage and carrot mix, available in produce department",
            "1 cup bean sprouts or pea shoots, any variety, available in produce department",
            "3 scallions, chopped on an angle",
            "2 tablespoons sesame seeds"
        ],
        "title": "Hot and Cold Sesame Noodles",
        "picture_link": null
    },
    "NtggJrjQ1pzufRTFlHrcqFPg9K6qH9.": {
        "instructions": "An easy tomato and sweet pickle relish tops this black bean burger.\n1. In small bowl stir together tomato, relish, onion, and mustard.\n2. Cook veggie burger according to package directions.\n3. Top bun bottom with lettuce, burger, tomato mixture and bun top.",
        "ingredients": [
            "4 grape tomatoes, finely chopped",
            "1 tablespoon sweet pickle relish",
            "1 tablespoon finely chopped red onion",
            "1 teaspoon spicy brown mustard",
            "1 Morningstar Farms® Spicy Black Bean Veggie Burger",
            "1 whole wheat hamburger bun or hamburger bun, split and toasted (about 1 1/2 oz.)",
            "1 lettuce leaf"
        ],
        "title": "Morningstar Farmsandreg; Black Bean Burger with Tomato Relish",
        "picture_link": "M4iLvTTUvsmE8Rtn7O00SjGv12iXwQS"
    },
    "TmeHD6Ajt5tzCCraEqAJX93YYyYjLQS": {
        "instructions": "Preheat oven to 350 degrees F.\nIn deep non-greased baking pan, add the thawed meatballs. Top the meatballs with the pineapple chunks. In a medium bowl add the mustard, red and green onion, and garlic. Mix well. Top the meatballs and pineapple with the mustard sauce. Add the Sweet and Sour Sauce and season with black pepper.\nBake for 30 minutes. Remove from the oven; add the remaining pineapple juice, stir to combine, and place back in the oven for the remaining 30 minutes. Serve while hot.\nIn a saucepot, mix all ingredients together. Cook on high heat. Keep your eye on it. Do not walk away. Cook for 2 minutes and stir. After 3 to 4 minutes, take it off the heat and mix for 2 minutes. Use it same day or keep in the refrigerator for about 2 to 3 weeks at the maximum.",
        "ingredients": [
            "1 pound cooked and frozen meatballs, thawed",
            "Two 8-ounce cans pineapple chunks, drained, juice reserved",
            "1/2 cup Dijon mustard",
            "1 diced red or white onion",
            "1/2 cup chopped green onion",
            "6 cloves chopped garlic",
            "Sweet and Sour Sauce, recipe follows",
            "Coarse black pepper",
            "4 cups ketchup",
            "1/4 cup water",
            "2 tablespoons Worcestershire sauce",
            "1 cup sugar",
            "1/4 cup white vinegar",
            "Black pepper (about 2 tablespoons)",
            "2 tablespoons pineapple juice"
        ],
        "title": "Shane's Sweet and Sour Meatballs",
        "picture_link": null
    },
    "WkDw3r9qOrY8uZUS/6zBD4iXfamQooO": {
        "instructions": "Mash the avocado in a medium bowl. Mix in the Jalapeno-Mango Salsa and jicama. Season with salt and pepper. Serve with homemade or purchased tortilla chips.\nHeat the vegetable oil in a small saute pan over medium-high heat. Lightly fry the jalapeno chiles, turning them in the pan until their skins are blistered, about 5 minutes. Set aside to cool. Once cooled, stem, seed and finely chop the jalapeno chiles and place them into a large mixing bowl. Add the cilantro, mangoes, lime juice and onions and season with salt and pepper. Serve immediately or store the salsa in the refrigerator in an airtight container for up to 3 days.",
        "ingredients": [
            "1 avocado, peeled and pitted",
            "1 cup Jalapeno-Mango Salsa, recipe follows",
            "1/3 cup peeled and diced jicama",
            "Kosher salt and freshly ground black pepper",
            "Tortilla chips, for serving",
            "2 tablespoons vegetable oil",
            "2 whole jalapeno chiles",
            "2 tablespoons chopped fresh cilantro",
            "2 mangoes, peeled, pitted and diced",
            "1 lime, juiced",
            "1/4 large red onion, minced",
            "Kosher salt and freshly ground pepper"
        ],
        "title": "Spicy Guacamole with Jalapeno-Mango and Chips",
        "picture_link": null
    },
    "KZyp.cEmvL/x0VIbUdhEAB0hHueda.a": {
        "instructions": "In a saucepan, bring the water, ginger, sugar, and lemon zest to a boil over medium-high heat. Add the pears, and when the pot returns to a boil, reduce the heat to a medium-low to maintain the simmer. Cook the pears until very soft when pierced with a knife (but not falling apart), about 12 minutes. Remove the pan from the heat, and using a slotted spoon, divide the pears among 4 dessert cups or ice cream dishes.\nAdd scoops of ice cream to the pears and garnish with a sprinkle of cinnamon then tumble some fresh blueberries over each serving.",
        "ingredients": [
            "1 cup water",
            "1 one-inch piece fresh ginger, sliced",
            "2 tablespoons sugar",
            "1 lemon zested",
            "2 firm pears, such as Bosc or Anjou, peeled, cut into thin wedges, cut core away as you work",
            "1 pint French vanilla bean ice cream",
            "Ground cinnamon, for garnish",
            "1 cup fresh blueberries"
        ],
        "title": "Ginger-Poached Pears with Ice Cream and Blueberries",
        "picture_link": null
    },
    "/HonfngJcuRnVtjX92f9tE4z92vGN4u": {
        "instructions": "Bring the sugar and 2 cups water to a boil in a medium saucepan over medium-high heat. Reduce the heat and allow the mixture to simmer, without stirring, until the sugar dissolves, about 3 minutes. Set aside to cool completely.\nPlace the raspberries and lime juice in a food processor and puree. Press the raspberry puree through a strainer to remove the seeds. When the sugar syrup has cooled completely, combine with the raspberry puree. Add the corn syrup and stir well.\nPour the mixture into an ice cream maker and freeze according to manufacturer's instructions. Sorbet is particularly soft after churning but firms up after freezing.",
        "ingredients": [
            "2 cups sugar",
            "2 cups water",
            "2 quarts raspberries, hulled and sliced",
            "1/4 cup fresh lime juice",
            "1/2 cup white corn syrup"
        ],
        "title": "Raspberry Sorbet",
        "picture_link": "2cVmxitSOAIh3kvJe7qAL0wYmceBXuO"
    },
    "HqYuPYeGOO8WN0NtMnKxw54KwjloyLW": {
        "instructions": "Puree all balsamic dip ingredients in a blender for 30 seconds. Serve in a bowl alongside veggies.",
        "ingredients": [
            "1 tablespoon Dijon mustard",
            "1 tablespoon honey",
            "1 shallot, minced",
            "2 tablespoons balsamic vinegar",
            "1/4 cup olive oil",
            "1 tablespoon freshly squeezed lemon juice",
            "1/8 teaspoon salt",
            "1/8 teaspoon freshly ground black pepper",
            "4 carrots, peeled and sliced",
            "2 Belgian endives, separated",
            "1 red pepper, membranes and seeds removed, sliced into 1/4-inch strips",
            "1 fennel bulb, trimmed, cored and sliced into bite-size pieces",
            "1 bunch radishes, trimmed",
            "1 cup teardrop tomatoes, stemmed"
        ],
        "title": "Crudites with Balsamic Dip",
        "picture_link": null
    },
    "T1Daop3iRiJTbKqYNbOhLzc2yQDldsq": {
        "instructions": "Mix the cream cheese, cottage cheese and confectioners' sugar in a medium bowl. Spread 2 waffles with the jam, then top with the cream cheese mixture; cover with the remaining 2 waffles.\nMelt the butter in a large skillet over medium-high heat. Add the sandwiches and cook until golden and crisp, about 3 minutes per side, adding more butter to the pan if needed. (Adjust the heat if the waffles are browning too quickly.)\nLet the sandwiches rest 1 minute before serving. Sprinkle with confectioners' sugar and cinnamon.\nPhotograph by Sam Kaplan",
        "ingredients": [
            "1/3 cup whipped cream cheese",
            "1/4 cup small-curd cottage cheese",
            "2 tablespoons confectioners' sugar, plus more for topping",
            "4 frozen waffles (untoasted)",
            "1 to 2 tablespoons jam (any flavor)",
            "1 tablespoon unsalted butter, plus more if needed",
            "Ground cinnamon, for topping"
        ],
        "title": "Breakfast Grilled Cheese",
        "picture_link": "lj5QmhgKtTvQWEzlBaaQe4jdSMOhwx2"
    },
    "FBNZZKrv5kFo9EH.Ue6p5OCM.f7cYmO": {
        "instructions": "In a medium bowl mix the potatoes, onions, and 1/2 teaspoon salt by hand.\nHeat 2 tablespoons of the oil in a large non-stick frying pan. Fry the potatoes and onions on low heat and cover with a lid for 5 minutes to let them soften. Turn up the heat for another 5 minutes until golden brown. Remove from the stove and drain off any excess oil.\nMeanwhile break the eggs into a medium bowl. Add the remaining salt and milk and whisk vigorously until frothy. Add the potatoes and onions to the eggs and mix until fully integrated.\nClean the frying pan and return to stove.\nHeat the remaining 2 tablespoons of oil on a high heat and pour in the mixture, moving it around in the pan to help the tortilla to rise. Fry until golden brown, stirring occasionally until it has set. Then turn down the heat to allow the inside to cook. After a few minutes turn up the heat in order to brown the tortilla.\nWhen it's cooked place a large plate over the frying pan and flip the tortilla onto it. Return to the pan and fry the other side until golden brown.",
        "ingredients": [
            "6 medium potatoes, diced",
            "2 small onions, coarsely chopped",
            "1/2 teaspoon salt, plus 1/2 teaspoon",
            "2 tablespoons sunflower oil, plus 2 tablespoons",
            "7 eggs",
            "1/4 cup milk",
            "Serving suggestion: tomato salad drizzled with olive oil"
        ],
        "title": "Spanish Tortilla",
        "picture_link": "MqENteLHQt/7umNYgwU.1aEeqtcoKNK"
    },
    ".MTsn/ZO9U7zBcU8e.oJDtIcHWXXq8W": {
        "instructions": "In a mixing bowl, whisk together the yeast and warm water. Let stand and bloom for about 20 minutes. Mix on low speed, the flour, cold water, olive oil, and salt. Beat in slowly at first and then increase the speed of the mixer as the flour in incorporated. Turn the speed down and mix until the dough becomes soft and begins to pull away from the sides of the bowl. Pour it out on a floured board. Knead the dough adding flour to dust as needed. Shape the dough into a large ball and cover with a towel to let stand until it doubles in size, about 1 hour.\nHeat a saute pan with 2 tablespoons of olive oil and add the leeks. Turn the heat to medium high and sweat the leeks until soft and translucent. Set aside and let cool. When ready, cut the dough into 6 ounce pieces. Roll it out to about 1/2-inch thick circle a little smaller than the skillet. Heat a large skillet with the remaining 2 tablespoons of olive oil. Place the rolled dough into the skillet and flip it to brown on both sides. Once browned, sprinkle the top with feta cheese, leeks, 1 teaspoon salt, and pepper. Bake in a preheat 350 degree F. oven just long enough for the cheese to melt. Pull from the oven and cut into 6 pieces. Serve warm.",
        "ingredients": [
            "1/2 envelope dry yeast",
            "1/4 cup warm water",
            "2 cups all-purpose flour",
            "1/2 cup cold water",
            "1 tablespoon extra-virgin olive oil",
            "4 tablespoons olive oil",
            "1 teaspoon salt, plus 1 teaspoon salt",
            "1/2 cup leeks, cleaned, sliced thin",
            "1 cup feta cheese, crumbled",
            "1/2 teaspoon black pepper"
        ],
        "title": "Skillet Pizza: Tiganopitta",
        "picture_link": null
    },
    "PAQgXyCWpYIpwrDh.afgkR0B6ChInvm": {
        "instructions": "To make the cajeta: place the unopened can of milk in a heavy saucepan and cover completely with water. Over very low heat, cook at a bare quiver for 3 hours, adding more water as necessary as it evaporates. With an oven glove, turn the can over and cook for 2 1/2 hours more. Cool to room temperature and refrigerate overnight.\nIn a blender, combine the milk, eggs, sugar, flour, butter, salt, vanilla, cloves, and cinnamon and blend until completely smooth. Let the batter sit in the refrigerator for 1 hour.\nHeat a small nonstick skillet and pour in about 2 tablespoons of the crepe batter, swirling the pan immediately to make sure the batter covers the pan evenly. Cook until small bubbles form on the surface, then flip to the other side. Slide onto a plate and make the remaining crepes in the same way, stacking them on the plate until you are finished.\nTo assemble the crepes: open the can of cooked condensed milk and stir it up from the bottom with a fork, blending to an evenly thick consistency. Spread about 1 tablespoon of the \"cajeta evenly over the surface of one crepe. Scatter some of the toasted pecans over the top and roll up into a tube. Repeat with the remaining crepes and reheat in a low oven for a few minutes before serving. Serve 4 crepes per person, sprinkled with a little confectioners sugar and scattered with raspberries.",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk",
            "1 cup milk",
            "1 large egg",
            "2 large egg yolks",
            "1 teaspoon sugar",
            "1/2 cup all-purpose flour",
            "2 tablespoons unsalted butter, melted",
            "1/4 teaspoon salt",
            "1/2 teaspoon vanilla",
            "Pinch ground cloves",
            "Pinch ground cinnamon",
            "1 cup coarsely chopped pecans, toasted (see Note)",
            "2 tablespoons confectioners sugar",
            "1 pint fresh raspberries"
        ],
        "title": "Crepes Cajeta",
        "picture_link": null
    },
    "NgoyDasaF5KAT/xxBoaevbW6aKWPMiW": {
        "instructions": "To make the marinade: using a food processor, grind the ingredients into a paste the consistency of thin yogurt. Reserve small amount for basting and transfer the remaining marinade to a glass bowl. Add the cleaned and trimmed chicken wings. Toss liberally, cover with plastic wrap, and marinate in the refrigerator overnight.\nTo grill the wings, shake off the excess marinade and grill the wings over medium heat for approximately 5 minutes per side, or until crispy. Brush them frequently with the reserved marinade, and be careful not to burn the wing tips. The wings should have a crispy texture with a deep mahogany color when done.\nServe with the Thai Peanut Sauce.\nTo make the peanut sauce, add the peanuts along with the peanut oil to a food processor. Blend, on high, until the peanuts form a rough paste. Add the rest of the ingredients except for the cilantro; blend until smooth. Stir in the cilantro and thin with peanut oil to taste.",
        "ingredients": [
            "2 cups coconut milk",
            "1 medium onion, coarsely chopped",
            "2 tablespoons crushed garlic",
            "2 teaspoons ground turmeric",
            "2 teaspoons red pepper flakes",
            "1 teaspoon ground galangal (or 1/2 teaspoon freshly grated ginger)",
            "1 tablespoon kosher salt",
            "20 chicken wings, jointed",
            "Thai Peanut Sauce, recipe follows",
            "1/2 cup unsalted roasted peanuts",
            "1 tablespoon peanut oil, plus more to taste",
            "2 fresh Thai chiles or other small chiles",
            "1 1/2-inch-thick slice fresh ginger",
            "4 garlic cloves",
            "1/3 cup canned unsweetened coconut milk",
            "2 teaspoons low-sodium soy sauce",
            "4 teaspoons fish sauce",
            "1 teaspoon granulated sugar",
            "1 tablespoon fresh lime juice",
            "Pinch salt (add to taste, as fish sauce can be very salty)",
            "1/2 cup finely minced cilantro leaves and stems"
        ],
        "title": "Grilled Coconut Wings with Thai Peanut Dipping Sauce",
        "picture_link": null
    },
    "S/kerCiajM5ieTA9qwgYaFFXFPhzuui": {
        "instructions": "In a large skillet over medium heat, melt the butter. Add the chanterelles and season with salt and pepper. When the chanterelles begin to release moisture, add the shallots and cook until the mushrooms are tender, about 3 to 5 minutes. Be careful not to overcook or they will become tough\nTransfer the chanterelles to a bowl with a slotted spoon, leaving the juices behind in the pan for drizzling. Stir the parsley into the mushrooms and season with salt and pepper.\nPlace croutons around the serving dish with the goat cheese end of the crouton facing outward. Put chanterelles in the center of the croutons and drizzle the mushroom liquid over top of the mushrooms.\nPreheat the oven to 325 degrees F.\nMelt the butter in a large skillet over low heat. Press the baguette slices into the melted butter. Once coated, place the baguette slices on a sheet pan. Sprinkle evenly with the Parmesan and herbs. Then sprinkle only the top half of the croutons with the goat cheese. Cook the croutons until crisp, about 6 to 8 minutes. Keep warm until ready to serve with the mushrooms.",
        "ingredients": [
            "3 ounces butter",
            "1 pound California chanterelles, cleaned and sliced",
            "Salt and freshly ground black pepper",
            "2 shallots, finely diced",
            "1 1/2 tablespoons chopped fresh parsley leaves",
            "Goat Cheese Croutons, recipe follows",
            "3 tablespoons butter",
            "12 baguette slices, sliced 3/8-inch-thick",
            "2 ounces grated Parmesan",
            "1 teaspoon chopped fresh parsley leaves",
            "1/4 teaspoon chopped fresh rosemary leaves",
            "1/4 teaspoon chopped fresh thyme leaves",
            "1 1/2 ounces goat cheese"
        ],
        "title": "California Chanterelles with Goat Cheese Croutons",
        "picture_link": null
    },
    "Aj984Dk6Q6kpxbnSufw8JjRqon03aEK": {
        "instructions": "Preheat the oven to 350 degrees F. Using a pencil, draw an 8-by-10-inch rectangle on a piece of parchment paper. Turn the parchment paper over so the pencil mark doesn¿t get onto the chocolate and place it on a sheet pan.\nPlace the pistachios in one layer on another sheet pan and bake for 8 minutes. Set aside to cool.\nPlace three-quarters of the white chocolate in a heat-proof glass bowl and put it in the microwave on high for 30 seconds. (Time it with your watch for accuracy.) Stir the chocolate with a rubber spatula, return it to the microwave for another 30 seconds, then stir again. Continue to heat and stir in 30-second intervals until the chocolate is just melted. Immediately stir in the remaining chocolate and allow it to sit at room temperature, stirring often, until it¿s completely smooth. (If you need to heat it a little more, place it in the microwave for another 15 seconds.)\nPour the melted chocolate onto the parchment paper and spread it lightly to fill the drawn rectangle. Sprinkle the top evenly with the cooled pistachios, the cranberries and apricots. Press the nuts and fruit lightly so they will set in the chocolate. Set aside for at least 2 hours until firm or refrigerate for 20 minutes. Cut or break the bark in 16 pieces and serve at room temperature.\nPhotograph by Johnny Miller",
        "ingredients": [
            "1/2 cup whole shelled salted pistachios",
            "16 ounces good white chocolate, finely chopped (see note)",
            "1/4 cup dried cranberries",
            "1/4 cup medium-diced dried apricots"
        ],
        "title": "White Chocolate Bark",
        "picture_link": null
    },
    "PnYSc/Nxrv2ZvzJEYwKsaUzTz10pv3.": {
        "instructions": "Special equipment: A steamer or steamer basket Cheesecloth or paper towel String hopper press, see Cook's Note ***** 12 thatu, see Cook's Note*****\nIn a large stainless steel pot combine the coconut milk and 3 cups water. Whisk in the tamarind pulp. Over high heat, bring the mixture to a boil, then remove from the heat. Add the saffron and steep for 15 minutes. Strain the mixture and reserve liquid for later.\nMelt the unsalted butter in a large pot over medium heat. Add the onions and saute for 5 minutes until soft and just beginning to brown. Add the Thai chiles, Sambhar Spice Mix, ground coriander, ground cumin, curry powder, and turmeric powder. Stir to combine, reduce heat to low and simmer for 3 to 4 minutes to bring out the flavor of the spices. Add the remaining 4 cups water, channa dal, potatoes and tomatoes and cook until tender, but not mushy, about 18 to 20 minutes.\nAdd the reserved coconut/tamarind liquid and simmer for 5 minutes. Serve warm and garnish with the cilantro leaves.\nIn a heavy skillet, over very low heat, dry roast the channa and urad dahl, stiring constantly, for 5 to 8 minutes. See Cook's Note***. Remove the dal from skillet and set aside to cool.\nIncrease the heat to medium high, add the coriander seeds, cumin seeds, black peppercorns, fenugreek seeds and dried chilies to the skillet, stirring constantly. Toast the spices until they release their aroma, about 3 minutes. Grind the dal to a powder in a spice grinder or coffee grinder. Grind the toasted spices to a powder. Combine the dal, ground spices and turmeric powder. Store in a tightly sealed jar.\nLine a steamer with several layers of cheesecloth and fill with the all-purpose flour. Steam for 45 minutes. Spread the steamed flour on a baking sheet to cool. Combine the steamed flour, rice flour, and salt in a large bowl.\nMake a well in the center of the flour and add the hot water. Mix with a spoon until you can gather the dough together into a ball. On a clean surface, knead the dough lightly for 2 to 3 minutes Press the dough through the hopper press onto the thatu. Place 6 filled thatu in the steamer and steam for 5 to 8 minutes. While they are steaming fill the remaining thatu with dough, then steam.",
        "ingredients": [
            "27 ounces coconut milk (2 tins)",
            "3 cups water, plus 4 cups",
            "4 ounces tamarind pulp",
            "Pinch saffron",
            "1/4 cup unsalted butter",
            "2 medium onions, sliced (about 1/2 pound)",
            "3 Thai chiles, chopped",
            "2 tablespoons Sambhar Spice Mix, recipe follows",
            "1 tablespoon ground coriander",
            "1 tablespoon ground cumin",
            "2 teaspoons curry powder",
            "1 teaspoon turmeric powder",
            "2 cups channa dal, see Cook's Note*",
            "2 Yukon gold potatoes, cubed",
            "3 tomatoes, diced",
            "2 tablespoons chopped fresh cilantro leaves",
            "Serving suggestions: String Hoppers, recipe follows",
            "2 teaspoons channa dal, see Cook's Note**",
            "2 teaspoons urad dal, see Cook's Note**",
            "4 tablespoons coriander seeds",
            "2 teaspoons cumin seeds",
            "2 teaspoons black peppercorns",
            "1 teaspoon fenugreek seeds",
            "8 dried chilies",
            "1/2 teaspoon turmeric powder",
            "2 1/2 cups all-purpose flour",
            "1/2 cup toasted rice flour****",
            "1 teaspoon kosher salt",
            "2 cups hot water"
        ],
        "title": "Sambhar",
        "picture_link": "en0PRguWl.PMpKl/qZBg0LDgfXMCEi6"
    },
    "0TSv8oiEPvzgBwFtbWJJ5S3ekVmev7W": {
        "instructions": "Prepare grill. Soak skewers in warm water for 20 minutes. While skewers are soaking, thinly slice garlic and in a shallow glass dish stir together with gingerroot and 2 tablespoons lime juice. Season marinade with salt and pepper. Holding a knife at a 45 degree angle, cut steak crosswise into about 1/4-inch thick slices and add to marinade, tossing to coat well. Marinate steak at room temperature for 10 minutes. In a small bowl whisk together hoisin sauce, ketchup, and remaining lime juice and season with salt and pepper. Drain skewers. Beginning at one end of each slice of steak of steak, weave a skewer lengthwise through it, stretching slice on skewer to flatten, and transfer to a plate. Season sates with salt and pepper. Grill sates on an oiled rack set 5 to 6 inches over glowing coals 30 seconds to 1 minute on each side for medium-rare. Serve sates with hoisin dipping sauce and lime wedges. Garnish with lemon wedges.;",
        "ingredients": [
            "28 (8-inch) wooden skewers",
            "2 large garlic cloves",
            "1 tablespoon finely grated peeled fresh gingeroot",
            "1/4 cup fresh lime juice, or to taste",
            "8 ounces skirt steak",
            "1/4 cup hoisin sauce",
            "1 tablespoon ketchup",
            "1 lemon, cut in wedges",
            "1 lime cut in wedges"
        ],
        "title": "Beef Sates with Hoisun Dipping Sauce",
        "picture_link": null
    },
    "vl300E3DnCOqz3MCiemba3H3mjEOvgi": {
        "instructions": "Pour oil in a deep fryer or heavy saucepan to reach halfway up the sides of the pan. Heat to 325 degrees F, use a deep fry thermometer to determine this. While the oil is heating, peel the potatoes and push through a French fry cutter to form uniform sticks. As you go, place the cut potatoes in a bowl of ice water to release some of the starch and to keep them from browning.\nDry the potato strips thoroughly, this will keep the oil from splattering. Fry the potatoes in batches so the pan isn't crowded and the oil temperature does not plummet. Cook for 3 minutes until they are soft but not browned. Remove the potatoes with a long-handled metal strainer and drain on brown paper bags.\nBring oil temperature up to 375 degrees F. Return the par-fried potatoes to the oil in batches and cook a second time for 4 minutes until golden and crispy. Drain on fresh brown paper bags then place in a serving bowl lined with paper towels. Salt and serve immediately.",
        "ingredients": [
            "Peanut or other vegetable oil, for frying",
            "2 pounds baking potatoes, like russets",
            "Salt, to taste"
        ],
        "title": "Double Fried French Fries",
        "picture_link": null
    },
    "hoAt7UVQyNiXbNlQgsmKfUNOBLVPco2": {
        "instructions": "Preheat oven to 450 degrees.\nSeason fish inside and out with salt and pepper. Place lime leaves inside the body cavity. Combine the peanut oil, garlic, ginger and basil leaves in a dish and marinate the fish for 1 to 2 hours, refrigerated, occasionally turning and basting.\nPreheat roasting pan in oven for 10 minutes before cooking snapper.\nAdd the red pepper, cabbage and tofu to the pan and roast for 5 minutes.\nPlace the marinated fish into the preheated roasting pan on one side on a bed of the vegetables and roast for 12 to 15 minutes before turning the fish to its other side.\nRoast for 5 minutes and pour the peanuts and coconut milk over the fish. Continue to roast for 10 minutes more before removing from the oven.\nAllow to rest for 5 minutes.\nUse two spoons to remove the fish from the bones.\nServe on a bed of rice noodles tossed with sesame oil. Spoon the tofu, red pepper, cabbage and pan juices over the fish and noodles.",
        "ingredients": [
            "1 whole red snapper, skin on scales removed and gutted",
            "Salt and freshly ground black pepper to taste",
            "4 keffir lime leaves",
            "2 tablespoons peanut oil",
            "2 cloves garlic, finelyminced",
            "2 tablespoons finely chopped ginger",
            "6 to 8 Thai or other fresh basil leaves, shredded",
            "2 sweet red peppers, seeded and julienned",
            "1 cup shredded white cabbage",
            "4-ounce piece fresh tofu, cut into 1-inch pieces",
            "1/2 cup shelled unsalted peanuts",
            "1/2 cup coconut milk (unsweetened)"
        ],
        "title": "Roasted Red Snapper with Thai Basil",
        "picture_link": null
    },
    "pOadgitLTBeDtBMI.WcHXr5LOUYbmSu": {
        "instructions": "For the infused vodka: Heat a small skillet over medium heat. Throw in the cardamom and toast until slightly golden and fragrant, about 30 seconds. Remove from the heat. Add the cardamom to the vodka along with the orange zest and vanilla bean. Stir to combine, then cover and refrigerate for at least 2 hours or up to overnight.\nFor the basil caviar: Combine 1 cup water and the raw sugar in a small pot over medium heat, stirring to dissolve the sugar. When it starts to simmer, remove the pot from the heat and stir in the basil. Pour the mixture into a blender and puree until smooth (be careful when blending hot liquids). Strain into a bowl and add the sodium alginate. Whisk for 1 minute, until thick. Whisk the bottled water and calcium lactate in a bowl. Suck the basil syrup into a syringe and squeeze small balls into the calcium bath. Let them soak for no more than 1 minute. Scoop out the basil caviar using a slotted spoon and rinse in a bowl of fresh water.\nFor the mojitos: For each drink, muddle slices from 1 orange, 3 to 4 basil leaves and 1 tablespoon maple syrup in a glass. Throw in some ice cubes, 1 shot infused vodka, 1/2 cup orange juice and 1/4 cup sparkling water and top with 1 tablespoon basil caviar.\nPhoto reprinted with permission from Nadia G.'s Bitchin' Kitchen: Cookin' For Trouble by Nadia G., copyright (c) 2011. Published by Ballantine Books.",
        "ingredients": [
            "3 cardamom pods",
            "Pitcher of European vodka",
            "Zest of 1 blood orange",
            "1 vanilla bean, split lengthwise",
            "1/2 cup raw sugar",
            "1 cup fresh Thai basil leaves",
            "2 grams sodium alginate",
            "2 cups demineralized bottled water",
            "3 grams calcium lactate",
            "4 blood oranges, sliced",
            "12 fresh Thai basil leaves",
            "4 tablespoons pure maple syrup",
            "Ice",
            "2 cups fresh blood orange juice",
            "1 cup sparkling water"
        ],
        "title": "Cardamom Blood Orange Mojitos with Sweet Basil Caviar",
        "picture_link": null
    },
    "1ZN1tzVleG/NC4d0IbqFMnk4GwM6nLS": {
        "instructions": "In a large sauce pan, combine the peaches, red pepper flakes, honey, water, and salt, and pepper, to taste and place the pan over medium heat. Bring to a simmer, then lower the heat and simmer slowly for 30 minutes, stirring occasionally. Let the mixture cool, then blend it in a blender or food processor until smooth.\nIn a small bowl, stir the cream cheese and sour cream together until well combined.\nDivide the cream cheese mixture among 4 slices of bread, reserving a little bit of cream cheese for garnish. Spread the peach jam on the other slices of bread. Top the cream cheese slices with a few slices of prosciutto and top with the slices with jam. Slice in half.\nIn a small bowl, blend the chopped tarragon, parsley, and basil then spread them out on a plate.\nSpread a light coating of reserved cream cheese on the exposed sliced end of each sandwich half and dip in the chopped herbs. Arrange the sandwiches on a plate and serve.",
        "ingredients": [
            "1 tablespoon sour cream",
            "8 thin slices of good quality white bread",
            "1/2 pound thinly sliced prosciutto",
            "1/4 cup each finely chopped fresh tarragon, Italian flat-leaf parsley, and basil",
            "3 peaches, pitted and chopped",
            "1/8 teaspoon red pepper flakes",
            "1/4 cup honey",
            "1 tablespoon water",
            "Kosher salt and freshly ground black pepper",
            "1/2 cup cream cheese"
        ],
        "title": "Prosciutto Finger Sandwiches with Spicy Peach Jam",
        "picture_link": "vWISENdaf4eKobI2CHRWfXynHUGMm5K"
    },
    "6hbuLw3lj/6eI1U2AU15GMIw3YsaL2y": {
        "instructions": "Preheat a medium soup pot over medium-high heat with 2 turns of the pan of olive oil, about 2 tablespoons. Add the chorizo and cook, stirring frequently, 3 minutes. Add the 2 cloves chopped garlic, onion, celery, carrot, potatoes, thyme, salt and pepper, cook for 3 to 4 minutes. Add the tomatoes and chicken broth and bring up to a bubble, turn the heat down to medium low and simmer for 10 minutes, or until slightly thickened.\nFill a medium skillet with warm water. Bring water to a gentle simmer over medium low heat. As the water is coming up to a simmer proceed with making the garlic croutons and the zesty parsley sprinkle.\nToast the bread in the broiler or in a toaster oven. Once the bread is toasted, rub with the cracked garlic and then drizzle extra-virgin olive oil over it and reserve.\nPile the parsley leaves, lemon zest and orange zest on a cutting board. Run your knife through the pile until the parsley is finely chopped and the zests are completely incorporated into the parsley, reserve.\nOnce the water is at a bubble for poaching the eggs, pour the vinegar into the simmering water. Crack an egg into a small bowl. Gently pour the egg into the simmering water. Repeat with the remaining 3 eggs. Cook eggs for about 2 minutes for runny yolks, or about 4 for solid yolks. Do not allow the water to boil. Carefully remove the eggs with a slotted spoon to a towel-lined plate to drain.\nTo serve, pull thyme stems from chorizo-tomato stew, then arrange the garlic croutons in the bottom of 4 shallow soup bowls, ladle some of the stew on top of the garlic croutons, set eggs in place and sprinkle dish with zesty parsley sprinkle and serve.",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil, 2 turns of the pan plus some for drizzling",
            "3/4 pound chorizo sausage, in packaged meats case near kielbasa, thinly sliced",
            "3 cloves garlic, 2 chopped and 1 crushed",
            "1 large yellow onion, chopped",
            "2 ribs celery, chopped",
            "1 large carrot, peeled and chopped",
            "6 medium size red potatoes, halved and thinly sliced",
            "4 sprigs fresh thyme",
            "Salt and pepper",
            "1 (28-ounce) can fire roasted diced tomatoes (recommended: Muir Glen)",
            "2 cups chicken broth",
            "4 thick slices crusty farm house, country style bread",
            "1/2 cup flat- leaf parsley leaves, a few large handfuls, picked",
            "1 lemon, zest",
            "1 orange, zest",
            "2 tablespoons white wine vinegar, eyeball it",
            "4 eggs, 1 per serving"
        ],
        "title": "Poached Eggs in Chorizo-Tomato Stew with Garlic Croutons",
        "picture_link": "9rIDg/SMmqnlkqMtokWoLq65Shxst6i"
    },
    "xaxGyTFp47wu44sao.vJzDq0UbUAuSC": {
        "instructions": "Dredge both sides of the swordfish in blackening spice. Heat a heavy, cast-iron skillet over high heat until it is smoking hot.\nAdd the swordfish and cook for 3 minutes. Turn over and cook for 3 minutes more. Warm the crab hash in saute pan, turning to warm throughout. Place warm Voodoo Sauce on a plate and top with sweet potato crab hash. Top with swordfish. Top with tomato and scallion garnish.\nHeat the olive oil in a saute pan. Add the roasted sweet potatoes, shallots, and poblano peppers and saute for 2 minutes. Add Voodoo sauce and Worcestershire sauce, salt and pepper, to taste. Add the crabmeat and gently toss until the crab is heated through.\nIn a saucepan over low heat, reduce the cream by 1/3. In a separate saucepan, heat the BBQ sauce. Add the reduced cream. Add the butter and simmer for 3 to 4 minutes. Whisk in the salt and pepper. Keep warm until ready to serve.\nIn a large pot, add the butter, onion, and garlic and let sweat until translucent. In a large bowl, blend together the vinegar, apricot jam, dry mustard, brown sugar, and Dijon mustard until smooth. Add this mixture to the garlic and onion mixture with the rest of the ingredients. Bring to a simmer and cook for 1 hour.",
        "ingredients": [
            "1 (9-ounce) swordfish steak",
            "1/2 cup blackening spice",
            "2 cups Sweet Potato Crab Hash, recipe follows",
            "4 ounces Voodoo Sauce, recipe follows",
            "1 ounce tomato concasse",
            "1 ounce scallions, chopped",
            "Olive oil, to coat saute pan",
            "1/2 pound sweet potatoes, roasted until tender and cut into 1/2-inch pieces",
            "1 shallot, thinly sliced",
            "1 poblano pepper, stemmed, seeded, and julienne",
            "3 ounces Voodoo Sauce, recipe follows",
            "2 tablespoons Worcestershire sauce",
            "Salt and pepper",
            "1/2 cup jumbo lump crabmeat",
            "1 cup heavy cream",
            "2 cups BBQ sauce, recipe follows",
            "2 tablespoons butter",
            "1 teaspoon salt",
            "1 teaspoon freshly ground black pepper",
            "1/2 pound butter",
            "3 large onions, chopped",
            "1 cup finely chopped garlic",
            "16 ounces white wine vinegar",
            "1 jar apricot jam",
            "1/4 cup dry mustard",
            "1/2 box brown sugar",
            "3/4 cup Dijon mustard",
            "13 cups (1 #10 can) chili sauce",
            "1 quart apple juice",
            "1/2 cup finely chopped cornichon",
            "1/8 cup hot red pepper sauce",
            "3/4 tablespoon cayenne",
            "1/2 cup Worcestershire sauce",
            "1/4 cup turmeric",
            "1/4 cup ground celery seed",
            "1 1/4 cups peeled, cored, and diced apples"
        ],
        "title": "Blackened Swordfish with Sweet Potato Crab Hash",
        "picture_link": null
    },
    "rz/Q79uzSIM/cFXvgieE9HKY7K18cSO": {
        "instructions": "Preheat the oven to 375 degrees F and butter a 3-quart baking dish. Melt 2 tablespoons butter in a large skillet over medium heat. Add the sausage and cook, stirring, until browned, about 5 minutes. Remove with a slotted spoon and transfer to a plate.\nMelt the remaining 6 tablespoons butter in the skillet, then add the onion, celery, sage, thyme, 1 teaspoon salt and a few grinds of pepper. Cook, stirring, until the vegetables are tender, about 5 minutes. Add 3 cups broth and bring to a boil; remove from the heat.\nWhisk the eggs and parsley in a large bowl. Add the potato bread, cornbread, sausage and vegetable-broth mixture and stir until combined, adding up to 1/2 cup more broth if necessary. Transfer to the prepared baking dish. Drizzle with the turkey drippings (or dot with butter).\nCover the dish with foil and bake 30 minutes, then uncover and bake until golden, about 35 more minutes.\nPhotograph by Ryan Dausch",
        "ingredients": [
            "1 stick unsalted butter, plus more for the baking dish",
            "1 pound andouille sausage, diced",
            "1 onion, finely chopped",
            "5 stalks celery, finely chopped",
            "1 tablespoon chopped fresh sage",
            "1 tablespoon chopped fresh thyme",
            "Kosher salt and freshly ground pepper",
            "3 to 3 1/2 cups low-sodium chicken or turkey broth",
            "2 large eggs",
            "1/2 cup chopped fresh parsley",
            "6 cups 1/2 -inch stale potato bread cubes (about 10 ounces)",
            "6 cups 1/2 -inch stale cornbread cubes (about 10 ounces)",
            "2 tablespoons fat from the turkey drippings (or butter)"
        ],
        "title": "Cornbread-Andouille Stuffing",
        "picture_link": "CJ4iC6F08i9zpbLSjoVvT3htLR62Ife"
    },
    "wS9WlZNzMwgxquL2qvwDQYyGl0bdESe": {
        "instructions": "Bring the reserved shrimp shells and seafood stock to a boil in a large pot. Reduce the heat to medium low and simmer, uncovered, 20 minutes, stirring and skimming the surface occasionally. Strain the broth into a large bowl, pressing on the solids with the back of a spoon to release as much liquid as possible. Return the broth to the pot and keep warm.\nMeanwhile, heat the olive oil in a heavy skillet over medium-high heat. Add the onion and cook until translucent, about 5 minutes. Add the carrot, celery and bell pepper and cook until softened, about 7 minutes. Stir in the tomato and chiles de arbol and cook 5 more minutes. Stir in the tomato paste and dried shrimp powder and cook 3 minutes.\nAdd the cooked vegetables to the broth. Cook over medium-low heat, covered, 1 hour, 30 minutes. Add the shrimp. Turn off the heat and let stand 3 minutes, or until the shrimp are cooked through. Serve with lime wedges.\nPhotograph by Yunhee Kim",
        "ingredients": [
            "1 pound jumbo shrimp, peeled and deveined, shells reserved",
            "8 cups seafood stock",
            "2 tablespoons extra-virgin olive oil",
            "1 small white onion, diced",
            "1 carrot, cut into 1/4-inch-thick rounds",
            "2 stalks celery, diced",
            "1 green bell pepper, diced",
            "1 tomato, seeded and diced",
            "4 dried chiles de arbol, roughly chopped",
            "2 tablespoons tomato paste",
            "1 tablespoon Mexican dried shrimp powder (optional)",
            "Lime wedges, for serving (optional)"
        ],
        "title": "Spicy Shrimp Broth",
        "picture_link": "W1OHdekXHyw/0UxtGVPnZMZORbEveq."
    },
    "In5kpRf3rIbbiZ.Eto3V23kBlj3JDSW": {
        "instructions": "Preheat the oven to 400 degrees F. Line a baking sheet with parchment paper. Microwave the bacon drippings for 8 to 10 seconds to melt, if necessary. Combine the tomatoes, onion, bacon drippings, lemon pepper, red pepper flakes, 1/2 teaspoon salt and 1/4 teaspoon pepper in a large bowl. Spread on the prepared baking sheet and roast until slightly softened, about 10 minutes. Let cool. Reduce the oven temperature to 375 degrees F.\nCoat the bottom and side of an 8- or 9-inch cast-iron skillet with cooking spray. Toss the tomato mixture with the lemon juice and asiago; spread evenly in the skillet. Place the puff pastry on top; trim the overhanging pastry with kitchen shears.\nTransfer the skillet to the oven and bake until the pastry is dark golden, about 50 minutes. Let cool about 5 minutes, then place a large plate or platter on top of the skillet and invert the tart. Sprinkle with basil and let cool, about 5 more minutes. Cut into wedges.\nPhotograph by Ryan Dausch",
        "ingredients": [
            "2 tablespoons bacon drippings",
            "4 cups heirloom cherry tomatoes",
            "1/2 large sweet onion, sliced into thin half-moons",
            "1/2 teaspoon lemon pepper seasoning",
            "1/4 teaspoon red pepper flakes",
            "Kosher salt and freshly ground pepper",
            "Cooking spray",
            "Juice of 1/2 lemon",
            "1/2 cup grated asiago cheese",
            "1 9-inch-square piece frozen puff pastry (half of a 17-ounce package), thawed",
            "Chopped fresh basil, for topping"
        ],
        "title": "Upside-Down Tomato Tart",
        "picture_link": "8DdFoAPtXUoqdXUOHyLlLWs8zv8JddW"
    },
    "fgMFCM7O97v4kt01Af68IUXgpaKGfkG": {
        "instructions": "Preheat vegetable oil to 360 degrees.\nTo make the dough, sift together flour, sugar and salt. Mix in shortening using hands or pastry cutter until crumbly. Add eggs and lemon zest. Mix until just incorporated.\nUse pasta machine to roll out half the dough to 1/8-inch thickness and forming a long rectangular shape (roughly 15 inches by 3 inches), being careful not to overwork dough. Repeat with other half of dough. Set aside.\nTo make the filling, use fork to mash chickpeas thoroughly. Stir in brown sugar, honey, grated chocolate, and chopped walnuts.\nDrop heaping teaspoonfuls of filling along length of rectangular dough (leaving 1-inch between spoonfuls) keeping to one side. There should be enough room for about 10 spoonfuls. With pastry brush use milk to moisten area around each filling spoonful. Fold dough lengthwise over filling and press down to remove any air and to seal edges. With a fluted pastry cutter or pizza cutter, cut into squares to form individual cookies. Repeat procedure with remaining filling and dough.\nFry cookies in hot vegetable oil until golden brown. Remove and place on paper towels to drain excess oil. Dust with powdered sugar. Serve the same day.",
        "ingredients": [
            "2 cups all-purpose flour",
            "1/2 cup powdered sugar",
            "Pinch salt",
            "2 tablespoons shortening",
            "2 eggs",
            "1/2 teaspoon lemon zest",
            "1/2 cup chick peas, cooked",
            "1/4 cup brown sugar",
            "2 tablespoons honey",
            "2 tablespoons grated chocolate",
            "1/2 cup finely chopped walnuts",
            "Vegetable oil, to fry",
            "1/4 cup milk, to seal dough",
            "Powdered sugar, to dust cookies"
        ],
        "title": "Phil's Calcionetti",
        "picture_link": null
    },
    "akfNfj5PBurSKrxZLXKI422WhYVrT9m": {
        "instructions": "For the sauce: Heat 1 tablespoon of the olive oil in a large skillet over medium-high heat. Add the sausage and use a wooden spoon to break up the meat as it browns. When the sausage has cooked to golden brown, about 8 minutes, transfer it to a paper towel-lined plate to drain. Return the skillet to medium heat and add the remaining tablespoon olive oil. Add the onions and use a wooden spoon to scrape up any browned bits left on the bottom of the skillet. Deglaze with 2 tablespoons water. Cook until the onions are translucent, stirring occasionally, about 8 minutes. Add the mushrooms and cook until browned, 4 to 5 minutes. Stir in the garlic and a pinch of crushed red pepper and cook about 2 minutes. Add the sausage back to the skillet. Stir in the canned butternut squash, cream, salt and pepper. Set aside.\nFor the filling: In a medium bowl, combine the ricotta, Parmesan, kale, sage, garlic powder, salt, pepper, eggs and nutmeg. Stir to combine and set aside.\nFor the lasagna: Preheat the oven to 400 degrees F. Bring a large pot of salted water to a boil.\nCook the lasagna noodles in the boiling water for half the time the package recommends. Drain and toss with a drizzle of olive oil to prevent them from sticking together.\nSpray a 9-by-13-inch casserole dish with nonstick cooking spray. Spoon about a cup of the sauce into the dish, spreading it to cover the bottom. Arrange half the lasagna noodles over the sauce, then begin layering first with half of the ricotta filling, then half of the sauce, then half of the mozzarella. Continue layering with the remaining noodles, filling and sauce, finishing with mozzarella on top. Sprinkle with the Parmesan. Tap the casserole on the counter to force out any air bubbles.\nBake until the cheese is golden brown and the lasagna is bubbling, 35 to 45 minutes. Let it rest for 15 minutes so it can set and be cut easily.",
        "ingredients": [
            "2 tablespoons olive oil",
            "2 pounds sweet Italian sausage (if links, casings removed)",
            "1 large yellow onion, diced",
            "8 ounces white button mushrooms, chopped",
            "3 cloves garlic, minced",
            "Pinch of crushed red pepper",
            "Two 15-ounce cans butternut squash puree",
            "1 1/2 cups heavy cream",
            "1 1/2 teaspoons sea salt",
            "1/2 teaspoon freshly ground black pepper",
            "2 1/2 cups whole-milk ricotta cheese",
            "1 cup finely grated Parmesan",
            "1 cup chopped cooked kale (use a kitchen towel to squeeze out any excess moisture from the kale)",
            "2 tablespoons minced fresh sage",
            "1 teaspoon garlic powder",
            "1/2 teaspoon sea salt",
            "1/2 teaspoon freshly ground black pepper",
            "2 large eggs, lightly beaten",
            "Pinch of ground nutmeg",
            "Sea salt",
            "1 pound lasagna noodles",
            "Olive oil, for drizzling",
            "Nonstick cooking spray, for the casserole dish",
            "4 cups shredded mozzarella",
            "1/3 cup finely grated Parmesan"
        ],
        "title": "Butternut Squash and Sausage Lasagna",
        "picture_link": "gbB8MrImQU3N10jMF8eW3olDq0/7c0G"
    },
    "bQBejzgA3HFujW6/NTnbRH9xKOwjbX2": {
        "instructions": "Special equipment: Special equipment: 15 lollipop sticks, candy thermometer\nFill a half sheet pan with an even 1/2-inch-deep layer of the powdered sugar. Press the back of a mold or shape of your choice (like a tablespoon measuring spoon) firmly into the sugar to create an impression as the mold for your lollipops The impression should be at least 1/4-inch deep. Make sure none of the sheet tray shows through the sugar in your mold, otherwise the lollipops will stick to it. Place a lollipop stick with 1/4-inch of the stick inside the impression. Make a dam with the powdered sugar to close the opening in the mold that the stick made, so no sugar syrup can escape. Repeat the process to make 4 rows of 3 molds each.\nReduce the pomegranate juice in a small saucepot over high heat until it's thick and syrupy and there are about 2 tablespoons left, 2 to 3 minutes. (You will only use half of this, but reducing further will not allow for enough liquid enough to pour.)\nCombine the granulated sugar, corn syrup and 1/4 cup water in a heavy-bottomed saucepan over medium-high heat and bring to a boil. Heat until a candy thermometer reads 300 degrees F, 10 to 12 minutes (it will just start to caramelize). Remove from the heat and carefully add 1 tablespoon of the pomegranate juice and the lime zest with a heatproof rubber spatula. Carefully transfer the candy mixture to a liquid measuring cup.\nWorking carefully but swiftly, pour the mixture into the lollipop molds. Allow the candy to cool and harden at room temperature, 15 to 20 minutes. You may dust off any residual powdered sugar with a pastry brush, but it's not necessary. I love that one side is glossy and one side is coated in sugar, it lends itself to the artisanal nature of the pop.",
        "ingredients": [
            "1 1/2 pounds powdered sugar",
            "1/2 cup pomegranate juice",
            "1 cup granulated sugar",
            "1/4 cup corn syrup",
            "Zest of 2 limes"
        ],
        "title": "Homemade Pomegranate-Lime Lollipops",
        "picture_link": "S2tk1tOwVT8HFEnkszIE56LBY0ulFca"
    },
    "DjkQnqhzqJLh7PeEjJgQDT/bjzMLLAK": {
        "instructions": "Melted butter, for brushing pans\n7 ounces all-purpose flour\nPinch salt\n1 generous teaspoon baking powder\n7 tablespoons butter, softened\n8 ounces caster sugar (superfine)\n1 teaspoon vanilla extract\n2 eggs, separated\n3 1/2 ounces shelled walnuts, roughly chopped\n3 1/2 ounces milk\nPreheat the oven to 350 degrees F. Brush 2 (8-inch) or 3 (7-inch) cake pans or sandwich pans with melted butter, and dust with flour. Line the base of each pan with parchment or greaseproof paper.\nIn a bowl, sift the flour with the salt, and baking powder.\nIn a large bowl, or in an electric food mixer, cream the butter until soft. Add the sugar, and vanilla extract, and beat until the mixture is light and fluffy. Beat in the egg yolks, and then stir in the chopped walnuts. Fold in a quarter of the flour and milk into the mixture, alternating each, until they are incorporated.\nIn a separate bowl, whisk the egg whites until they are stiff.\nStir a quarter of the egg whites into the cake mixture, and then gently fold in the rest. Divide the batter between the tins, making a slight hollow in the center of each so that the cake rises evenly rather than forming a peak.\nBake in the oven until firm to the touch or until a skewer inserted into the center of each cake comes out clean, about 16 to 20 minutes. Remove the cakes from the oven and allow to sit for 5 minutes, before turning out onto a wire rack to cool.\nTo make the buttercream filling: Cream the butter until very soft, and then beat in the confectioners' sugar, and the vanilla extract. When the cakes are cool, spread the buttercream filling on one layer, and top with the second layer, sandwiching the layers together.\nMake the American frosting as described below. Spread the American frosting quickly over the cake with a palette knife, regularly dipping the knife into a jug of boiling water to help spread the icing. It sets very quickly at this stage, so speed is essential. Scatter with rose petals, if using, or arrange the walnut halves around the top of the cake, and allow the icing to set until it feels dry on the surface.\nTo make the American Frosting: Ensure your cake is ready before you start, as this icing begins to set very quickly. Bring to the boil a saucepan of water large enough to hold a heatproof bowl. Place the egg whites in the bowl and whisk with a hand-held electric beater until very stiff.\nIn a separate saucepan over a medium-high heat, dissolve the sugar in the water and boil for 5 to 10 minutes until the liquid is thick and syrupy and has reached the 'thread' stage - when the last few drops that fall from a metal spoon dipped into the syrup come off in one long, quite thick and syrupy thread.\nPour the boiling syrup over the stiffly beaten egg whites, whisking all the time with the hand-held beater. Place the bowl in the saucepan of simmering water. Continue to whisk over the water for 10 to 15 minutes until the icing is snow white, very thick and meringue-like.\nSpread quickly over the cake with a palette knife, regularly dipping the knife into a jug of boiling water. The icing sets very quickly at this stage, so speed is essential.",
        "ingredients": [
            "6 tablespoons butter, softened",
            "4 1/2 ounces icing sugar (confectioners'), sifted",
            "1/2 teaspoon vanilla extract",
            "American frosting, recipe follows",
            "Edible rose petals, to decorate",
            "8 walnut halves, to decorate",
            "2 egg whites",
            "15 ounces caster (superfine) or granulated sugar",
            "3 1/2 ounces water"
        ],
        "title": "Walnut Cake with American Frosting",
        "picture_link": "4qByMeO1XMxmWjJkw34QkfDkWVzpYdK"
    },
    "5x9fBCrvF.ZmPUB9us0bx7hKoU6FYT2": {
        "instructions": "Watch how to make this recipe.\nFor the glaze:\nBring vinegar to a boil in a small nonreactive saucepan and cook, stirring occasionally, until reduced to 1/2 cup. Stir in the honey and season with salt and pepper, to taste.\nFor the steak:\nHeat grill to high. Brush steak on both sides with oil and season with salt and pepper. Grill until golden brown and slightly charred on both sides and cooked to medium-rare doneness, about 5 minutes per side. Remove from the grill to a cutting board, tent lightly with foil and let rest for 10 minutes. Slice into 1/4-inch thick slices.\nFor the pizza:\nHeat the grill to high.\nBrush both sides of the pizzas with oil and season with salt and pepper. Grill until golden brown on both sides, about 2 minutes per side. Remove from the grill, divide the Monterey Jack cheese over the top of each one and then sprinkle with the blue cheese. Place back on the grill, close the cover of the grill and grill until the cheese has melted, about 1 minute. Remove to a flat surface, divide the steak between each pizza, then top with the watercress Drizzle with some of the balsamic glaze and sprinkle with some of the shaved Parmigiano-Reggiano.\nIn a large bowl stir together 1/3 cup water, yeast, and sugar and let stand until foamy, about 10 minutes. Stir in remaining 1/3 cup water, 2 tablespoons oil, 1 3/4 cups flour, cornmeal, and salt and blend until the mixture forms a dough. Knead dough on a floured surface, incorporating as much of remaining 1/4 cup flour, as necessary, to prevent dough from sticking, until smooth about 5 to 10 minutes. Form the dough into a ball.\nLightly oil the sides and bottom of a large bowl with oil, add the dough, turn to coat in the oil, cover and let rise in a warm place until doubled in size, about 1 hour. Gently punch the dough down and divide into 4 equal pieces. Roll each piece on a lightly floured surface into a 10-inch circle that is 1/8-inch thick. Brush off excess flour and transfer the dough to a baking sheet, cover each circle of dough with plastic wrap and continue stacking rolled out pieces on top of each other. Wrap well with plastic wrap and refrigerate until ready to grill.",
        "ingredients": [
            "2 cups balsamic vinegar",
            "1 tablespoon honey",
            "Salt and freshly ground black pepper",
            "1 (12-ounce) NY strip steak",
            "Canola oil",
            "Salt and freshly ground black pepper",
            "Pizza",
            "1/2 recipe Pizza Dough rolled into 2 (10-inch) rounds, recipe follows or 2 store-bought pizza dough",
            "1 cup grated Monterey Jack cheese",
            "1/2 cup crumbled blue cheese (recommended: Cabrales)",
            "Grilled steak",
            "1 bunch watercress, coarsely chopped",
            "Balsamic Glaze",
            "Shaved Parmigiano-Reggiano",
            "2/3 cup lukewarm water (105 degrees F to 115 degrees F)",
            "2 1/2 teaspoons active dry yeast",
            "1/2 teaspoon sugar",
            "2 tablespoons olive oil, plus additional for oiling bowl",
            "1 3/4 to 2 cups all-purpose unbleached flour",
            "1/4 cup finely ground yellow cornmeal",
            "2 teaspoons coarse salt"
        ],
        "title": "Pizza with NY Strip, Blue Cheese and Balsamic Glaze",
        "picture_link": "06lDIy7xRrBZ52d86B/vX0LAZXVLuBW"
    },
    "R0ofB6hpS1rNsKg48Yo7Ediu1nlx0nq": {
        "instructions": "Watch how to make this recipe.\nMix the flour, sugar, and salt in a large bowl. Add the lard and the butter, and cut them in with a pastry blender until the larger pieces are the size of peas and the mixture begins to clump on the pastry blender. Shuffle through the mixture with your hands, pinching chunks of lard to flatten them.\nAdd 4 tablespoons of the ice water and mix with a fork. Pinch a clump of dough in your hands: If it feels moist and clumps together easily, it's probably hydrated enough. If it feels really crumbly, add another tablespoon or two of ice water until you can form a baseball-size clump of dough, packing it on as if you were making a snowball. You want to mix the dough as little as possible to ensure it stays tender.\nDivide the dough in half and form each half into a flat disk. Wrap both disks in plastic wrap and refrigerate for at least 1 hour and up to 2 days.\nThirty minutes before you're ready to roll out the dough, remove it from the refrigerator and let it sit at room temperature to soften.",
        "ingredients": [
            "2 1/2 cups all-purpose flour",
            "2 tablespoons sugar",
            "3/4 teaspoon fine seat salt",
            "6 ounces rendered leaf lard, cold, cut into cubes",
            "2 tablespoons unsalted butter, cold, cut into cubes",
            "4 to 6 tablespoons ice water"
        ],
        "title": "Leaf Lard Crust",
        "picture_link": "UUcMK1tuYK/YdBMvRdS50WY1FMdnFWe"
    },
    "hANHEeMGKnKUDqHr0C.8kYCTlTwzId.": {
        "instructions": "Preheat oven to 400 degrees F.\nSet up your indoor/oven \"beer can chicken\" roaster according to manufacturer's instructions. Rub the chicken all over with the dry rub making sure to get some around the cavity opening as well. Put the rubbed chicken in place over the beer can, on top of a roasting pan. Place the chicken in the oven and roast for 30 minutes.\nLower the oven to 325 degrees F and roast for 90 minutes basting with the chicken drippings and Barbecue Sauce until very, very tender. Carefully remove the chicken from the roaster and let rest 10 minutes before carving. Remove beer can from chicken. Serve with more Barbecue Sauce on the side.\nCombine all ingredients together. Store in an airtight container.\nIn a medium saucepan over medium-high heat, saute the onion and garlic in vegetable oil until soft. Add salt and pepper. Stir in remaining ingredients and bring to a boil. Lower the heat and simmer 10 minutes.",
        "ingredients": [
            "5 pound whole chicken, rinsed and patted dry",
            "2 to 3 tablespoons dry rub, recipe follows",
            "1 (12-ounce) can light beer",
            "Barbecue Sauce, recipe follows",
            "2 teaspoons salt",
            "2 teaspoons sweet paprika",
            "2 teaspoons brown sugar",
            "1 teaspoon celery salt",
            "1 teaspoon dried oregano",
            "1 teaspoon dry mustard",
            "1 teaspoon black pepper",
            "1 teaspoon ground cumin",
            "1 teaspoon garlic powder",
            "1 teaspoon chili powder",
            "Cayenne pepper, pinch",
            "3/4 cup finely chopped onion",
            "2 teaspoons minced garlic",
            "2 tablespoons vegetable oil",
            "Salt and freshly ground black pepper",
            "2 tablespoons brown sugar",
            "1 teaspoon cayenne pepper",
            "1/2 cup ketchup",
            "2 tablespoons prepared yellow mustard",
            "1/2 cup apple cider vinegar",
            "2 tablespoons lemon juice",
            "1/4 cup water",
            "Dash Worcestershire sauce"
        ],
        "title": "Beer in the Rear Chicken and BBQ Sauce",
        "picture_link": null
    },
    "TO2ObJKgE2VZcf/PJDKaCzyqPiBbdUm": {
        "instructions": "Rub inside of fondue pot or heavy small saucepan with garlic. Pour cider into pot. Add 1 tablespoon of lemon juice, the brandy and salt and bring to a simmer over medium heat. Meanwhile, grate the cheese and toss well with the cornstarch in a large bowl. When the cider just begins to simmer, gradually add the cheese a handful at a time, allowing each addition to melt completely before adding the next. Continue adding cheese and stirring until all cheese is incorporated, about 3 minutes. If mixture starts to bubble, reduce heat to low. The mixture is ready when creamy and easily coats the back of a spoon. Stir in curry powder and pepper. If cheese seems stringy, add some or all of the remaining lemon juice. Move fondue pot to alcohol warmer, and keep stirring during service. A variety of breads, from pumpernickel to rye to bagel chunks can be skewered and dipped as can cauliflower, broccoli, mushrooms and potatoes. (Soften all vegetables by blanching briefly in boiling water then chilling.) Crisp fruits such as apples make great fondue fodder, as do cooked meats and sausages. Even soft pretzels make for good dipping. If any fondue is left over, cover with ice water and refrigerate, pour off water and reheat over low heat.;",
        "ingredients": [
            "1 clove garlic, halved",
            "1 (12-ounce) bottle hard apple cider",
            "2 tablespoons lemon juice",
            "1 tablespoon brandy",
            "Pinch kosher salt",
            "5 ounces (2 cups) Gruyere, grated",
            "5 ounces (2 cups) Smoked Gouda, rind removed, grated",
            "1 tablespoon plus 1 teaspoon cornstarch",
            "1/4 teaspoon curry powder",
            "Several grinds fresh ground black pepper"
        ],
        "title": "Fondue Vudu",
        "picture_link": null
    },
    "2G0s0oijitiCukon49JlXF654KnZsO.": {
        "instructions": "In a large saucepan, combine the milk and cream and bring to a simmer over medium heat. Immediately turn off the heat and set aside. In a large, heavy skillet, melt the butter over medium-high heat. Stir in the brown sugar, raise the heat to medium-high, and cook 5 to 7 minutes, stirring constantly, to caramelize the mixture. (You'll smell a characteristic nutty-caramel odor when the butter browns, signaling that the mixture is ready.) Whisking constantly, gradually add the butter/brown sugar mixture to the hot milk/cream mixture. If the mixture is not smooth, blend for 20 seconds with a hand blender or pour through a fine sieve. Put the egg yolks in a medium bowl. Whisk in about 1/2 cup of the hot milk mixture. Whisk in the cornstarch and salt until dissolved. Whisk in the cornstarch mixture back into the hot mixture in the saucepan. Whisking constantly, cook over medium-high until thick and just boiling. When the mixture thickens, the whisk will leave trail marks on the bottom of the pot and the mixture will have a few large bubbles boiling up to the top. Turn off the heat and whisk in the vanilla extract. Pour into 6 to 8 custard cups, ramekins, or mugs and chill, uncovered, at least 2 hours or overnight. Serve chilled.;",
        "ingredients": [
            "2 1/4 cups whole, 2 percent fat, or 1 percent fat milk",
            "1 cup heavy cream",
            "6 tablespoons unsalted butter",
            "1 1/4 cups light brown sugar, packed",
            "3 egg yolks",
            "1/4 cup cornstarch",
            "1/4 teaspoon salt",
            "1 1/2 teaspoons pure vanilla extract"
        ],
        "title": "Butterscotch Pudding",
        "picture_link": null
    },
    "1V/U/bKCSiFbQRJCZN3dde/SQchlKrW": {
        "instructions": "In a small bowl, mix together chopped cilantro, olive oil, minced garlic, 1/4 teaspoon of the salt and 1/8 teaspoon of the pepper; set aside.\nIn medium bowl, mix together brown sugar, mustard, hoisin sauce and vinegar. Reserve 2/3 of this mixture. To remainder, add 1/2 cup lime juice and stir in chicken; cover and refrigerate.\nPlace sweet potatoes in a heavy saucepan and cover with boiling water. Cook, covered, over medium-high heat until tender, about 15 minutes. Reserve 1/4 cup cooking liquid, then drain potatoes in colander. Return potatoes to reserved cooking water and add butter, chipotle pepper, adobo sauce, remaining 1 1/2 teaspoons lime juice, cumin, lime zest, remaining 1/4 teaspoon salt and remaining 1/8 teaspoon pepper. Mash potatoes.\nPreheat the broiler. Thread chicken on 8 bamboo skewers that have been soaked in water for 30 minutes. Broil about 6 inches from heat, basting with reserved mahogany sauce until done, about 8 minutes. To serve, divide potatoes among 4 plates; top each with 2 skewers of chicken and drizzle with cilantro chimichurri sauce. Garnish with cilantro sprigs.",
        "ingredients": [
            "1 cup chopped cilantro leaves",
            "6 tablespoons extra-virgin olive oil",
            "3 large cloves garlic, minced",
            "1/2 teaspoon salt, divided",
            "1/4 teaspoon pepper, divided",
            "5 tablespoons dark brown sugar",
            "3 tablespoons Dijon mustard",
            "2 tablespoons bottled hoisin sauce",
            "2 teaspoons balsamic vinegar",
            "1/2 cup plus 1 1/2 teaspoons lime juice, divided",
            "1 1/2 pounds boneless skinless chicken breast halves, cut in 1-inch cubes",
            "2 large sweet potatoes, peeled and cut in 1/2-inch pieces",
            "2 tablespoons unsalted butter",
            "1 teaspoon chopped canned chipotle pepper",
            "1 teaspoon adobo sauce (from canned chipotle)",
            "3/4 teaspoon ground cumin",
            "1/2 teaspoon lime zest",
            "Cilantro sprigs, for garnish"
        ],
        "title": "Mahogany Broiled Chicken with Smoky Lime Sweet Potatoes and Cilantro Chimichurri",
        "picture_link": "/XDJcKHy8Q4ulahbRWo90ydzV51EbUC"
    },
    "ATXjlrVwNZL2ROcQ1ZwsxssxtK2pIG2": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 375 degrees F.\nPrepare a 9-inch spring form pan: Cut a circle of parchment the size of the removable bottom of the pan. Fit the parchment circle into the bottom of the pan. Tear off an 18-inch length of aluminum foil. Center the pan over the sheet of foil and crumple and crimp the foil all around the sides of the pan. (The foil will prevent water from seeping into the pan during baking.) Set the pan aside.\nIn a medium saucepan, bring the espresso, brown sugar and the cinnamon sticks to a simmer over very low heat. Simmer until the syrup is very fragrant, about 20 minutes. Stir in the butter until melted, and then stir in the cayenne pepper. Set aside.\nPulse the chocolate in the food processor until coarsely chopped. Transfer to a deep bowl. Pour in the warm coffee syrup and whisk until the chocolate is completely melted. Whisk in the beaten eggs until completely blended.\nScrape the batter into the prepared pan. Set the pan in a large, deep, oven-proof skillet or a roasting pan and set on the oven rack. Pour in enough water to come halfway up the sides of the pan. Bake until center is set and barely wiggles when you shake the pan gently, 50 to 60 minutes.\nCool the cake to room temperature. Remove the foil and chill the cake in the pan at least 8 hours. Run a wet knife around the sides of the pan then pop the spring to release. Place a platter on top of the cake and flip over. Remove the bottom of the pan, and peel off the parchment. Serve with cinnamon ice cream and raspberries.",
        "ingredients": [
            "1 cup espresso",
            "1 packed cup dark brown sugar",
            "3 cinnamon sticks",
            "1 teaspoon ground cayenne pepper",
            "3 sticks (12 ounces) unsalted butter, cubed",
            "12 ounces semisweet chocolate",
            "4 ounces unsweetened chocolate",
            "8 large eggs, beaten",
            "Cinnamon ice cream and raspberries, for serving"
        ],
        "title": "Chocolate-Chile Cake",
        "picture_link": "Vu8DMMftHuWtOdvuJGIypBWqzZNQ0aO"
    },
    "SR5haG3lhhswhmIjoyvNKVNiW9NXVOG": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 350 degrees F.\nPlace the chicken breasts, skin side up, on a baking sheet and rub them with olive oil. Sprinkle generously with salt and pepper. Roast for 35 to 40 minutes, until the chicken is cooked through. Set aside until cool.\nWhen the chicken is cool, remove meat from the bones and discard the skin and bones. Cut the chicken into a 3/4-inch dice.\nMeanwhile, place the pecans and walnuts on a separate sheet pan and toast in the oven for 7 to 8 minutes until golden. Set aside to cool.\nFor the dressing, mix together the mayonnaise, sour cream, 2 teaspoons salt and 1/2 teaspoon pepper. Fold in half the chopped tarragon leaves.\nPlace the diced chicken in a bowl, add the pecans, walnuts and grapes. Pour the dressing over the chicken and toss well. Sprinkle the remaining chopped tarragon leaves on top, and serve on a bed of lettuce leaves.",
        "ingredients": [
            "2 split (1 whole) chicken breasts, bone in, skin on (1 1/2 pounds)",
            "Good olive oil",
            "Kosher salt and freshly ground black pepper",
            "1/2 cup pecan halves",
            "1/2 cup walnuts halves",
            "1/2 cup good mayonnaise",
            "1/2 cup sour cream",
            "1 tablespoon chopped fresh tarragon leaves, divided",
            "1 cup green grapes, cut in 1/2",
            "Lettuce leaves, for serving"
        ],
        "title": "Chicken Salad Contessa",
        "picture_link": "T4b2jcHzrmeNGbAtRUze1NayvA/2tfG"
    },
    "pRkRXrzc8sVVAUoIl4KF1RGJkCEpgFO": {
        "instructions": "Preheat the oven to 425 degrees F. Brush the pork with 1 tablespoon olive oil; season with 1/2 teaspoon salt and a few grinds of pepper. Sprinkle with 2 tablespoons parsley and the fennel seeds, pressing to adhere.\nHeat the remaining 2 tablespoons olive oil in a large ovenproof nonstick skillet over medium-high heat. Add the pork and cook, turning, until browned on all sides, 8 to 10 minutes. Scatter the garlic, tomatoes, raisins and pine nuts around the pork. Cook, stirring, until the tomatoes are slightly softened, about 1 minute. Add the broth and bring to a simmer. Sprinkle the cheese over the pork, then transfer the skillet to the oven. Roast until a thermometer inserted into the center of the pork registers 145 degrees F, 15 to 20 minutes. Remove to a cutting board and let rest; reserve the tomato mixture in the pan.\nMeanwhile, bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Drain, then add to the tomato mixture along with the remaining 6 tablespoons parsley; season with salt and toss. Top with cheese. Slice the pork and serve with the pasta.\nPhotograph by Charles Masters",
        "ingredients": [
            "1 large pork tenderloin (1 1/4 to 1 1/2 pounds), trimmed",
            "3 tablespoons extra-virgin olive oil",
            "Kosher salt and freshly ground pepper",
            "1/2 cup roughly chopped fresh parsley",
            "2 teaspoons fennel seeds, finely chopped",
            "1 clove garlic, minced",
            "1 pint grape or cherry tomatoes, halved",
            "1/4 cup golden raisins",
            "1/4 cup pine nuts",
            "1 cup low-sodium chicken broth",
            "1/4 cup grated pecorino romano cheese, plus more for topping",
            "8 ounces spaghetti"
        ],
        "title": "Sicilian Pork with Spaghetti",
        "picture_link": "XP2tbMIb6xhPw.nkrPDT8nNtRCaTaCe"
    },
    "Wc5GntQIOH5BfUyeo6PSBrBgh.ZZoc6": {
        "instructions": "Make the cupcakes: Preheat the oven to 325 degrees F. Line a 12-cup muffin pan with liners. Combine the butter, 2/3 cup condensed milk, the granulated sugar, egg, vanilla and salt in a food processor. Process until smooth and slightly thickened, about 2 minutes. Add the flour, baking powder and baking soda and pulse a few times until blended. Drizzle in 1/4 cup whole milk, pulsing a few times, until smooth.\nDivide the batter among the prepared muffin cups, filling each about three-quarters of the way; sprinkle the mini chocolate chips on top. Bake until the tops of the cupcakes are golden and spring back when lightly pressed, 20 to 25 minutes. Let cool 5 minutes in the pan, then transfer to a rack. Poke the warm cupcakes all over with a toothpick. Mix the remaining 2 tablespoons each condensed milk and whole milk; brush evenly over the warm cupcakes. Let cool completely.\nMake the frosting: Put the milk chocolate in a microwave-safe bowl and microwave in 30-second intervals, stirring, until smooth. Let cool slightly. Combine the butter, melted chocolate, 1/4 cup condensed milk and the salt in a food processor and process until smooth, scraping down the sides occasionally. Add the confectioners' sugar and process until smooth, about 1 more minute. Transfer to a bowl and refrigerate until firm but still spreadable, about 20 minutes.\nSpread the frosting on the cupcakes, making a small well in the middle; fill each with 1/2 to 3/4 teaspoon condensed milk. Top with cookies.\nPhotograph by Ryan Dausch",
        "ingredients": [
            "1 stick unsalted butter, at room temperature",
            "2/3 cup plus 2 tablespoons sweetened condensed milk",
            "1/4 cup granulated sugar",
            "1 large egg",
            "1 teaspoon pure vanilla extract",
            "1/2 teaspoon salt",
            "1 cup all-purpose flour",
            "1 teaspoon baking powder",
            "1/4 teaspoon baking soda",
            "1/4 cup plus 2 tablespoons whole milk",
            "2 tablespoons mini chocolate chips",
            "6 ounces milk chocolate, chopped",
            "1 1/2 sticks (12 tablespoons) unsalted butter, at room temperature",
            "1/4 cup sweetened condensed milk, plus more for topping",
            "Pinch of salt",
            "3/4 cup confectioners' sugar",
            "Mini chocolate chip cookies, for topping"
        ],
        "title": "Milk-and-Cookies Cupcakes",
        "picture_link": "1YlQBV7alUqL4WBbA/Dk3dm0t9N5/gG"
    },
    "OPNAJUD7YvHBshLnSnMa907Y7gNh.w2": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 400 degrees F.\nHeat a 10-inch cast-iron or nonstick skillet over low heat. Add the butter; when melted, add the garlic and cook until soft but not browned, 3 to 4 minutes.\nSlice the potatoes on a mandoline set to 3mm (about the thickness of 3 credit cards). Place the potatoes in a large bowl; add the melted garlic butter and sprinkle with salt. Toss well to ensure all the slices are coated.\nPlace the skillet used for the butter over low heat. Carefully layer the potato slices in the skillet, overlapping them in a circular pattern starting from the edge of the skillet and working towards the center. Continue until you have about five layers of potatoes.\nSet a medium pot lid (6 to 8 inches wide) on directly on top of the potatoes. Then place a heavy pot on top of the lid to weight it down. Adjust the heat to medium-low and cook for about 15 minutes on the stovetop, then transfer to the oven and bake until the bottom is golden brown and crispy, another 15 minutes. (You can use a spatula to peek at the bottom to make sure it's golden brown.)\nRemove the skillet from the oven and let the potatoes rest for 15 minutes. Remove the pot and lid, and place a plate upside down on the skillet. Using oven mitts, carefully turn the skillet over to release the potatoes onto the plate. Garnish with thyme leaves and serve.",
        "ingredients": [
            "8 tablespoons (1 stick) butter",
            "4 cloves garlic, chopped",
            "2 russet potatoes, skin left on",
            "Salt",
            "3 sprigs fresh thyme leaves"
        ],
        "title": "Skillet Potatoes",
        "picture_link": "tc41ifR1vxusqznCSYLd38moW4/rEtG"
    },
    "nMnwk1J/fTES7ssRiuFMpb8SdzA1k2K": {
        "instructions": "Watch how to make this recipe.\nHeat a large Dutch oven over medium heat. Add 6 tablespoons of the butter and let it melt. Stir in the onions and the thyme and season with salt and pepper, to taste. Cook, stirring occasionally, until the onions caramelize, about 40 to 45 minutes.\nMeanwhile, put the mushrooms in a small pot and cover with a couple of cups of water. Bring to a boil over high heat, then reduce the heat to low and simmer to reconstitute the mushrooms.\nAdd the sherry to the pot with the onions, to deglaze the pan, then stir in the wine. Remove the mushrooms from their broth with a slotted spoon to a cutting board. Chop them, and add them to the onions. Add all but the last 1/2 cup of the mushroom liquid to the soup, about 1 cup. Add herb bundle and the beef stock to the pot and simmer the soup for 30 to 45 minutes. Cool and refrigerate for a make-ahead meal. Reheat over medium heat, covered, and prepare the croutons when ready to serve.\nHeat the oven to 425 degrees F. Toast the bread on a rack over a baking sheet, until deep golden brown. Butter the bread, using the 2 tablespoons of remaining butter and liberally rub them with the cut garlic. Top the toasts with the cheeses and return them to the oven until the cheese is melted and bubbly. Toasts may be arranged on top of crocks of soup, put on baking sheet, then topped with cheese and baked to brown, for a more dramatic presentation.\nLadle the soup into serving bowls and serve with the cheese toasts.",
        "ingredients": [
            "1 stick butter",
            "4 large onion, very thinly sliced",
            "1 teaspoon ground thyme",
            "Salt and freshly ground black pepper",
            "1-ounce dried porcini mushrooms",
            "1/4 to 1/3 cup dry sherry",
            "1 cup white wine",
            "1 small bundle made with fresh flat-leaf parsley, a few sprigs fresh sage and fresh bay leaves",
            "2 quarts beef stock",
            "8 (1/2-inch) thick slices baguette",
            "1 large clove garlic, peeled and halved",
            "1 1/2 cups grated Gruyere",
            "1/2 cup grated Parmigiano-Reggiano"
        ],
        "title": "French Onion Soup with Porcini",
        "picture_link": "481UUG395T29Ch7MBANz0LJgOGJ7bTm"
    },
    "mx/5f5XkaRMLQWEiZrGRk4x1A8qWiVS": {
        "instructions": "Cut off the ends of the plantains and then carefully cut a slit down the length of the skin without cutting into the plantain itself. Using a wooden spoon, pry up the edges of the peel and pull off the skin. Once the peel is removed cut the plantain crosswise into 3 or 4 pieces, each about 2 to 3 inches long.\nHeat the oil in a medium skillet over high heat until it shimmers, about 3 minutes. Add the plantains and fry them until they turn golden on all sides, about 3 minutes. Use a slotted spoon to transfer them to a paper towel-lined plate to drain, then place between 2 sheets of parchment paper. Reduce the heat to medium.\nFlatten the plantains by pressing down on them with a heavy-bottomed pan. Return 1/2 of the flattened plantains to the oil and re-fry until deep golden on both sides, about 4 to 6 minutes. Transfer back to the paper towel-lined plate to drain and repeat with the remaining flattened plantains. Sprinkle with salt and serve immediately.",
        "ingredients": [
            "2 green plantains",
            "1 cup vegetable oil, plus more if necessary",
            "Salt"
        ],
        "title": "Plantain Chips Patacones",
        "picture_link": "p5oZxBE6QDushmEgpxc4hhgjGZ.idee"
    },
    "4ze8cSh9dJz5T8Q2Va9ZSwQdSYgV/oi": {
        "instructions": "In large bowl, completely cover cod in water, and soak for at least 24 hours, refrigerated, changing water every 2 to 3 hours.\nMake 2 bouquets garnis: For each, bunch 2 bay leaves, 1 sprig rosemary, and 6 sprigs thyme together, and tie with kitchen string. In a medium saucepan, place cod with 1 head of garlic, 1 bouquet garni, the milk, and 1 cup water. Over low heat, bring to simmer. Cook until fish is flaky, about 10 minutes. Drain, and discard garlic and bouquet garni. When cool enough to touch, flake fish, and set aside.\nPlace potatoes in medium saucepan, and cover with salted water. Cook potatoes at a simmer until fork-tender, 15 to 20 minutes, and drain.\nIn small saucepan, add oil, remaining head of garlic, and remaining bouquet garni. Over low heat, warm the oil, about 10 minutes. Discard garlic and bouquet garni.\nPut potatoes through a food mill while still warm. In the bowl of an electric mixer fitted with the paddle attachment, combine potatoes and cod on low speed until just incorporated. Slowly add the infused oil, then add 1/2 cup cream. Do not overmix, or potatoes will become pasty.\nGarnish brandade with remaining 2 tablespoons warm cream and garlic confit. Serve with toasted croutons or bread.\nPlace ingredients in a small saucepan over low heat, and cook slowly until soft and golden brown, 45 to 50 minutes. Serve warm.;",
        "ingredients": [
            "1 pound dried salt cod, cut into large pieces",
            "4 dried bay leaves",
            "2 sprigs fresh rosemary",
            "12 sprigs fresh thyme",
            "2 heads garlic, halved crosswise, outer paper removed",
            "2 cups milk",
            "1 pound Yukon Gold potatoes, peeled and quartered",
            "1/2 cup olive oil",
            "1/2 cup plus 2 tablespoons heavy cream, warmed",
            "Garlic Confit, for garnish, recipe follows",
            "Toasted croutons or bread",
            "1 head garlic, cloves separated and peeled",
            "1/2 cup olive oil"
        ],
        "title": "Brandad de Morue",
        "picture_link": null
    },
    "v1sMzTyGzuMjCUeEFB2KFgi0zcd8GVa": {
        "instructions": "Special equipment: food mill\nPreheat the oven to 250 degrees F.\nPat the chicken breasts dry with a paper towel. Coat a medium saute pan with olive oil, and place over medium-high heat. When the pan is hot, sprinkle the skin of the chicken generously with salt, and then place skin-side down into the pan. Cook until the skin is golden and crispy, 4 to 6 minutes. Sprinkle the opposite side of the breast with salt, and then flip the chicken and continue cooking until cooked through, another 5 to 6 minutes. If the pan starts to smoke, lower the heat. Transfer the breast to a sheet pan, tent loosely with foil and place in the oven until the sauce is finished and you are ready to plate.\nRemove the excess oil from the pan before returning over medium-high heat. Add the clementine juice, clementine supremes and vinegar, scraping up the brown bits that cling to the bottom of the pan. Stir in the thyme and chiles and let the liquid reduce by half before pouring in the chicken stock and a pinch salt. Continue cooking until the stock has reduced. Taste the sauce, making sure it's delicious, and then remove the thyme stalk and season with more salt, if needed. The sauce should be thickened and a little chunky.\nLay the Yukon Gold and Cauliflower puree on the bottom of the plate, and then slice the chicken breast and fan the slices on top. Spoon some of the sauce on and around the chicken, and garnish with the supreme clementines.\nHalve the potatoes, and then cut each half into 6 to 8 pieces. Place the potatoes in a pot large enough to hold the cauliflower as well, and then cover the potatoes by 2 inches of water. Sprinkle generously with salt (it should taste like the ocean) and bring to a boil. After the water has been boiling about 10 minutes, add the cauliflower and cook until the vegetables are fork-tender.\nBring the cream to a scald in a small saucepan. Meanwhile, pass the potatoes and cauliflower through a food mill into a large bowl. Add about half of the hot cream and 1/2 of the butter, and stir with purpose until thoroughly combined. Repeat this process with the remaining cream and butter until incorporated. Taste for seasoning (you will probably have to add salt), and serve warm. Yield: 2 servings.",
        "ingredients": [
            "1 skin-on chicken breast, wing bone attached, wing tip and tenderloin removed",
            "Extra-virgin olive oil",
            "Kosher salt",
            "3 large clementines, supremed and squeezed, juice reserved",
            "A few drops red wine vinegar",
            "1 sprig fresh thyme",
            "1/2 Thai bird chile, halved lengthwise",
            "1/2 cup rich (hopefully homemade) chicken stock",
            "Yukon Gold and Cauliflower Puree, for serving, recipe follows",
            "2 large Yukon gold potatoes",
            "1/2 head cauliflower, cut into florets",
            "Kosher salt",
            "1/2 to 3/4 cup cream",
            "4 tablespoons cold butter (1/2 stick), cubed"
        ],
        "title": "Chicken Breast with Clementines, Thai Bird Chile and Yukon Gold and Cauliflower Puree",
        "picture_link": "5R9V3Nn1o1xSUo9/GojNZDMqAJdxo6a"
    },
    "l2nI7hqa0O64eT3F0Fc1F7HabzdXT1u": {
        "instructions": "Bring a large pot of water to a boil. Add the lemon juice and 2 tablespoons of salt.\nSnap off the stems of the artichokes and reserve. Trim the artichokes for all but their innermost leaves. Cut about 2 inches off the top of each artichoke and discard. Add the artichokes to the boiling water. Peel the tough outer skin off the stems and add the stems to the water. Place a small bread plate or other weight on top of the artichokes to keep them submerged. Lower the heat to a slow boil and cook until the artichokes' bottoms are just tender when pierced with the tip of a small knife through the bottom, about 15 minutes. Drain and let cool.\nTrim the rest of the leaves off the artichokes and scrape out the chokes (the fuzzy centers) with a spoon. Cut the bottoms into quarters and the stems into 1/4-inch rounds.\nHeat the oven to 375 degrees F.\nHeat 2 tablespoons of the butter in a saute pan over medium-high heat. Add the onion and lower the heat to medium. Cook, stirring, until the onion is tender, about 7 minutes. Add the artichokes, season with salt and pepper, and continue to cook for an additional 3 to 4 minutes.\nStrip the leaves away from the stems of the Swiss chard. Cut the stems into 1/2-inch pieces and the leaves into 1-inch pieces, and keep the stems and leaves separate. Heat the remaining butter in another saute pan over medium-high heat. Add the chard stems and cook for about 5 minutes. Add the leaves and continue to cook until the stems and leaves are tender. Season with salt and pepper. Drain the chard and add it to the artichokes and onion and toss to combine.\nPut the artichokes, onion and chard into a 1 1/2-quart gratin dish. Drizzle the cream and sprinkle the Parmesan over the vegetables. Season with salt and pepper. Bake until the cheese is melted and the cream is bubbling, about 15 minutes. Raise the heat to 425 degrees F, sprinkle on the bread crumbs and bake again until bread crumbs are browned and the inside of the gratin is hot, another 7 to 10 minutes. Serve immediately.",
        "ingredients": [
            "1 lemon, juiced",
            "Kosher salt",
            "4 large artichokes",
            "4 tablespoons unsalted butter",
            "1 medium onion, thinly sliced",
            "Freshly ground black pepper",
            "6 whole Swiss chard leaves, well washed, excess water shaken off but leaves not dried",
            "1 cup heavy cream",
            "1/2 cup grated Parmesan, preferably Parmigiano-Reggiano",
            "1/2 cup seasoned bread crumbs"
        ],
        "title": "Gratin of Artichoke and Swiss Chard",
        "picture_link": null
    },
    "w6TxMaURgUMRQAZ5osFLRNByk2EBsVu": {
        "instructions": "Warm the taco shells in the oven according to the package instructions. Heat the Chicken Taco Meat in a skillet until piping hot.\nPile up the warm shells with: sliced lettuce, Chicken Taco Meat, chopped tomatoes, grated Cheddar-Jack and sour cream. Top with hot sauce and garnish with chopped cilantro. Serve with lime wedges for squeezing over the tacos.\n\nIn a skillet over medium-high heat, add the olive oil and heat until hot. Add the chicken in batches and cook, browning, a couple minutes per side; remove the chicken to a plate using a slotted spoon. Add the garlic and onions to the skillet and cook briefly. Add the chili powder, paprika, cumin and salt to taste. Pour in the tomato sauce and 2 cups water to create a broth. Add the chicken back to the skillet. Bring to a boil, then simmer until the broth is reduced by half.\nLet cool, divide among 4 freezer bags and freeze. Yield: 4 freezer bags (16 to 20 servings).",
        "ingredients": [
            "16 taco shells",
            "1 bag Chicken Taco Meat (thawed if frozen), recipe follows",
            "1 head green lettuce, thinly sliced",
            "6 Roma tomatoes, chopped",
            "1 1/2 cups grated Cheddar-Jack cheese",
            "1 cup sour cream",
            "Hot sauce, as needed",
            "Chopped fresh cilantro, for garnish",
            "Lime wedges, for squeezing",
            "2 tablespoons olive oil",
            "6 large boneless, skinless chicken breasts, cut into bite-sized pieces",
            "3 cloves garlic, minced",
            "1 large onion, chopped",
            "2 tablespoons chili powder",
            "2 teaspoons paprika",
            "1 tablespoon cumin",
            "Salt",
            "One 14-ounce can tomato sauce"
        ],
        "title": "Chicken Taco Meat Tacos",
        "picture_link": "bxt18nzffBKUFmbfiVB.YO5gAEmXKmO"
    },
    "9sGHFGc5JGnO3iaVkrN54Q3jjFnck9K": {
        "instructions": "Preheat oven to 300 degrees F.\nUse a jaccard steak tenderizing tool, or tenderize the steak yourself with a fork. Lay the meat out in front of you, pushing it flat with your hands or a meat mallet, and pull it gently apart with tines of the fork until the meat is slightly pulled apart and tender. Season with salt and pepper and dredge in flour. In a large oven-safe skillet over medium-high heat, add olive oil and brown steaks, in batches if necessary, on both sides, about 2 minutes per side. Set aside, keep warm.\nMeanwhile, in a saucepan, reduce stock by half.\nSeason mushrooms with salt and pepper, to taste. Saute quartered mushrooms in the same pan as the meat, in the leftover olive oil, until very brown, about 5 minutes. Add butter, minced onion, carrot, thyme, and garlic. Cook until vegetables are caramelized, about 5 minutes, add balsamic vinegar and reduce for 1 to 2 minutes. Add broth, slide meat back into sauce, cover and bake until tender, about 1 hour.\nStack steaks with pea whipped potatoes and drizzle with balsamic/mushroom sauce.\nPut the potatoes in a large saucepan with cold water to cover by 3 inches. Salt the water, cover and bring to a boil over high heat. Reduce heat and simmer until tender, about 10 minutes. While the potatoes are cooking, cook the peas in a separate saucepan of salted water. Simmer until just tender, about 3 to 5 minutes. Remove with a sieve and cool on a baking sheet. When the potatoes are done, drain well, scatter on a baking sheet, and let cool for several minutes. In a small saucepan, heat 1/2 cup of the cream until it reaches a boil then simmer for a few minutes. Add the cream to a blender with the cooked peas and puree until smooth. Season with salt and pepper.\nHeat 1 tablespoon of the butter in a large saucepan over medium heat until the butter stops foaming and turns a light brown. Add the garlic and cook quickly until pale gold. Add remaining cream, season, to taste, with salt and pepper and bring to a boil.\nPress the cooled potatoes through a ricer or food mill into the butter and garlic mixture, tossing to coat.\nReduce the heat to low. Add the remaining butter by tablespoonfuls, stirring vigorously after each addition. In this way, the butter does not melt into a golden puddle. Instead, it forms an emulsion with the potatoes, creating a very smooth puree.\nFold the pea puree into the mashed potatoes and adjust seasoning, as necessary. Instead of salt, the puree can be seasoned with a little grated Parmesan, if desired.\nServe hot.\nPrep Time: 10 minutes\nCook Time: 20 minutes\nInactive Prep Time: 15 minutes\nEase of preparation: easy",
        "ingredients": [
            "4 boneless steaks (about 4 ounces each)",
            "Salt and freshly ground black pepper",
            "Flour, for dredging",
            "1/4 cup extra-virgin olive oil",
            "4 cups beef stock",
            "8 ounces white button mushrooms, quartered",
            "8 ounces shiitake mushrooms, stemmed, caps quartered",
            "1 tablespoon unsalted butter",
            "1 onion, minced",
            "1 carrot, diced",
            "4 sprigs fresh thyme",
            "3 cloves garlic, minced",
            "1 cup balsamic vinegar",
            "Pea whipped potatoes, recipe follows",
            "2 pounds russet potatoes, peeled and cut into large chunks",
            "1 1/2 pounds English peas, or 2 pounds frozen peas",
            "2 cups heavy cream",
            "1/2 cup (2 sticks) unsalted butter, at room temperature",
            "1 tablespoon minced garlic (about 3 to 4 cloves)",
            "Salt and freshly ground black pepper",
            "Grated Parmesan, optional"
        ],
        "title": "Salisbury Steak with Mushroom Sauce",
        "picture_link": "Gos0/RirnLLuT15znwG3gWS8qLaUSI2"
    },
    "QqArIHPlDg0Y0Gi.9APuhGV8VorIP1u": {
        "instructions": "To prepare the crust, in a medium bowl whisk together the whole-wheat pastry flour, all- purpose flour, granulated sugar and salt. Add the butter and using two knives or a pastry cutter, cut the butter into the flour mixture until you get a pebbly, course texture. In a small bowl combine the buttermilk and ice water. Using a fork, gradually mix the buttermilk mixture into the flour mixture. Pat the dough into a 4-inch round and wrap in plastic wrap. Refrigerate for 30 minutes.\nIn the meantime, preheat the oven to 425 degrees F, and prepare the filling. Peel the pears, core them and cut into 1/4-inch slices. In a large bowl toss the pear slices with the lemon juice. Sprinkle in the cornstarch, brown sugar and cinnamon and toss until the pears are evenly coated. Set aside.\nOn a lightly floured surface, roll the chilled dough into a large circle about nine inches in diameter. Line a baking sheet with parchment paper, and draping the dough over the rolling pin, transfer to the prepared baking sheet. If the dough breaks at all patch it up with your fingers.\nArrange the pears in a mound in the center of the dough, leaving a 2-inch boarder. Fold the border over the filling. It will only cover the pears partially and does not need to be even.\nBake the tart for 15 minutes, and then reduce the oven temperature to 350 degrees F, keeping the tart in the oven all the while, and bake for another 40 minutes, until the pears are tender and the crust is golden brown.\nIn a small bowl stir together the honey and boiling water to make a glaze. When the tart is done remove it from the oven and brush the honey glaze all over the top of the fruit and crust. Transfer to a plate to cool slightly. Cut into 6 wedges and serve warm or a room temperature.",
        "ingredients": [
            "1/2 cup whole-grain pastry flour or regular whole wheat flour",
            "1/2 cup all-purpose flour",
            "2 teaspoons granulated sugar",
            "1/8 teaspoon salt",
            "4 tablespoons cold, unsalted butter, cut into small pieces",
            "2 tablespoons lowfat buttermilk",
            "3 tablespoons ice water",
            "3 medium pears",
            "1 tablespoon lemon juice",
            "1 tablespoon plus 1 teaspoon cornstarch",
            "3 tablespoons light brown sugar",
            "1/8 teaspoon ground cinnamon",
            "1 teaspoon honey",
            "1/4 teaspoon boiling water"
        ],
        "title": "Rustic Pear Tart",
        "picture_link": "s5P66j66z9GCh2znXMWhzHo/VZsx3A."
    }
}