{
    "TOCyMHYM034htoE0n1iqR0j8PaLSByK": {
        "instructions": "For the sweet potatoes: Heat the oven to 350 degrees F. Place the potatoes on a rimmed baking sheet and bake until tender when pierced with the point of a paring knife, about 1 hour.\nCool the potatoes slightly. Peel the potatoes, discard the skins, and place them in a medium bowl. Mash with a potato masher or large fork until smooth. Stir in the eggs, milk, brown sugar, melted butter and vanilla until combined; season with salt and pepper.\nMeanwhile, for the topping: Combine the pecans, brown sugar, flour and butter in the bowl of a food processor fitted with the blade attachment. Pulse until combined. Set aside.\nTransfer the sweet potato mixture to a medium casserole dish and sprinkle with the topping. Place the casserole in the oven and bake until bubbly and browned on top, about 30 minutes. Serve immediately.",
        "ingredients": [
            "8 sweet potatoes",
            "4 large eggs, lightly beaten",
            "1/2 cup milk",
            "1/4 cup packed dark brown sugar",
            "4 tablespoons (1/2 stick) unsalted butter, melted",
            "1/2 teaspoon pure vanilla extract",
            "Coarse salt and freshly ground black pepper",
            "1/2 cup pecans",
            "1/4 cup packed dark brown sugar",
            "1/4 cup all-purpose flour",
            "3 tablespoons unsalted butter, softened"
        ],
        "title": "Sweet Potato Casserole",
        "picture_link": "v0S6ygLagEB4tPGJiNN.qtoxNamht6e"
    },
    "v1t/R3z48ITySzP2TIdxlK6PVpFyy.i": {
        "instructions": "Watch how to make this recipe.\nFor the souffle: Preheat the oven to 350 degrees F. Grease a 2 1/2-quart baking dish with butter.\nPoke the sweet potatoes with a fork and bake on a foil-covered baking sheet until they are soft, 1 hour. When cool enough to handle, peel the potatoes, place the flesh in a large mixing bowl and mash until very smooth. Add the eggs, sugar, butter, vanilla, milk and salt. Combine well with an electric mixer or hand mixer. Turn the mixture into the baking dish.\nFor the topping: In a medium bowl, stir together the pecans, brown sugar, flour and butter until thoroughly combined. Spoon the mixture over the sweet potatoes, making an even layer. Bake the casserole until slightly browned, 40 minutes. Let the casserole sit for 5 minutes before serving.",
        "ingredients": [
            "1/2 cup butter (1 stick), at room temperature, plus more to grease pan",
            "5 medium sweet potatoes",
            "2 large eggs",
            "1 cup granulated sugar",
            "1 1/2 teaspoons vanilla extract",
            "1/2 cup milk",
            "Pinch of salt",
            "1 cup finely chopped pecans",
            "1 cup brown sugar, packed",
            "1/2 cup all-purpose flour",
            "1/4 cup butter (1/2 stick), softened"
        ],
        "title": "Sweet Potato Souffle",
        "picture_link": "SpOqtvsVIOBwW39YDC9c2HQUO2Ad/Fu"
    },
    "4nb1wjiuaM6FmKk0C0NmgLPUCAGiGCG": {
        "instructions": "Watch how to make this recipe.\nPreheat oven to 350 degrees F.\nSpill 2 bags of chips onto a cookie sheet and put in oven to heat them up. When oil is visible on the chips, take them out of the oven, and sprinkle with the garlic spice. Let them cool and serve.\nPreheat the oven to 350 degrees F.\nPlace the thinly sliced garlic between some parchment paper on a baking sheet. Bake until the garlic is dry, about 15 minutes. Remove from the oven and cool.\nIn a grinder add the dried garlic, salt, black peppercorns, mustard powder, and chili powder. Grind them all up.",
        "ingredients": [
            "2 bags favorite plain potato chips",
            "Roasted Garlic Spice, recipe follows",
            "8 cloves garlic, sliced very thin",
            "2 teaspoons gray salt",
            "4 black peppercorns",
            "1/2 teaspoon mustard powder",
            "Pinch chili powder"
        ],
        "title": "Flavored House Made Potato Chips",
        "picture_link": "EWtAt.AJ57fAY3PmLWUSelxuUmOoYg6"
    },
    "1NEfSfx6UwhfNjGQ09vcNq4Fsm1jjPC": {
        "instructions": "Put shallot, mustard, and vinegar in a blender, and blend. With the motor running, slowly drizzle in oil. Toss cucumber and dill in the vinaigrette with fennel seeds and chile. Fold in the tomatoes.",
        "ingredients": [
            "1 large shallot, finely minced",
            "1 tablespoon Dijon mustard",
            "1/4 cup balsamic vinegar",
            "3/4 cup olive oil",
            "1 seedless, skinless, cucumber, halved lengthwise and cut into 1/4-inch half moons",
            "1 bunch fresh dill, trimmed and minced",
            "Lightly toasted fennel seeds",
            "1 serrano chile, seeded and chopped",
            "1 pint grape tomatoes"
        ],
        "title": "Cucumber, Grape Tomato and Dill Salad",
        "picture_link": null
    },
    "HNvX9BsI9Lddy/fXVMy46RUqHVQhRDG": {
        "instructions": "Bring water to a boil in a small saucepan. Add rice, cover and simmer 20 minutes, stirring occasionally.\nWhen rice is done, remove it from the stove top. To a medium skillet over medium high heat add oil and bacon and cook 3 minutes to crisp edges of bacon. Add onions and cook 3 minutes to soften. Add beans to heat through, then stir in cooked rice. Season rice and beans with cayenne sauce, salt and pepper, to your taste. Serve rice and beans from the skillet.",
        "ingredients": [
            "1 3/4 cups water",
            "1 cup enriched white rice",
            "1 tablespoon extra-virgin olive oil or vegetable oil, 1 turn of the pan",
            "2 slices bacon, chopped",
            "1 medium onion, chopped",
            "1 can red beans, drained",
            "1 tablespoon cayenne sauce (recommended: Frank's Red Hot)",
            "Salt and freshly ground black pepper"
        ],
        "title": "Tex Mex Red Beans and Rice",
        "picture_link": "5oRzErWHmvxsfehUirhu96pn7l9Uy2G"
    },
    ".1PqO1mgbhc7LKhz1cBXJaU/45vFo7a": {
        "instructions": "Heat the oven to 350 degrees F. Line a baking sheet with a silicone baking mat or parchment paper to protect the baking sheet from spills and make for easy cleanup.\nPeel the potatoes and slice them on a mandoline into 1/8-inch-thick slices. Or, using a chef's knife, carefully slice the potatoes thinly and evenly.\nArrange the potatoes in a medium casserole dish in overlapping layers, seasoning with salt and pepper as you go. Place the dish on the prepared baking sheet. Combine the milk, heavy cream, thyme, garlic and nutmeg in a medium heavy-bottomed saucepan. Bring to a gentle simmer over medium heat. Pour over the potatoes. Sprinkle the cheese over the top.\nBake until the potatoes are tender and the top is bubbling around the edges and a deep golden brown, about 1 hour. (If it starts to brown too deeply, cover the top of the dish with aluminum foil.) Let cool 10 minutes before serving.",
        "ingredients": [
            "1 1/2 pounds russet potatoes",
            "Coarse kosher salt and freshly ground black pepper",
            "2 cups 2-percent or whole milk, plus more if needed",
            "1/2 cup heavy cream, plus more if needed",
            "1 tablespoon chopped fresh thyme",
            "1 clove garlic, finely chopped",
            "Pinch of freshly grated nutmeg",
            "1/2 cup grated gruyere cheese (about 2 ounces)"
        ],
        "title": "Scalloped Potatoes",
        "picture_link": "34RLjLxuuesghcEl3bslZ7ZPqN5p1nq"
    },
    "3fhwPyfHPt4EekttJZcYNx7bKlB2voa": {
        "instructions": "Combine the peaches, oranges, pineapple, fruit cocktail, bananas, juice concentrate and lemon juice in a bowl and mix until combined. Place in small disposable plastic cups and cover with plastic wrap or foil. Freeze until firm. Remove from the freezer 45 minutes to 1 hour before serving to thaw.",
        "ingredients": [
            "4 cups frozen peaches, thawed and chopped into large chunks",
            "2 cans mandarin oranges, drained",
            "2 cans crushed pineapple, drained",
            "1 can fruit cocktail, drained",
            "6 medium firm bananas, chopped into chunks",
            "1 small can frozen pineapple-orange juice concentrate, thawed",
            "1/3 cup lemon juice"
        ],
        "title": "Frozen Fruit Cups",
        "picture_link": "TTtn31/X9Y4uqD4XKUvSJ4GR.z/Zure"
    },
    "38vjeXCEVAYeptgrV8r2dbLhRxTt5Uq": {
        "instructions": "1. Beat pudding mix and milk in medium bowl with whisk for 2 min. Add cookie crumbs; mix well.\n2. Shape into 42 {1-inch) balls. Freeze for 10 min. Dip in melted chocolate; place in single layer in shallow waxed paper-lined pan.\n3. Refrigerate for 20 min. or until firm. Drizzle with white chocolate and refrigerate for 10 min. or until firm.",
        "ingredients": [
            "1 pkg. (3.9oz) JELL-O Chocolate Instant Pudding",
            "1/2 cup Cold Milk",
            "36 OREO Cookies, finely crushed (about 3 cups)",
            "1-1/2 pkg. BAKER'S Semi-Sweet Chocolate (12 squares), melted",
            "1 square BAKER'S White Chocolate, melted"
        ],
        "title": "Triple-Chocolate Cookie Balls",
        "picture_link": null
    },
    "wu9Q0GItIfaIdpEazyHPiANI3ywiIui": {
        "instructions": "Steep the 4 tea bags in 4 cups of boiling water for 10 minutes. Discard the tea bags and allow the tea to cool.\nCombine the lemon juice, sugar and 4 cups of cold water in a large pitcher. Add the tea and lemon slices. Serve over ice.",
        "ingredients": [
            "4 tea bags",
            "1 cup freshly squeezed lemon juice (5 to 6 lemons)",
            "1/2 to 3/4 cup superfine sugar, to taste",
            "3 lemon slices"
        ],
        "title": "California Iced Tea",
        "picture_link": null
    },
    "MMobpIj.zJDwClyCWSBd2s5lO.tSTIu": {
        "instructions": "Preheat the oven to 450 degrees F.\nAdd the tomatoes and red onion to a bowl and drizzle with oil. Season with salt and pepper. Add to a greased baking sheet. Add the garlic to a square of tinfoil, drizzle with olive oil and seal. Place on the sheet tray and roast for 25 minutes, until charred and tender.\nRemove from oven and let cool for a few minutes. Add the vegetables and garlic to a food processor along with jalapeno, cilantro and lime juice; pulse until chunky. Taste for seasoning and season with salt and pepper, if necessary.\nAdd 1 tablespoon olive oil to a large nonstick skillet over medium-high heat. Once hot, add the fish and cook for 4 minutes per side. Top with the roasted salsa.",
        "ingredients": [
            "6 plum tomatoes, sliced into quarter wedges",
            "1/2 red onion, sliced into quarters",
            "Olive oil",
            "Kosher salt and freshly ground pepper",
            "7 cloves garlic",
            "1 jalapeno, sliced in half and seeds removed",
            "3 tablespoons chopped fresh cilantro",
            "Juice of 1 lime",
            "4 (5-ounce) center-cut cod filets, skinned"
        ],
        "title": "Cod with Roasted Tomato Salsa",
        "picture_link": "krekfZgjlotIXtQVethVI.BtYtxe2Ie"
    },
    "Atgm/EfhHxnxIeG8DidOdWmTPwYLDCO": {
        "instructions": "Chop the reserved onion and pepper mixture and put into a bowl. Stir in the sour cream, cream cheese, garlic, adobo sauce, and season with salt and pepper, to taste.\nServe with the reserved spiced chips.",
        "ingredients": [
            "Reserved 1 cup onion and pepper mixture from Spicy Fajita Soup",
            "Reserved 1 cup sour cream from Braised Beef Tacos",
            "1/2 cup cream cheese, softened",
            "1 teaspoon chopped garlic",
            "1 teaspoon adobo sauce reserved from Spicy Fajita Soup",
            "Kosher salt and freshly ground black pepper",
            "Reserved spiced chips from Spicy Fajita Soup"
        ],
        "title": "Online Round 2 Recipe - Creamy Mexican Dip with Spiced Chips",
        "picture_link": "ARgdH3yUQdLZ7RM2sLMlIXpCXoelxgq"
    },
    "8jcKAhjhnlN/XXgM0X9s0FtlQiNf5Me": {
        "instructions": "Line a broiler pan rack with foil. Spray the foil with cooking spray. Preheat the broiler.\nTo make the glaze, whisk together the brown sugar, ginger, mustard and soy sauce in a small bowl. Place the salmon on the broiler pan rack and spoon the glaze over the top. Broil, 6 inches from the heat, until the salmon is lightly browned and just opaque in the center, 4 to 5 minutes. Do not turn.",
        "ingredients": [
            "Cooking spray, for greasing",
            "3 tablespoons packed light brown sugar",
            "1 tablespoon grated peeled fresh ginger",
            "1 tablespoon country-style Dijon mustard",
            "2 teaspoons reduced-sodium soy sauce",
            "Four 4-ounce salmon fillets"
        ],
        "title": "Roasted Salmon with Brown Sugar Glaze",
        "picture_link": ".8rjSQb837xJwDgClPFId3vV2oTFsGq"
    },
    "MphG8LJtMh9imH2UlExVtL6vhHANBH.": {
        "instructions": "In a pot of cold water, place beets and then bring to a boil. Allow pot to simmer until the beets are tender but still have slight resistance in the centers. This will take 8 minutes. Peel the beets and slice.\nIn a small bowl whisk together olive oil and balsamic. Season with salt and pepper.\nIn a separate larger bowl, toss arugula, beets, pecans and goat cheese. Drizzle them with dressing and serve.",
        "ingredients": [
            "4 medium candy striped beets",
            "1/4 cup olive oil",
            "2 ounces balsamic vinegar",
            "Salt and freshly ground black pepper",
            "4 cups arugula",
            "1/4 cup chopped pecans",
            "1/2 cup goat cheese, crumbled"
        ],
        "title": "Gina's Beet and Goat Cheese Salad",
        "picture_link": "jgQQUbhgk92lKh/QX50u2hadJwNVu6."
    },
    "vwGDbUIjVI1ygHvdE8PXLMEiIv4zqtS": {
        "instructions": "PORK CHOPS: Combine ingredients of marinade. Marinate pork chops for at least 1 hour or up to overnight in refrigerator. Combine seasoned flour ingredients and set aside. Using a cast iron pan over medium heat, add 1/2 cup vegetable oil and slowly bring to temperature. Remove pork chops from marinade, dredge in seasoned flour, and then place chops in pan. Fry the pork chops until golden brown on both sides (12 to 15 minutes total for medium.) Remove from pan and drain on paper towels.\nAPPLESAUCE: In separate pan on high heat, add olive oil and butter. Slowly add apples. Cook them until caramelized and then add apple cider, clove, cinnamon, and salt and pepper. Place pan in oven at 350 degrees for 10 minutes or until the apples have broken down.\nPRESENTATION: Place pork chops in center of plate and garnish with roasted applesauce and fresh thyme.",
        "ingredients": [
            "1/2 cup Apple Jack brandy (or Calvados)",
            "1/3 cup extra-virgin olive oil",
            "1/2 cup apple juice",
            "1/2 bunch fresh bunch thyme, chopped",
            "1/4 cup bacon drippings",
            "Salt and coarse pepper, to taste",
            "4 (8-ounce) pork T-bone (porterhouse) chops",
            "1/2 cup flour",
            "1 tablespoon onion powder",
            "1 tablespoon garlic powder",
            "1 tablespoon fresh thyme",
            "1 tablespoon paprika",
            "1 tablespoon coarse black pepper",
            "Salt to taste",
            "1-ounce olive oil",
            "1 tablespoon butter",
            "6 Granny Smith apples, peeled, seeded and sliced in eighths",
            "1/4 cup apple cider",
            "1/2 teaspoon cloves, whole",
            "1 teaspoon cinnamon",
            "Salt and Pepper, to taste"
        ],
        "title": "Fried Pork T-Bone Chops with Roasted Applesauce",
        "picture_link": null
    },
    "yupOEAlI6fGn9A1CjEOnIO719Rp1eYO": {
        "instructions": "In a food processor grate the potatoes. Line a sieve with cheesecloth and transfer potatoes to the sieve. Set sieve over a bowl, twist cheesecloth into a pouch, squeezing out some moisture. Let mixture drain for 15 minutes. After 15 minutes, pour off liquid from the bowl but leave the white potato starch that settles in the bottom of the bowl.\nTo that starch add shallots, eggs, flour, 1-1/2 teaspoons of salt and freshly ground pepper. Return drained potatoes to this mixture and toss to combine.\nPreheat oven to 200 degrees. Line a baking pan with paper towels. When you are ready to eat, in a large skillet heat 1/4 inch of oil over medium high heat until hot. Drop heaping tablespoonfuls of potato mixture and cook for 3 to 4 minutes a side; latkes should be golden and crisp on both sides. Eat right away or keep warm in oven.",
        "ingredients": [
            "1-1/2 pounds russet potatoes peeled",
            "1/4 cup finely chopped shallots",
            "2 large eggs, lightly beaten",
            "2 tablespoons flour (or more) or matzo meal",
            "1 tablespoon thyme",
            "1 1/2 teaspoons salt and freshly ground black pepper",
            "Vegetable oil for frying"
        ],
        "title": "Herbed Potato Latkes",
        "picture_link": null
    },
    "fnBQ2qyljVj8yK.pJBPGojwJdN9dVrO": {
        "instructions": "Puree the tomatoes, celery and broth in a blender until smooth. Season, to taste, with salt and pepper. Season with lemon juice and maple syrup. Stir in cream.\nTransfer to a microwave safe bowl. Heat in microwave on HIGH until warmed through, about 4 minutes. (Alternatively, heat the old-fashioned way in a pan.) Pour hot soup into an air-tight thermos. Pack in a lunch sack and send off to school.",
        "ingredients": [
            "1 (28-ounce) can whole tomatoes, in juice",
            "1 rib celery, roughly chopped",
            "1 cup low-sodium chicken broth",
            "Kosher salt and freshly ground black pepper",
            "1 tablespoon pure maple syrup",
            "1 to 2 teaspoons fresh lemon juice",
            "1/4 to 1/3 cup cream"
        ],
        "title": "Ten-Minute Tomato Soup",
        "picture_link": "UqFw8aX7mb7emPkVb5pE8KjusZPdzga"
    },
    "PE5mYLzp8NEqtHLqn99N5R.PwvvjNlW": {
        "instructions": "Heat the oil in a 4-quart saucepan over medium-high heat. Add the turkey, onion, chili powder, cumin, oregano, black pepper and garlic powder. Cook until the turkey is well browned, stirring often to separate meat.\nStir the stock, salsa, sugar, beans and corn in the saucepan and heat to a boil. Reduce the heat to low. Cover and cook for 30 minutes or until the mixture is hot and bubbling.",
        "ingredients": [
            "1 tablespoon vegetable oil",
            "1 pound ground turkey",
            "1 large onion, chopped (about 1 cup)",
            "2 tablespoons chili powder",
            "1 teaspoon ground cumin",
            "1 teaspoon dried oregano leaves, crushed",
            "1/2 teaspoon ground black pepper",
            "1/4 teaspoon garlic powder or 2 cloves garlic, minced",
            "1 3/4 cups Swanson Chicken Stock",
            "1 cup Pace Chunky Salsa",
            "1 tablespoon sugar",
            "1 can (about 15 ounces) black beans, rinsed and drained",
            "1 can (about 16 ounces) whole kernel corn, drained"
        ],
        "title": "Black Bean, Corn and Turkey Chili",
        "picture_link": "IkC6G.t/M3vkb.irqI7toaWa32cpYzO"
    },
    "ZrF11K5//v/xcibchsJX26G.NPzzOcW": {
        "instructions": "Watch how to make this recipe.\nMix all ingredients, except olive oil and pita bread, in food processor until pureed, then slowly add in olive oil.\nLet set up for 1 hour prior to serving.\nServe with toasted pita bread.",
        "ingredients": [
            "16 ounces chickpeas",
            "6 ounces roasted red bell peppers",
            "1 jalapeno, seeded, diced",
            "1 tablespoon chopped garlic",
            "3 tablespoons chopped cilantro leaves",
            "1 teaspoon paprika",
            "3 tablespoons chopped onion",
            "1 teaspoon freshly cracked black pepper",
            "1 tablespoon chipotle pepper in adobo",
            "1/4 cup extra-virgin olive oil",
            "Toasted pita bread, for serving"
        ],
        "title": "Roasted Red Bell Pepper Hummus",
        "picture_link": "iL5NRvPDEC1CKKCOsIVqL2m0vU4XOmi"
    },
    "XE9oXJD0.kVGJaB02u8Vves0lb.kNVa": {
        "instructions": "In a food processor, puree the butter, tomatoes and garlic until it forms a smooth paste. Heat a small saute pan over medium heat and add the butter mixture. Heat the butter until melted down and fragrant, about 3 minutes. Keep warm.\nHeat a large saucepan over high heat. Once hot, add the popcorn kernels and oil, and shake the pan to coat the kernels in the oil. Cover and continue to cook over high heat until the kernels begin to pop. Shake the pan once again and reduce the heat to medium-high. Continue to cook until the popping slows dramatically, 1 to 2 minutes.\nPour the popped popcorn into a large bowl. While still warm, add the flavored butter, cheese, oregano and salt. Toss to coat, and then serve.",
        "ingredients": [
            "4 tablespoons unsalted butter, at room temperature",
            "1/4 cup sun-dried tomatoes in oil, drained well",
            "1 clove garlic, smashed",
            "1/3 cup popcorn kernels",
            "1 tablespoon grapeseed oil",
            "2 tablespoons grated Parmigiano-Reggiano",
            "3/4 teaspoon dried oregano",
            "1/2 teaspoon kosher salt"
        ],
        "title": "Pizza Popcorn",
        "picture_link": "yFFWT8wDAvBRFOgpRAoRB9ibZM2avX6"
    },
    "HFrmmzj1bab56NY9zjL7phWloRAeNhK": {
        "instructions": "Heat the extra-virgin olive oil in a skillet over medium heat. Add the onions, rosemary and salt and pepper, to taste. Cook the onions until sweet and soft, 8 to 10 minutes. Stir in the tomato paste for 1 minute. Add the stock, then stir in the beans and reduce heat to low. Adjust seasoning and turn out into a serving bowl. Keep warm until ready to serve.",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil",
            "1 medium to large onion, chopped",
            "2 sprigs rosemary, leaves finely chopped",
            "Salt and freshly ground black pepper",
            "1/4 cup tomato paste",
            "1 cup chicken stock",
            "2 (15-ounce) cans cannellini beans, drained"
        ],
        "title": "Red White Beans",
        "picture_link": null
    },
    "a0FUbsNhUvdA/iIwLLhOUaqskJW.HRe": {
        "instructions": "In a blender on high speed, combine mustard, lemon juice, vinegar, and ginger for just a few seconds until smooth. Then turn the blender to a lower speed and slowly pour the oil in a continuous stream. Season with salt and pepper, to taste.\nPlace shredded lettuce piled high in the center of a bowl with edges. Add dressing to lettuce and toss. Sprinkle parsley around the edges of the bowl and garnish with a lemon slice.",
        "ingredients": [
            "1 tablespoon Dijon mustard",
            "1 tablespoon fresh lemon juice",
            "2 tablespoons rice wine vinegar",
            "1 tablespoon fresh ginger, peeled and chopped",
            "3/4 cup canola oil",
            "Kosher salt",
            "1/8 teaspoon fresh ground black pepper",
            "1/2 head iceberg lettuce, shredded",
            "2 tablespoons chopped fresh parsley leaves",
            "Lemon slices, for garnish"
        ],
        "title": "Ginger Salad",
        "picture_link": "ncZGezzkKRNaT/nNs4mV9ZuzuW2kBey"
    },
    "Tg6WfsgcuO2GaUzpJxCgNqABxhl6gB6": {
        "instructions": "Remove the meat from the lobsters, chopping any large chunks into bite-size pieces. In a bowl, combine the lobster meat, mayonnaise, lemon juice, celery, parsley, and salt and pepper to taste.\nBrush cut sides of the rolls with melted butter and fill with the lobster salad.",
        "ingredients": [
            "4 (1 1/2-pound) cooked lobsters or 4 lobster tails or 1 1/2 pounds lobster meat",
            "1/2 cup mayonnaise",
            "3 tablespoons freshly squeezed lemon juice",
            "2 inner celery stalks and leaves, finely chopped",
            "2 tablespoons chopped fresh parsley leaves",
            "Salt and freshly ground black pepper",
            "4 rolls, split and lightly toasted",
            "Melted butter, for brushing"
        ],
        "title": "Lobster Rolls",
        "picture_link": "lL4CewUHDcDfRi67kw3zMX7Lq225OMW"
    },
    "nrVrr4AcAKiWaNl/BOld9fJ1jCkDgwC": {
        "instructions": "Preheat the oven to 375 degrees F. Mix the maple syrup and dark brown sugar in a small bowl.\nLine a baking sheet with aluminum foil and set a rack on stop. Put the bacon on the rack leaving space between the strips. Brush with the maple syrup mixture and then sprinkle some fennel seeds on top¿fennel is a strong spice so use it sparingly. Season with black pepper.\nBake until brown and crisp, 20 to 25 minutes. Loosen the bacon from the rack and let it cool there 5 minutes before serving.",
        "ingredients": [
            "3 tablespoons pure maple syrup",
            "1 tablespoon dark brown sugar",
            "12 slices thick-cut bacon",
            "2 teaspoons fennel seeds, crushed",
            "Freshly ground black pepper"
        ],
        "title": "Maple Fennel Bacon",
        "picture_link": "C03gYk4ZJ/YAgg7ibzYWWjkxkqbiNV2"
    },
    "zC0AgiBuJ/nHIum6NfYxGpO/ISDbxBS": {
        "instructions": "Preheat electric sandwich press or contact grill. In small bowl pour water over tomatoes. Let stand for 5 minutes. Drain well. Finely chop. Set aside.\nMeanwhile, cook MorningStar Farms Spicy Black Bean burger according to package directions.\nIn another small bowl stir together tomatoes, mayonnaise, cocktail sauce and horseradish.\nLay out the bread slices onto a clean work surface. Spray one side of each slice with nonstick cooking spray. Flip 4 of the slices over and spread with the mayonnaise mixture. Place the burgers on top of the mayonnaise mixture then top each with 1 tablespoon of the pepper rings, 1 tablespoon of onion and remaining bread piece sprayed side facing up.\nPlace sandwich in press or grill. Cover and cook for 3 to 6 minutes or until bread is toasted. Slice in half and serve.",
        "ingredients": [
            "1 cup boiling water",
            "8 pieces sun-dried tomatoes (not oil-packed)",
            "4 MorningStar Farms Spicy Black Bean Veggie Burgers",
            "1/4 cup reduced-fat mayonnaise",
            "1/4 cup cocktail sauce",
            "4 teaspoon prepared horseradish",
            "8 (1/2-inch-thick) slices firm-textured, whole wheat or sourdough bread (about 1 1/2 oz.)",
            "Nonstick cooking spray",
            "1/4 cup banana pepper rings, drained",
            "1/4 cup chopped red onion"
        ],
        "title": "Black Bean Burger Panini",
        "picture_link": null
    },
    "eFh9.QpEmHABlU8KLEFRdBEUdqzejbC": {
        "instructions": "Preheat the oven to 350 degrees F.\nButter a baking dish. Cut each apple into 8 wedges and add them to a bowl of ice water with lemon juice. Separate the crescent roll dough into triangles. Remove the apples from water and pat dry with paper towels. Roll each apple wedge in the dough starting at the smallest end. Put all of the triangles into the baking dish.\nIn a small bowl mix the sugar, ground cinnamon, and ground nutmeg until well combined. Sprinkle over the apple triangles, generously covering all portions. Cut the butter into small pieces and scatter over the baking dish, evenly distributing it around the dumplings. Pour the lemon lime soda over the dumplings. Bake until the dumplings are golden brown, about 40 to 50 minutes. Remove from the oven and arrange on a serving platter. Serve warm with a side of whipped cream or vanilla ice cream.",
        "ingredients": [
            "4 tablespoons butter, plus butter for dish",
            "2 large Granny Smith apples, peeled and cored",
            "1/2 lemon, juiced",
            "2 cans refrigerated crescent roll dough",
            "1 cup sugar",
            "1 tablespoons ground cinnamon",
            "1 teaspoon ground nutmeg",
            "1 (12-ounce) can lemon lime soda (recommended: Mountain Dew)",
            "Whipped cream or vanilla ice cream, for serving, optional"
        ],
        "title": "Lemon Lime Soda Apple Dumplings",
        "picture_link": null
    },
    "trOdrH9Ovv5pDgopYWbMyknxbLawp/W": {
        "instructions": "Preheat oven to 425degrees.\nCombine bread crumbs and 1 tablespoon Parmesan cheese in large bowl. Dip pork in egg, then bread crumb mixture, coating well. Arrange pork on greased baking sheet. Bake, turning once, 18 minutes or until pork is done.\nMeanwhile, heat Sauce in 2-quart saucepan. To serve, spoon sauce over hot penne. Top with pork, then sprinkle with remaining 2 tablespoons cheese.",
        "ingredients": [
            "1/3 cup plain dry bread crumbs",
            "3 Tbsp. grated Parmesan cheese",
            "3/4 lb. boneless pork or pork tenderloin, thinly sliced and pounded 1/4 inch thick",
            "1 egg, slightly beaten",
            "1 jar Bertolli Tomato & Basil Sauce",
            "8 ounces penne pasta, cooked and drained"
        ],
        "title": "Pork Cutlets Parmigiana",
        "picture_link": "DZhHtabo0QooqN5V3it7GlW5U9yCcZC"
    },
    "y7iee12zAQ1IXmoXxOZ/tG0x0u/zqjS": {
        "instructions": "Combine the flour, salt, and sugar in food processor. Add butter; process until mixture resembles coarse meal, about 8 to 10 seconds. For hand method, place dry ingredients in large bowl. Add butter; blend with pastry cutter until mixture resembles coarse meal.\nAdd ice water in a slow steady stream through feed tube of food processor with machine running, until the dough holds together for no longer than 30 seconds. For hand method, mix dough with a wooden spoon, adding water until dough just holds together.\nTurn dough onto piece of plastic wrap. Press into a disk, and. wrap in plastic wrap. Refrigerate at least 1 hour. May be frozen, double wrapped in plastic, for several months.",
        "ingredients": [
            "2 1/2 cups all-purpose flour",
            "1 teaspoon salt",
            "1 teaspoon sugar",
            "1 cup (2 sticks) cold unsalted butter, cut into small pieces",
            "1/4 to 1/2 cup water"
        ],
        "title": "Pie Crust 101",
        "picture_link": null
    },
    "bJnb1zIuu1MoBgeBC70EsrnYJsM6X9W": {
        "instructions": "Preheat oven to 350 degrees. Butter and dust with bread crumbs a 1-quart souffle dish or 4 (8-ounce) ramekins. Coarsely chop smoked salmon and put aside, or if using canned salmon, thoroughly drain the salmon. In a bowl, clean bones and skin from salmon. Break it into fine pieces with a fork. Set aside. Place all remaining ingredients in a blender container. Cover and blend at medium speed for about 30 seconds. Blend at high speed for another 10 to15 seconds. Stir the egg mixture into the bowl with the salmon. Pour the mixture into the prepared souffle dish or spoon the mixture into the prepared ramekins including an equal amount of salmon pieces in each. Bake for 45 minutes to 50 minutes on a cookie sheet, until puffy and delicately browned. Don't open oven door for at least 30 minutes. Serve immediately.",
        "ingredients": [
            "Butter or margarine",
            "Bread crumbs",
            "8 ounces smoked salmon or 1 (7 1/2-ounce) can red salmon",
            "6 eggs",
            "12 ounces cottage cheese",
            "2 tablespoons lemon juice",
            "1 teaspoons Dijon mustard",
            "1/2-cup chopped red onion",
            "1/4-cup fresh dill"
        ],
        "title": "Amazing Salmon Blender Souffle",
        "picture_link": null
    },
    "8lR8S6DpGVjhqBjLD0kcsJO961mRqfO": {
        "instructions": "Pancakes:\nPlace dry ingredients in a stainless steel bowl and whisk to combine. Fold in eggs and buttermilk with a spoon or rubber spatula. Stir in melted butter and set aside batter to rest for at least 1 hour.\nHeat a nonstick griddle over medium heat. Ladle pancake batter onto hot griddle, in batches as necessary, and cook until bubbles form around the edges. Flip pancakes and continue cooking on second side until set and golden brown. Keep warm in a 200 degree F oven until ready to serve.\nSauce:\nIn a saucepan, combine berries, sugar, vanilla, cinnamon, and nutmeg and bring to a boil. In a small bowl, combine cornstarch and water, stirring until it dissolves. Add the cornstarch slurry to the sauce to thicken. Stir until smooth and simmer slowly for 2 to 3 minutes.\nTo serve, stack 2 pancakes on a plate and top with 4 tablespoons of sauce.",
        "ingredients": [
            "1 1/2 cups coarse-ground cornmeal",
            "2 cups all-purpose flour",
            "2 teaspoons baking powder",
            "1 teaspoon baking soda",
            "1/2 teaspoon salt",
            "3 tablespoons sugar",
            "2 eggs, beaten",
            "4 cups buttermilk",
            "1/4 cup unsalted butter, melted",
            "1 cup raspberries",
            "1 cup blueberries",
            "1 cup blackberries",
            "1/2 cup sugar",
            "1 teaspoon vanilla extract",
            "1/2 teaspoon ground cinnamon",
            "1/2 teaspoon ground nutmeg",
            "2 tablespoons cornstarch",
            "1/4 cup cold water"
        ],
        "title": "Polenta Pancakes with Warm Berry Sauce",
        "picture_link": null
    },
    "UX3VTTxgjcO6zsjHVL.XOuSmsZUk08G": {
        "instructions": "Fill one shot glass with the whiskey and serve with the Lemon-Ginger Zapper in a second shot glass as a chaser.\nJuice the lemons, then the ginger, following your juicer's specific settings for each. Stir in the coconut water, agave syrup and cayenne. Serve the juice immediately over ice, if desired.",
        "ingredients": [
            "1 ounce whiskey",
            "3 ounces Lemon-Ginger Zapper, recipe follows",
            "6 large, juicy lemons, peel and pith removed",
            "2 ounces fresh ginger (about a 2-inch piece)",
            "1/2 cup coconut water or tap water",
            "1 teaspoon agave syrup",
            "1/8 to 1/4 teaspoon cayenne pepper"
        ],
        "title": "Zapperback",
        "picture_link": "RH29eCGRigmdqybszRtgzsyHj0w94gC"
    },
    "9Pp8AZDwu.VmLseGj8M3l21VE32JXx.": {
        "instructions": "Watch how to make this recipe.\nCombine the kale, grapes, orange juice, pear, banana and 1/2 cup water in a blender with ice and blend until smooth.",
        "ingredients": [
            "2 cups kale",
            "1 cup grapes",
            "1 orange, juiced",
            "1/2 pear, cored",
            "1/2 banana, sliced"
        ],
        "title": "Katie's Kale Smoothie",
        "picture_link": "FnI7/GVJAi6LTQoz64C71xf8AqW2HdC"
    },
    "efQOFu8nwlZgli6eM3VRb34BGHZjkAe": {
        "instructions": "In a small bowl mash tuna with mayonnaise to taste to a smooth paste. Spread on bread and wrap securely in foil. Let sandwich sit 2 hours until mayonnaise has softened bread. Slice in half and serve with a glass of cold milk.;",
        "ingredients": [
            "1 small can solid white tuna packed in water, drained well",
            "3 to 4 tablespoons mayonnaise",
            "2 slices white bread"
        ],
        "title": "Tuna Sandwich",
        "picture_link": null
    },
    "0tqVcR24.KCSP7DamS4eDai3fL4tZhG": {
        "instructions": "Take 1 tablespoon of the butter and add to a small fry pan, then saute the white parts of the scallions until soft. In a large sauce pot, boil the potatoes until they are tender. Drain the potatoes well, add the sauteed scallions, then mash and whip in butter, salt and white pepper, to taste, with a beater. Fold the cheese into the potatoes and allow it to melt. Stir to evenly distribute cheese, transfer to a serving dish and garnish with finely chopped tender green parts of scallions or fresh chives.",
        "ingredients": [
            "1/2 cup butter (8 tablespoons or 1 (4-ounce) stick",
            "6 scallions, white parts only (use tender green parts for garnish below), finely sliced",
            "6 large potatoes, peeled and cut into chunks",
            "Salt",
            "White pepper",
            "2 cups sharp shredded Cheddar",
            "Tender green parts from scallions above, finely chopped or 1/4 cup chopped fresh chives"
        ],
        "title": "\"Say Cheese\" Mashed Potatoes",
        "picture_link": "baylg2D8RIWC/Ya7BKfMmM4vzaNyuMa"
    },
    "dCKz.95C/0D4pc1hgnjmgs1VbE0ZFOS": {
        "instructions": "Dip eggplant rounds in the flour, the egg and then in the bread crumbs and transfer to a sheet pan and arrange in a single layer. In a skillet heat 1/4-inch of olive oil and cook eggplant in batches, adding more olive oil to pan when necessary, until golden brown on both sides. Transfer cooked eggplant to paper towel-lined sheet pan to drain and season with salt and pepper. Spread warm marinara sauce in bottom of baking dish and alternate layers of eggplant, marinara sauce, basil, salt and pepper, grated Parmesan cheese and Mozzarella slices, ending with the Mozzarella on top. Bake in a pre-heated 350 F oven, uncovered, for 30 minutes.",
        "ingredients": [
            "1 medium eggplant, cut into 1/2-inch rounds",
            "1/2 cup flour",
            "1 egg, lightly beaten",
            "1 1/4 cups seasoned dry bread crumbs",
            "1 clove garlic, thinly sliced",
            "1/2 cup olive oil",
            "3 cups Marinara sauce, heated",
            "1/2 cup fresh basil leaves, thinly sliced",
            "Salt and pepper",
            "3/4 cup grated Parmesan cheese",
            "1/2 pound Mozzarella, thinly sliced"
        ],
        "title": "Eggplant Parmigiana",
        "picture_link": null
    },
    "xmqk3tgT7IFd4mlHPAU31J10zWGSYLK": {
        "instructions": "Watch how to make this recipe.\nIn a medium saute pan over medium heat add oil. When oil is hot add onions and cook, stirring occasionally until onions release their natural sugar and become golden brown, about 20 minutes.\nTo make dressing: In a small jar or pint container with a lid add mustard, honey, vinegar, oil, salt and pepper. Place top on container and shake to combine.\nIn a large mixing bowl add spinach, roasted pepper, beans, feta, tuna and 2 tablespoons dressing. Toss to combine. Garnish with caramelized onion, orange segments and toasted almonds.",
        "ingredients": [
            "2 tablespoons canola oil",
            "1 medium yellow onion, thinly sliced",
            "2 teaspoons Dijon mustard",
            "2 tablespoons honey",
            "3 tablespoons rice wine vinegar",
            "1/2 cup extra-virgin olive oil",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "1 (8-ounce) bag baby spinach",
            "1 roasted red pepper, cut into strips",
            "1 can white beans, drained and rinsed",
            "1/4 cup crumbled feta cheese",
            "1 can whole chunk tuna in water",
            "1 orange, cut into segments",
            "1/4 cup toasted sliced almonds"
        ],
        "title": "Spinach Salad",
        "picture_link": "z6FONLFJsYOfiyBIV7NKpsl.acnSHFy"
    },
    "6YLBCBvff.JoYh3VUwdW3FqUgHIouNC": {
        "instructions": "Watch how to make this recipe.\nPeel away the outer husks on the corn without actually removing them. Remove the inner silky threads, then wrap the outer husk back around the ear. Soak the ears in water for 1 hour.\nIn a small saucepan, combine the maple syrup, butter, chiles and garlic and season with salt and pepper. Allow to simmer over medium heat for about 8 minutes. Remove from the heat and keep warm.\nPreheat a grill for medium heat. Grill the corn, turning occasionally, until the kernels are slightly charred, about 20 minutes. Brush with the maple butter.",
        "ingredients": [
            "8 ears corn",
            "1/2 cup Grade B maple syrup",
            "5 tablespoons unsalted butter",
            "2 chipotle chiles in adobo, pureed",
            "2 cloves garlic, chopped to a paste",
            "Kosher salt and freshly ground black pepper",
            "Canola oil"
        ],
        "title": "Grilled Corn with Maple and Chipotle",
        "picture_link": "uzDKtP8QNwa2uux/FWC65ykMSFxLw7G"
    },
    "ih3qoOj.Vy8EZvOMAhJRCsUqk5mX/Yu": {
        "instructions": "In a large skillet heat oil over medium high heat. Add butter and stir until melted. Add potatoes and toss to coat. Cook the potatoes for 10 minutes, occasionally tossing and stirring them. Transfer potatoes to a baking sheet and roast in oven at 400 degrees for another 20 minutes. Bake until potatoes are golden brown and crispy. Season with salt and pepper.",
        "ingredients": [
            "4 Idaho potatoes, scrubbed clean and sliced into 1/2-inch thick slices",
            "3 tablespoons vegetable oil",
            "2 tablespoons butter",
            "Salt and pepper"
        ],
        "title": "Oven Baked Steak Fries",
        "picture_link": null
    },
    "7o3GauBUBiOZrW0DS73i5cCuEkGDYlS": {
        "instructions": "Watch how to make this recipe.\nFind a tall bottle that will hold at least a dozen vanilla beans. Fill the bottle with vodka. Let the beans marinate in the vodka for at least a month.",
        "ingredients": [
            "12 vanilla beans",
            "Vodka"
        ],
        "title": "Vanilla Extract",
        "picture_link": "LOZEGPJMhlwqcG7NoC2U5yQpfDg8.T."
    },
    "znNVq1m5dWPiojg3Fnmx2NJ1MFuDnO6": {
        "instructions": "Add coconut milk, sugar and salt to a saucepan and stir over medium heat until the sugar and salt dissolves. Reduce heat to medium low, add shredded coconut and cook for 5 minutes to soften. Make a slurry in a separate small bowl by gradually whisking 1/4 cup water into the cornstarch. Whisk slurry into the coconut mixture and allow to reduce and thicken until it is the consistency of yogurt. Transfer to serving dishes and chill.",
        "ingredients": [
            "1 quart coconut milk",
            "1/2 cup sugar",
            "1/4 teaspoon salt",
            "1/3 cup shredded coconut",
            "1/4 cup water",
            "1/4 cup cornstarch"
        ],
        "title": "Haupia (Coconut Pudding Dessert)",
        "picture_link": null
    },
    "EltT1FtSwoCtAKlPkjOZgb/mhvJAjsS": {
        "instructions": "Line six 3-inch muffin or custard cups with paper cupcake liners.\nIn the top of a double boiler or a stainless steel mixing bowl set over a pot of simmering water (do not let the water touch the bottom of the bowl), whisk together the egg whites and sugar. Continue to whisk gently until the sugar is dissolved and the mixture is warm to the touch (test it with a clean finger). Remove from the heat and, with an electric mixer on medium-high speed, beat the mixture until white and fluffy and completely cool.\nIn a medium bowl, combine the cream and vanilla and, with the same beaters, whip until soft peaks form. Fold the whipped cream into the beaten egg whites until completely incorporated, then fold in the almonds. Spoon the schiumone into the prepared cups and freeze for at least 3 hours.",
        "ingredients": [
            "2 egg whites",
            "1/2 cup sugar",
            "1 cup heavy whipping cream",
            "2 teaspoons vanilla",
            "1 cup almonds, toasted and chopped"
        ],
        "title": "Frozen Vanilla Mousse (Schiumone)",
        "picture_link": null
    },
    "vhlTt3DmOJ6doXlxxqSsCqInFeZo7jS": {
        "instructions": "Watch how to make this recipe.\nHeat a gas grill to medium-high heat on one side and medium heat on the other.\nGenerously season the steak with salt and pepper. Use a clean tea towel to brush the grill grates with oil.\nGrill the steak on each side for 5 to 6 minutes for medium. Remove from the grill and allow to rest for 5 minutes. While the steak rests, prepare the salad.\nIn a separate bowl, add the vinegar and drizzle in the olive oil while whisking and season with salt and pepper. Add the arugula and tomatoes and toss to coat. Divide and arrange the salad between two plates. Slice the steak and divide between the two plates.",
        "ingredients": [
            "1 (20-ounce) rib eye steak, 1 1/2-inches thick",
            "Kosher salt and freshly ground pepper",
            "2 tablespoons extra-virgin olive oil, plus more for grill grates",
            "1 tablespoon balsamic vinegar",
            "2 large handfuls arugula",
            "1 cup cherry tomatoes, halved"
        ],
        "title": "Grilled Rib Eye with Tomato and Arugula Salad",
        "picture_link": "I59Reg9pwgi9KnW0iT7TFmolpACjk7G"
    },
    "V6qqYx2hXyQnTSUOBcG0EPOLKMlCVKS": {
        "instructions": "Heat a large griddle or cast-iron skillet over medium heat.\nPrepare the sandwiches by spreading 4 slices of the bread with preserves. Top with a slice of cheese, 2 slices of folded prosciutto, then another slice of cheese. Spread the remaining bread slices with Dijon and set in place over the cheese.\nIn a large shallow bowl, beat the eggs with the milk or cream, Parmesan, and parsley. Nest the butter in a paper towel and wipe it across the hot pan. Dip the sandwiches into the egg mixture and cook the sandwiches until deep golden, about 3 to 4 minutes on each side.\nToss the arugula with the lemon juice, extra-virgin olive oil, and salt and pepper, to taste, in a large serving bowl. Cut the sandwiches from corner to corner and serve alongside the salad.",
        "ingredients": [
            "8 slices good quality white bread",
            "1/2 cup fig or plum preserves",
            "8 slices mild provolone or fontina cheese",
            "8 slices prosciutto cotto with rosemary (recommended: Citterio)",
            "1/4 cup Dijon mustard",
            "3 eggs",
            "1/2 cup milk or cream",
            "1/2 cup grated Parmigiano-Reggiano, a couple handfuls",
            "1/4 cup chopped fresh flat-leaf parsley",
            "1 tablespoon butter",
            "6 cups arugula or baby arugula",
            "1 lemon, juiced",
            "2 tablespoons extra-virgin olive oil, eyeball it",
            "Salt and freshly ground black pepper"
        ],
        "title": "Italian-Style Monte Cristo Sandwiches",
        "picture_link": "/5c4ZwM7JcqukKxa1J./gRT6MQ6PyIu"
    },
    "RUBv85T5ksPxNuutERr86pNRo6m2fEO": {
        "instructions": "Form the meat into 36 golf ball-size balls. Pulse the onion in a food processor until finely chopped.\nHeat a cast-iron skillet over high heat. Working in batches, add the meatballs to the skillet and smash them very flat with a spatula. Season with salt and pepper, then sprinkle the onion over the patties. Cook 1 minute, then flip and smash the burgers with the spatula again. Cook 1 more minute for well done; place both halves of the buns on top of the patties to steam for the last few seconds of cooking.\nServe the burgers on the buns; top with pickles, ketchup and mustard.\nPhotograph by Tina Rupp",
        "ingredients": [
            "2 1/4 pounds 90% lean ground beef (such as sirloin)",
            "1 large onion, roughly chopped",
            "Kosher salt and freshly ground pepper",
            "36 slider buns, split",
            "Dill pickle slices, ketchup and mustard, for topping"
        ],
        "title": "Smashed Sliders",
        "picture_link": "PSK1LUqdfR.43q.7mnri4xxV3bNinYq"
    },
    "fpc5CenOsQK5bhzAbeDwHyjXjg6gbyu": {
        "instructions": "Watch how to make this recipe.\nCombine the coffee, sugar, coffee liqueur, and vanilla and stir until the sugar dissolves. Pour the mixture in a flat pan that's about 9 by 13-inches. Place the pan in the freezer for one hour, until it starts to become slushy around the edges. Rake the mixture with a large fork to break up the crystals and place it back into the freezer. Every 30 minutes, rake the mixture until it is completely frozen and granular throughout. Freeze until ready to serve.\nSpoon the granite into pretty stemmed glasses and top with a dollop of whipped cream. Serve immediately.\nPlace the cream, sugar, and vanilla in the bowl of an electric mixer fitted with the whisk attachment. Whip on medium and then high speed until the cream just forms stiff peak.",
        "ingredients": [
            "2 cups hot freshly brewed strong coffee",
            "1/2 cup sugar",
            "1 teaspoon coffee liqueur, such as Tia Maria",
            "1/2 teaspoon pure vanilla extract",
            "Sweetened Whipped Cream, recipe follows",
            "1 cup cold heavy cream",
            "1 tablespoon sugar",
            "1/2 teaspoon pure vanilla extract"
        ],
        "title": "Coffee Granita (with Sweetened Whipped Cream)",
        "picture_link": "Lw31BW7p9MY5brjTAvBr2M26wGMgsfq"
    },
    "MYgtL/xSustcQz0Bt9bpdTNaT9s7/1G": {
        "instructions": "Blend above and then rub over the entire turkey. This is enough for 1 (10 to 12) pound turkey.;",
        "ingredients": [
            "4 tablespoons kosher salt",
            "4 teaspoons garlic powder",
            "4 teaspoons white pepper",
            "2 teaspoon cayenne pepper",
            "1 teaspoon onion powder"
        ],
        "title": "Cajun Rub for Deep Fried Turkey",
        "picture_link": null
    },
    "HG4Bbcr8LJQF5TSyyG6l9KFWL3ex5MK": {
        "instructions": "In a large saucepan heat oil and saute onions and garlic until onions are translucent. Add ginger, salt, pepper, red pepper flakes, curry powder and saute for about 3 minutes, stirring constantly. Add tomatoes, squash, chicken or vegetable stock and deglaze pan. Bring to a boil, reduce heat and simmer, covered for 20 minutes. Add 2 cups of the peas and simmer, covered, for another 10 minutes or until peas and squash are tender. Using an immersion blender puree soup in pot. Add remaining peas and reheat. Stir in cilantro. Adjust seasoning. Serve hot.",
        "ingredients": [
            "2 tablespoons vegetable oil",
            "2 medium onions, chopped",
            "2 garlic cloves, minced",
            "1 teaspoon grated fresh ginger",
            "Salt and pepper to taste",
            "Hot red pepper flakes to taste, crumbled",
            "2 1/2 teaspoons mild curry powder",
            "4 plum tomatoes, chopped",
            "1/2 butternut squash, peeled, seeded, roughly chopped",
            "4 cups vegetable stock",
            "3 cups fresh green peas (or 1 pound frozen)",
            "1/4 cup cilantro leaves, chopped"
        ],
        "title": "Pea Soup East African Style",
        "picture_link": null
    },
    "dhCzpUr0wNPQLKOjHHV70xDh7SYcaaG": {
        "instructions": "Cut lamb meat away from bone in 2 large pieces. Slice lengthwise into 1-inch strips and then cut into 1-inch cubes.\nCombine ginger, garlic, soy sauce, onion, lemon juice and honey. Season with salt and pepper. Place meat in marinade and rest overnight in the refrigerator.\nPreheat broiler. Divide lamb among 6 skewers. Lay on a rack and broil 5 minutes each side.\nRefill pineapple shell with pineapple flesh. To eat, stick end of each lamb skewer in a piece of pineapple.",
        "ingredients": [
            "1 (3 1/2 pound) leg of lamb, trimmed of heavy fat, shank removed",
            "3 thin slices ginger root",
            "4 cloves garlic, roughly crushed",
            "3 tablespoons soy sauce",
            "1/2 cup finely sliced onion",
            "1/2 lemon, juiced",
            "3 tablespoons honey",
            "Freshly ground salt, to taste",
            "Freshly ground pepper, to taste",
            "1 large ripe pineapple, cored, flesh cut into 1-inch pieces, with shell left whole and intact"
        ],
        "title": "Lamb Kebabs",
        "picture_link": null
    },
    "Bl9doo1kqi2RH4xVVO26ec3CeGS7kZ2": {
        "instructions": "Melt the butter and squeeze in lemon juice and add crushed garlic, cilantro and green onions and mix well. Place salmon fillet on a piece of aluminum foil that is large enough to completely wrap and seal the fillet. After placing the salmon on the foil, brush or pour the butter mixture on the salmon. Seal the salmon in foil. Place on the barbecue grill and cook for 10 to 12 minutes per side. Any longer will dry out the salmon. Cut in portions and serve immediately.\nFish can also be cooked in a preheated 350-degree F oven for 35 to 40 minutes.",
        "ingredients": [
            "1 pound butter",
            "1 to 2 lemons, juiced",
            "4 to 5 garlic cloves, crushed",
            "1 bunch cilantro, stems removed and chopped",
            "3 green onions, thinly sliced",
            "1 (4 to 5 pound) salmon fillet"
        ],
        "title": "Salmon in Herb Butter",
        "picture_link": null
    },
    "iTq.7q9Oi37UQy1M6uqOUVbWFCDbQ6W": {
        "instructions": "Preheat an oven to 350 degrees F.\nLine up strips of bacon on a sheet of waxed paper or parchment. Sprinkle half the sugar over top of bacon. Dust bacon with pepper to taste. With your fingers, rub in sugar and pepper. Turn bacon strips over and sprinkle the other side with remaining sugar and pepper to taste, rubbing it in.\nHave a broiler pan with a slotted top or a rack set over a baking pan ready. Transfer the bacon strips to it, twisting each piece into a corkscrew as you place it. Place strips close together but do not touch. Bake until bacon is golden brown and crisp, turning with tongs about half way through, about 15 to 20 minutes.",
        "ingredients": [
            "12 strips bacon",
            "3 tablespoons brown sugar",
            "Freshly ground black pepper"
        ],
        "title": "Corkscrew Bacon",
        "picture_link": null
    },
    "yyDS7w0Jd3NOPnu2slROdEWcKR3rOz6": {
        "instructions": "In a large pot of boiling salted water, over medium heat, add the beans and blanch for 3 minutes. Remove from water and shock in an ice bath. Drain, pat dry and add to a large serving bowl. Add the remaining ingredients and toss.",
        "ingredients": [
            "1 1/2 pounds green beans, stemmed",
            "2 shallots, sliced thin",
            "6 slices deli ham, diced",
            "1/4 cup slivered almonds",
            "2 teaspoons freshly chopped dill leaves",
            "1 lemon, zested and juiced",
            "3 tablespoons olive oil",
            "Kosher salt and freshly ground black pepper"
        ],
        "title": "Gina's Green Bean Salad",
        "picture_link": "BTlpk1yGAM8dh84Rbhkl16UxB4xi9oC"
    },
    "CSj/4aftxcRN9wDJdpJ.gXblzT9ibP6": {
        "instructions": "Special equipment: Candy thermometer\nSpray inside of measuring cup with nonstick cooking spray. In a medium saucepan, over medium-high heat, add corn syrup, sugar, and salt. Cook on stove until the temperature reaches 310 degrees F. on a candy thermometer. Once the mixture reaches 310 degrees F, take off the stove; add the baking soda, cashews and butter, working quickly and stirring constantly.\nThe mixture should stay an opaque color. On a nonstick tray sprayed with nonstick cooking spray, pour in the mixture and spread with wooden spoon. Cool for 1 1/2 hours.\nPlace 2 scoops of vanilla ice cream on each dish and garnish with broken pieces of cashew crunch.",
        "ingredients": [
            "1/2 cup corn syrup",
            "1 1/2 cups sugar",
            "1/2 teaspoon salt",
            "1/2 teaspoon baking soda",
            "1 cup raw cashews, unsalted",
            "2 tablespoons butter",
            "Vanilla ice cream"
        ],
        "title": "Cashew Candy Crunch Sundae",
        "picture_link": "NnltERQjcsjVhOq.E3l4dxjGL9I6gYO"
    },
    "FDd60pzPX0okh8RO9DZ4y3o7qucRcaq": {
        "instructions": "Reserve the oysters refrigerated until ready to open. Make the sauce by stirring together the vinegar, soy sauce, mirin, and leek. Open the oysters and arrange on a platter. Spoon about half a teaspoon of the sauce onto each oyster, and serve immediately.",
        "ingredients": [
            "24 oysters, refrigerated",
            "3 tablespoons rice vinegar",
            "1 tablespoon soy sauce",
            "2 teaspoons mirin",
            "2 tablespoons minced leek, pale green portion only"
        ],
        "title": "Ivan's Oysters",
        "picture_link": null
    },
    "6GGyu1nV43eFwWzETVkF93qrKtlGfpG": {
        "instructions": "Cut fillets into 6 portions. Combine flour, seasoned salt, and paprika; mix well. Roll fish in flour mixture. Place fish in a single layer, skin side down, in a well greased 15 by 10 by 1 inche baking pan. Drizzle 2 tablespoons melted butter over fish. Broil about 4 inches from source of heat about 10 minutes or until fish flakes easily when tested with a fork. While fish is broiling, saute almonds in remaining butter in a fry pan and allow to turn a golden brown, stirring constantly. Remove from heat. Add lemon juice, hot pepper sauce, parsley; mix. Pour over fish. Serve at once.",
        "ingredients": [
            "2 pounds skinless pollock fillets",
            "1/4 cup all-purpose flour",
            "1 teaspoon seasoned salt",
            "1 teaspoon paprika",
            "1/4 cup melted butter",
            "1/2 cup sliced almonds",
            "2 tablespoons fresly squeezed lemon juice",
            "4 to 5 drops liquid hot pepper sauce",
            "1 tablespoon chopped parsley leaves"
        ],
        "title": "White Fish Fillets Amandine",
        "picture_link": "hHxtGt3.g..NffL5kGqfaoCCzzwkkxC"
    },
    "FdEJzjkWgdKVIJzR81VzRQxjZOHjzBS": {
        "instructions": "Butter bread slices very lightly and line small baking dish with 4 slices. In a sauce pan combine raspberries, sugar lemon juice and water. Bring to a simmer and cook for about 10 minutes. Pour berry-mixture over bread. Layer remaining slices over berries. Place another dish on top and press down. Pour off excess liquid and reserve to serve with pudding or use for a sauce for ice cream. Cover with plastic wrap and weight down. Chill at least 6 hours before serving.;",
        "ingredients": [
            "8 thin slices white bread",
            "Butter, softened",
            "5 cups raspberries",
            "1/2 to 2/3 cups sugar",
            "1 tablespoon lemon juice",
            "1/3 cup water"
        ],
        "title": "Raspberry Summer Pudding",
        "picture_link": null
    },
    "aywpl88Bnq6pMAhnIDnLQdlYVs7LEfu": {
        "instructions": "String both sides of the sugar snap peas. Snap off the stem tip and gently pull downward. Bring salted water to a boil, add sugar snap peas and parboil for 2 to 3 minutes or until just tender, but still crisp.",
        "ingredients": [
            "1 pound sugar snap peas"
        ],
        "title": "Sugar Snap Peas",
        "picture_link": null
    },
    "apg8QJ5QTGazPYn3GvTMnI2PZM9EKza": {
        "instructions": "Watch how to make this recipe.\nPreheat a panini grill to medium high. Place the doughnuts inside and press for 2 to 3 minutes. (If you don't have a panini grill, you can also use a grill pan and place a weight on top of the doughnuts to press them down.)\nMeanwhile, microwave the chocolate-hazelnut spread until melted, about 40 seconds. Serve the doughnuts with the chocolate-hazelnut sauce for dipping.",
        "ingredients": [
            "4 cinnamon sugar doughnuts",
            "1/4 cup chocolate-hazelnut spread"
        ],
        "title": "Grilled Doughnuts with Melted Chocolate-Hazelnut Sauce",
        "picture_link": "zUZBBA4o2e0RvvOgmxmyz4vWJB56FmK"
    },
    "ZVS5.PiX3j8Qh8N7zcKlLIb3rblm/1u": {
        "instructions": "Use a melon baller to scoop out balls of flesh from the cantaloupe; place balls in a large bowl. Repeat with the honeydews and add the balls to the bowl. Use the handle of a teaspoon to scrape out the visible watermelon seeds in rows, then scoop out flesh with the melon baller. Add to other melon balls and toss well with orange juice to combine. Chill.\nIn a medium bowl, whisk together the honey and lime juice until honey is liquefied. Whisk in yogurt; taste and add more honey or lime according to your taste.\nDivide melon balls between 4 serving dishes and drizzle 1/2 cup yogurt over each. Enjoy.",
        "ingredients": [
            "1 small ripe cantaloupe",
            "1/2 large ripe honeydew",
            "1 wedge of watermelon",
            "1/2 cup freshly-squeezed orange juice",
            "1 generous tablespoon honey, or to taste",
            "Juice of one large lime, about 1 tablespoon, or to taste",
            "2 cups plain yogurt"
        ],
        "title": "Melon Balls with Honeylime Yogurt",
        "picture_link": null
    },
    "LwRPJ3TjO4HqjTqw8v4jJRfNPnQvXMC": {
        "instructions": "For the hoagies:\nPreheat frying pan over medium-high heat. Cut the hoagie rolls horizontally to open up and make a pocket. Add the blended oil to the pan and stir in the onions. Put the steak on top of onions and add 1/2-ounce of the butter. Cover the pan for 2 1/2 minutes. The meat should have a cooked appearance on top and rare underneath. Using a fork and spatula separate steak from the onions. When the meat is cooked add the salt, remaining butter, and provolone. Cover to the pan to melt the cheese. Divide the steak mixture among the hoagie rolls and serve. If you like, you can add the optional ingredients to the steak mixture before serving.",
        "ingredients": [
            "4 (8-inch) hoagie rolls, homemade preferred",
            "2 3/4 ounces blended canola/olive oil, 60/40 ratio",
            "10 ounces sliced thin sweet onions in 1/16-inch slices",
            "28 ounces sliced thin rib-eye steak in 1/16-inch slices",
            "2 ounces melted sweet butter",
            "1/4 teaspoon salt",
            "Provolone cheese",
            "Optional ingredients: homemade tomato sauce, bell peppers, mushrooms, or your favorite cheese"
        ],
        "title": "Sonny's Steak Hoagie",
        "picture_link": null
    },
    "Laqhhl3lAP7HipbLb4/BJfDFq4AK8Uu": {
        "ingredients": [
            "5 tablespoons kosher salt",
            "2 tablespoons cayenne pepper",
            "2 tablespoons garlic powder",
            "2 tablespoons sweet paprika",
            "1 tablespoon dried oregano",
            "1 tablespoon dried thyme",
            "1 tablespoon freshly ground black pepper",
            "1 tablespoon onion powder"
        ],
        "picture_link": "4dBjURZoCaHWXYONL9YGjiam.jmDK8O",
        "instructions": "Stir all ingredients in a small bowl to blend. DO AHEAD: Can be made 1 month ahead. Store airtight at room temperature.\nStir all ingredients in a small bowl to blend. DO AHEAD: Can be made 1 month ahead. Store airtight at room temperature.",
        "title": "Cajun Spice Mix "
    },
    "EH3nb6aWqYKKvWQr0ZFAEhxU0VuQENq": {
        "instructions": "In a bowl, mix the cream cheese, walnuts, honey, cinnamon and salt until combined. Spread on anything and eat!",
        "ingredients": [
            "8 ounces cream cheese, at room temperature",
            "1/2 cup toasted walnuts, chopped",
            "2 tablespoons honey",
            "1/4 teaspoon cinnamon",
            "Pinch sea salt"
        ],
        "title": "Honey-Walnut Cream Cheese",
        "picture_link": "FnI7/GVJAi6LTQoz64C71xf8AqW2HdC"
    },
    "l/CB9JIZMCr/EA7g16HS/jy.sel093S": {
        "instructions": "Pour boiling liquid over ingredients in bowl.\nBeat by hand until smooth and all chocolate is melted.\nPour into large buttered pan.\nCool before cutting.",
        "ingredients": [
            "4 1/2 cups granulated sugar",
            "2 tablespoons butter",
            "1 tall can evaporated milk",
            "pinch of salt",
            "Boil for 5 minutes",
            "12 oz. chocolate chips",
            "12 oz. grated German chocolate",
            "2 cups chopped nuts",
            "2 teaspoons vanilla"
        ],
        "title": "Fudge",
        "picture_link": null
    },
    "HSEuYTaPKCI9LfD9O2ONNlYqlnR3sS.": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 425 degrees F. Lightly butter an 8 by 8-inch baking dish.\nHeat the oil in a medium skillet over medium-high heat. Add the onion and cook until translucent, about 3 minutes. Add the sausage and cook until brown, about 5 minutes. Set the pan aside to cool.\nIn a large bowl, whisk together the eggs, milk, salt and pepper, to taste, until smooth, about 20 seconds. Add the red bell pepper, 1 cup of Gruyere cheese and 1/4 cup of parsley. Stir in the onion mixture. Pour the batter into the prepared pan. Sprinkle with the remaining cheese. Bake for 20 to 25 minutes or until golden brown.\nCut the baked omelet into wedges and sprinkle with remaining parsley before serving.\nCook's Note: To make individual servings, divide the batter between 4 buttered 8-ounce ramekins. Bake for 15 to 18 minutes.",
        "ingredients": [
            "Butter, for greasing baking dish",
            "2 tablespoons olive oil",
            "1 small onion, diced",
            "1/2 pound mild turkey sausage, casings removed",
            "8 large eggs",
            "1/3 cup whole milk",
            "1 teaspoon kosher salt",
            "Freshly ground black pepper",
            "1 red bell pepper, diced",
            "1 1/2 cups (4 ounces) grated Gruyere cheese",
            "1/4 cup plus 2 tablespoons chopped fresh flat-leaf parsley"
        ],
        "title": "Baked Gruyere and Sausage Omelet",
        "picture_link": "1zuaUKLM.DCYd0JrIaRhd5yEPJbqbZK"
    },
    "tWSwXVUrvWpA4ZgIfKQanVnXrxb0CH.": {
        "instructions": "Place broccolini in a large bowl. Add 1 cup water and tuck lemon peels in and around the broccolini. Cover with plastic wrap and microwave for 5 minutes. Remove from the microwave, drain and add a little salt.",
        "ingredients": [
            "1 1/2 pounds broccolini, washed, chopped",
            "1 cup water",
            "4 strips lemon peel",
            "Salt"
        ],
        "title": "Lemon-Scented Broccolini",
        "picture_link": null
    },
    "0qLAsrXTsNiLKzbd8.LM1wcr/DPuccG": {
        "instructions": "Wash radishes and radish leaves well. Dry thoroughly. Cut leaves from radishes, leaving 1-inch of stem attached to each radish. Remove any spidery roots. Scatter radish leaves on large plate or platter. Cut radishes in half lengthwise and place on radish greens, cut side up. Place goat cheese in food processor with two teaspoons cold water. Process just until smooth and thick, careful not to over mix. With a butter knife, spread cheese thickly on cut side of each radish, or pipe through a pastry bag. Refrigerate until ready to use. In a small nonstick skillet, cook cumin seeds over medium heat until they begin to darken and exude a fragrant aroma. Add salt and mix well. Sprinkle each radish with cumin-salt mixture.;",
        "ingredients": [
            "12 medium red radishes, with stems and leaves",
            "4 ounces fresh goat cheese",
            "1 tablespoon cumin seeds",
            "1/4 teaspoon salt"
        ],
        "title": "Little Radishes with Whipped Goat Cheese and Toasted Cumin",
        "picture_link": null
    },
    "pmuvBYp8iLlHqFBx5kgRNmyfmyBLSUK": {
        "instructions": "Cook the beef in a 10-inch skillet over medium-high heat until well browned, stirring often to separate meat. Pour off any fat.\nStir the soups, water and pasta in the skillet and heat to a boil. Reduce the heat to medium. Cook for 10 minutes or until the pasta is tender, stirring often.\nServing Suggestion: Serve with carrot & celery sticks with ranch dressing for dipping. For dessert serve store-bought brownies topped with vanilla ice cream.\nCost per recipe: $7.23",
        "ingredients": [
            "1 pound ground beef",
            "1 can (10 3/4 ounces) Campbell's Condensed Cheddar Cheese Soup",
            "1 can (10 3/4 ounces) Campbell's Condensed Tomato Soup (Regular or Healthy Request)",
            "1 1/2 cups water",
            "2 cups uncooked medium shell-shaped pasta"
        ],
        "title": "Cheeseburger Pasta",
        "picture_link": "vA7ULpU7ZwcMTDVtDrPxuueL5lSExTO"
    },
    "uspQIVu6uEGRMRJyGlCV8yiM26Q3e.q": {
        "instructions": "Heat the oven to 350 degrees F. Spread 1/4 cup enchilada sauce in the bottom of a 9-inch pie plate.\nPour the remaining enchilada sauce into a shallow dish. Dip 3 tortillas into the enchilada sauce and turn to coat. Line the pie plate with the coated tortillas, overlapping as needed. Top with half the chicken and 1/2 cup cheese. Repeat the layers. Coat the remaining tortillas with the enchilada sauce and place on top. Spread with the remaining enchilada sauce.\nBake for 25 minutes or until the filling is hot and bubbling. Top with the remaining cheese and bake until the cheese is melted.",
        "ingredients": [
            "2 cups prepared enchilada sauce",
            "9 corn tortillas (6-inch)",
            "2 cups shredded or chopped cooked chicken",
            "2 cups shredded Mexican cheese blend (about 8 ounces)"
        ],
        "title": "Chicken and Tortilla Enchilada Bake",
        "picture_link": "EIR3lPaSwXQAZSMjM47.deLFoaptBoS"
    },
    "XbG6gNgCimLsGXceTjJwiqs0S/5tUQ.": {
        "instructions": "Watch how to make this recipe.\nPreheat oven to 350 degrees F.\nIn a large bowl, whisk together honey and eggs until thoroughly integrated. Stir in orange zest. Sift together flour, baking powder, and baking soda. Add slowly to egg mixture. Lightly grease a loaf pan with butter. Add the mixture to the pan and bake. After 30 minutes check for doneness with a wooden skewer. (If it comes out clean, you are done. If not, give it another 5 minutes and check it again).",
        "ingredients": [
            "1 cup orange blossom honey",
            "4 large eggs",
            "1 tablespoon orange zest",
            "1 1/2 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1 pinch baking soda",
            "Butter, for greasing"
        ],
        "title": "Aunt Verna's Orange Cake",
        "picture_link": "PyjOpaXrCw7XtCNceVkKpVjsOCIQhka"
    },
    "kZrPKvwCHEqKJuaK8hwtugCZrN0NleK": {
        "instructions": "Toast nuts in a small pan over low heat then remove from heat and reserve.\nBring 3 cups stock and 2 tablespoons butter to a boil. Add rice, stir, then return to boil, cover and reduce heat. Simmer rice 17 to18 minutes, until tender and liquid is absorbed. Remove from heat. Add nuts and parsley as you fluff rice with fork. Transfer to serving dish.",
        "ingredients": [
            "1 cup chopped hazelnuts (recommended: Diamond) available on baking aisle",
            "3 cups chicken stock",
            "2 tablespoons butter or extra-virgin olive oil",
            "1 1/2 cups brown rice (recommended: Uncle Ben?s or Near East)",
            "2 tablespoons chopped flat-leaf parsley"
        ],
        "title": "Brown Rice with Hazelnuts",
        "picture_link": null
    },
    "/rt9LTK.q4NV17gUZcpti8qeKX444MS": {
        "instructions": "Heat a pot of water until very hot (160 degrees F to 170 degrees F). Add a generous amount of salt. Place a large bowl filled with ice water nearby. Put the curd in another large bowl; add enough hot water to cover the curd.\nLet the curd soften, about 3 minutes, then gather it into a ball and hold it over the water; fold and pull it like taffy until elastic, about 5 minutes, dipping it back into the hot water if it gets stiff. Don't overwork the curd, as this will make your finished cheese rubbery. If the water cools too much, simply pour it off and add more of the hot water. When soft and smooth, divide the curd into 4 portions and form each into a ball.\nPlunge the mozzarella balls into the bowl of ice water and let cool.\nSlice and eat!\nServe the fresh cheese at room temperature. Refrigerate leftovers, covered with salted water, for up to 1 week.\nPhotograph by John Lee",
        "ingredients": [
            "Kosher salt",
            "12 ounces fresh mozzarella curd"
        ],
        "title": "Mozzarella",
        "picture_link": "/FKlkt21ssS7gXI1am2sjlHlfsuiZyi"
    },
    "Oda//DGcqm73ar35uMZCu2AvK7Droo6": {
        "instructions": "Watch how to make this recipe.\nServing suggestion: maple syrup and fresh raspberries\nIn a food processor, combine the mascarpone, water, sugar, almond extract, and vanilla extract. Process until the mixture is smooth. Add the pancake mix and pulse until just combined. Add the almond paste and pulse once to incorporate.\nPreheat a griddle or a large, nonstick skillet over medium-low heat. Grease the griddle or skillet with 1 tablespoon of butter. Working in batches, pour 1/4 cup of batter per pancake onto the griddle and cook for about 1 1/2 minutes each side until golden. Repeat with the remaining butter and batter.\nArrange the pancakes on a platter and serve with maple syrup and fresh raspberries.",
        "ingredients": [
            "1/2 cup (4 ounces) mascarpone cheese, at room temperature",
            "1 1/2 cups water",
            "1 tablespoon sugar",
            "2 teaspoons pure almond extract",
            "1 teaspoon pure vanilla extract",
            "2 cups buttermilk pancake mix (recommend: Krusteaz)",
            "4 ounces almond paste, cut into 1/4-inch pieces",
            "2 tablespoons unsalted butter, at room temperature"
        ],
        "title": "Almond Pancakes",
        "picture_link": "cOaS.5KR.Mo/SRPhe5OJjlZfHD4dZuO"
    },
    "h.Vs9/0A8tsd0MQfwowBHfXw5BjkG9a": {
        "instructions": "Heat the butter in a 12-inch ovenproof nonstick skillet over medium heat. Add the mushrooms, onion and zucchini and cook until tender. Stir in the egg mixture. Reduce the heat to low. Cook for 5 minutes or until the eggs are set but still moist.\nHeat the broiler. Sprinkle the cheese over the egg mixture. Broil the frittata with the top 4 inches from the heat for 2 minutes or until the top is golden brown. Sprinkle with the green onion.\nServing Suggestion: Serve with whole-grain rolls and a fresh fruit salad. For dessert serve lemon sorbet and meringue cookies.",
        "ingredients": [
            "6 eggs",
            "1 can (10 3/4 ounces) Campbell's Condensed Broccoli Cheese Soup (Regular or 98% Fat Free)",
            "1/4 cup milk",
            "1/8 teaspoon ground black pepper",
            "1 tablespoon butter",
            "2 cups sliced mushrooms (about 6 ounces)",
            "1 large onion, chopped (about 1 cup)",
            "1 small zucchini, sliced (about 1 cup)",
            "1/4 cup shredded Cheddar cheese",
            "1 green onion, chopped (about 2 tablespoons)"
        ],
        "title": "Cheddar Broccoli Frittata",
        "picture_link": "vA7ULpU7ZwcMTDVtDrPxuueL5lSExTO"
    },
    "BMq/.PK1iqnBSm/y50.CZ62/5a7bTM6": {
        "instructions": "Watch how to make this recipe.\nWhisk together the oil, vinegar, garlic paste and thyme in a medium bowl, add the tomatoes and toss to coat. Let tomatoes sit at room temperature for 30 minutes to marinate.\nHeat the grill to high.\nRemove the tomatoes from the marinade and skewer 4 per skewer, depending on the size of the tomatoes). Season on both sides with salt and pepper and grill until golden brown and slightly charred on both sides, about 6 minutes. Transfer the skewers to a platter and garnish with chives.",
        "ingredients": [
            "1/4 cup olive oil",
            "3 tablespoons balsamic vinegar",
            "3 cloves garlic, finely chopped and made into garlic paste",
            "1 tablespoon finely chopped fresh thyme leaves",
            "24 cherry tomatoes",
            "8 to 10 wooden (6-inch) skewers, soaked in water for 30 minutes",
            "Salt and freshly ground black pepper",
            "2 tablespoons finely chopped fresh chives"
        ],
        "title": "Marinated Grilled Cherry Tomatoes Skewers",
        "picture_link": "lpoA7kpilRmc3lwuKDe8XyV1NJm.VTK"
    },
    "/YVK5pLZ2LEZjihkGEOg3nwReUG0qSu": {
        "instructions": "In a 4-quart saucepan over moderate heat, bring the cream, corn syrup, sugar, salt and chocolate to a boil, stirring constantly. Simmer until mixture thickens, about 5 minutes.\nRemove from the heat and whisk in the butter. Serve while still warm.\nWhat Makes This Recipe Sing: The versatility of this sauce makes it the WOW hostess gift. Try with grilled fruit, over sponge cakes or even as a \"no need for the fondue pot\" chocolate dunk for fresh fruits, cookies and pound cakes. This sauce is a classic and of course perfect for your favorite ice cream... My choice is peppermint ice cream. Also, it makes for easily made s'mores and if all else fails, just use a good old-fashioned spoon!\nBYOC: Try adding a swirl, by heating peanut butter and swirling in the fudge. Add your favorite toasted nuts, a drop of peppermint or orange oil, or even your favorite cereal for a crunchy fudge sauce.",
        "ingredients": [
            "2/3 cup heavy cream",
            "1/2 cup light corn syrup",
            "1/3 cup packed light brown sugar",
            "1/4 teaspoon salt",
            "8 ounces bittersweet chocolate (at least 60 percent), finely chopped",
            "3 tablespoons unsalted butter"
        ],
        "title": "Hot Fudge",
        "picture_link": "CUHsYcXsA3Zq9cAwqUeiRgelRtABgjm"
    },
    "lSccK5gC2x5Mp.Nq3J9yNW2rlkY1o6C": {
        "instructions": "Between sheets of plastic wrap pound the thicker side of the breast to make it overall more even in thickness and season lightly with salt.\nHeat the sesame oil in a skillet over moderate heat. Add the chicken breasts and tenderloins. Saute the chicken without disturbing the pieces for 4 to 5 minutes. You'll know to turn the chicken over when the top looks opaque (tenderloins may take only 2 to 3 minutes per side). Turn the chicken over to the other side and saute, undisturbed again for another 4 to 5 minutes or until the interior is cooked through.\nRemove the chicken to a plate and discard the fat from the skillet. Squeeze the juice from the lime into the skillet and scrape up any coagulated juices into the juice; add the coconut milk, bring it to a simmer. Remove the skillet from the heat and whisk in the scallions and cilantro; season to taste with salt and dried red pepper flakes.",
        "ingredients": [
            "2 boneless, skinless chicken breast halves, tenderloins separated",
            "Salt",
            "1 tablespoon Oriental sesame oil",
            "Half a lime or lemon, seeds removed",
            "1/3 cup coconut milk",
            "1 small scallion (green onion), trimmed and finely sliced",
            "1/4 cup chopped cilantro",
            "Dried red pepper flakes"
        ],
        "title": "Saute of Chicken Breasts with Coconut Milk and Herbs",
        "picture_link": null
    },
    "jCX1sk.rZ1NhBRtZGng6Nh3Mn4TwHS6": {
        "instructions": "Steep the 8 tea bags in 4 cups of boiling water for about 10 minutes. Discard the tea bags. Combine the tea with the apple juice and refrigerate until cold. Serve over ice.",
        "ingredients": [
            "4 Celestial Seasonings Lemon Zinger tea bags",
            "4 Celestial Seasonings Red Zinger tea bags",
            "4 cups pure apple juice"
        ],
        "title": "Herbal Iced Tea",
        "picture_link": null
    },
    "QsmQATvHJF9lXGJ5e2HmoHNwhQVfQ5O": {
        "instructions": "Watch how to make this recipe.\nCook the pasta in a large pot of water according to the directions on the package. Drain and rinse with cold water. While the pasta is cooking put the broccoli in a steamer basket over a large pot of boiling water and steam it for 3 minutes. Add the snow peas and sugar snap peas and steam for 2 minutes more.\nToast the peanuts in a dry pan over a medium heat until they become fragrant, about 3 minutes. Set them aside to cool. Make the sauce by pureeing the peanut butter, soy sauce, water, vinegar, lime juice, scallion, ginger, sugar and red pepper flakes in a food processor or blender until smooth.\nRight before serving, toss the pasta with 3/4 cup of the peanut sauce. Divide into 6 serving bowls and top each serving with the vegetables. Drizzle the remaining sauce over the vegetables. Coarsely chop the peanuts, sprinkle them on top and serve.",
        "ingredients": [
            "3/4 pound spinach linguine or whole-wheat spaghetti",
            "2 cups (about 9 ounces) broccoli florets",
            "2 cups (about 6 ounces) snow peas, trimmed",
            "2 cups (about 6 ounces) sugar snap peas, trimmed",
            "1/2 cup natural creamy peanut butter",
            "1/4 cup low-sodium soy sauce",
            "1/4 cup water",
            "2 tablespoons rice vinegar",
            "2 tablespoons fresh lime juice",
            "1 scallion, cut into pieces",
            "3/4 inch fresh ginger, finely grated",
            "2 tablespoons brown sugar",
            "1/4 teaspoon red pepper flakes",
            "1/2 cup shelled unsalted peanuts"
        ],
        "title": "Aromatic Noodles With Lime Peanut Sauce",
        "picture_link": "SqOKfYzMIoqbLu9sVatQWwxsa0Uy0lu"
    },
    "abQs5Zx0tLJ8qz80JvegocHQF1WdNY6": {
        "instructions": "Combine the rice and cinnamon stick with 4 cups water in a blender; pulse to coarsely grind. Transfer to a large bowl and add another 4 cups water; soak at room temperature for 3 hours.\nPuree the rice mixture in a blender in batches until smooth. Strain through cheesecloth or a fine sieve into a pitcher. Mix in the sugar; chill.\nStir the horchata well before serving. Pour into ice-filled glasses; garnish with cinnamon sticks and a dusting of ground cinnamon.\nPhotograph by Kana Okada",
        "ingredients": [
            "1 cup long-grain white rice, rinsed",
            "1 cinnamon stick, preferably Mexican, broken into pieces, plus more for garnish",
            "1/2 cup sugar, or to taste",
            "1 tablespoon ground cinnamon, preferably Mexican, for garnish"
        ],
        "title": "Horchata",
        "picture_link": ".hrjs.mxsVDMNRLCKBKX6LiJbhGQXMS"
    },
    "YGeaQpH8fddDP2JCAaGYzjUM3EDtsy6": {
        "instructions": "Combine the egg, garlic, lemon juice and vinegar in the bowl of a food processor. Process for 10 seconds. With machine running, add oil 1 drop at a time through feed tube until mixture emulsifies. Slowly add remaining oil in a steady stream. Season with salt and pepper.;",
        "ingredients": [
            "1 large egg",
            "4 cloves garlic, finely chopped",
            "1 teaspoon freshly squeezed lemon juice",
            "2 teaspoons white-wine vinegar",
            "1 cup extra-virgin olive oil",
            "Coarse salt and freshly ground black pepper"
        ],
        "title": "Aioli",
        "picture_link": null
    },
    "KcimMW1D9oarfif6PqIsvu0ca45i3eu": {
        "instructions": "Preheat the oven to 350 degrees F. Butter a 2-quart baking dish.\nHeat the butter in a medium skillet set over medium heat. Add the leek and cook, stirring occasionally until soft, 8 to 10 minutes. Add the apples and cook until slightly soft, about 5 minutes. Remove from the heat and transfer to a large bowl.\nAdd the cornbread, parsley and sage to the leek mixture. Gradually add the broth, stirring gently until the cornbread is well moistened but not soggy. Season with salt and pepper.\nSpread out in the prepared baking dish and bake until heated through and lightly browned, about 30 minutes. Sprinkle with parsley before serving.\nCopyright 2016 Television Food Network, G.P. All rights reserved.",
        "ingredients": [
            "4 tablespoons unsalted butter, plus more for buttering the dish",
            "1 large leek, white part with 1-inch of green, finely chopped and rinsed",
            "2 small apples, peeled, cored and chopped",
            "4 cups cubed day old cornbread",
            "2 tablespoons finely chopped fresh flat-leaf parsley, plus more for topping",
            "1 tablespoon finely chopped fresh sage",
            "1 1/2 to 2 cups low-sodium chicken broth",
            "Kosher salt and freshly ground black pepper"
        ],
        "title": "Apple-Sage Cornbread Stuffing",
        "picture_link": "UUFu3kBr3eoee7lgD9YpeJtlPHE9Dz6"
    },
    "iqd4lhEqJB7m2x2mGfslQe5AssSUdDe": {
        "instructions": "Preheat oven to 450 degrees F.\nPut the almonds, butter, garlic, chipotle, zest, and juice in a mini chopper and pulse to combine. Transfer to a large bowl and set aside.\nScatter the broccoli in a single layer on a sheet pan, toss in the oil and season with salt and pepper. Roast until florets begin to brown but are still crisp, about 15 minutes. Stir into the bowl with the butter mixture until butter melts to completely coat the broccoli. Place back on the sheet pan and bake until tender and beginning to brown on top, about 10 minutes more. Serve.",
        "ingredients": [
            "1/4 cup sliced almonds",
            "4 tablespoons unsalted butter, softened",
            "2 cloves garlic, roughly chopped",
            "1 chipotle en adobo, chopped (with or without seeds)",
            "1 lime zested and juiced (1 tablespoon)",
            "1 bunch broccoli, stems peeled and quartered from top of florets through to bottom of stem (about 1 1/2 pounds)",
            "2 tablespoons olive oil",
            "Kosher salt and freshly ground black pepper"
        ],
        "title": "Smokey Chili Roasted Broccoli",
        "picture_link": null
    },
    "WptjJgr2MXGxMfYJYvHQb5.8VqsoyQe": {
        "instructions": "In a medium saucepan, combine the Lemon Beurre Blanc, roasted peppers, garlic, and feta cheese and heat over low heat. Keep warm until ready to use, stirring occasionally.\nPreheat a grill or grill pan. Place chicken breasts on grill and grill on both sides until completely cooked through. Remove from grill and place on a serving plate. Spoon sauce over the chicken and garnish with crumbled feta cheese.\nSweat the shallots and garlic in 1 tablespoon of butter in a medium saucepan over medium-high heat. Add the wine and lemon juice and cook until reduced by half. Add the cream and reduce until it reaches a sauce consistency. Reduce the heat to low and whip in the butter. Season, to taste, with salt and pepper.;",
        "ingredients": [
            "Lemon Beurre Blanc, recipe follows",
            "1 roasted green bell pepper, chopped",
            "1 roasted red bell pepper, chopped",
            "1/2 cup roasted garlic cloves",
            "1 cup feta cheese, crumbled, plus more for garnish",
            "6 (8-ounce) boneless, skinless chicken breasts",
            "Pinch chopped garlic",
            "Pinch chopped shallots",
            "1/2 pound butter, cut into pieces",
            "1/2 cup Chablis wine",
            "2 lemons, juiced",
            "2 cups heavy cream",
            "Salt and freshly ground pepper"
        ],
        "title": "Roasted Garlic Chicken",
        "picture_link": null
    },
    "VR6RdW6c9t.1Zf16cob2Dr66YLp4fmm": {
        "instructions": "Boil potatoes. Drain water. In a bowl, add the potatoes and garlic cloves and mash. Keep potatoes a little chunky to add texture. Season with salt and pepper. Heat the vegetable oil on medium heat in a frying pan. Cook the shallots until translucent, about 5 minutes. Add the shallots to the smashed potatoes. Add the smashed potatoes to a pan, sprinkle with salt and pepper and fry. Using a spatula flip the potatoes constantly to allow them to crisp up and turn golden brown, about 5 minutes.",
        "ingredients": [
            "2 to 3 Yukon gold potatoes",
            "4 cloves garlic",
            "2 shallots, thinly sliced",
            "2 tablespoons vegetable oil",
            "Salt and freshly ground black pepper"
        ],
        "title": "Not-Just-For-Breakfast Smashbrowns",
        "picture_link": null
    },
    "tu8Nk/A/IZIh5YkwSX4KzD0c0mxq7T2": {
        "instructions": "Preheat oven to 350 degrees F.\nMix all ingredients. Pour milk into the mix little by little until you have a dough, (a little stiff, not dry). Lightly flour your hands and roll the dough into little balls. Bake for about 12 minutes. Serve immediately.\nIt can be served plain, with butter or jam.",
        "ingredients": [
            "About 11 ounces all-purpose flour",
            "About 5 ounces sugar",
            "2 eggs",
            "1 teaspoon baking powder",
            "About 3 ounces butter",
            "Milk"
        ],
        "title": "Scones",
        "picture_link": null
    },
    "aYnii7aUhEenSfjPxyVhz7uirBJ23/K": {
        "ingredients": [
            "2 tablespoons mayonnaise",
            "2 tablespoons (1/4 stick) butter, room temperature",
            "1 garlic clove, pressed",
            "1 1/3 cups crumbled feta cheese",
            "1 1/4 cups (about) grated Parmesan cheese, divided (about 4 ounces)",
            "1/2 cup (packed) grated Monterey Jack cheese",
            "1/2 cup finely chopped green onions",
            "12 3/4-inch-thick slices pain rustique or ciabatta bread"
        ],
        "picture_link": null,
        "instructions": "Position rack in center of oven and preheat to 475°F. Mix first 3 ingredients in medium bowl. Mix in feta, 1/2 cup Parmesan, Jack cheese, and onions. Spread 2 tablespoons cheese mixture onto each bread slice. Top each with 1 tablespoon Parmesan; press to adhere. Place on baking sheet. Sprinkle lightly with salt and pepper. Bake until cheese is golden and bubbly, about 12 minutes.\nPosition rack in center of oven and preheat to 475°F. Mix first 3 ingredients in medium bowl. Mix in feta, 1/2 cup Parmesan, Jack cheese, and onions. Spread 2 tablespoons cheese mixture onto each bread slice. Top each with 1 tablespoon Parmesan; press to adhere. Place on baking sheet. Sprinkle lightly with salt and pepper. Bake until cheese is golden and bubbly, about 12 minutes.",
        "title": "Three-Cheese Garlic Bread "
    },
    "lM7MtUy4t/BjuI6eHp.lavLftZNNvB.": {
        "instructions": "In a large soup pot, heat the vegetable oil. Add the leeks, cover and cook for a couple of minutes until they begin to soften. Add the garlic and cabbage, 1 cup of the water, cover and cook for 10 minutes or until the cabbage has wilted. Add the remaining water, zucchini and green beans, cover and simmer for 5 minutes or until the vegetables are somewhat tender. Add the pasta, cover and simmer for 10 minutes or until the pasta is tender. (At this point check the level of liquid; if the soup seems somewhat thick, just add more water to bring the level of the liquid back up to where it was at the beginning of cooking time.) Add the peas and simmer for 1 to 2 minutes to heat through. Season carefully with salt and pepper. Remove the soup from the heat and stir in the fresh herbs. Serve with 1 or 2 of the garnishes, according to taste.",
        "ingredients": [
            "4 tablespoons vegetable oil",
            "2 leeks (white and green parts) cleaned and sliced",
            "2 cloves garlic, thinly sliced",
            "1/2 medium cabbage, shredded finely",
            "6 cups water or homemade chicken broth",
            "2 zucchini, trimmed, seeded and cut into 1/2 inch half moons",
            "1/2 pound green beans cut into 1-inch lengths or \"haricots verts\" cut in half",
            "1/2 cup orzo or other small shaped pasta",
            "1 package (10 ounces) frozen \"petite\" peas, thawed",
            "Salt and freshly ground pepper",
            "1 tablespoon each chopped parsley, mint and chives",
            "1 tablespoon chiffonade of basil",
            "Freshly grated Parmesan or Romano cheese, Pesto or other herb paste"
        ],
        "title": "Green on Green Pasta Soup",
        "picture_link": null
    },
    "2B5mTm2C3o1tPIxz2cuFjhJUxP05s9e": {
        "instructions": "Pat the peppers dry with a paper towel and set aside.\nWrap each cheese stick with a slice of ham, then slice the wrapped sticks into approximately 1/2-inch cubes. Stuff the wrapped cheese cubes into the peppers.\nHeat the oil in a medium heavy-bottomed pot to 350 degrees F.\nSet up a breading station using pie pans or plates. Put the flour in the first pie pan, then whisk together the egg and 2 tablespoons water in the second pie pan. In the third, mix together the panko, salt and pepper. Run each stuffed pepper through the breading station: lightly coat in the flour, dip in the egg wash and thoroughly coat in the panko.\nFry the peppers in batches in the hot oil until the breading is lightly browned, 1 to 2 minutes. Transfer to a plate lined with a paper towel. Serve hot.",
        "ingredients": [
            "16 jarred sweet piquante peppers, such as Peppadew",
            "2 Cheddar cheese sticks",
            "2 slices deli ham",
            "About 3 cups canola oil, for frying",
            "1/2 cup all-purpose flour",
            "1 large egg",
            "1 cup panko breadcrumbs",
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper"
        ],
        "title": "Ham and Cheese Pepper Poppers",
        "picture_link": "LPumCi5nVimmBwn3GM4g.OLNQsWJ6CK"
    },
    "eCw.DId0PKt6dqZO9j.6e/SNViI4YI6": {
        "ingredients": [
            "1/2 cup heavy cream (not ultra-pasteurized)",
            "1/2 cup sour cream"
        ],
        "picture_link": null,
        "instructions": "1. Whisk the heavy cream and the sour cream together in a small bowl. 2. Pour the mixture into a jar, cover and let stand in a warm place for 12 hours. Then stir and refrigerate for 24 hours. Serve.\n1. Whisk the heavy cream and the sour cream together in a small bowl.\n2. Pour the mixture into a jar, cover and let stand in a warm place for 12 hours. Then stir and refrigerate for 24 hours. Serve.",
        "title": "Crème Fraîche "
    },
    "miP.RIOwx1tEhhYpSHQPQjvSZmV/mWm": {
        "instructions": "Put the flour in a shallow bowl or lipped plate. Break the eggs into another shallow bowl and whisk with the salt and pepper. In a third shallow bowl mix the breadcrumbs with herbs.\nBread the chops. Dredge a chop in the flour, shaking off the excess, then dip it into the eggs, and finally coat the meat evenly with the breadcrumbs. Set on a piece of waxed paper or baking sheet. Repeat with the remaining chops. Heat a large skillet over medium heat with enough oil to come halfway up the sides of the chops, about 1/4 cup. When the oil shimmers, add the chops and fry 3 to 4 minutes on each side, until golden brown and crispy. Drain on paper towels and serve immediately with lemon wedges.",
        "ingredients": [
            "Four 1/2-inch-thick, bone-in, pork chops (about 1-1/2 pounds), patted dry",
            "Flour for dredging",
            "2 large eggs",
            "1 teaspoon kosher salt",
            "Freshly ground black pepper",
            "1 1/2 cups fresh sourdough bread crumbs",
            "1/4 teaspoon dried thyme",
            "1/4 teaspoon dried marjoram",
            "1/4 teaspoon dried basil",
            "Extra-virgin olive oil for shallow frying",
            "2 lemon wedges"
        ],
        "title": "Breaded Pork Chops",
        "picture_link": null
    },
    "OzXY/iwSrHeTw6VjfCuxy40aNxe2tTy": {
        "instructions": "Preheat oven to 425 degrees F.\nLightly oil a large shallow baking pan with 1 tablespoon olive oil.\nArrange peppers, cut sides up, in baking pan, and lightly oil the cut edges and stems.\nIn a bowl, toss the tomatoes, onion, basil, garlic, 2 tablespoons oil, red pepper flakes, mozzarella, and salt and pepper, to taste.\nDivide mixture among peppers and roast in upper third of oven until peppers are tender, about 20 minutes.",
        "ingredients": [
            "1 tablespoon olive oil, plus 2 tablespoons",
            "4 red bell peppers, halved through the stem, seeds and ribs removed but stem intact",
            "1 pint cherry tomatoes, halved",
            "1 medium onion, diced",
            "1 cup packed fresh basil leaves, chiffonaded",
            "3 garlic cloves, finely chopped",
            "1/4 teaspoon red pepper flakes",
            "1 cup cubed mozzarella",
            "Salt and freshly ground black pepper"
        ],
        "title": "Roasted Peppers Stuffed with Cherry Tomatoes, Onion, and Basil",
        "picture_link": "fgcoVKx9yibHuq79/eRoVazbkpBVdAy"
    },
    "wQWbehixk4pEPO2V4qToPqYtqnG24WS": {
        "ingredients": [
            "1/2 lb extra-lean ground round beef",
            "1/2 lb lean ground pork",
            "1 tbsp chopped fresh rosemary",
            "1 tbsp chopped fresh sage",
            "1/4 tsp salt",
            "4 whole-grain buns",
            "1 cup baby spinach leaves",
            "1/2 cup nonfat sour cream",
            "2 tbsp chopped fresh chives",
            "2 dashes each salt and pepper",
            "Apple slaw",
            "3 green apples, peeled, cored and grated",
            "2 tsp extra-virgin olive oil",
            "1 tsp fresh lemon juice",
            "1/4 tsp salt"
        ],
        "picture_link": "T3IP/Q6tIeIUjbMyesJ7t4K8.Z7s/Fq",
        "instructions": "Preheat grill to medium high. Combine beef, pork, rosemary, sage, and salt in a medium-sized bowl; form into 4 patties. In a small bowl, combine mayo ingredients. In a medium-sized bowl, combine slaw ingredients. Grill patties 4 minutes on each side or until juices run clear. Toast the buns and spread each top with mayo. Place burger on bun and top with slaw and several spinach leaves.\nPreheat grill to medium high. Combine beef, pork, rosemary, sage, and salt in a medium-sized bowl; form into 4 patties. In a small bowl, combine mayo ingredients. In a medium-sized bowl, combine slaw ingredients. Grill patties 4 minutes on each side or until juices run clear. Toast the buns and spread each top with mayo. Place burger on bun and top with slaw and several spinach leaves.",
        "title": "Rosemary-Sage Burgers with Apple Slaw and Chive \"Mayo\" "
    },
    "b7D2NhCHvPETFzJA2bCB2N.0gspLl5W": {
        "instructions": "Preheat the oven to 425 degrees.\nWell in advance of cooking the fish, prepare the stuffing. Combine the sage, softened butter, lemon juice, spice and seasonings, bread crumbs, pine nuts, jalapenos, garlic and coriander in the bowl of a food processor, pulsing to combine well. Remove and place in a bowl. Keep refrigerated until ready to use.\nSeason the trout with salt and pepper and rub the trout with olive oil.\nDivide the stuffing between the 4 fish evenly and spread an even layer inside the cavity of the fish. Divide the shrimp in the same way and add the shrimp in a layer in top of the herb butter. Close the fish to seal in the stuffing.\nLay the fish on an oiled rack and set in a roasting pan.\nPlace the fish in the oven and roast for 12 minutes on each side. Remove and serve immediately.",
        "ingredients": [
            "3 tablespoons chopped fresh sage",
            "1/4 cup unsalted butter, softened to room temperature",
            "Juice of 1 lemon",
            "1/2 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper",
            "1/2 teaspoon paprika",
            "3 scallions, finely chopped",
            "1/2 cup dry bread crumbs",
            "1/4 cup pine nuts",
            "2 fresh jalapeno peppers, seeded and diced",
            "1 clove garlic, finely chopped",
            "1 tablespoon toasted, ground coriander seed",
            "Salt and freshly ground black pepper to taste",
            "4 butterflied rainbow trout, whole, skin on, bones removed (ask your fish dealer to do this for you)",
            "Olive oil",
            "1/2 pound cleaned and shelled rock shrimp"
        ],
        "title": "Roasted Rainbow Trout with Rock Shrimp and Sage Butter Stuffing",
        "picture_link": null
    },
    "7GeNcasS.HPbzlEkfXJOdQD8qfcmeny": {
        "instructions": "Combine the cream of coconut, lime juice and half of the zest in a blender and blend until combined. Pour into the crust and freeze until solid, about 4 hours.\nPut the chocolate in a small microwave-safe bowl and heat for 30-second increments, stirring after each, until melted and very thin. Dip a fork into the chocolate and drizzle over the frozen pie. Sprinkle the remaining zest on top. Cover loosely with plastic wrap and freeze until the chocolate sets, then slice and serve.",
        "ingredients": [
            "One 15-ounce can cream of coconut",
            "8 small limes, 2 zested and all juiced (about 1 cup juice)",
            "One 9-inch prepared graham cracker crust",
            "1 ounce dark chocolate"
        ],
        "title": "4-Ingredient Coconut-Lime Pie",
        "picture_link": "qAGalhosxPIq/645mGvIzEqOB5ehKKe"
    },
    "Zitazrxu4kd0/4tbeVvuGw4XiMkgaxm": {
        "instructions": "Combine all ingredients in a mixing bowl, and season to taste with salt and pepper. Toss gently and refrigerate 45 minutes before serving.\nServe salad on a bed of mixed greens with crusty bread. Or alternatively, serve salad scooped onto a hero roll with arugula.",
        "ingredients": [
            "1 (15-ounce) can white northern or cannellini beans, drained & rinsed",
            "1 (15-ounce) can artichoke hearts, drained and quartered",
            "1 rib celery, finely diced",
            "2 tablespoons red onion, finely diced",
            "1 (6-ounce) can tuna, drained and flaked",
            "3 tablespoons extra-virgin olive oil",
            "juice and zest of 1 lemon",
            "¼ cup chopped fresh parsley",
            "Kosher salt and cracked black pepper"
        ],
        "title": "Artichoke and Bean Salad with Tuna",
        "picture_link": "ebBEmslLz0OQBlv9LLHSviIsgTgVLG."
    },
    "S/2qzxl72LD2I.5BjZXG1ACCqA2jO1u": {
        "instructions": "Preheat the grill to high heat.\nHeat the olive oil in a small saucepan until hot. Add the sage and allow the sage to infuse its flavor into the oil. Remove from the heat when the sage becomes fragrant and slightly crispy, a few minutes.\nGrill the endive and radicchio until slightly wilted with good grill marks, about 4 minutes per side. Turn the endive and radicchio cut-side up and top with the gorgonzola. Close the lid and grill until the cheese has softened, 2 minutes.\nRemove the endive and radicchio to a platter. Drizzle the infused olive oil over the top. Serve immediately.",
        "ingredients": [
            "1/2 cup extra-virgin olive oil",
            "4 sprigs sage",
            "3 heads endive, sliced in half lengthwise",
            "3 heads radicchio di Treviso, sliced in half lengthwise",
            "4 ounces crumbled gorgonzola",
            "Kosher salt and freshly ground black pepper",
            "Pinch red pepper flakes"
        ],
        "title": "Grilled Endive and Radicchio with Gorgonzola and Sage-Infused Olive Oil",
        "picture_link": null
    },
    "qIp0vWmUgh4qr2fKAUdJMOCzX1EnWOC": {
        "instructions": "Preheat oven to 300 degrees F.\nCut the eggplant in half and scoop out the flesh. Set eggplant halves aside. Cut flesh into bite sized cubes. Chop the tomatoes and slice the garlic.\nIn a large saute pan, heat the oil and add the garlic. When the garlic is golden brown, add the chopped eggplant and saute for 3 minutes. Remove the eggplant and place in a large bowl. To the bowl, add the uncooked tomatoes and capers. Mix until combined.\nIn a baking dish, place the reserved eggplant halves and fill with the eggplant/tomato mixture. Sprinkle with Parmesan.\nPlace baking dish in the oven and cook for 10 minutes.\nRemove from the oven and garnish with fresh basil.",
        "ingredients": [
            "1 eggplant",
            "3 plum tomatoes",
            "1 clove garlic",
            "1 tablespoon olive oil",
            "1 teaspoon capers",
            "1 tablespoon grated Parmesan",
            "4 basil leaves"
        ],
        "title": "Eggplant Parmigiana",
        "picture_link": "qNn2PoHAgHHNsuOvs4q8i1Qu4SLbGHq"
    },
    "nnaHbkIsc8TNj7qOQPzWU0KD9PjUOOm": {
        "ingredients": [
            "2 tablespoons water",
            "1/2 teaspoon crumbled saffron threads",
            "1 cup mayonnaise",
            "1 tablespoon sherry vinegar or red wine vinegar",
            "1/2 teaspoon minced garlic"
        ],
        "picture_link": null,
        "instructions": "Bring water and saffron just to a boil in a small saucepan. Remove from heat. Stir, then let steep, uncovered, 10 minutes, to release saffron color and flavor. Whisk together mayonnaise, sherry vinegar, and garlic in a bowl. Gradually whisk in saffron water.\nBring water and saffron just to a boil in a small saucepan. Remove from heat. Stir, then let steep, uncovered, 10 minutes, to release saffron color and flavor.\nWhisk together mayonnaise, sherry vinegar, and garlic in a bowl. Gradually whisk in saffron water.",
        "title": "Saffron Mayonnaise "
    },
    "ap58p/huBUfKVE3xwgz7OS.dr0xQ2Q.": {
        "instructions": "For dessert, warm the apple and cranberry sauces in microwave or in a small pot over low heat and season with cinnamon and orange zest. Place a little cranapple sauce in the bottom of a sundae dish, top with 2 scoops ice cream, more sauce and whipped cream, garnish with chopped pecans.",
        "ingredients": [
            "1 1/2 cups all natural apple sauce",
            "1/2 cup good quality whole berry cranberry sauce (recommended: Ocean Spray)",
            "2 pinches ground cinnamon",
            "2 teaspoons orange zest",
            "2 pints French vanilla ice cream",
            "Whipped cream",
            "1/4 cup chopped toasted pecans"
        ],
        "title": "Cran-applesauce Sundaes",
        "picture_link": null
    },
    "inFiGDyyLIZOkQR3ePQ4GWtlM7c0PE2": {
        "instructions": "Heat a skillet over medium heat. Spread the butter on both sides of the bread.\nBuild the sandwich with the ham and cheeses and place in the hot skillet. Cook until the bread is golden and toasty, a few minutes on each side.\nArrange the tomato halves for the eyes, 1/4 cheese slice for a nose and pickle spear for a smile.\nThis recipe was created by a contestant during a cooking competition. The Food Network Kitchens have not tested it for home use, therefore, we cannot make any representation as to the results.",
        "ingredients": [
            "2 tablespoons butter, softened",
            "2 slices rustic white bread",
            "2 slices ham",
            "2 slices American cheese, plus 1/4 slice for serving",
            "2 slices mozzarella cheese",
            "1 grape tomato, halved",
            "1 small pickle spear"
        ],
        "title": "\"Smiling\" Grilled Cheese",
        "picture_link": "L5Kn3VKhqJ1Tuo.z9SWiz0HzfWkfslK"
    },
    "DSYLnBnu0KvZciyYZiBFNaz5btwFCr.": {
        "ingredients": [
            "2 pounds green beans, trimmed",
            "2 tablespoons unsalted butter, softened",
            "1/2 teaspoon celery salt"
        ],
        "picture_link": "5PtJ1O5yi5KDI7hvXBUnEvorjnZQUvG",
        "instructions": "Cook green beans in a large pot of boiling salted water (1 tablespoon salt for 5 quarts water) until just tender, 5 to 7 minutes. Meanwhile, stir together butter and celery salt. Drain beans, then toss with butter and season with pepper.\nCook green beans in a large pot of boiling salted water (1 tablespoon salt for 5 quarts water) until just tender, 5 to 7 minutes. Meanwhile, stir together butter and celery salt. Drain beans, then toss with butter and season with pepper.\nWhat to drink: Marimar Estate Don Miguel Vineyard '06\nMarimar Estate Don Miguel Vineyard '06",
        "title": "Green Beans with Celery-Salt Butter "
    },
    "j2uDUfy8YABwmUDO8.YIYdcJaGuBBne": {
        "instructions": "Pour buttermilk into a bowl.\nIn a separate bowl, mix flour, salt, and garlic powder. Dip each fish portion into buttermilk then roll in flour until evenly covered, set aside on plate.\nHeat deep-fat fryer to 360 degrees F and cook fish for 6-8 minutes, or until golden brown and done. To check for doneness, cut into one portion and check to see if fish is flaky and looks milky white. Serve with french fries, coleslaw, and garlic bread.",
        "ingredients": [
            "2 cups buttermilk",
            "1 cup flour",
            "1/2 teaspoon seasoned salt",
            "1 teaspoon garlic powder",
            "2 pounds cod or halibut, cut into 2 ounce portions",
            "Serving suggestions: french fries, coleslaw, and garlic bread"
        ],
        "title": "Toby's Fish and Chips",
        "picture_link": null
    },
    "8vnYnVcBT2xttaEjAtLfen9stRq/Ws2": {
        "instructions": "To a wok or saucepan over a low flame, add oil. Oil should be cold. Add garlic. Fry garlic for about 4 to 5 minutes. Remove when garlic chips are brown and place towels to drain. Add spinach, and pepper flakes. Saute for 3 to 4 minutes. Garnish with garlic chips.;",
        "ingredients": [
            "1/3 cup extra virgin olive oil",
            "4 cloves garlic, sliced",
            "4 bunches spinach, washed and dried",
            "Pinch hot pepper flakes"
        ],
        "title": "Sauteed Spinach and Garlic Chips",
        "picture_link": null
    },
    "PH4ygeNFK4.RZTnh6AQM3RMmzpS3EDy": {
        "instructions": "In a roasting pan, place butternut squash cubes, sprinkle nutmeg, salt, pepper and olive oil over the cubes and roast in a 375 degree oven for 30 minutes or until tender. Place the roasted squash in a food processor and puree.\nFollow the basic risotto recipe, and when beginning to add the vegetable stock to the risotto, add the butternut squash puree, stirring continuously with a wooden spoon. When the risotto is cooked al dente, add the butter, chopped Italian parsley and Parmesan cheese, continue stirring until a creamy consistency appears, serve on a platter or in individual bowls.",
        "ingredients": [
            "3 cups butternut squash, peeled and cut into cubes",
            "1 teaspoon nutmeg",
            "1 tablespoon olive oil",
            "2 ounces unsalted butter",
            "3/4 cup grated Parmesan cheese",
            "1/4 cup chopped Italian parsley",
            "Salt and pepper"
        ],
        "title": "Risotto con Zucca",
        "picture_link": null
    },
    "cc4K6bBEBrt6oR5yZ.gGO8OMMdaEb9a": {
        "instructions": "Bring water to a boil and add lemon juice to prevent discoloration of the cauliflower. Add florets and boil until cauliflower is cooked through yet firm, 3 to 4 minutes.\nWhile cauliflower is steaming, heat the olive oil and saute the red pepper ribbons over high heat until slightly charred; remove from heat.\nWhen cauliflower is done, drain it well then toss with red pepper ribbons and season to taste with salt and pepper.",
        "ingredients": [
            "1 medium head cauliflower, cored and cut into florets",
            "1 tablespoon lemon juice or white wine vinegar",
            "1 to 2 tablespoons olive oil",
            "1 small red pepper, seeded and cut into 1/4inch julienne",
            "Salt and pepper"
        ],
        "title": "Cauliflower with Red Pepper Ribbons",
        "picture_link": null
    },
    "D7v.lNSM5qzKGWNf19FRzgXWxoXvySa": {
        "instructions": "For the cookies:\nPreheat the oven to 350 degrees F.\nIn a medium bowl, sift the flour, baking powder, baking soda, cinnamon, cloves, ginger and nutmeg. Set aside. In a mixer, beat the butter and sugar until fluffy. Add egg and molasses, and beat until smooth. Add the flour mixture, a little at a time, and mix until incorporated and a dough is formed. Refrigerate until firm, at least 3 hours.\nRoll dough out to 1/4-inch thick, and cut gingerbread men with cookie cutters. Transfer to an ungreased cookie sheet and bake until set, about 6 to 8 minutes. Cool on wire racks.\nFor the icing:\nIn a mixer, combine sugar, cream of tartar, and egg whites*, and beat until stiff peaks form, about 7 minutes. Mix in the lemon juice to taste. Transfer icing to a piping bag and decorate gingerbread men.",
        "ingredients": [
            "2 cups all-purpose flour",
            "1 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1 1/2 teaspoon cinnamon",
            "1 teaspoon ground cloves",
            "1 teaspoon ground ginger",
            "1/2 teaspoon nutmeg",
            "1/2 cup butter, at room temperature",
            "1/2 cup sugar",
            "1 egg",
            "1/2 cup molasses",
            "2 1/4 cups confectioners' sugar",
            "1/4 teaspoon cream of tartar",
            "2 egg whites*",
            "Lemon juice, to taste"
        ],
        "title": "Gingerbread Boys with a Bite",
        "picture_link": null
    },
    "QBw.2vKJ7Aaq8cGY0gIeDjDlQ3qAU9G": {
        "instructions": "Brush each ear of corn with a little oil, sprinkle with salt and pepper. Grill over medium to high heat until golden brown, about 2 to 3 minutes on each side for a total of 8 to 12 minutes. Serve.",
        "ingredients": [
            "4 ears corn, shucked",
            "1 to 2 tablespoons extra virgin olive oil",
            "Salt",
            "Pepper"
        ],
        "title": "Grilled Corn",
        "picture_link": null
    },
    "siXPqhrGta3z57a86UgTvL7IrrFjdAu": {
        "ingredients": [
            "3 tablespoons heavy cream",
            "1/4 cup white-wine vinegar",
            "1 tablespoon Dijon-style mustard or to taste",
            "1 tablespoon minced shallot",
            "a pinch of sugar",
            "2 teaspoons fresh lemon juice, or to taste",
            "3/4 cup olive oil"
        ],
        "picture_link": null,
        "instructions": "In a blender or food processor blend the cream, the vinegar, the mustard, the shallot, the sugar, and the lemon juice until the mixture is combined well, with the motor running add the oil in a stream, and blend the vinaigrette until it is emulsified. Add salt and pepper to taste and serve the vinaigrette over asparagus.\nIn a blender or food processor blend the cream, the vinegar, the mustard, the shallot, the sugar, and the lemon juice until the mixture is combined well, with the motor running add the oil in a stream, and blend the vinaigrette until it is emulsified. Add salt and pepper to taste and serve the vinaigrette over asparagus.",
        "title": "Creamy Mustard Vinaigrette for Asparagus "
    },
    "U5LS/0qeHZDDN66tJQsuSWc21oscDJC": {
        "instructions": "Mix cannellini beans, tuna, and celery in a salad bowl. Squeeze the lemon juice into the bowl. Pour in the extra-virgin olive oil. Season with salt and pepper, to taste. Mix well.",
        "ingredients": [
            "2 (19-ounce) cans cannellini beans, drained and rinsed",
            "14 ounces canned tuna in oil or water, drained",
            "1 celery stalk, chopped",
            "Juice of 1/2 lemon",
            "1/2 cup extra-virgin olive oil",
            "Salt",
            "Freshly ground black pepper"
        ],
        "title": "Insalata di Fagioli e Tonno: Tuna and Bean Salad",
        "picture_link": null
    },
    "GKZ4TT3rGujF65PIpVaX8AaKlHCB4Um": {
        "ingredients": [
            "Four 6-ounce salmon steaks",
            "2 tablespoons olive oil, turning to coat",
            "Salt and pepper"
        ],
        "picture_link": "EfPfJAtW4WY5AWz5045eE3e0vB1Qft.",
        "instructions": "Heat broiler. Place four 6-ounce salmon steaks on a broilerproof baking sheet. Drizzle with 2 tablespoons olive oil, turning to coat; season with salt and pepper. Broil until cooked through but still slightly translucent in the center, 5–7 minutes.\nHeat broiler. Place four 6-ounce salmon steaks on a broilerproof baking sheet. Drizzle with 2 tablespoons olive oil, turning to coat; season with salt and pepper. Broil until cooked through but still slightly translucent in the center, 5–7 minutes.",
        "title": "Broiled Salmon Steaks "
    },
    "rJUo78VTSIVcidnk5DMXg7JkvBRCZoy": {
        "instructions": "In a saute pan with the olive oil, sweat the leeks and brown the mushrooms lightly. Add the sherry and reduce. Add the rice and saute for 2 minutes.\nIn three stages, stir in the chicken stock. Continue to stir during the process of adding the stock. When all the stock is absorbed, taste the rice for doneness. If the rice still has a bite to it, stir in more stock and continue to cook.\nStir in the Parmesan and the parsley. Season and serve.\n*(Domesticated mushrooms may be substituted. Your choice, the drier the better).",
        "ingredients": [
            "1 tablespoon olive oil",
            "2 tablespoons wild leeks, diced (domestic leeks may be used)",
            "1 cup boletus* (wild mushroom), diced",
            "1 cup orange latex milky mushrooms* (wild mushrooms), diced",
            "1/4 cup cream sherry",
            "1 cup Arborio rice",
            "3 cups low-fat chicken stock",
            "1/4 cup Parmesan, grated",
            "1 tablespoon Italian flat leaf parsley, chopped",
            "To taste salt and black pepper"
        ],
        "title": "Wild Mushroom Risotto",
        "picture_link": null
    },
    "C9wEFjJPTM6BGH4aLq0LaG8ElyP1Vhi": {
        "instructions": "Preheat the oven to 375 degrees. Lightly butter a 9-inch square baking pan.\nCut the chilled butter into the walnut and cinnamon flour, with a pastry blender or fork until it is like coarse crumbs; set aside. Drizzle melted butter over cubed bread to coat, then toss with apples and raisins\nTransfer apples and bread to a baking dish and top with walnut flour topping; bake for 45 minutes or until crisp. Serve hot or warm with ice cream.\nNote that if you are starting out with fresh bread, then dry it out first in an oven",
        "ingredients": [
            "1/4 cup finely chopped walnuts mixed with 1/4 cup flour, 3/4 teaspoon ground cinnamon and a pinch of salt",
            "4 tablespoons chilled butter",
            "4 slices dried out egg, brioche or challah bread, crusts removed and cut into 3/4-inch cubes",
            "1/3 cup melted unsalted butter",
            "1 cup raisins soaked in rum, Port or Cognac",
            "4 Granny Smith or Golden Delicious apples peeled, cored, quartered and sliced",
            "Vanilla ice cream or whipped cream for garnish"
        ],
        "title": "Buttery Apple Brown Betty",
        "picture_link": null
    },
    "OonW0kIuO50NWSwNvGgSnQTMVgk53/O": {
        "instructions": "In a small saucepan over high heat, bring the rice and 1 1/2 cups water to a boil. Reduce the heat; cover and simmer 5 minutes, or until all of the water is absorbed. Stir in the vinegar, sugar, all-purpose seasoning and salt.\nOn a cutting board, separate the salmon slices and cut into 1 1/2-inch-wide strips. Place 2 teaspoons of the rice at one end of each salmon strip and roll up tightly. Sprinkle with sesame seeds, if desired. Serve the sushi bites with the soy sauce for dipping.\nPhotograph by Kana Okada",
        "ingredients": [
            "1 1/2 cups instant rice",
            "1 1/2 teaspoons rice vinegar",
            "1 tablespoon sugar",
            "3/4 teaspoon salt-free all-purpose seasoning",
            "Pinch of salt",
            "3 4-ounce packages sliced smoked salmon",
            "Sesame seeds (optional)",
            "Soy sauce, for dipping"
        ],
        "title": "Salmon Sushi Bites",
        "picture_link": "TRbJtwH5AXGxMss4.Dm0FfJhO7ViKz2"
    },
    "rtPpWjYBQBuNXsFtAuSuo2YzQdbSpWu": {
        "instructions": "Make batter: In a blender blend batter ingredients until smooth and transfer to a bowl. Let batter stand, covered, 1 hour.\nPreheat oven to 425 degrees. Spoon 1 teaspoon roast drippings into each cup of 3 mini muffin pans. Put 2 mini-muffin pans on 1 baking sheet and put remaining pan on another baking sheet. Put first baking sheet with the two mini muffin pans in middle of oven for 3 minutes to heat drippings in cups. Working quickly, pour 2 teaspoons of batter into hot drippings in each cup and bake in middle of oven 18 minutes, or until pudding shells are golden and puffed. Remove shells from cups with tongs and cool on racks. Repeat procedure with other baking sheet. Shells may be made 3 days ahead and chilled, covered, or 1 month ahead and frozen in airtight containers. Bring shells to room temperature and re-crisp in a 300 degree oven 10 minutes.",
        "ingredients": [
            "1 cup plus 2 tablespoons milk",
            "2 large eggs",
            "1 large egg yolk",
            "1 cup all-purpose flour",
            "1 teaspoon salt",
            "Freshly ground black pepper, to taste",
            "3/4 cup roast drippings or vegetable oil",
            "Garnish: 36 small fresh flat-leafed parsley leaves"
        ],
        "title": "Individual Yorkshire Puddings",
        "picture_link": null
    },
    "boZuHFZXHZV0pRJuuFXFa/wS080zLX2": {
        "instructions": "Watch how to make this recipe.\nPreheat oven to 500 degrees F.\nIn foil lined baking pan, place serranos and spray lightly with oil. Heat for 30 to 45 minutes or until serranos are slightly browned. Allow to cool then chop and set aside.\nForm several 8 to 12-ounce patties with ground angus beef. Grill to taste or temperature.\nCombine cilantro and mayonnaise.\nWhen burgers are almost done, top with chopped roasted serranos then the cheese.\nRemove from grill when cheese is melted.\nPlace burger on bottom bun and cilantro mayonnaise on top bun.",
        "ingredients": [
            "15 to 20 serrano peppers, stemmed",
            "5 to 6 pounds ground angus beef",
            "1/4 cup finely chopped fresh cilantro leaves",
            "1 cup mayonnaise",
            "4 to 6 slices jalapeno pepper jack cheese",
            "4 to 6 hamburger buns"
        ],
        "title": "Casino El Camino - Amarillo Burger",
        "picture_link": "KD3IaNB.poQo//U.mFEJZJ27aK3Lfki"
    },
    "XBVgZT61nUJX5S9nbFvVmRsDUTFC7lm": {
        "instructions": "In a bowl, whisk together the vinegar and salt and pepper, to taste.\nDrizzle in the hazelnut oil, gradually at first, whisking, to form an emulsion. Then add oil at a faster rate, whisking to retain the emulsion. When one cup of the oil has been incorporated into the mayonnaise, stir in the herbs.\nPile the lettuce on a plate in a mound, drizzle it with 1 tablespoon of oil and 2 teaspoons of vinegar. Remove the eggs from the bowl with a slotted spoon, lightly dry them with a paper towel, trim off loose strands of egg white, and place the eggs on the lettuce. Spoon a dollop of herbed mayonnaise on each egg.\nRecommended Drink: Pol Roger Brut Champagne, Non-Vintage",
        "ingredients": [
            "1/2 tablespoon tarragon vinegar",
            "Salt",
            "Pepper",
            "1 cup hazelnut oil, plus 1 tablespoon",
            "1 teaspoon fresh tarragon, chopped",
            "1 teaspoon chives, chopped",
            "1 teaspoon fresh marjoram, chopped",
            "2 cups mixed lettuces, rinsed and dried",
            "2 teaspoons champagne vinegar",
            "3 eggs, poached until yolk is almost set, in a bowl of cold water"
        ],
        "title": "Poached Eggs with Herb Mayonnaise",
        "picture_link": null
    },
    "Y1dEgIXOGMsGxQoZ3t6Wi0LvxX/gs..": {
        "instructions": "Remove and discard the hard outer pods of the dried tamarind. Combine the dried tamarind or the prepared pulp with the water and bring to a boil. Cook over medium heat about 30 minutes, or until the flesh is very soft, occasionally stirring and mashing with a whisk to break up the flesh and separate the seeds.\nStrain and discard the solids. Cool to room temperature and chill. Serve in tall glasses with plenty of ice.",
        "ingredients": [
            "1 1/2 pounds dried tamarind pods or 1 pound pulp with seeds",
            "1 gallon water",
            "1 cup sugar"
        ],
        "title": "Tamarind Water",
        "picture_link": null
    },
    "q5nBZGcNp36d4WSYYZ0Zw27mfAtTVT.": {
        "instructions": "In a large cast iron pot, or heavy-bottomed braising pan add the bacon and fry until crisp. Remove from the pan and drain on a paper towel.\nPreheat the oven to 200 degrees F. Cut the bread lengthwise and put in the oven.\nAdd the pork to the bacon grease, and cook on medium-high heat until the pork is 3/4 cooked. Next add the sausages, onions, and bell peppers and cook until the onions are translucent.\nAdd the chicken, celery, garlic, parsley, and 3/4 cup green onions. Cook until chicken is tender, then season with salt, pepper, and cayenne. Stir in the water and combine thoroughly. Cover and let sit for 15 minutes.\nEvenly divide the meat mixture and cheese to each loaf. Top the cheese with the bacon and remaining green onions. Cut the loaves in half and serve.",
        "ingredients": [
            "1/4 pound thick cut bacon, diced",
            "2 sourdough bread loaves (about 1 foot long)",
            "1 pound pork butt or pork loin, cut in 1/2-inch pieces",
            "1 pound smoked sausage, sliced 1/4-inch thick",
            "1/2 pound andouille sausage, sliced 1/4-inch thick",
            "2 cups chopped red onions",
            "1 cup julienned red bell peppers",
            "1 pound boneless chicken thighs, cut in 1/2-inch pieces",
            "2 celery stalks, thinly sliced",
            "1 tablespoon minced fresh garlic",
            "1/4 cup chopped parsley leaves",
            "1 cup chopped green onions",
            "1 teaspoon salt",
            "2 teaspoons freshly cracked black pepper",
            "2 teaspoons cayenne pepper, or to taste",
            "1/2 cup water",
            "1 pound Havarti cheese, thinly sliced"
        ],
        "title": "Jambalaya Sandwich",
        "picture_link": "td3QwNBf7gQ2Qmp.E48i.MQLvZjg/oa"
    },
    "AWOma8VVUvyqdbMwy1zDMGm74mmnCau": {
        "instructions": "Resift flour with sugar, baking powder and 3/4 teaspoon of salt. Combine melted butter, egg and yolk and whisk in milk. Preheat the griddle\nWith a few swift strokes fold the wet ingredients into the dry ones. Do not overmix; keep the batter lumpy so they will turn out light. Cook the pancakes on the griddle, using a scant 1/4 cup for each pancake. Turn them over when bubbles form over the entire surface of the pancake and cook for a few minutes on the other side. Serve hot with maple syrup. For dinner, serve hot with a saute of apples and raisins and along with either slices of bacon or topped with cottage or ricotta cheese.",
        "ingredients": [
            "1 1/2 cups flour, measured after sifting",
            "2 tablespoons sugar",
            "2 1/2 teaspoons baking powder",
            "3/4 teaspoon salt",
            "2 tablespoons melted butter",
            "1 egg, lightly beaten plus 1 egg yolk",
            "1 cup, plus 2 tablespoons milk"
        ],
        "title": "Old Fashioned Pancakes",
        "picture_link": null
    },
    "zPLu.pRnWeTgQ.jTmHd4QkQxWn40VTC": {
        "ingredients": [
            "2 1/2 cups sugar",
            "1 cup water",
            "6 tablespoons fresh lime juice, strained through a fine-mesh sieve",
            "4 drops green food coloring (if making cherry lime rickeys)"
        ],
        "picture_link": null,
        "instructions": "Stir together sugar, water, and a pinch of salt in a small saucepan and simmer, uncovered, stirring occasionally, until syrup has thickened slightly, 5 to 8 minutes. Transfer to a glass measure and chill, uncovered, until cool, then stir in lime juice and food coloring.\nStir together sugar, water, and a pinch of salt in a small saucepan and simmer, uncovered, stirring occasionally, until syrup has thickened slightly, 5 to 8 minutes. Transfer to a glass measure and chill, uncovered, until cool, then stir in lime juice and food coloring.",
        "title": "Lime Syrup "
    },
    "CKPYxvrXQK/pMER91eTu3vU8J/jFgq.": {
        "instructions": "Place potatoes in a bowl and wash under cold, running water until water runs clear. Place in a medium saucepan with salt. Add enough water to generously cover. Bring to a boil, reduce to a simmer, and cook, uncovered, until soft, about 15 minutes.\nMeanwhile, place the peas and scallions in a small saucepan over medium heat, cover with the milk and add the sugar. Slowly bring to a boil, reduce the heat and simmer for 3 to 4 minutes, or until peas are tender. Turn off the heat and let the milk sit.\nPeel and mash the boiled potatoes, using a fork or food mill, and while potatoes are hot, add the warm milk mixture. Beat in some of the butter, and season to taste with salt and pepper. Serve with remaining butter melting on top.",
        "ingredients": [
            "6 to 8 baking potatoes, unpeeled",
            "1 cup fresh peas",
            "3 scallions, finely chopped",
            "1 1/2 cups milk",
            "Pinch of sugar",
            "4 to 8 tablespoons unsalted butter",
            "Salt and freshly ground black pepper"
        ],
        "title": "Pea Champ",
        "picture_link": null
    },
    "JgpCABT5J7Dk7N7S008SNJDIO/qar9y": {
        "instructions": "Watch how to make this recipe.\nHeat 1 tablespoon of the reserved bacon fat in a small saute pan over low heat. Add the onions and cook until translucent. Cool the onions for a bit.\nMix the bacon, onion, egg, mayonnaise, mustard, sugar, and lemon zest in a bowl. Add the salmon and potato, mixing gently after each addition. Form the mixture into 12 small patties. In a shallow dish, combine the bread crumbs, Parmesan, and pepper, to taste. Coat the patties in the bread crumb topping. Heat 1/4 cup of the oil in a large saute pan over medium heat, and cook the salmon cakes in batches until golden, about 3 to 4 minutes per side. Add more oil, as necessary. Arrange on a serving platter and serve.",
        "ingredients": [
            "2 strips bacon, cooked until crispy, crumbled, bacon fat reserved",
            "1/4 cup chopped onion",
            "1 egg",
            "1/2 cup mayonnaise",
            "2 teaspoons Dijon mustard",
            "1/2 teaspoon sugar",
            "1/2 lemon, zested",
            "1 (14-ounce) can wild salmon, checked for large bones",
            "1 baked or boiled russet potato, peeled, and fluffed with a fork",
            "1/4 cup bread crumbs",
            "2 tablespoons grated Parmesan",
            "Freshly ground black pepper",
            "1/2 cup vegetable oil"
        ],
        "title": "Salmon Cakes",
        "picture_link": "E1CTWajiXBnZaBagu53VSyaYDKxMD9O"
    },
    "5OB7t1RQR0EGdL/HqZ5h52vqyePTq9y": {
        "instructions": "Tear the leaves off of the basil and place in a blender with the olive oil. Puree until smooth. Pour mixture into a large saucepan or skillet and bring to a simmer over medium-high heat for about 3 minutes. Strain through a fine-mesh strainer into a sterilized airtight jar or bottle. Store in a cool, dark place for up to 1 week.;\n2 cups pure olive oil\n1/2 cup ground cinnamon\nIn a large saute pan, heat olive oil over medium-high heat. Add cinnamon, stir to combine, and simmer for about 3 minutes. Strain through a fine-mesh strainer lined with a coffee filter into a sterilized airtight jar or bottle. Store in a cool, dark place for up to 1 month.",
        "ingredients": [
            "1 bunch fresh basil",
            "1 cup pure olive oil"
        ],
        "title": "Basil Oil and Cinnamon Oil",
        "picture_link": "vsi26CCNtKGt7FfnQ1UboW7qAM.xVoa"
    },
    "3eP9eK/uJJWhJJn.4VNpbhixi4NJgse": {
        "ingredients": [
            "1/2 cup water",
            "1/3 cup sugar",
            "2 medium cantaloupes, seeded and cut into 1-inch pieces (8 cups)",
            "1/4 cup fresh lemon juice",
            "6 tablespoons cream Sherry"
        ],
        "picture_link": "stqNWj6BWOi7Z8..jn9.QfZ4Wxy.JIy",
        "instructions": "Bring water and sugar to a boil, stirring until sugar has dissolved, then cool syrup. Purée cantaloupes with syrup, lemon juice, Sherry, and 1/8 teaspoon salt in a blender (in batches if necessary) until smooth. Pour into a 13- by 9-inch nonreactive baking dish and freeze until partially frozen, about 2 hours. Scrape and stir with a fork, crushing any lumps. Continue to freeze, scraping once or twice, until evenly frozen, about 3 hours more.\nBring water and sugar to a boil, stirring until sugar has dissolved, then cool syrup.\nPurée cantaloupes with syrup, lemon juice, Sherry, and 1/8 teaspoon salt in a blender (in batches if necessary) until smooth. Pour into a 13- by 9-inch nonreactive baking dish and freeze until partially frozen, about 2 hours. Scrape and stir with a fork, crushing any lumps.\nContinue to freeze, scraping once or twice, until evenly frozen, about 3 hours more.",
        "title": "Cantaloupe and Cream Sherry Granita "
    },
    "fiF2Sq4vd5IM1BIbP2fAue8IAADsAAq": {
        "instructions": "Watch how to make this recipe.\nMix corn pancake batter in a large bowl. Heat a griddle or cast iron pan over medium-low to medium heat.\nStir the corn kernels, orange zest, and scallions into batter. Cut up 2 tablespoons butter into small bits and fold it into the batter. Nestle a pat of butter into a folded paper towel and wipe pan with it. Pile the batter into mounds 3 inches wide and cook the cakes until deep golden on each side. Repeat with remaining batter. Meanwhile, heat a small pot of water over low heat and bring to a bubble. Remove the pan from heat and put the honey jar into the water bath to gently warm. Arrange the corn cakes on a serving platter and serve with honey drizzled on top.",
        "ingredients": [
            "1 package corn muffin mix, prepared to package directions for corn pancakes (recommended: Jiffy)",
            "2 ears fresh corn, kernels scraped from cob",
            "1 orange, zested",
            "2 scallions, whites and greens, finely chopped",
            "3 tablespoons butter",
            "Honey"
        ],
        "title": "Corn Cakes with Honey",
        "picture_link": "Vw7ZGo.0jIFoEXqFJmU81LIyizTUcG2"
    },
    "dCAENbMzaERMbtrdi.Sds8ze/43XowC": {
        "instructions": "Preheat a grill to medium-high heat.\nScrub potatoes under cold running water; leave skins on. Slice potatoes into thick rounds and then brush both sides of potatoes liberally with olive oil. Place potatoes on grill and grill on both sides until slightly brown, about 2 minutes per side. Remove from the grill and place in a single layer on a baking sheet.\nDrizzle potatoes liberally with olive oil again on both sides and then season both sides with salt and pepper. Place baking sheet on the grates of the grill and cook for about 10 more minutes, or until cooked through in the center and crispy on the outside. Remove from grill and sprinkle with minced garlic and chopped thyme leaves. Serve.",
        "ingredients": [
            "6 Yukon gold potatoes, skins on",
            "Olive oil",
            "Coarse salt",
            "Freshly ground black pepper",
            "4 cloves garlic, minced",
            "4 to 6 sprigs fresh thyme, leaves chopped"
        ],
        "title": "Olive Oil Braised Potatoes",
        "picture_link": null
    },
    "3lQ0HKGQL8hOP1PfStlbkLa.4vnW/v2": {
        "ingredients": [
            "2 tablespoons freshly squeezed lemon juice",
            "1/2 teaspoon salt",
            "1 teaspoon fine white pepper"
        ],
        "picture_link": null,
        "instructions": "Combine all the ingredients and mix well.\nCombine all the ingredients and mix well.",
        "title": "Salt, Pepper, and Lemon Dipping Sauce "
    },
    "wY3bpmwVilTum6vSqN88pdSb6zOaWUS": {
        "instructions": "Watch how to make this recipe.\nAdd the oil to a large saute pan with the garlic and red pepper flakes. Cook over medium heat until the garlic turns golden. Remove the garlic and discard. Add the chopped Swiss chard ribs and saute until soft, about 4 minutes. Add the Swiss chard leaves and season with salt, to taste. Cook until the leaves are wilted. Stir in a splash of red wine vinegar. Serve immediately.;",
        "ingredients": [
            "2 tablespoons olive oil",
            "2 cloves garlic, smashed",
            "1 teaspoon red pepper flakes",
            "1 large bunch Swiss chard, ribs removed and chopped, leaves roughly chopped",
            "Kosher salt",
            "Splash red wine vinegar"
        ],
        "title": "Garlicky Sauteed Swiss Chard",
        "picture_link": "8efmswq90Fbty2RG/58o7T9UHt8t0uO"
    },
    "bNSqx6UPJAU0AQhJ6hfeBn9bIbxpe5a": {
        "instructions": "Preheat oven to 375 degrees F.\nSpray 8 muffin tins with vegetable spray. Layer potato slices, cheese, and onions into each muffin cup. Season with salt and pepper and top each gratin with 1 or 2 tablespoons of heavy cream. Cover with foil and bake for 30 to 40 minutes, removing the foil halfway through cooking time. Invert gratins onto plate and serve.",
        "ingredients": [
            "Vegetable spray",
            "2 large russet potatoes, roughly peeled and thinly sliced",
            "1/2 cup grated Swiss cheese",
            "2 green onions, finely chopped",
            "Salt and freshly ground black pepper",
            "3/4 cup heavy cream"
        ],
        "title": "Individual Potato Gratins",
        "picture_link": "eH.bPrSLa03UO2Qx8OPZ6c0EAEXLRf."
    },
    "RJMIM7FxXaq0.Fgq4/80RI3kSy3V6j6": {
        "instructions": "Preheat oven to 350 degrees F.;\nIn an electric mixer beat the cream cheese and butter on high until smooth. Then add confectioners' sugar. Continue to beat on high until the lumps have all dissolve. Finally, beat in vanilla extract and lemon juice on low speed until the frosting is completely mixed.;\nIn a large mixing bowl combine, sugar, flour, salt, spices, and baking soda. Add oil to the dry ingredients and mix well. Add eggs; beat in one at a time.\nOnce the batter is properly mixed, stir in carrots and walnuts. Pour the cake batter into a greased 9 by 13-inch pan and bake at 350 degrees F for 60 to 70 minutes or until golden brown.\nOnce cake has cooled, frost and sprinkle chopped walnuts on top as a garnish.",
        "ingredients": [
            "4 (3-ounce) packages cream cheese",
            "1/2 cup butter or margarine",
            "1 2/3 cups confectioners' sugar",
            "1 teaspoon vanilla extract",
            "1 tablespoon lemon juice",
            "2 cups sugar, granulated",
            "2 cups all-purpose flour",
            "1 teaspoon salt",
            "2 1/2 teaspoons cinnamon",
            "1 teaspoon ground clove",
            "1/2 teaspoon ground allspice",
            "1 1/2 teaspoons baking soda",
            "1 1/2 cups canola oil",
            "4 eggs",
            "3 1/2 cups carrots, grated",
            "1 cup chopped walnuts"
        ],
        "title": "Carrot Cake with Lemon Cream Cheese Frosting",
        "picture_link": null
    },
    "Ac.A6wqdp5KKENN7K3wrT9YCh0YC.fa": {
        "instructions": "In a large heavy bottom saucepan, pour enough oil to fill the pan about a third of the way. Heat over medium heat until a deep-fryer thermometer inserted in the oil reaches 350 degrees F. (If you do not have a thermometer a cube of bread will brown in about 3 minutes.)\nIn a bowl whisk together the egg whites, cornstarch, salt, and pepper, to taste. Dip the shrimp into the egg mixture, and then press the shrimp into the coconut flakes, coating well on both sides.\nFry the shrimp in batches until coconut is golden, about 2 to 3 minutes. Drain on paper towel. Serve immediately.\nDress shrimp with lime dressing and garnish with watercress leaves.\nCombine ingredients in a small bowl, and chill until ready to serve.;",
        "ingredients": [
            "Peanut or vegetable oil, for deep-frying",
            "2 egg whites",
            "1 tablespoon cornstarch",
            "Kosher salt",
            "Freshly ground black pepper",
            "12 (U-15) jumbo shrimp, peeled, deveined, and flattened",
            "2 cups flaked coconut",
            "Lime dressing, recipe follows",
            "2 bunches watercress leaves, for garnish",
            "1 cup sour cream",
            "1 lime, zested and juiced",
            "1 small shallot, finely diced",
            "2 tablespoons chopped parsley",
            "1 tablespoon sugar",
            "1/4 teaspoon finely chopped scotch bonnet pepper",
            "Kosher salt",
            "Freshly ground black pepper"
        ],
        "title": "Coconut Shrimp with Lime Dressing",
        "picture_link": null
    },
    "wdgXuM1Wpwj7ABUNgKfEByIRvRJv4Py": {
        "instructions": "Blend the ingredients in a food processor, shape into a log on waxed paper, wrap and chill.\nPhotograph by Kang Kim",
        "ingredients": [
            "1 stick softened butter",
            "1 tablespoon confectioners' sugar",
            "Seeds of 2 vanilla beans",
            "1/2 teaspoon cinnamon",
            "Pinch of nutmeg"
        ],
        "title": "Vanilla-Spice Butter",
        "picture_link": "6cv/33EkDaezGO9SR2bz8eeHVPizc2G"
    },
    "/yJj72YajZ6MJ587KyayEbPE/UCILVS": {
        "instructions": "Pat steak dry and season with salt and pepper. Place on hot oiled grill and grill about 4 minutes on each side for medium rare.;",
        "ingredients": [
            "1 pound (3/4-inch thick) bone less beef loin (strip)",
            "Salt and freshly ground black pepper",
            "Olive oil"
        ],
        "title": "Grilled Strip Steak",
        "picture_link": null
    },
    "KfGhKfG37wWGxpoQb46hwGxa5Ck2eGe": {
        "instructions": "Melt the butter in a saute pan over medium heat. Whisk the flour into the butter until the flour has dissolved, making a roux. Let cook 2 to 3 minutes, and then reduce the heat to medium-low.\nIn a liquid measuring cup, combine the cider and broth together. Slowly pour in over the roux and whisk constantly until all liquid has been incorporated into the mixture. Stir in the mustard. (If there are any pan drippings from the roasted turkey you can add them at this point). Add fresh thyme and let simmer until the gravy is thickened, 4 to 5 minutes.",
        "ingredients": [
            "3 tablespoons butter",
            "3 tablespoons all-purpose flour",
            "1 cup cider",
            "1 cup chicken broth",
            "1 tablespoon brown mustard",
            "1 teaspoon fresh thyme leaves"
        ],
        "title": "Cider Gravy",
        "picture_link": "SZXjKTbYO02kE3vhrT0K02qRRgFH9Dq"
    },
    "8fwUQUzvP4C42Zz4Gkx3w.bloDlIj5O": {
        "instructions": "Preheat grill.\nWhisk olive oil, vinegar, dill, salt and pepper together in a small bowl; set aside.\nAssemble skewers, starting with garlic, mushroom, zucchini, onion, and tomato. Repeat until skewer is full, leaving 1 inch at each end of skewer. Brush each skewer with olive oil marinade. Grill for about 6 minutes, or until vegetables are cooked to your liking, turning skewers once after 3 minutes.",
        "ingredients": [
            "1/4 cup extra-virgin olive oil",
            "1/4 cup balsamic vinegar",
            "1 tablespoon fresh dill",
            "1/2 teaspoon salt",
            "Cracked black pepper",
            "6 large cloves garlic",
            "8 button mushrooms",
            "2 large zucchini, cut into 1-inch dice",
            "1/2 cup red onion, cut into 1-inch dice",
            "4 plum tomatoes, halved",
            "4 wooden skewers, soaked in water for 30 minutes, or 4 metal skewers"
        ],
        "title": "Quick Vegetable Skewers",
        "picture_link": null
    },
    "94SNck8q.5SYLu9QEVSbYKSHmiTZ20m": {
        "instructions": "Line cookie sheet with foil or waxed paper. Place cereal in large bowl.\nIn small microwavable bowl, microwave white vanilla baking chips uncovered on High about 1 minute 30 seconds, stirring every 30 seconds, until chips can be stirred smooth. Stir in half the crushed peppermint candy.\nPour over cereal mixture; toss to evenly coat. Spread mixture in single layer on cookie sheet. Immediately sprinkle with remaining candy. Let stand until set, about 20 minutes. Gently break up coated cereal. Store in airtight container.",
        "ingredients": [
            "6 cups Rice Chex or Chocolate Chex cereal",
            "1 bag (12 oz) white vanilla baking chips (2 cups)",
            "1/3 cup coarsely crushed peppermint candy canes (14 miniature, unwrapped)"
        ],
        "title": "Reindeer Feed",
        "picture_link": "SZXjKTbYO02kE3vhrT0K02qRRgFH9Dq"
    },
    "DR0VGvjjhBJOIf/tev8j7ALdz8OYuoe": {
        "ingredients": [
            "3 tablespoons Nutella",
            "2 slices white sandwich bread"
        ],
        "picture_link": null,
        "instructions": "1. Preheat a panini grill. 2. Spread the Nutella across each piece of bread, from edge to edge. Close up the sandwich and trim the crusts. 3. Grill each sandwich for 3 minutes until the bread is lightly browned. Remove the crusts and cut each into 4 triangles before serving.\n1. Preheat a panini grill.\n2. Spread the Nutella across each piece of bread, from edge to edge. Close up the sandwich and trim the crusts.\n3. Grill each sandwich for 3 minutes until the bread is lightly browned. Remove the crusts and cut each into 4 triangles before serving.",
        "title": "Nutella Panini "
    },
    "vJphBqkbC0dBg6woudVowyUwbWIpq9S": {
        "instructions": "In a large bowl stir together the mashed potatoes, sour cream, horseradish, pepper and Worcestershire sauce. Cover with a damp paper towel and microwave on HIGH for 3 minutes.",
        "ingredients": [
            "1 (24-ounce) container homestyle mashed potatoes (recommended: Country Crock)",
            "2 tablespoons sour cream",
            "1 tablespoon prepared horseradish",
            "Freshly ground black pepper",
            "1 teaspoon Worcestershire sauce"
        ],
        "title": "Horseradish Mashed Potatoes",
        "picture_link": "aumgKtWiotOJP/b.VVoEj5SL.CYJnK2"
    },
    "jztnG2HJJrpwE.CcYlvhxgh9HNXiy9C": {
        "instructions": "Watch how to make this recipe.\nUsing a mandoline slicer or very sharp knife, slice the mushrooms as thinly as possible and arrange them in a single layer on a large serving platter. Scatter the arugula evenly over the top.\nJust before serving, squeeze the juice of the lemon over the arugula and very lightly drizzle with some olive oil. Season with salt and pepper, to taste, and using a vegetable peeler, shave thin strips of Parmesan evenly over the top. Serve immediately.",
        "ingredients": [
            "1/2 pound large white mushrooms, brushed clean and trimmed",
            "4 ounces baby arugula",
            "1 lemon, halved",
            "Extra-virgin olive oil",
            "Wedge Parmesan, for shaving",
            "Kosher salt and freshly ground black pepper"
        ],
        "title": "Mushroom Carpaccio",
        "picture_link": "DsU4gkOjNuZLg7XBQeR4bDKaHxte.Vi"
    },
    "//KdNk5zGJdtiIxI/nzq4dNcgnJ9/YC": {
        "instructions": "Put the cucumber slices in the bottom of a large pitcher. Gently roll the lemon verbena sprigs back and forth a few times in your hands to release the scent, then add them to the pitcher along with the water. Cover and refrigerate for at least 30 minutes before serving.",
        "ingredients": [
            "1 small cucumber, thinly sliced",
            "6 sprigs fresh lemon verbena, torn",
            "2 quarts (8 cups) filtered water"
        ],
        "title": "Cucumber and Lemon Verbena Water",
        "picture_link": "CtRxlS6p1qy/2NO3t3WgSR4YMQbHex."
    },
    "QPpP71.vC7mMtB0OU84u5B9w4l6NGyy": {
        "instructions": "HEAT oven to 325 degrees F. Spray a cookie sheet with no-stick cooking spray. Melt peanut butter in a saucepan over very low heat; cool slightly.\nBEAT egg whites, vanilla and salt in medium bowl until soft peaks form. Gradually add sugar, beating until stiff peaks form. Fold in coconut and melted peanut butter. Drop by rounded teaspoonfuls onto prepared cookie sheet.\nBAKE 20 minutes. Let stand 1 minute; remove to rack. Cool.",
        "ingredients": [
            "1/4 cup Jif Creamy Peanut Butter",
            "2 large egg whites",
            "1/2 teaspoon vanilla extract",
            "Dash salt",
            "2/3 cup sugar",
            "1 (3 1/2 oz.) can (1 1/3 cups) flaked coconut"
        ],
        "title": "Peanut Butter Macaroons",
        "picture_link": "gltVMUOf54yNP08DSABSv7mTWlM2q0m"
    },
    "b1ET6RaHv5cxFDCXBYEo4viTtaYKMYm": {
        "instructions": "Combine all ingredients in a small bowl, and serve on chicken or fish.;",
        "ingredients": [
            "2 tablespoons minced garlic",
            "1 teaspoon red-pepper flakes",
            "1 tablespoon grated lemon zest",
            "1/4 cup finely chopped fresh flat-leaf parsley",
            "2 tablespoons olive oil",
            "Coarse salt and freshly ground pepper"
        ],
        "title": "Lemon Parsley Power Pack",
        "picture_link": null
    },
    "naay2ESdsHSKMEBWTJU135y.gIyuErC": {
        "instructions": "In a saucepan, heat the olive oil. Saute the garlic and add the sausages and rosemary. Cook for a few minutes, turning the sausages over. Pierce the sausages to allow the fat to drip out and flavor up the dish. Add the tomatoes to the pan. With the back of a wooden spoon, break up the tomatoes into little chunks. Add 1/2 a cup of water and allow to simmer. Then add the beans, salt, and pepper.\nLet cook together for about 15 minutes or until the sauce has reduced and thickened.",
        "ingredients": [
            "4 tablespoons/59 ml extra-virgin olive oil",
            "3 cloves garlic, peeled and crushed",
            "8 (3-ounce/85 g) pork sausage links",
            "2 sprigs fresh rosemary",
            "1 (10-ounce/283 g) can peeled plum tomatoes",
            "1/2 cup water",
            "2 (19-ounce/540 ml) cans cannellini beans, drained and rinsed",
            "Salt and freshly ground black pepper"
        ],
        "title": "Salsiccie e Fagioli: Pork and Beans",
        "picture_link": null
    },
    "pasAePlSDNrAz9ov9H.KzmGW6D4bwJa": {
        "instructions": "Combine vegetables and cheese in food processor. Puree until smooth. As an alternative, soften cheese in microwave for 30 seconds and stir in vegetables.",
        "ingredients": [
            "2 scallions, finely chopped",
            "1 carrot, finely chopped",
            "8 ounces cream cheese, softened"
        ],
        "title": "Vegetable Cream Cheese",
        "picture_link": null
    },
    "DtgRQ5kjhPP1YQGlKiFJnJrwiQtuU2G": {
        "instructions": "In a small saucepan combine the peanut butter, soy sauce, vinegar, lime juice, garlic, cayenne and hot water. Whisk the sauce together over moderate heat until smooth and hot.\nIn a kettle of boiling salted water cook the pasta for 5 minutes. Add the sliced carrots to the cooking pasta, stir and cook for 1 minute. Add the broccoli, stir and cook for 30 seconds. Add the snow peas, stir and cook for another 30 seconds. Drain the pasta and vegetables in a colander.\nTransfer the pasta and vegetables to a large bowl and pour the hot sauce over the mixture, tossing to combine. Sprinkle with scallions.",
        "ingredients": [
            "3/4 cup smooth peanut butter",
            "3 tablespoons soy sauce",
            "2 tablespoon rice vinegar or white wine vinegar",
            "1 tablespoon lime juice",
            "1 small garlic clove, minced",
            "Cayenne pepper",
            "1/2 cup hot water",
            "12 ounces pasta, i.e. rotelle, penne, farfalle",
            "2 carrots, cut into thin slices diagonally",
            "1 1/2 cups broccoli florets",
            "1/2 pound snow peas, trimmed and cut crosswise into 1-inch pieces",
            "4 scallions, thinly sliced"
        ],
        "title": "Pasta with Summer Vegetables and Spicy Peanut Sauce",
        "picture_link": null
    },
    "U8v1brpws2Tdcc.x4a17z6l.IOqV1ke": {
        "instructions": "Preheat oven to 250 degrees F.\nIn a mixer on medium-low speed, beat the egg whites until frothy, about 2 minutes. Increase the mixer speed to high, add salt and whip to stiff, but not dry peaks. Reduce the speed to medium. Add the vanilla and then the sugar, a few tablespoons at a time. Whip to glossy peaks, about 2 minutes. Gently fold in the chocolate chips and the pecans. Drop by the tablespoon onto cookie sheets lined with parchment. Bake 45 minutes. Turn oven off and leave in oven overnight without opening the oven door.\nTip: To reduce calories further, you can scale back on the sugar, chocolate chips, and pecans. I recommend making them the first time with the full amount of sugar to get a feel for how much you want to cut back.",
        "ingredients": [
            "4 egg whites, room temperature",
            "1/4 teaspoon salt",
            "1 teaspoon vanilla",
            "3/4 cup sugar",
            "12 ounces mini chocolate chips",
            "1 cup pecans, finely chopped"
        ],
        "title": "Rita's Ultra-Lite Pecan Chocolate Chip Cookies",
        "picture_link": null
    },
    "llLO7KyObUzg7XTYf7JBWZZb3Nvq4fC": {
        "instructions": "Watch how to make this recipe.\nFit a food processor with the thickest slicing blade. Cut the cabbages into small wedges and place horizontally into the feed tube. Process in batches. Next, fit the food processor with the grating blade. Cut the carrots in half and place in the feed tube so they are lying on their sides. Process in batches and mix in a bowl with the grated cabbages.\nIn a medium bowl, whisk together the mayonnaise, mustard, sugar, vinegar, celery seeds, celery salt, salt, and pepper. Pour enough of the dressing over the grated vegetables to moisten them. Serve cold or at room temperature.",
        "ingredients": [
            "1 pound white cabbage (1/2 small head)",
            "3/4 pound red cabbage (1/2 small head)",
            "5 carrots",
            "2 cups good mayonnaise",
            "1/4 cup Dijon mustard",
            "1 tablespoon sugar",
            "2 tablespoons cider vinegar",
            "2 teaspoons celery seeds",
            "1 teaspoon celery salt",
            "1/2 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper"
        ],
        "title": "Vegetable Coleslaw",
        "picture_link": "/ygZ9vQo8R.jec94Z1nsN9jGkRpg/J."
    },
    "VzfV7PmBfeqpy5khctMKlzN7CbD9T02": {
        "instructions": "Season the fish to taste with salt and pepper. Combine egg and cream to make an egg wash. Brush 1 side of the fillets with egg wash, then cover the egg wash side of fillets with bread crumb or cereal, and press down firmly. In a hot saute pan add 3 tablespoons oil. Place the fillets into the pan breaded side down. Cook for 2 minutes. Turn fillets over add the thyme and cook for approximately 2 minutes more, or until fillets are cooked, remove from pan. Meanwhile place 2 tablespoons oil into a hot pan, when the oil starts to smoke, add the endive. Toss the endive. Add the spice mix and the chives. Cook for 1 minute then remove from the heat. Place the endive in the center of 4 plates. Place the fish on top of the endive. Drizzle the chive oil around then the balsamic vinegar. Garnish with chives.;",
        "ingredients": [
            "4 (7-ounce) sea bass fillets",
            "Sea salt and freshly ground pepper, to taste",
            "1 egg",
            "3 tablespoons heavy cream",
            "4 tablespoons panko bread crumbs (or your favorite cereal)",
            "5 tablespoons vegetable oil",
            "A few sprigs of thyme",
            "6 Belgium endives (split into sixths)",
            "Spice mix",
            "Aged balsamic vinegar, to taste",
            "2 tablespoons chives (thinly sliced) plus extra for garnish",
            "1/4 teaspoon ground ginger",
            "1/4 teaspoon ground coriander seed",
            "1/4 teaspoon ground cinnamon",
            "1 tablespoon granulated sugar",
            "1/4 teaspoon ground star anise",
            "1/4 teaspoon cayenne pepper",
            "Sea salt, to taste",
            "White pepper (ground to taste)"
        ],
        "title": "Crisp Sea Bass with Braised Endive and Aged Balsamic Vinegar",
        "picture_link": null
    },
    "qklDVDN/z/1r22JDyl8CkSFrivaH9GS": {
        "instructions": "Toast the bread slices on a baking sheet in the upper third of a preheated 500 degree oven for 4 minutes, or until they are golden. While the toasts are warm, brush both sides of the toasts with the oil and rub them with the garlic. In a bowl combine the tomatoes, mozzarella, basil, balsamic vinegar, and salt and pepper to taste and top toasts with the mixture.;",
        "ingredients": [
            "8 (1/2-inch) thick slices Italian bread",
            "2 tablespoons olive oil (preferably extra-virgin)",
            "1 garlic clove, halved",
            "1/4 cup chopped sun-dried tomatoes in oil",
            "1/4 cup mozzarella, cubed",
            "1 tablespoon fresh basil leaves, minced",
            "1 1/2 teaspoon balsamic vinegar"
        ],
        "title": "Bruschetta with Sundried Tomato and Mozzarella",
        "picture_link": null
    },
    "5vRA6msdw9uObdT0p2QcH0/p.tETRNG": {
        "instructions": "Heat the oven to 325 degrees F/160 degrees C.\nCut slivers in the pork chops and slide in slices of garlic. Heat the pork fat or butter in a pan on high heat. Sprinkle the chops with salt and pepper and brown them, about 3 minutes per side.\nArrange half the potatoes and onions in a casserole. Sprinkle with salt and pepper and lay the chops on top. Scatter over the bacon and juniper berries. Cover with the remaining potatoes and onions. Sprinkle with salt and pepper again. Pour over the wine. Cut a piece of parchment to fit over the potatoes and pork chops and lay it in on top. Bake the dish for about 1 hour 30 minutes, pouring in the stock halfway through baking. Sprinkle with parsley to serve.",
        "ingredients": [
            "4 fatty pork chops",
            "2 cloves garlic, sliced",
            "Kosher salt and freshly ground black pepper",
            "1 tablespoon pork fat, or butter",
            "1 1/2 pounds/750 g potatoes, peeled and thinly sliced",
            "1 onion, sliced",
            "4 slices bacon",
            "1/2 teaspoon juniper berries",
            "1/2 cup/125 ml white wine, cider or beer",
            "1/2 cup/125 beef or chicken stock",
            "A handful of chopped fresh parsley, for garnish"
        ],
        "title": "Pork Chops with Potatoes",
        "picture_link": null
    },
    "hj2tiI2PdiNxP51Tx7eqrT3fhiF9AlO": {
        "instructions": "Preheat the oven to 375 degrees F.\nWash and core apples, leaving enough of the core at the base of the apple to contain the filling.\nCombine the butter, brown sugar, cinnamon and chopped pecans in a small bowl. Roll log shapes of the mixture and press enough into each apple to fill the core.\nFill a 2-quart baking dish with about 3/4 cup water, or enough to cover the bottom. Place the apples upright in the dish. Bake until the apples are soft and the filling is browned, 1 hour.",
        "ingredients": [
            "4 large baking apples, such as Honeycrisp",
            "4 tablespoons (1/2 stick) butter, softened",
            "1/2 cup brown sugar",
            "3/4 teaspoon cinnamon",
            "1/4 cup chopped pecans"
        ],
        "title": "Baked Apples",
        "picture_link": "ZIbqJqU99yeQnvk3KPKlr2XUQUeSOHi"
    },
    "LytXopbMHzcnvSlXl.8huFZWEc7JXF.": {
        "instructions": "Peel ginger and cut into small pieces. Press about 1/2-inch piece of ginger in a garlic presser and squeeze ginger juice and small bits into a medium size bowl. Grate another 1/2-inch piece into same bowl. Finely chop the scallions and place in the same bowl. Add all other ingredients and mix well. Adjust by tasting and enjoy this fantastic Chinese dumpling dipping sauce.",
        "ingredients": [
            "1 small piece ginger, about 2 ounces",
            "2 scallions (green onion)",
            "1/2 cup soy sauce",
            "2 tablespoons white vinegar",
            "1 1/2 teaspoons sugar",
            "2 tablespoons water",
            "1 teaspoon spicy Chinese chili red paste (optional)"
        ],
        "title": "Ginger Scallion Soy Sauce",
        "picture_link": null
    },
    "Q0IRdSvRGjiZ0ZXCnlz4.25SK/vVCje": {
        "ingredients": [
            "1 cup chilled whipping cream",
            "1 1/2 tablespoons sugar",
            "1 teaspoon vanilla extract",
            "2 tablespoons chopped crystallized ginger"
        ],
        "picture_link": null,
        "instructions": "Beat chilled whipping cream with sugar and vanilla extract in bowl to soft peaks. Stir in chopped crystallized ginger. Cover and chill up to 6 hours.\nBeat chilled whipping cream with sugar and vanilla extract in bowl to soft peaks. Stir in chopped crystallized ginger. Cover and chill up to 6 hours.",
        "title": "Ginger Whipped Cream "
    },
    "sLwMmwUFNMqBukxo9MLDgXldXadw9pK": {
        "instructions": "In a large heavy pot, heat oil over medium heat. Add onion, garlic and peppers and cook until tender about 5-8 minutes. Stir in spices and toss to coat vegetables. Pour in stock and beans and bring to a boil. Reduce heat to a simmer and cook for 15 minutes. In a blender, puree half of the soup until smooth and stir back into soup pot. Serve hot with garnishes.",
        "ingredients": [
            "2 tablespoons olive oil",
            "1 1/2 cups chopped onion",
            "2 cloves garlic, finely chopped",
            "1 cup chopped green bell pepper",
            "1 cup chopped red bell pepper",
            "1 tablespoon cumin",
            "1 teaspoon cayenne pepper",
            "6 cups low sodium chicken stock",
            "2 cans black beans, drained and rinsed",
            "Salt and pepper",
            "Cheddar cheese",
            "Sour cream",
            "Chopped red onion"
        ],
        "title": "Easy Spicy Black Bean Soup",
        "picture_link": null
    },
    "8lwQwq1AE1yW0ySlw6lq6Hf0xw6NKEG": {
        "instructions": "Place sausages on the heated grill. Brush with olive oil. Season with salt and pepper. Cook until done, about 10 to 15 minutes.;",
        "ingredients": [
            "12 links blood sausage (about 2 pounds)",
            "1 tablespoon olive oil",
            "Coarse salt and freshly ground black pepper"
        ],
        "title": "Morcilla Blood Sausage",
        "picture_link": null
    },
    "N/Gkca6YNmPI5kfUpXoUAWCVWS7PFhm": {
        "instructions": "Put all ingredients except lime zest in a pot and bring to a boil. Strain and pour into shallow pan. Place in freezer and every twenty minutes stir with a fork until ice crystals form and it is nice and fluffy. Candied lime zest: Cover the zest with cold water and bring to a boil. Strain zest and repeat process 3 times. After the fourth time add 1 cup water and 1/2 cup sugar and cook slowly until zest is soft. Remove zest to parchment paper and cool. Use as a garnish for the granita.",
        "ingredients": [
            "1 cup of freshly squeezed lime juice",
            "1 cup sugar",
            "2 cups of water",
            "Candied lime zest, recipe follows",
            "5 limes zested",
            "1 cups water",
            "1/2 cup sugar"
        ],
        "title": "Lime Granita and Candied Lime Zest",
        "picture_link": null
    },
    "x7gGxIY1J2J8elPDlwXSTKO4dBETXQW": {
        "instructions": "Bring a large pot of salted water to a boil. Add the ravioli and cook as the label directs. Reserve 1/2 cup of the cooking water, then drain the ravioli.\nCombine the butter, cream and peas in a large skillet and bring to a simmer over medium heat; cook 1 minute. Add the ravioli, cheese, nutmeg and a splash of the reserved cooking water to the skillet and toss. Add more cooking water to thin the sauce, if needed. Season with salt and pepper. Divide among bowls and top with the parsley.\nPhotograph by Christopher Testani",
        "ingredients": [
            "Kosher salt",
            "2 9-ounce packages mushroom ravioli",
            "Freshly ground pepper",
            "4 tablespoons unsalted butter",
            "1/2 cup heavy cream",
            "1 cup frozen peas, thawed",
            "1/2 cup grated parmesan cheese",
            "Pinch of freshly grated nutmeg",
            "2 tablespoons chopped fresh parsley"
        ],
        "title": "Ravioli Alfredo With Peas",
        "picture_link": "5G5Yl8y0kL.xddLYmRghBtzvCkLzrz2"
    },
    "0J6vaG3dRstS9kWH3s8Hc/6SPQEZkqG": {
        "instructions": "Preheat oven to 375 degrees F.\nLine a large cookie sheet with foil and spray with nonstick spray. In a 10-inch skillet over medium heat, add 6 tablespoons sugar and orange-tangerine juice. Bring to a simmer, and then add walnuts. Cook until sugar is absorbed and mixture starts to caramelize around walnuts, stirring constantly, about 2 minutes.\nIn a small bowl, mix cinnamon and remaining 3 tablespoons sugar. Toss walnuts in cinnamon-sugar. Place walnuts in single layer on prepared cookie sheet. Bake until walnuts appear crystallized and toasted, about 8 minutes. Set aside\nPlace 4 to 6 dry lettuce leaves on each plate. Randomly place orange segments, onion slices, and walnuts on top of each lettuce bed. Drizzle 2 tablespoons of dressing on top of each salad and serve.",
        "ingredients": [
            "Nonstick vegetable spray",
            "6 tablespoons plus 3 more tablespoons sugar",
            "3 tablespoons orange-tangerine juice",
            "2 cups walnut halves",
            "1/2 teaspoon ground cinnamon",
            "2 heads butter lettuce, washed and dried",
            "2 (8-ounce) cans mandarin orange segments",
            "1/2 red onion, very thinly sliced",
            "1 cup purchased Asian-style salad dressing (such as miso dressing or ginger dressing)"
        ],
        "title": "Candied Walnut Butter Salad",
        "picture_link": "CTfEq6AD/JpKf4ys4awoYB4hpdzgXqm"
    },
    "cK68VDaqTEJFVgZT8dYOZMi/Yd/2mm.": {
        "instructions": "Preheat oven to 450 degrees F.\nToss turkey with lime juice and season with salt and pepper.\nHeat 1 1/2 tablespoons oil in a 10-inch heavy skillet over moderately high heat until hot but not smoking, then cook bell peppers, stirring, until crisp-tender, about 3 minutes.\nTransfer to a bowl. Heat remaining 1/2 tablespoon oil in skillet over moderate heat and cook garlic, cumin, and oregano, stirring, 1 minute. Add the beans and cook, stirring, until heated through, about 1 minute. Season with salt and pepper.\nMake 2 layers each of corn chips, sauteed peppers, beans, turkey, cheese, scallion, and cilantro in a 3-quart shallow baking dish. Bake nachos in middle of oven until cheese is melted, 6 to 10 minutes.\nStir together sour cream and jalapeno, to taste, and serve on the side along with salsa.",
        "ingredients": [
            "1/2 pound leftover roast turkey meat, shredded",
            "1 1/2 tablespoons fresh lime juice",
            "Salt and pepper",
            "2 tablespoons vegetable oil",
            "3 bell peppers (preferably red and orange), finely chopped",
            "1 garlic clove, finely chopped",
            "1/4 teaspoon ground cumin",
            "1 teaspoon dried oregano, crumbled",
            "1 (15 to 16-ounce) can black beans, rinsed and drained",
            "4 ounces corn tortilla chips (not low-fat)",
            "2 cups grated jalapeno Jack cheese (8 ounces)",
            "1/4 cup chopped scallion greens",
            "1/2 cup chopped fresh cilantro leaves",
            "1 cup sour cream",
            "2 to 3 teaspoons finely chopped pickled jalapeno",
            "Serving Suggestion: Your favorite salsa"
        ],
        "title": "Turkey Nachos",
        "picture_link": "NbIPSdUMs7gQA9Xlsdjpu8IbNFjuTnO"
    },
    "81qp7NrKIRvSW9km4vUJtei5wVr8QUm": {
        "instructions": "Preheat the oven to 375 degrees F.\nIn a medium bowl, sprinkle the pineapple with half of the sugar, and set aside.\nIn another medium bowl, beat together the butter, remaining sugar, and eggs. In a third medium bowl, combine the flour, cinnamon, cloves, ginger, nutmeg, baking soda, and salt. Add the wet ingredients to the dry, and fold in 2/3 of the pineapple. Spoon the mixture into a small baking dish, or 4 ramekins, and scatter the rest of the pineapple onto the top. Bake for 16 to 22 minutes, or until a toothpick comes out cleanly.",
        "ingredients": [
            "2 cups fresh pineapple, diced",
            "1/2 cup sugar",
            "8 tablespoons unsalted butter, room temperature",
            "2 eggs",
            "1 cup all-purpose flour",
            "1/2 teaspoon ground cinnamon",
            "1/4 teaspoon ground cloves",
            "1/4 teaspoon ground ginger",
            "1/4 teaspoon ground nutmeg",
            "2 teaspoons baking soda",
            "Pinch kosher salt"
        ],
        "title": "Pineapple Clafouti",
        "picture_link": null
    },
    ".dUydB4Jm/PqTNefRrwWyUyHU9LufGO": {
        "ingredients": [
            "1/4 cup orange juice",
            "1/4 cup freshly squeezed lime juice",
            "2 tablespoons sugar"
        ],
        "picture_link": null,
        "instructions": "1. Combine the juices and sugar in a small saucepan and boil for 2 to 3 minutes over low heat. 2. Remove from the heat and let cool. 3. Pour the cooled syrup over the fruit or store for up to 1 month in the refrigerator.\n1. Combine the juices and sugar in a small saucepan and boil for 2 to 3 minutes over low heat.\n2. Remove from the heat and let cool.\n3. Pour the cooled syrup over the fruit or store for up to 1 month in the refrigerator.",
        "title": "Citrus Syrup "
    },
    "uoz1uqO9rWvw2K/r0TA4PRK7VK3u/KW": {
        "instructions": "To make the relish: In a straight-sided skillet, saute the onions and bell peppers in the oil until onions are translucent. Add the vinegar, sugar, and port wine, and cook at a very low heat until liquid evaporates. Onions and peppers should still be a little firm to the bite but sweet and caramelized. Set aside.\nTo cook the pork: Prepare the grill for grilling chops: high heat on left side, medium heat on right side. Drizzle the chops with canola oil and season with salt and pepper. Place the chops on the grill and cook for 2 to 3 minutes on each side, using a inverted baking pan to keep chops covered during cooking. Move the chops to the right side of the grill and continue cooking over medium heat. Cook 4 minutes and then turn chops over to finish cooking, keeping covered for an additional 4 minutes. Cook to 150 degrees F internal temperature.\nServe with the relish.",
        "ingredients": [
            "2 pounds sweet red onion, peeled and thinly sliced",
            "1 red bell pepper, ribs and seeds removed, thinly sliced",
            "1 green bell pepper, ribs and seeds removed, thinly sliced",
            "1 yellow bell pepper, ribs and seeds removed, thinly sliced",
            "1 tablespoon grapeseed oil",
            "2 teaspoons balsamic vinegar",
            "2 tablespoons brown sugar",
            "1/2 cup ruby port wine",
            "4 (8-ounce) bone-in pork loin chops, about 1 to 1 1/2 inches thick, trimmed",
            "Canola oil",
            "Salt and freshly ground black pepper"
        ],
        "title": "Grilled Pork Chops with Onion and Bell Pepper Relish",
        "picture_link": null
    },
    "SBA6HD5z9ZA4odD0Nidwp9HMlQ/KprG": {
        "instructions": "Special equipment: 2 wire racks 2 rimmed baking sheets\nAdjust 2 oven racks to the top and bottom thirds of the oven and preheat to 425 degrees F. Put the wire racks in the baking sheets and coat each generously with cooking spray.\nCombine the flour and 3/4 teaspoon salt in a large re-sealable plastic bag. Combine the eggs and 3/4 teaspoon salt in another large plastic bag; combine the breadcrumbs, Parmesan and 3/4 teaspoon salt in a third large plastic bag.\nAdd about a half of the zucchini sticks to the bag with the flour and use a combination of your hands and shaking the bag to coat the zucchini. Remove the zucchini and shake off any excess flour. Transfer to the egg wash and repeat until coated. (It's less messy if you use only one hand for the dry ingredients and the other for the wet.) Let any excess egg drip off before transferring to the breadcrumb mixture; repeat until fully coated (you'll still see some green and white of the zucchini peeking through the breading). Transfer to the prepared baking sheets and coat the breaded zucchini generously with cooking spray (there's no need to turn them). Repeat with the remaining zucchini.\nBake, rotating the baking sheets from top to bottom about halfway through, until golden brown and tender, 25 to 30 minutes. Sprinkle with a little salt and serve warm with your favorite dipping sauces.",
        "ingredients": [
            "Nonstick cooking spray",
            "1/2 cup all-purpose flour",
            "Kosher salt",
            "2 large eggs",
            "2 1/2 cups panko breadcrumbs (see Cook's Note)",
            "1/2 cup finely grated Parmesan",
            "1 pound zucchini (2 to 3 small-to-medium zucchini), cut into 3-inch-by-1/4-inch sticks"
        ],
        "title": "Baked Parmesan Zucchini Fries",
        "picture_link": "hL1PHxPQPRz7Ico7XFGCPJBCm8EKnM."
    },
    "hugz4qNPzg6Xr06DYTdDCHqEEh54vZa": {
        "ingredients": [
            "1 1/2 pounds lambs-quarters",
            "1 bunch scallions, chopped (1 1/2 cups)",
            "1 tablespoon olive oil",
            "Salt",
            "freshly ground black pepper",
            "3 tablespoons unsalted butter",
            "3 tablespoons all-purpose flour",
            "1 cup milk, plus additional, if necessary",
            "1/4 teaspoon nutmeg (preferably freshly grated)",
            "1 teaspoon finely grated lemon zest",
            "1 cup coarse fresh breadcrumbs (coarsely ground from a baguette; see Cooks' Notes)",
            "1/2 cup packaged pre-grated mozzarella",
            "1/4 cup finely grated Parmesan",
            "4 teaspoons olive oil"
        ],
        "picture_link": "PXNBQX3wvRgy3YnzHiZsliCTntqTsnS",
        "instructions": "Make Filling: Preheat the oven to 350° F with the rack in the middle. Butter a 2-quart shallow baking dish. Bring 1-inch salted water to a boil in a large saucepan. Meanwhile, wash lamb's-quarters in a large bowl of cold water and drain well. Trim any coarse, woody stems at bottom (don't go crazy with trimming; young lamb's-quarter stems cook up tender and delicious). Add lamb's-quarters to pot and cook over medium heat, covered, until leaves are wilted and stems are tender, 2 to 3 minutes. Drain the greens in a large sieve or colander and rinse well under cold running water. Drain again, pressing out excess liquid with the back of a large spoon. Coarsely chop greens and transfer to a bowl. Dry saucepan and reserve. Cook scallions in olive oil with 1/4 teaspoon salt in reserved saucepan over medium heat, stirring, until softened, 3 to 4 minutes. Combine scallion mixture with greens in bowl. Reserve saucepan again. Melt butter in reserved saucepan over medium-low heat and stir in flour. Cook, stirring, 2 minutes, then whisk in milk and bring to a boil, whisking. Reduce heat and simmer sauce, whisking, 2 minutes (it will be thick). Remove from heat and whisk in nutmeg, zest, and salt and pepper to taste. Mix sauce into greens mixture. If the mixture is too thick, thin with a little additional milk; season with salt and pepper. Spread out mixture in baking dish.\nPreheat the oven to 350° F with the rack in the middle. Butter a 2-quart shallow baking dish.\nBring 1-inch salted water to a boil in a large saucepan. Meanwhile, wash lamb's-quarters in a large bowl of cold water and drain well. Trim any coarse, woody stems at bottom (don't go crazy with trimming; young lamb's-quarter stems cook up tender and delicious).\nAdd lamb's-quarters to pot and cook over medium heat, covered, until leaves are wilted and stems are tender, 2 to 3 minutes. Drain the greens in a large sieve or colander and rinse well under cold running water. Drain again, pressing out excess liquid with the back of a large spoon. Coarsely chop greens and transfer to a bowl. Dry saucepan and reserve.\nCook scallions in olive oil with 1/4 teaspoon salt in reserved saucepan over medium heat, stirring, until softened, 3 to 4 minutes. Combine scallion mixture with greens in bowl. Reserve saucepan again.\nMelt butter in reserved saucepan over medium-low heat and stir in flour. Cook, stirring, 2 minutes, then whisk in milk and bring to a boil, whisking. Reduce heat and simmer sauce, whisking, 2 minutes (it will be thick). Remove from heat and whisk in nutmeg, zest, and salt and pepper to taste.\nMix sauce into greens mixture. If the mixture is too thick, thin with a little additional milk; season with salt and pepper. Spread out mixture in baking dish.\nMake Topping: Toss together crumbs, cheeses, and oil until combined well. Sprinkle topping evenly over greens mixture and bake in oven until crumbs are golden and mixture is bubbling, about 30 minutes.\nToss together crumbs, cheeses, and oil until combined well. Sprinkle topping evenly over greens mixture and bake in oven until crumbs are golden and mixture is bubbling, about 30 minutes.\nCooks' Notes: The best way to make coarse fresh breadcrumbs is to cube fresh bread, then grind it in small batches in a blender (a food processor is not as good at grinding crusty bread into breadcrumbs because the crusts get stuck in the blade). Creamy lamb's-quarters mixture and crumb mixture can be made 1 day ahead and kept separately in airtight containers, chilled.\nThe best way to make coarse fresh breadcrumbs is to cube fresh bread, then grind it in small batches in a blender (a food processor is not as good at grinding crusty bread into breadcrumbs because the crusts get stuck in the blade).\nCreamy lamb's-quarters mixture and crumb mixture can be made 1 day ahead and kept separately in airtight containers, chilled.",
        "title": "Creamy Lamb's-Quarters Gratin "
    },
    "sLZ2G/41ux/RlFaXkHS.ZEbgKSEUVEK": {
        "instructions": "For the onion marmellata, place a large, heavy pot over medium-high heat. Add the olive oil and the onions. Stir to combine and cook until starting to sizzle, about 2 minutes. Add the remaining ingredients. Reduce the heat to low. Cover the pot and cook over low heat for 2 hours, stirring every 30 minutes to scrape up any brown bits. The onions should be a soft, jam-like consistency and a deep mahogany color.\nMeanwhile, for the pork chops, combine the rosemary, thyme, garlic, salt, and pepper in a small bowl. Using your fingers, work all the ingredients together until well combined. Rub the herb mixture over the pork chops. Cover with plastic wrap and reserve in the refrigerator.\nAbout 20 minutes before the onions are finished, remove the pork chops from the refrigerator. Place a grill pan over medium-high heat or preheat a gas or charcoal grill. Grill the pork chops to medium, about 7 minutes a side depending on thickness. To serve, spoon the onion marmellata over the pork chops. Sprinkle with the chopped parsley. Serve immediately.",
        "ingredients": [
            "1/4 cup olive oil",
            "4 large onions, thinly sliced (about 3 pounds)",
            "1/4 cup orange marmalade",
            "1 tablespoon chopped fresh rosemary",
            "1 tablespoon chopped fresh thyme",
            "1 teaspoon kosher salt",
            "1 teaspoon freshly ground black pepper",
            "2 tablespoons balsamic vinegar",
            "1 tablespoon sugar (or more to taste)",
            "1 tablespoon chopped fresh rosemary",
            "1 tablespoon chopped fresh thyme",
            "2 cloves garlic, minced",
            "1 teaspoon kosher salt",
            "1 teaspoon freshly ground black pepper",
            "4 to 6 pork chops",
            "1/4 cup chopped fresh flat-leaf parsley"
        ],
        "title": "Pork with Sweet Onion Marmellata",
        "picture_link": "T3DxQtrNZxPg8njMbTzKXiDt2deFHzu"
    },
    ".dOYaIRB1BYYRzcgaGk6B7WXCSYfl5i": {
        "ingredients": [
            "2 1/2 pounds French green beans, trimmed",
            "4 tablespoons plus 1 teaspoon canola oil",
            "1/2 cup (2 ounces) pecan halves",
            "1 cup (2 sticks) unsalted butter, at room temperature",
            "1/4 cup (2 ounces) maple syrup",
            "2 teaspoons kosher salt",
            "1 tablespoon freshly ground black pepper"
        ],
        "picture_link": null,
        "instructions": "Cook beans in large pot of boiling salted water , uncovered, until crisp-tender, 3 to 4 minutes. Using large slotted spoon, transfer beans to colander set in bowl of ice and cold water to stop cooking, then drain well. Return water to boil and repeat with remaining beans. In small heavy skillet over moderate heat, heat 1 teaspoon oil until hot but not smoking. Add pecans and toast, stirring constantly, until light brown and fragrant, about 3 to 4 minutes. Remove from heat and set aside. In electric mixer fitted with paddle attachment, whip butter until smooth, about 1 to 2 minutes. Add maple syrup and pecans, stirring by hand to incorporate. Set aside. In 10-inch skillet over moderately high heat, heat 2 tablespoons canola oil until hot but not smoking. Add half green beans and sauté until hot, about 3 to 5 minutes. Transfer to large bowl and repeat with remaining beans and oil. Add maple-pecan butter and toss to combine. Sprinkle with salt and pepper and serve immediately.\nCook beans in large pot of boiling salted water , uncovered, until crisp-tender, 3 to 4 minutes. Using large slotted spoon, transfer beans to colander set in bowl of ice and cold water to stop cooking, then drain well. Return water to boil and repeat with remaining beans.\nIn small heavy skillet over moderate heat, heat 1 teaspoon oil until hot but not smoking. Add pecans and toast, stirring constantly, until light brown and fragrant, about 3 to 4 minutes. Remove from heat and set aside.\nIn electric mixer fitted with paddle attachment, whip butter until smooth, about 1 to 2 minutes. Add maple syrup and pecans, stirring by hand to incorporate. Set aside.\nIn 10-inch skillet over moderately high heat, heat 2 tablespoons canola oil until hot but not smoking. Add half green beans and sauté until hot, about 3 to 5 minutes. Transfer to large bowl and repeat with remaining beans and oil. Add maple-pecan butter and toss to combine. Sprinkle with salt and pepper and serve immediately.",
        "title": "Green Beans with Maple-Pecan Butter "
    },
    "lVrgdv67g1G1MPQfJ0Q8OehIhojQUAa": {
        "instructions": "For the ganache: Line a baking sheet with parchment paper. In a medium stainless steel or glass bowl, combine the chocolate chips and heavy cream. Set the bowl over a saucepan of barely simmering water and stir occasionally until the chocolate has melted and the mixture is smooth, about 6 minutes. Whisk in the cinnamon. Refrigerate the ganache until very firm, about 2 hours. Using a 1-ounce cookie scoop or a round tablespoon measure, scoop the ganache into 18 (1-inch) round pieces and arrange on the prepared baking sheet. Working quickly, with dry hands, roll the mixture into balls. Put a pop stick into each ball and freeze, stick side up, until firm, about 30 minutes.\nAdd the 2 cups of chocolate chips to a medium stainless steel or glass bowl. Set the bowl over a saucepan of barely simmering water and stir occasionally until the chocolate has melted, about 4 minutes.\nPut the chopped nuts, mini-chocolate chips and chopped candy bars in 3 small bowls.\nDip the pops in the melted chocolate, allowing the excess chocolate to drip off, and then dip into the toppings until coated. Arrange the pops, stick side up, on the baking sheet. Refrigerate for 30 minutes until the chocolate has set. Let the pops stand at room temperature for 15 minutes before serving.\nStore the pops, refrigerated, in an airtight container.\nCook's Note: If the scooped ganache is too sticky to roll into balls, put the pan in the freezer for 10 to 15 minutes to harden.",
        "ingredients": [
            "8 ounces (1 1/2 cups) bittersweet (60 percent cacao) chocolate chips (recommended: Ghiradelli)",
            "3/4 cup heavy cream",
            "1/2 teaspoon ground cinnamon",
            "2 cups (12 ounces) bittersweet (60 percent cacao) chocolate chips (recommended: Ghiradelli)",
            "1 cup finely chopped nuts, such as pistachios or walnuts",
            "1 cup mini-chocolate chips",
            "3 (1.4-ounce) milk chocolate-toffee candy bars, such as Heath or Skor, finely chopped",
            "Special equipment: 18 (4-inch) wooden pop sticks, a 1-ounce cookie scoop"
        ],
        "title": "Truffle Pops",
        "picture_link": null
    },
    "IuET6zkMwL3mqM5z0mHH2RiOAxPTRxG": {
        "ingredients": [
            "4 red bell peppers",
            "2 medium to large onions",
            "3 bulbs of garlic",
            "2 teaspoons salt",
            "1/2 a Scotch bonnet pepper",
            "1/4 pound plum tomatoes",
            "1/4 cup sunflower oil",
            "1 teaspoon dried thyme",
            "1/2 teaspoon ground ginger",
            "1/2 teaspoon cayenne pepper or alternative",
            "1/4 teaspoon smoked paprika",
            "1 heaping teaspoon tomato paste",
            "Generous 2 cups chicken stock",
            "1 teaspoon red palm oil",
            "1 1/4 cups white basmati rice"
        ],
        "picture_link": "N6Z95Icg0iBO4J5QGem2m945WNDkGTy",
        "instructions": "Finely slice the peppers and onions. Make a paste out of the garlic and 1 teaspoon of salt. Seed and slice the Scotch bonnet pepper, dice the tomatoes and set them aside. Soften the onions and peppers in the sunflower oil over high heat for 5 minutes, stirring frequently. Add the pasted garlic, Scotch bonnet pepper, tomatoes, and dry seasonings and cook for another 10 minutes over medium heat, stirring frequently. Add the tomato paste, cook for another minute or so, then remove from the heat. Blend the mixture with a generous 3/4 cup of chicken stock. If this was prepared in advance, reheat it first. Add another 3/4 cup of stock and blend until the mixture is smooth. Add the palm oil, a final teaspoon of salt, and then pour 2 1/2 cups of this mixture back into the pot. Heat the sauce until it is lightly bubbling. Measure out your rice, then add to the pot. The pot should have a tight-fitting lid, but if it doesn’t you can use some foil with the shiny side facing down to retain the heat. Stir gently so that all the rice is coated with the red sauce, then reduce the heat to a very low flame—the lowest possible. Cover and simmer for 10 minutes. Open the lid and stir gently again. It is important to get under the center of the pan so all the rice cooks at the same rate. Cover and simmer for another 10 minutes. Open and stir for a final time, then simmer for a final 10 minutes. This makes 30 minutes cooking time in total. Turn the heat off and allow to steam, covered, for another 15 minutes. It’s tempting to open the pot here but it’s very important to trust the process and allow the rice to cook residually. This improves the final taste and texture of the rice. Open the lid then leave to stand for 5 minutes, uncovered. Then fluff with a fork to separate the rice, slowly working inward from the edge of the pan in a swirling motion. If the rice is not completely cooked, add the remaining 1/2 cup stock, stir gently, then place back over low heat for another 10 minutes. Spoon the rice out onto a separate dish and serve.\nFinely slice the peppers and onions. Make a paste out of the garlic and 1 teaspoon of salt. Seed and slice the Scotch bonnet pepper, dice the tomatoes and set them aside. Soften the onions and peppers in the sunflower oil over high heat for 5 minutes, stirring frequently. Add the pasted garlic, Scotch bonnet pepper, tomatoes, and dry seasonings and cook for another 10 minutes over medium heat, stirring frequently. Add the tomato paste, cook for another minute or so, then remove from the heat.\nBlend the mixture with a generous 3/4 cup of chicken stock. If this was prepared in advance, reheat it first. Add another 3/4 cup of stock and blend until the mixture is smooth. Add the palm oil, a final teaspoon of salt, and then pour 2 1/2 cups of this mixture back into the pot. Heat the sauce until it is lightly bubbling. Measure out your rice, then add to the pot. The pot should have a tight-fitting lid, but if it doesn’t you can use some foil with the shiny side facing down to retain the heat. Stir gently so that all the rice is coated with the red sauce, then reduce the heat to a very low flame—the lowest possible.\nCover and simmer for 10 minutes. Open the lid and stir gently again. It is important to get under the center of the pan so all the rice cooks at the same rate. Cover and simmer for another 10 minutes. Open and stir for a final time, then simmer for a final 10 minutes. This makes 30 minutes cooking time in total. Turn the heat off and allow to steam, covered, for another 15 minutes. It’s tempting to open the pot here but it’s very important to trust the process and allow the rice to cook residually. This improves the final taste and texture of the rice.\nOpen the lid then leave to stand for 5 minutes, uncovered. Then fluff with a fork to separate the rice, slowly working inward from the edge of the pan in a swirling motion. If the rice is not completely cooked, add the remaining 1/2 cup stock, stir gently, then place back over low heat for another 10 minutes. Spoon the rice out onto a separate dish and serve.",
        "title": "Jollof Rice "
    },
    "io1Hf8b3uH1ISD5Hnc05BKIUxUqsEgO": {
        "ingredients": [
            "12 whole graham crackers (about 7 ounces)",
            "1/4 cup sugar",
            "7 tablespoons unsalted butter, melted",
            "1 cup canned pure pumpkin",
            "3/4 cup (packed) golden brown sugar",
            "1/4 cup heavy whipping cream",
            "1 teaspoon vanilla extract",
            "1/2 teaspoon ground ginger",
            "1/2 teaspoon ground cinnamon",
            "1/2 teaspoon freshly grated nutmeg",
            "1/4 teaspoon ground allspice",
            "1/4 teaspoon salt",
            "2 quarts premium vanilla ice cream",
            "Nonstick vegetable oil spray",
            "6 ounces bittersweet or semisweet chocolate, chopped",
            "1/2 cup slivered almonds, toasted, coarsely chopped",
            "1 cup (packed) golden brown sugar",
            "1/4 cup dark corn syrup",
            "3 tablespoons water",
            "3 tablespoons unsalted butter",
            "2 cups chilled heavy whipping cream, divided",
            "1 teaspoon vanilla extract",
            "1/8 teaspoon salt",
            "2 tablespoons sugar"
        ],
        "picture_link": "DlD.JUjaz//jwyd6VCF4oYU4mAH814.",
        "instructions": "For crust: Preheat oven to 350°F. Finely grind graham crackers in processor. Mix in sugar. Add butter; mix to blend. Press onto bottom and up sides of 10-inch-diameter glass pie dish. Bake until light brown around edges, about 12 minutes. Cool completely.\nPreheat oven to 350°F. Finely grind graham crackers in processor. Mix in sugar. Add butter; mix to blend. Press onto bottom and up sides of 10-inch-diameter glass pie dish. Bake until light brown around edges, about 12 minutes. Cool completely.\nFor filling: Whisk first 9 ingredients in medium bowl. Slightly soften ice cream in microwave in 10-second intervals. Measure 1 cup ice cream; cover and freeze (reserve for another use). Spoon remaining ice cream into large bowl. Working quickly, add pumpkin mixture and fold just until swirled into ice cream (do not blend completely). If ice cream begins to melt, freeze until almost firm. Spoon ice cream filling into cooled crust, cover with plastic, and freeze until firm, at least 6 hours. DO AHEAD: Can be made 2 days ahead. Keep frozen.\nWhisk first 9 ingredients in medium bowl. Slightly soften ice cream in microwave in 10-second intervals. Measure 1 cup ice cream; cover and freeze (reserve for another use). Spoon remaining ice cream into large bowl. Working quickly, add pumpkin mixture and fold just until swirled into ice cream (do not blend completely). If ice cream begins to melt, freeze until almost firm. Spoon ice cream filling into cooled crust, cover with plastic, and freeze until firm, at least 6 hours. DO AHEAD: Can be made 2 days ahead. Keep frozen.\nFor bark, sauce, and topping: Line baking sheet with parchment paper; spray with nonstick spray. Stir chocolate in bowl set over saucepan of simmering water until melted and smooth. Pour onto baking sheet. Using offset spatula, spread chocolate in even layer into 12x9-inch rectangle. Sprinkle with nuts. Place in freezer until hard, at least 30 minutes. Invert onto work surface. Peel off paper. Coarsely chop. Place DO AHEAD: Chocolate-almond bark can be made 2 days ahead. Keep frozen. Bring brown sugar, corn syrup, 3 tablespoons water, and butter to boil in heavy medium saucepan, stirring until butter melts and sugar dissolves. Reduce heat to medium and boil until dark brown, stirring occasionally, about 5 minutes. Carefully stir in 1/2 cup cream, vanilla, and salt (mixture will bubble vigorously). Boil 1 minute longer. Cool slightly. DO AHEAD: Sauce can be made 2 days ahead. Cover and chill. Rewarm before serving. Using electric mixer, beat 1 1/2 cups cream and 2 tablespoons sugar in medium bowl until peaks form. Spoon decoratively over pie. Sprinkle chocolate-almond bark over. Cut pie into wedges and serve, passing warm sauce alongside.\nLine baking sheet with parchment paper; spray with nonstick spray. Stir chocolate in bowl set over saucepan of simmering water until melted and smooth. Pour onto baking sheet. Using offset spatula, spread chocolate in even layer into 12x9-inch rectangle. Sprinkle with nuts. Place in freezer until hard, at least 30 minutes. Invert onto work surface. Peel off paper. Coarsely chop. Place DO AHEAD: Chocolate-almond bark can be made 2 days ahead. Keep frozen.\nBring brown sugar, corn syrup, 3 tablespoons water, and butter to boil in heavy medium saucepan, stirring until butter melts and sugar dissolves. Reduce heat to medium and boil until dark brown, stirring occasionally, about 5 minutes. Carefully stir in 1/2 cup cream, vanilla, and salt (mixture will bubble vigorously). Boil 1 minute longer. Cool slightly. DO AHEAD: Sauce can be made 2 days ahead. Cover and chill. Rewarm before serving.\nUsing electric mixer, beat 1 1/2 cups cream and 2 tablespoons sugar in medium bowl until peaks form. Spoon decoratively over pie. Sprinkle chocolate-almond bark over. Cut pie into wedges and serve, passing warm sauce alongside.",
        "title": "Pumpkin Ice Cream Pie with Chocolate-Almond Bark and Toffee Sauce "
    },
    "BVmtgqMwlRMEesC1z/ShGQSNlCGb2jK": {
        "instructions": "Watch how to make this recipe.\nDivide the meat into 4 equal portions (about 6 ounces each). Form each portion loosely into a 3/4-inch-thick burger and make a deep depression in the center with your thumb. Season both sides of each burger with salt and pepper.\nHeat the oil in the pan or griddle over high heat until the oil begins to shimmer. Cook the burgers until golden brown and slightly charred on the first side, about 3 minutes for beef and 5 minutes for turkey. Flip over the burgers. Cook beef burgers until golden brown and slightly charred on the second side, 4 minutes for medium rare (3 minutes if topping with cheese) or until cooked to desired degree of doneness. Cook turkey burgers until cooked throughout, about 5 minutes on the second side.\nAdd the cheese, if using, to the tops of the burgers during the last minute of cooking and top with a basting cover, close the grill cover, or tent the burgers with aluminum foil to melt the cheese.\nPlace the burgers on the bun bottoms and, if desired, top with tomato, lettuce, onion, and a dollop of horseradish mustard mayonnaise. Pile on the potato chips, top with the bun tops, and serve immediately.\nWhisk together the mayonnaise, mustard, and horseradish in a small bowl and season with salt and pepper. Cover and refrigerate for at least 30 minutes to allow the flavors to meld. The sauce can be prepared 1 day in advance and kept covered in the refrigerator.",
        "ingredients": [
            "1 1/2 pounds ground chuck (80 percent lean) or ground turkey (90 percent lean)",
            "Kosher salt and freshly ground black pepper",
            "1 1/2 tablespoons canola oil",
            "8 slices American cheese, each 1/4 inch thick",
            "4 potato hamburger buns, split; toasted, if desired (see Cook's Note)",
            "4 slices beefsteak tomato (optional)",
            "4 leaves romaine lettuce (optional)",
            "4 slices red onion (optional)",
            "Horseradish Mustard Mayonnaise, recipe follows (optional)*",
            "4 handfuls of potato chips",
            "1/4 cup mayonnaise",
            "2 tablespoons Dijon mustard",
            "2 tablespoons drained prepared horseradish",
            "Kosher salt and freshly ground black pepper"
        ],
        "title": "Crunchburger (aka the Signature Burger)",
        "picture_link": "YtTHJOmzpQgwqjTSej0XvnYHoHRnzcy"
    },
    "e0yOcknvhOpc.HjVFq88DO20Llcxfrq": {
        "instructions": "1. For the rub: Mix the five-spice powder, 1 teaspoon salt, 1/2 teaspoon pepper, granulated garlic, and onion powder together in a bowl. Smear the spices all over the drumsticks. Cover and refrigerate for several hours or overnight.\n2. Prepare an outdoor grill with a medium-hot fire on one side of the grill for both direct and indirect cooking. Position a drip pan under the grate on the cool side. Toss 1/2 cup soaked wood chips onto the coals.\n3. Lay the turkey legs on the grate over the drip pan. Cover the grill and position the lid's vent holes directly over the meat. When the fire dies down, after 45 minutes or so, add about a 1/2 dozen pieces of cold charcoal and the remaining wood chips to maintain a medium to medium-low smoky fire.\n4. Meanwhile, make the mop: Whisk together the garlic, ginger, vinegar, soy sauce, sesame oil, hoisin, chili sauce, and scallions.\n5. Set aside about half the sauce for serving. After about 1 hour, mop the turkey drumsticks with some of the mop and flip. Mop and flip every 10 minutes or so until the legs are browned and glazed and an instant-read thermometer inserted into the thickest part of the thigh registers about 170 degrees F, 30 to 40 minutes more. Serve the drumsticks with the reserved mop on the side.",
        "ingredients": [
            "2 tablespoons five-spice powder",
            "Kosher salt and freshly ground pepper",
            "1/2 teaspoon granulated garlic",
            "1/2 teaspoon onion powder",
            "4 turkey drumsticks, without thighs (about 4 pounds)",
            "3/4 cup wood chips, soaked",
            "6 cloves garlic, chopped (about 2 tablespoons)",
            "1 1/2-inches fresh ginger, peeled and finely chopped",
            "3/4 cup rice vinegar",
            "1/4 cup soy sauce",
            "1 tablespoon dark sesame oil",
            "2 tablespoons hoisin sauce",
            "4 teaspoons Asian chili sauce, such as Sriracha",
            "4 scallions (white and green parts), thinly sliced"
        ],
        "title": "Asian BBQ Turkey Drumsticks",
        "picture_link": "DJ..wnWRiecqAXojXyG3YSenf1uzyVS"
    },
    "bR7g24fNWu7YpWsB7yprGGAuZkdq1FO": {
        "ingredients": [
            "3 plum tomatoes, cut lengthwise into 1/4-inch-thick slices",
            "3 teaspoons olive oil",
            "two 3/4-to 1-inch-thick shoulder lamb chops (8 to 10 ounces each)",
            "2 teaspoons ground cumin",
            "1/2 teaspoon coarse salt",
            "1/2 teaspoon freshly ground black pepper"
        ],
        "picture_link": null,
        "instructions": "Preheat oven to 450°F. and lightly oil a baking pan. Arrange tomatoes in one layer in prepared pan and brush with 1 teaspoon oil. Roast tomatoes in middle of oven 20 minutes, or until browned lightly, and keep warm. Pat lamb chops dry. In a small dish stir together cumin, salt, and pepper and rub mixture on both sides of lamb chops. In a 9-inch heavy non-stick skillet heat remaining 2 teaspoons oil over moderate heat until hot but not smoking and cook lamb chops 3 to 5 minutes on each side for medium-rare meat. Transfer lamb chops to 2 plates and serve with roasted tomatoes.\nPreheat oven to 450°F. and lightly oil a baking pan.\nArrange tomatoes in one layer in prepared pan and brush with 1 teaspoon oil. Roast tomatoes in middle of oven 20 minutes, or until browned lightly, and keep warm.\nPat lamb chops dry. In a small dish stir together cumin, salt, and pepper and rub mixture on both sides of lamb chops.\nIn a 9-inch heavy non-stick skillet heat remaining 2 teaspoons oil over moderate heat until hot but not smoking and cook lamb chops 3 to 5 minutes on each side for medium-rare meat. Transfer lamb chops to 2 plates and serve with roasted tomatoes.",
        "title": "Spice-Rubbed Lamb Chops with Roasted Tomatoes "
    },
    "GcqDlbl8W2pFr5YSwYt8X/KOgTJ7Hdi": {
        "ingredients": [
            "1 2/3 cups all purpose flour",
            "1 teaspoon baking powder",
            "1/2 teaspoon salt",
            "1 1/2 cups sugar",
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "2 large eggs",
            "2 teaspoons (packed) grated lemon peel",
            "1/2 cup whole milk",
            "1/4 cup fresh lemon juice"
        ],
        "picture_link": null,
        "instructions": "Preheat oven to 350°F. Lightly butter 8 1/2x4 1/2x2 1/2-inch loaf pan. Stir flour, baking powder and salt in medium bowl to blend. Using electric mixer, beat 1 cup sugar and butter in large bowl until light and fluffy. Beat in eggs 1 at a time. Add grated lemon peel. Mix in dry ingredients alternately with milk. Pour batter into prepared loaf pan. Bake until tester inserted into center of bread comes out clean, about 1 hour. Meanwhile, combine remaining 1/2 cup sugar and fresh lemon juice in small heavy saucepan and stir over low heat until sugar dissolves. Transfer lemon bread to rack. Gradually spoon lemon glaze over hot bread, adding more as glaze is absorbed. Cool lemon bread completely in pan on rack. (Can be prepared 1 day ahead. Turn bread out onto rack. Cover with plastic wrap and let stand at room temperature.)\nPreheat oven to 350°F. Lightly butter 8 1/2x4 1/2x2 1/2-inch loaf pan. Stir flour, baking powder and salt in medium bowl to blend. Using electric mixer, beat 1 cup sugar and butter in large bowl until light and fluffy. Beat in eggs 1 at a time. Add grated lemon peel. Mix in dry ingredients alternately with milk. Pour batter into prepared loaf pan. Bake until tester inserted into center of bread comes out clean, about 1 hour.\nMeanwhile, combine remaining 1/2 cup sugar and fresh lemon juice in small heavy saucepan and stir over low heat until sugar dissolves.\nTransfer lemon bread to rack. Gradually spoon lemon glaze over hot bread, adding more as glaze is absorbed. Cool lemon bread completely in pan on rack. (Can be prepared 1 day ahead. Turn bread out onto rack. Cover with plastic wrap and let stand at room temperature.)",
        "title": "Glazed Lemon Bread "
    },
    "ASGIgDxKpL6ejcF6r4t8X8ltmtrqhvC": {
        "instructions": "Pour the oil into a deep, heavy bottomed pot and heat to 350 degrees F.\nMake the breading mixture by combining the breadcrumbs, and Parmesan in a medium bowl. Mix to blend. In another bowl, whisk together the eggs and the splash of water.\nPlace the zucchini in a large bowl and season with salt. Toss to blend. Sprinkle lightly with flour (use a sieve) to dredge then toss to coat evenly - this will help the breading to stick. Submerge the zucchini in the eggs. Remove the pieces, 1 by 1, shaking off excess egg and them roll them in the breadcrumb mixture until they are coated on all sides. Transfer to a platter or baking sheet.\nWhen the oil comes up to temperature, test the oil by dropping in one piece of zucchini. It should rise to the surface fairly quickly, begin the bubble and fry gradually. Prepare a baking sheet fitted with a kitchen towel and a slotted spoon (or, alternatively, a spider) to remove the zucchini from the oil. Drop a few pieces of zucchini into the oil and gently swirl the oil as they fry. This swirling will allow the zucchini to move around a lot, assuring they fry more evenly on all sides. When they are light to medium brown, remove them with the spoon and lay them out on the kitchen towel to cool. Sprinkle with a touch of salt and paprika. Repeat.\nServe immediately with lemon wedges.",
        "ingredients": [
            "4 cups canola oil",
            "1 cup toasted Italian breadcrumbs",
            "3 tablespoons grated Parmesan",
            "3 eggs",
            "1 splash cold water",
            "4 medium zucchini, washed, dried, ends trimmed, cut, lengthwise, into 10 wedges like pickles",
            "2 cups flour, for dredging",
            "Kosher salt",
            "1 tablespoon paprika, for dusting",
            "1 lemon, cut into wedges"
        ],
        "title": "Fried Zucchini",
        "picture_link": "OON8hYFLjQCyqYk7TGhDCPRwA3j20VK"
    },
    "ae9rO6SAhpTtlqIBwRDpO8rsPynU2Cq": {
        "instructions": "1. Heat oven to 375 degrees F.\n2. Wash the turkey, inside and out, and dry well. Coat inside and outside with olive oil. Season turkey on the outside with salt and pepper, pressing it in to adhere. Place 2 rosemary sprigs, 1 thyme sprig, 1 sage sprig, 1 oregano sprig and lemon halves inside the cavity of the turkey. Place cooling rack or roasting rack in bottom of large roasting pan. Place turkey on rack, and arrange carrots, celery and remaining herbs on bottom of pan around turkey. Pour 4 cups (1 carton) chicken broth and water over vegetables and herbs.\n3. Roast until an instant-read thermometer (inserted deep into the thigh but away from the bone) reads 165 degrees F and juices in the thigh run clear when pierced with a fork, about 2 to 2 1/2 hours, basting with pan broth every 30 minutes. Remove turkey from the pan and let rest for 15 minutes before carving. Strain and reserve pan juices, and discard vegetables.\n4. While turkey is resting, make the gravy. In a medium heavy saucepan, cook flour and butter over medium heat for 3 to 4 minutes, or until a blond roux is formed. Add pan juices and 4 cups (1 carton) of chicken broth; heat to boiling over high heat. Reduce the heat and let simmer until thickened and ready to serve.\n5. Carve turkey as desired, and serve with gravy.\nCopyright 2010 Michael Chiarello\nRecipe provided by Chef Michael Chiarello - June 2010.",
        "ingredients": [
            "1 (12 to 14 lb) whole turkey",
            "4 cups water",
            "3/4 cup all-purpose flour",
            "3/4 cup butter",
            "3 tablespoons extra-virgin olive oil",
            "1 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper",
            "3 sprigs fresh rosemary",
            "2 sprigs fresh thyme",
            "2 sprigs fresh sage",
            "2 sprigs oregano",
            "1 lemon, halved",
            "2 carrots, halved",
            "4 celery stalks, halved",
            "2 cartons (32 oz each) Progresso chicken broth"
        ],
        "title": "Chiarello's Herb Roasted Turkey",
        "picture_link": "EUdM/a1m4wt9sOdRysJmOfuA31W0WWC"
    },
    "zgGZMZ5YyLfm5S0MT45tdZA5dYNiISm": {
        "ingredients": [
            "1/3 cup olive oil",
            "3 garlic cloves, thinly sliced",
            "1 pound tomatoes, cored, seeded, coarsely chopped",
            "2 tablespoons chili oil",
            "1/2 teaspoon fennel seeds, lightly crushed",
            "Kosher salt",
            "3 pounds mussels, scrubbed, debearded",
            "2 tablespoons unsalted butter",
            "3 tablespoons finely chopped chives",
            "4 slices country-style bread, grilled"
        ],
        "picture_link": "4bNdiZApYXgCr1b2nbWHB6MlEkI0FIe",
        "instructions": "Heat oil in a large saucepan over medium. Cook garlic, stirring occasionally, until golden and crisp, about 3 minutes. Using a slotted spoon, transfer garlic to a small bowl. Increase heat to medium-high and add tomatoes to oil. Cook, pressing down on tomatoes using a wooden spoon until they are very soft and broken down, 8–10 minutes; pluck out peels. Stir in chili oil and fennel seeds; season with salt. Add mussels, cover, and cook, shaking pan occasionally, until mussels open, 5–8 minutes (discard any mussels that don’t open). Using a slotted spoon, transfer mussels to shallow bowls. Add butter to tomato oil and stir until melted and incorporated. Taste and adjust seasoning. Ladle oil over mussels and top with chives and fried garlic. Serve with grilled bread.\nHeat oil in a large saucepan over medium. Cook garlic, stirring occasionally, until golden and crisp, about 3 minutes. Using a slotted spoon, transfer garlic to a small bowl. Increase heat to medium-high and add tomatoes to oil. Cook, pressing down on tomatoes using a wooden spoon until they are very soft and broken down, 8–10 minutes; pluck out peels. Stir in chili oil and fennel seeds; season with salt. Add mussels, cover, and cook, shaking pan occasionally, until mussels open, 5–8 minutes (discard any mussels that don’t open). Using a slotted spoon, transfer mussels to shallow bowls.\nAdd butter to tomato oil and stir until melted and incorporated. Taste and adjust seasoning. Ladle oil over mussels and top with chives and fried garlic. Serve with grilled bread.",
        "title": "Mussels With Spicy Tomato Oil and Grilled Bread "
    },
    "uMQq8LgYYCBCMjYQziHsiom8lOpupli": {
        "instructions": "Combine the garlic, ginger, chiles and 3 tablespoons kosher salt in a food processor and process to a fine paste; transfer the marinade to a large bowl. Using a paring knife, pierce each chicken wing two or three times through the skin then add to the marinade, tossing to coat evenly. Cover the bowl with plastic wrap and refrigerate for at least 2 hours, or preferably overnight.\nMeanwhile, toast the coconut in a medium skillet over medium heat, stirring often until golden, 4 to 5 minutes. Transfer the coconut to a bowl and let cool.\nMake the raita: Combine the cucumber and 1 teaspoon salt in colander set over a bowl, toss to combine and let stand for 30 minutes. Use your hands to squeeze as much moisture as possible from the cucumbers, then transfer them to a bowl. Stir in the yogurt, cilantro, lime zest and juice. Season the raita with more salt and pepper then cover with plastic wrap and refrigerate until ready to use, up to 2 days. Stir before serving.\nPut the chickpea flour in a large bowl. Using tongs, remove half the wings from the marinade and toss with the flour to coat evenly. Transfer the wings to a wire rack set over a baking sheet and repeat the dredging process with the remaining wings. Discard any leftover chickpea flour.\nHeat 2 inches of oil in a large, heavy-bottomed pot over medium heat until a deep-fry thermometer registers 350 degrees F. Working in 2 batches, fry the wings, turning occasionally, until golden brown and cooked through, 16 to 18 minutes per batch. Use a slotted spoon to transfer the wings to a large bowl and sprinkle with salt. (Make sure the oil returns to the proper temperature between batches.)\nToast the mustard and coriander seeds in a medium skillet over medium heat, swirling the pan until the mustard seeds begin to pop and the spices are fragrant, 2 to 3 minutes. Stir in the turmeric, cook for 10 seconds, then stir in the butter. Heat until the butter melts and the spices begin to sizzle, about 1 minute. Pour the butter and spices over the chicken wings, toss to coat, then transfer to a serving platter. Add the toasted coconut to the seasonings left in the large bowl, then sprinkle over the wings. Serve immediately with the raita on the side.",
        "ingredients": [
            "2 heads garlic, cloves separated and peeled",
            "One 8-inch piece ginger (about 6 ounces), peeled and thinly sliced",
            "10 serrano chiles (about 4 ounces), stems removed (remove seeds for less heat)",
            "Kosher salt",
            "4 pounds chicken wings, separated into flats and drummettes",
            "1 cup sweetened shredded coconut",
            "1 cucumber, grated on the large holes of a box grater",
            "1 cup plain whole-milk yogurt (not Greek)",
            "2 tablespoons finely chopped cilantro",
            "Finely grated zest and juice of 1 lime",
            "Freshly ground pepper",
            "Vegetable oil, for frying",
            "3 cups chickpea flour",
            "1 tablespoon whole brown mustard seeds",
            "1 tablespoon whole coriander seeds",
            "1/2 teaspoon ground turmeric",
            "1 stick (8 tablespoons) unsalted butter, diced"
        ],
        "title": "Extra-Crispy Indian Spiced Chicken Wings",
        "picture_link": "WO7UVRcsv1cX94769xc51PRgrRWYhh."
    },
    "o9BQwwhMUJp8kuYr/PGnSDp9QRLf5CK": {
        "ingredients": [
            "2 large eggs, preferably omega-3 eggs, beaten",
            "1/3 cup packed light brown sugar",
            "2 teaspoons pure vanilla extract",
            "3 cups grated fresh zucchini",
            "2/3 cup canola oil, preferably expeller-pressed, plus more for greasing the muffin tins",
            "2 teaspoons baking soda",
            "1/2 teaspoon salt",
            "3 cups unbleached all-purpose flour",
            "2 teaspoons ground cinnamon",
            "1/2 teaspoon ground nutmeg",
            "1 cup chopped pecans",
            "1 cup golden raisins"
        ],
        "picture_link": null,
        "instructions": "1. Preheat oven to 350°F. 2. In a large bowl, whisk together the eggs, brown sugar, and vanilla. Stir in the grated zucchini, canola oil, baking soda, and salt. 3. In a separate bowl, whisk the flour with the cinnamon and nutmeg. Add the dry ingredients to the zucchini mix and stir well. Finally, stir in the pecans and raisins. 4. Grease a 12-cup muffin tin with canola oil. Spoon the batter into the cups to fill them about 3/4 of the way. Bake for 25 to 30 minutes or until a toothpick or small knife inserted in a muffin comes out clean. (Alternatively, spoon the batter into a 8 x 5 x 3-inch loaf pan. Bake for 50 to 55 minutes or until the top of the loaf cracks and a toothpick or small knife inserted in the center of the loaf comes out clean.) 5. Transfer the pan to a wire rack to cool for about 20 minutes. Then run a small paring knife around each muffin and remove them from the muffin tin.\n1. Preheat oven to 350°F.\n2. In a large bowl, whisk together the eggs, brown sugar, and vanilla. Stir in the grated zucchini, canola oil, baking soda, and salt.\n3. In a separate bowl, whisk the flour with the cinnamon and nutmeg. Add the dry ingredients to the zucchini mix and stir well. Finally, stir in the pecans and raisins.\n4. Grease a 12-cup muffin tin with canola oil. Spoon the batter into the cups to fill them about 3/4 of the way. Bake for 25 to 30 minutes or until a toothpick or small knife inserted in a muffin comes out clean. (Alternatively, spoon the batter into a 8 x 5 x 3-inch loaf pan. Bake for 50 to 55 minutes or until the top of the loaf cracks and a toothpick or small knife inserted in the center of the loaf comes out clean.)\n5. Transfer the pan to a wire rack to cool for about 20 minutes. Then run a small paring knife around each muffin and remove them from the muffin tin.",
        "title": "Zucchini Muffins "
    },
    "8w5X0Vlrd9b5RZ716pw2GmmQzWbqTpi": {
        "ingredients": [
            "8 pounds cherrystone clams, scrubbed",
            "1 tablespoon unsalted butter",
            "8 ounces bacon, cut into 1/2\" pieces",
            "2 celery stalks, minced",
            "1 large onion, minced",
            "1 garlic clove, minced",
            "2 1/2 pound Yukon Gold potatoes, peeled, cut into 1/2\" pieces",
            "1 tablespoon chopped fresh thyme",
            "1 bay leaf",
            "2 tablespoons cornstarch",
            "2 cups heavy cream",
            "Kosher salt, freshly ground pepper",
            "1 freshly ground pepper",
            "Chopped fresh chives",
            "Oyster crackers or Vermont Common Crackers"
        ],
        "picture_link": "HIbVrcVLUuJp/Ja.jKQHw6nwdgm5mQS",
        "instructions": "Bring clams and 4 cups water to a boil in a large pot over high heat. Cook until clams just open, 8-10 minutes (discard any that do not open). Using a large slotted spoon, transfer clams to a large rimmed baking sheet; set broth aside. Let clams cool slightly, then pull meat from shells; discard shells. Chop clams into bite-size pieces. Strain broth through a fine-mesh sieve set over a large bowl. Add water if needed to measure 6 cups. DO AHEAD: Clams and broth can be made 1 day ahead. Cover separately and chill. Melt butter in a large heavy pot over medium heat. Add bacon and cook, stirring occasionally, until fat is rendered and bacon begins to brown, about 8 minutes. Add celery, onion, and garlic and cook, stirring often, until onion is translucent, about 10 minutes. Add reserved broth (or 6 cups bottled clam juice), potatoes, thyme, and bay leaf. Bring chowder base to a simmer; cook until potatoes are tender, 20-25 minutes. Stir cornstarch and 2 Tbsp. water in a small bowl to form a slurry. Stir slurry into chowder base; return to a boil to thicken. DO AHEAD: Base can be made 1 day ahead. Let cool; cover and chill. Keep clams chilled. Bring base to a simmer before continuing. Remove base from heat. Discard bay leaf. Stir in reserved clams (or two 10-ounce cans baby clams) and cream. Season with salt, if needed (clams' brininess varies), and pepper. Divide chowder among bowls. Garnish with chives and oyster crackers.\nBring clams and 4 cups water to a boil in a large pot over high heat. Cook until clams just open, 8-10 minutes (discard any that do not open). Using a large slotted spoon, transfer clams to a large rimmed baking sheet; set broth aside. Let clams cool slightly, then pull meat from shells; discard shells.\nChop clams into bite-size pieces. Strain broth through a fine-mesh sieve set over a large bowl. Add water if needed to measure 6 cups. DO AHEAD: Clams and broth can be made 1 day ahead. Cover separately and chill.\nMelt butter in a large heavy pot over medium heat. Add bacon and cook, stirring occasionally, until fat is rendered and bacon begins to brown, about 8 minutes. Add celery, onion, and garlic and cook, stirring often, until onion is translucent, about 10 minutes. Add reserved broth (or 6 cups bottled clam juice), potatoes, thyme, and bay leaf. Bring chowder base to a simmer; cook until potatoes are tender, 20-25 minutes. Stir cornstarch and 2 Tbsp. water in a small bowl to form a slurry. Stir slurry into chowder base; return to a boil to thicken. DO AHEAD: Base can be made 1 day ahead. Let cool; cover and chill. Keep clams chilled. Bring base to a simmer before continuing.\nRemove base from heat. Discard bay leaf. Stir in reserved clams (or two 10-ounce cans baby clams) and cream. Season with salt, if needed (clams' brininess varies), and pepper.\nDivide chowder among bowls. Garnish with chives and oyster crackers.",
        "title": "New England Clam Chowder "
    },
    "jQz1aYn3ByYEgSVYsSqI2G2YzG2ovMS": {
        "ingredients": [
            "2 3 1/2-pound chickens, halved, backbones removed, excess fat trimmed",
            "8 tablespoons olive oil (preferably extra-virgin)",
            "2 tablespoons coarsely ground black pepper",
            "Lemon wedges"
        ],
        "picture_link": null,
        "instructions": "Rub each chicken half all over with 2 tablespoons oil, then 1 1/2 teaspoons pepper. Sprinkle generously with salt. Let stand at room temperature 1 hour. Preheat broiler. Arrange chicken, skin side down, on broiler pan. Watching closely to avoid burning, broil chicken 5 to 6 inches from heat source until golden brown, about 12 minutes. Remove broiler pan from oven. Using tongs, transfer chicken to plate. Pour off any pan drippings. Return chicken, skin side up, to broiler pan. Broil until skin is crisp and golden brown, about 5 minutes. Turn chicken over, skin side down again, and broil until cooked through, about 8 minutes longer. Transfer chicken to platter; let stand 5 minutes. Serve with lemon wedges to squeeze over\nRub each chicken half all over with 2 tablespoons oil, then 1 1/2 teaspoons pepper. Sprinkle generously with salt. Let stand at room temperature 1 hour.\nPreheat broiler. Arrange chicken, skin side down, on broiler pan. Watching closely to avoid burning, broil chicken 5 to 6 inches from heat source until golden brown, about 12 minutes. Remove broiler pan from oven. Using tongs, transfer chicken to plate. Pour off any pan drippings. Return chicken, skin side up, to broiler pan. Broil until skin is crisp and golden brown, about 5 minutes. Turn chicken over, skin side down again, and broil until cooked through, about 8 minutes longer. Transfer chicken to platter; let stand 5 minutes. Serve with lemon wedges to squeeze over",
        "title": "Tuscan-Style Peppered Chicken "
    },
    "Pi4HEo3KIoofX7reV3kj/5XCEtADv9.": {
        "ingredients": [
            "2 cups all purpose flour",
            "1 teaspoon baking soda",
            "1 teaspoon baking powder",
            "1 teaspoon ground ginger",
            "1 teaspoon ground cardamom",
            "1 teaspoon ground cinnamon",
            "1 teaspoon ground nutmeg",
            "1/2 teaspoon salt",
            "2 cups sugar",
            "1 cup (2 sticks) unsalted butter, room temperature",
            "1 tablespoon grated orange peel",
            "4 large eggs",
            "1 cup sour cream",
            "1/2 cup whole milk",
            "Orange Cream Cheese Frosting"
        ],
        "picture_link": "4Be0lr0KZHvxLhIYCCseaTAII6nOWpu",
        "instructions": "Preheat oven to 350°F. Butter three 9-inch-diameter cake pans. Line bottom of pans with waxed paper. Butter and flour pans; tap out excess flour. Sift first 8 ingredients into medium bowl. Using electric mixer, beat sugar, butter and orange peel in large bowl until fluffy. Beat in eggs 1 at a time. Stir flour mixture into butter mixture alternately with sour cream and milk. Divide batter among prepared pans. Bake cakes until tester inserted into center comes out clean, about 25 minutes. Transfer pans to racks and cool 10 minutes. Turn cakes out onto racks and cool completely. (Can be made 1 day ahead. Store airtight at room temperature.) Place 1 cake layer on platter. Spread 2/3 cup frosting over. Top with second cake layer. Spread 2/3 cup frosting over. Top with third cake layer. Cover top and sides of cake with remaining frosting. (Can be made 1 day ahead. Cover with cake dome and store at room temperature.)\nPreheat oven to 350°F. Butter three 9-inch-diameter cake pans. Line bottom of pans with waxed paper. Butter and flour pans; tap out excess flour. Sift first 8 ingredients into medium bowl. Using electric mixer, beat sugar, butter and orange peel in large bowl until fluffy. Beat in eggs 1 at a time. Stir flour mixture into butter mixture alternately with sour cream and milk. Divide batter among prepared pans.\nBake cakes until tester inserted into center comes out clean, about 25 minutes. Transfer pans to racks and cool 10 minutes. Turn cakes out onto racks and cool completely. (Can be made 1 day ahead. Store airtight at room temperature.)\nPlace 1 cake layer on platter. Spread 2/3 cup frosting over. Top with second cake layer. Spread 2/3 cup frosting over. Top with third cake layer. Cover top and sides of cake with remaining frosting. (Can be made 1 day ahead. Cover with cake dome and store at room temperature.)",
        "title": "Spiced Layer Cake with Orange Cream Cheese Frosting "
    },
    "1SSZHDgmKbmwCbTO6CRkqGk6iycftiy": {
        "instructions": "Prepare the romesco sauce: If using a dried pepper, remove the stem and seeds from the pepper and soak in warm water for 1 hour, or until softened. Scrape off the flesh and discard skin. If using a roasted pepper, remove the charred skin, stem, and seeds, and chop. Set aside.\nIn a food processor, finely chop the bread and almonds. Add the salt, pepper, garlic, tomato and reserved flesh of the pepper. Process to a smooth paste. With the motor running, add the olive oil in a thin stream, until mixture is the consistency of a thick, creamy sauce. Add the warm water as needed to help thin the sauce if necessary. Adjust the seasonings, transfer to a bowl and set aside at room temperature or chill until ready to serve.\nPreheat a grill or broiler, and preheat an oven to 400 degrees F. Trim the roots off the onions and spread them over the grill. Grill the onions until charred all over but not dried out, turning frequently. Transfer the onions to a large roasting pan, cover tightly and roast in the oven for 20 to 25 minutes. Serve the onions steaming hot, strip back the charred outer skin, dip the onions in the romesco sauce, eat the white bottoms and discard the top.",
        "ingredients": [
            "1 sweet dried red romesco pepper, (or substitute a roasted red bell pepper)",
            "1 slice bread, toasted",
            "10 blanched almonds, toasted",
            "Salt and freshly ground black pepper",
            "4 cloves garlic, peeled",
            "1 tomato, peeled, seeded and chopped",
            "1/3 cup olive oil",
            "1 to 2 tablespoons warm water",
            "12 to 16 knob onions, or calcots"
        ],
        "title": "Grilled Knob Onions with Romesco Sauce",
        "picture_link": null
    },
    "P0klvbgNaGkCrHA1cU/Qr0P4.ep8fWa": {
        "ingredients": [
            "3 tablespoons olive oil, divided",
            "1 bunch asparagus, trimmed, cut into 2\" pieces",
            "Kosher salt, freshly ground pepper",
            "2 tablespoons unsalted butter",
            "8 ounces shiitake mushrooms, stems removed, caps sliced",
            "1 small shallot, finely chopped",
            "1 teaspoon chopped fresh oregano",
            "1 teaspoon chopped fresh thyme",
            "12 ounces dried or 1 pound fresh fettuccine",
            "3 ounces Parmesan, grated (about 3/4 cup), plus more for serving",
            "4 large egg yolks*"
        ],
        "picture_link": "yRPqwQUSKSopzNYHKjVGcm5V6G7rtgK",
        "instructions": "Heat 2 tablespoons oil in a large skillet over medium-high heat. Add asparagus, season with salt and pepper, and cook, stirring occasionally, until just tender, about 4 minutes. Transfer to a plate. Heat butter and remaining 1 tablespoon oil in same skillet over medium-high heat. Add mushrooms, season with salt and pepper, and cook, tossing often, until tender, about 5 minutes. Add shallot and cook, tossing occasionally, until softened, about 2 minutes. Toss in oregano, thyme, and asparagus. Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid. Add pasta, 1/2 cup pasta cooking liquid, and 3 ounces Parmesan to skillet. Cook, tossing and adding more pasta cooking liquid as needed, until sauce coats pasta, about 2 minutes; season with salt and pepper. Divide pasta among plates and top each with a yolk and more Parmesan.\nHeat 2 tablespoons oil in a large skillet over medium-high heat. Add asparagus, season with salt and pepper, and cook, stirring occasionally, until just tender, about 4 minutes. Transfer to a plate.\nHeat butter and remaining 1 tablespoon oil in same skillet over medium-high heat. Add mushrooms, season with salt and pepper, and cook, tossing often, until tender, about 5 minutes. Add shallot and cook, tossing occasionally, until softened, about 2 minutes. Toss in oregano, thyme, and asparagus.\nMeanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.\nAdd pasta, 1/2 cup pasta cooking liquid, and 3 ounces Parmesan to skillet. Cook, tossing and adding more pasta cooking liquid as needed, until sauce coats pasta, about 2 minutes; season with salt and pepper.\nDivide pasta among plates and top each with a yolk and more Parmesan.",
        "title": "Fettuccine With Shiitakes and Asparagus "
    },
    "SErzqGNVBRGKsQYawdiXVIb.blppk8y": {
        "instructions": "Heat oven to 350 degrees F. Butter a 10-cup ring mold pan, and set aside. In the bowl of an electric mixer fitted with the paddle attachment, cream butter and sugars on medium speed until light and fluffy, 2 to 4 minutes. Add the vanilla, and mix. Add the eggs, 1 at a time, mixing well after each addition. In a large bowl, sift together ginger, cinnamon, nutmeg, cloves, baking soda, baking powder, salt, and flour. Gradually add the flour mixture to the butter mixture, and mix on low speed just until the flour has been incorporated. Pour batter into prepared pan, and smooth the top with spatula. Bake until a cake tester inserted into the middle comes out clean, 50 to 55 minutes. Transfer pan to a wire rack to cool completely. Invert onto a serving platter and dust with confectioners' sugar. Serve garnished with cinnamon cream.\nPlace heavy cream, sugar, and cinnamon in a chilled medium bowl. Using a whisk, whip cream until soft peaks form. Cover with plastic, and refrigerate until ready to use.",
        "ingredients": [
            "2 cups (4 sticks) unsalted butter, room temperature, plus more for pan",
            "1 cup dark-brown sugar, firmly packed",
            "1 cup granulated sugar",
            "2 teaspoons pure vanilla extract",
            "8 large eggs",
            "1 1/2 teaspoons ground ginger",
            "2 teaspoons ground cinnamon",
            "1 1/2 teaspoons ground nutmeg",
            "1/2 teaspoon ground cloves",
            "1 teaspoon baking soda",
            "1 teaspoon baking powder",
            "2 teaspoons salt",
            "3 cups all-purpose flour",
            "Confectioners' sugar, for dusting",
            "Cinnamon Cream, recipe follows",
            "1 cup heavy cream",
            "2 tablespoons confectioners' sugar",
            "1/4 teaspoon ground cinnamon"
        ],
        "title": "Gingerbread Cake",
        "picture_link": null
    },
    "NTq0m53xDjMmqTvF8j2atHs//EpwzFi": {
        "ingredients": [
            "1 1/2 cups orzo (rice-shaped pasta)",
            "1 1/4 cups chopped onion",
            "5 bacon slices, chopped",
            "3 1/4 cups (or more) canned low-salt chicken broth",
            "1 1/2 cups frozen peas, thawed"
        ],
        "picture_link": null,
        "instructions": "Heat large nonstick skillet over medium heat. Add orzo and stir until beginning to color, about 10 minutes. Transfer orzo to small bowl. Add onion and bacon to same skillet. Sauté until bacon browns and onion is tender, about 15 minutes. Add 3 1/4 cups broth and orzo and bring to boil. Reduce heat to medium-low, cover and simmer until broth is absorbed and orzo is tender, about 18 minutes. Mix in peas. Add more broth if mixture is dry. Cover and cook until peas are just warmed through, about 2 minutes. Season to taste with salt and pepper and serve.\nHeat large nonstick skillet over medium heat. Add orzo and stir until beginning to color, about 10 minutes. Transfer orzo to small bowl. Add onion and bacon to same skillet. Sauté until bacon browns and onion is tender, about 15 minutes. Add 3 1/4 cups broth and orzo and bring to boil. Reduce heat to medium-low, cover and simmer until broth is absorbed and orzo is tender, about 18 minutes. Mix in peas. Add more broth if mixture is dry. Cover and cook until peas are just warmed through, about 2 minutes. Season to taste with salt and pepper and serve.",
        "title": "Toasted Orzo with Peas, Onion and Bacon "
    },
    "kXna3zeOyzBBKAUdLZZP5F5ST3PA1pS": {
        "instructions": "Preheat the oven to 425 degrees F. Line a rimmed baking sheet with foil and set a wire rack on top; coat with cooking spray. Combine 1 cup water, the coconut water, rice and lime zest in a medium saucepan and bring to a boil. Reduce the heat to medium low; cover and simmer 8 minutes. Remove from the heat; add the carrots, red onion, 1/4 teaspoon salt and a few grinds of pepper (do not stir). Cover and let sit 10 minutes, then fluff with a fork to combine. Discard the lime zest.\nMeanwhile, season the shrimp with salt and pepper. Beat the egg and 2 tablespoons water in a bowl. Combine the coconut and panko in another bowl. Dip the shrimp in the egg mixture, then the coconut-panko mixture, gently pressing to adhere; transfer to the prepared rack. Bake until the shrimp are cooked through, about 10 minutes.\nTurn on the broiler. Broil the shrimp until golden brown, 1 to 2 minutes. Add the cilantro to the rice mixture and toss. Serve with the shrimp and lime wedges.\nPhotograph by Charles Masters",
        "ingredients": [
            "Cooking spray",
            "3/4 cup coconut water",
            "3/4 cup jasmati or other long-grain rice",
            "Zest of 1 lime (removed with a vegetable peeler), plus wedges for serving",
            "1/2 cup shredded carrots",
            "2 tablespoons finely chopped red onion or scallions",
            "Kosher salt and freshly ground pepper",
            "1 pound large shrimp, peeled and deveined",
            "1 large egg",
            "1 cup sweetened shredded coconut",
            "3/4 cup panko breadcrumbs",
            "2 tablespoons chopped fresh cilantro"
        ],
        "title": "Coconut Shrimp with Tropical Rice",
        "picture_link": "3fCzbhYKorJwe1bind6QErO5jcdAXq6"
    },
    "QrafNk9WSR6R9DONkk3tY0JDW06uMSW": {
        "ingredients": [
            "2 large lemons, zest of 1 removed in strips with a vegetable peeler",
            "1/4 cup fresh rosemary leaves",
            "3 large garlic cloves",
            "2 tablespoons olive oil",
            "2 teaspoons fresh lemon juice",
            "1/2 teaspoon salt",
            "a 7-pound leg of lamb (ask butcher to remove pelvic bone and tie lamb for easier carving)",
            "2 1/2 pounds small red potatoes",
            "3 tablespoons minced fresh chives",
            "Garnish: fresh rosemary sprigs and lemon wedges"
        ],
        "picture_link": null,
        "instructions": "Preheat oven to 350°F. Cut off and discard pith from zested lemon and cut off and discard zest and pith from other lemon. In a saucepan of boiling water blanch zest 1 minute and drain in a colander. Cut each lemon crosswise into 6 slices. In a small food processor blend rosemary, garlic, zest, 1 tablespoon oil, lemon juice, and salt until mixture is chopped fine. With tip of a small sharp knife cut small slits all over lamb and rub rosemary mixture over lamb, rubbing into slits. Arrange lemon slices in middle of a large roasting pan and arrange lamb on them. Roast lamb in middle of oven 45 minutes. Quarter potatoes and in a saucepan cover with salted cold water by 1 inch. Bring water to a boil and cook potatoes, covered, 5 minutes. Drain potatoes in colander and in a bowl toss with remaining tablespoon oil. Arrange potatoes around lamb and sprinkle with salt and pepper to taste. Roast lamb and potatoes, stirring potatoes occasionally, 55 minutes, or until a meat thermometer registers 140°F. for medium-rare. Transfer lamb to a cutting board and let stand 15 minutes. Increase temperature to 500°F. and roast potatoes and lemons in one layer 5 to 10 minutes more, or until golden. Transfer potatoes and lemons with a slotted spoon to bowl and toss with chives. Transfer potato mixture to a platter. Serve lamb, sliced thin across grain, with potatoes, garnished with rosemary and lemon wedges.\nPreheat oven to 350°F.\nCut off and discard pith from zested lemon and cut off and discard zest and pith from other lemon. In a saucepan of boiling water blanch zest 1 minute and drain in a colander. Cut each lemon crosswise into 6 slices.\nIn a small food processor blend rosemary, garlic, zest, 1 tablespoon oil, lemon juice, and salt until mixture is chopped fine.\nWith tip of a small sharp knife cut small slits all over lamb and rub rosemary mixture over lamb, rubbing into slits. Arrange lemon slices in middle of a large roasting pan and arrange lamb on them. Roast lamb in middle of oven 45 minutes.\nQuarter potatoes and in a saucepan cover with salted cold water by 1 inch. Bring water to a boil and cook potatoes, covered, 5 minutes. Drain potatoes in colander and in a bowl toss with remaining tablespoon oil. Arrange potatoes around lamb and sprinkle with salt and pepper to taste.\nRoast lamb and potatoes, stirring potatoes occasionally, 55 minutes, or until a meat thermometer registers 140°F. for medium-rare. Transfer lamb to a cutting board and let stand 15 minutes. Increase temperature to 500°F. and roast potatoes and lemons in one layer 5 to 10 minutes more, or until golden. Transfer potatoes and lemons with a slotted spoon to bowl and toss with chives. Transfer potato mixture to a platter.\nServe lamb, sliced thin across grain, with potatoes, garnished with rosemary and lemon wedges.",
        "title": "Rosemary, Lemon, and Garlic Leg of Lamb with Roasted Potatoes "
    },
    "f18RY/nAA.9oW1DHnT6g1cRkBPakZC.": {
        "instructions": "Preheat the broiler and set the rack about 4 to 5 inches from the heat source.\nHeat oil in large ovenproof nonstick skillet over medium-high heat. Saute mushrooms until browned, seasoning with salt and pepper. Add onion and saute until tender.\nWhisk eggs, egg whites, salt, and pepper in a medium bowl. Pour over vegetables in skillet and mix gently. Reduce heat to medium-low, cover skillet, and cook until eggs are set around edges, about 4 to 5 minutes. Sprinkle with cheese and then place skillet under broiler and cook until cheese is melted and just browned, about 2 minutes. Let frittata stand 1 minute before cutting into 8 wedges. Serve with salad on the side.\nArugula Salad:\n1 large bunch arugula leaves, washed and dried\n1/4 cup olive oil\n1 lemon, juiced\n10 grinds black pepper\nCouple pinches salt\nCombine all ingredients in a large bowl. Toss to coat leaves with dressing and serve with the frittata.",
        "ingredients": [
            "3 tablespoons vegetable oil",
            "1 (10-ounce) package mushrooms, chopped",
            "Salt and freshly ground black pepper",
            "1 medium onion, chopped",
            "8 eggs",
            "4 egg whites",
            "1 cup grated sharp Cheddar",
            "Arugula Salad, recipe follows"
        ],
        "title": "Mushroom and Cheddar Fritatta and Arugula Side Salad",
        "picture_link": "gR/o.yBUmUhUcSE544hp.pWWKUqy45m"
    },
    "OJu6G3JA9gaVGxJydBMVmBgEVWWHLxO": {
        "instructions": "Cook the bacon in a medium cast-iron skillet over medium heat, flipping about halfway through, until crisp and the fat has rendered, about 8 minutes; transfer to a plate. Pour off and reserve the bacon drippings, leaving enough in the skillet to coat it nicely.\nSlice 4 rounded chunks of lettuce (4 to 5 inches across) from the top and 3 sides of the head to make \"bun\" halves; set on a platter.\nShape the ground beef into 2 burgers, each about 4 inches wide and 3/4 inch thick, and sprinkle both sides with salt and pepper. Put the bacon skillet over high heat, add the burgers and cook for 3 minutes; flip and cook for 3 minutes more for medium rare.\nLay 1 lettuce \"bun\" half cut-side up on each of 2 plates and top with a burger. Spoon 1 tablespoon of the dressing over each burger and top with 1 tablespoon of the onion. Crumble 1 piece of bacon over each burger and top with the remaining lettuce \"bun\" tops.",
        "ingredients": [
            "2 slices bacon",
            "1 head iceberg lettuce (2 to 2 1/2 pounds)",
            "10 ounces 80percent lean ground beef",
            "Kosher salt and freshly ground black pepper",
            "2 tablespoons chunky blue cheese dressing",
            "2 tablespoons diced red onion"
        ],
        "title": "Wedge Salad Burgers",
        "picture_link": "9TZAz4o.KWlZhGjzHrzrReaFuMgV54i"
    },
    "SFD/xU6XNkCBFhWTNv.hwCTJwRv07oq": {
        "ingredients": [
            "2 tablespoons olive oil",
            "1 red onion, chopped",
            "2 large jalapeño chilies, seeded but not deveined, minced",
            "1 teaspoon chili powder",
            "1/2 teaspoon ground cumin",
            "2 16-ounce cans black beans, rinsed, drained",
            "2 tablespoons fresh lime juice",
            "2 tablespoons olive oil",
            "1 1/2 pounds boneless chicken breasts, skinned, cut into 3/4-inch pieces",
            "1 1/2 teaspoon chili powder",
            "3/4 teaspoon ground cumin",
            "4 cups sliced romaine lettuce",
            "1 medium head radicchio, sliced",
            "1/2 cup fresh cilantro leaves",
            "Vegetable oil",
            "6 corn tortillas",
            "1/4 cup olive oil",
            "1 tablespoon fresh lime juice",
            "2 tablespoons (about) water",
            "1/2 pound goat cheese, crumbled",
            "Avocado Salsa",
            "6 fresh cilantro springs"
        ],
        "picture_link": null,
        "instructions": "Make beans: Heat olive oil in heavy medium saucepan over medium-low heat. Add onion and chilies; cook until onion is translucent, stirring occasionally, about 8 minutes. Add chili powder and cumin; stir 30 seconds. Add beans and lime juice. Cook until heat through, stirring and mashing beans slightly with spoon, about 4 minutes. (Can be prepared 1 day ahead. Cover and chill.)\nHeat olive oil in heavy medium saucepan over medium-low heat. Add onion and chilies; cook until onion is translucent, stirring occasionally, about 8 minutes. Add chili powder and cumin; stir 30 seconds. Add beans and lime juice. Cook until heat through, stirring and mashing beans slightly with spoon, about 4 minutes. (Can be prepared 1 day ahead. Cover and chill.)\nMake chicken: Heat oil in heavy large skillet over high heat. Add chicken and sprinkle with salt and pepper. Stir until almost cooked through, about 3 minutes. Add chili powder and cumin and stir until cooked through, about 30 seconds. Remove from heat.\nHeat oil in heavy large skillet over high heat. Add chicken and sprinkle with salt and pepper. Stir until almost cooked through, about 3 minutes. Add chili powder and cumin and stir until cooked through, about 30 seconds. Remove from heat.\nMake Salad: Combine first 3 ingredients in large bowl. Add oil to depth of 1/4 inch to heavy medium skillet. Heat over medium-high heat until just beginning to smoke. Add tortilla and cook until crisp, abut 30 seconds per side. Drain on paper towels. Repeat with remaining tortillas. Add 1/4 cup olive oil to salad; toss Season with salt and pepper. Add 1 tablespoon lime juice; toss. Rewarm beans over medium-low heat, stirring and thinning slightly with water. Place 1 tortilla on each plate. Spread with beans. Sprinkle with cheese. Top with salad, then chicken, salsa and cilantro.\nCombine first 3 ingredients in large bowl.\nAdd oil to depth of 1/4 inch to heavy medium skillet. Heat over medium-high heat until just beginning to smoke. Add tortilla and cook until crisp, abut 30 seconds per side. Drain on paper towels. Repeat with remaining tortillas.\nAdd 1/4 cup olive oil to salad; toss Season with salt and pepper. Add 1 tablespoon lime juice; toss. Rewarm beans over medium-low heat, stirring and thinning slightly with water. Place 1 tortilla on each plate. Spread with beans. Sprinkle with cheese. Top with salad, then chicken, salsa and cilantro.",
        "title": "Chicken, Black Bean and Goat Cheese Toastadas "
    },
    "ktFIhyzLjq2HUFwEWaYgBA7YLQMfw.S": {
        "ingredients": [
            "Nonstick vegetable oil spray",
            "2 large egg whites (1/4 cup)",
            "1/3 cup (packed) golden brown sugar",
            "Pinch of salt",
            "1 1/2 cups coarsely chopped walnuts",
            "1 1/4 cups mini semisweet chocolate chips, divided",
            "2 cups cake flour",
            "1/2 teaspoon salt",
            "1/4 teaspoon baking powder",
            "1/4 teaspoon baking soda",
            "1 cup plus 2 tablespoons sugar",
            "1/2 cup (1 stick) unsalted butter, room temperature",
            "3 large eggs",
            "3/4 cup sour cream",
            "3/4 cup powdered sugar",
            "2 tablespoons sour cream"
        ],
        "picture_link": "8RZOpUF9ur523CuDCIHyjf1.lNZGt6S",
        "instructions": "For cake: Position rack in center of oven and preheat to 350°F. Butter and flour 10-inch-diameter tube pan, then spray with nonstick spray. Mix egg whites, brown sugar, and salt in bowl. Mix in walnuts and 1/4 cup chocolate chips. Whisk flour, salt, baking powder, and baking soda in medium bowl. Using electric mixer, beat sugar and butter in large bowl to blend. Beat in eggs 1 at a time. Stir in flour mixture in 4 additions alternately with sour cream in 3 additions, beginning and ending with flour mixture. Stir in 1 cup chocolate chips. Transfer batter to pan; smooth top. Spoon walnut mixture evenly over. Bake cake until tester inserted near center comes out clean, about 1 hour. Cool in pan on rack 10 minutes. Turn cake out onto rack; invert onto second rack (walnuts should be on top). Cool. (Can be made 1 day ahead. Wrap in plastic.)\nPosition rack in center of oven and preheat to 350°F. Butter and flour 10-inch-diameter tube pan, then spray with nonstick spray. Mix egg whites, brown sugar, and salt in bowl. Mix in walnuts and 1/4 cup chocolate chips.\nWhisk flour, salt, baking powder, and baking soda in medium bowl. Using electric mixer, beat sugar and butter in large bowl to blend. Beat in eggs 1 at a time. Stir in flour mixture in 4 additions alternately with sour cream in 3 additions, beginning and ending with flour mixture. Stir in 1 cup chocolate chips.\nTransfer batter to pan; smooth top. Spoon walnut mixture evenly over. Bake cake until tester inserted near center comes out clean, about 1 hour. Cool in pan on rack 10 minutes. Turn cake out onto rack; invert onto second rack (walnuts should be on top). Cool. (Can be made 1 day ahead. Wrap in plastic.)\nFor topping: Mix powdered sugar and sour cream in bowl; drizzle over cake.\nMix powdered sugar and sour cream in bowl; drizzle over cake.",
        "title": "Chocolate Chip Coffee Cake "
    },
    "Irvv.n.H7ROlpKkQKjNPR3pAaKz.fWW": {
        "instructions": "For the potatoes: Steam the potatoes in a covered saucepan with about 1 inch/2.5 cm water in the bottom, until very tender, about 30 minutes.\nFor the mushrooms: Clean and quarter the mushrooms. Heat just 2 tablespoons of the butter with 1 tablespoon of the olive oil and saute the mushrooms until cooked and golden. Remove from the pan. Heat the other spoonful of olive oil (adding more if you need it) and saute the onion until soft. Add the garlic for 1 minute. Deglaze with the wine and reduce to no more than a spoonful. Add the stock, thyme and mushrooms, season with salt and pepper and cook until the stock has reduced by half. Knead together the flour with the last tablespoon of butter and stir it in. Cook until the liquid has thickened to a sauce, a matter of minutes. Stir in the parsley. Spoon the mixture into a gratin dish.\nFor the cheese potato top: Heat the oven to 425 degrees F/220 degrees C. Mash the potatoes with the milk and butter until smooth, adding more milk if needed. Season with salt and pepper. Stir in the diced cheese. Distribute evenly over the mushroom mixture, and smooth with the back of the spoon (if you want to be very retro-housewife, make patterns with the tines of a fork or make waves with a spoon). Sprinkle over the Parmesan. Bake the gratin until bubbling hot and golden on top, about 15 minutes.",
        "ingredients": [
            "6 medium floury potatoes, such as Yukon gold",
            "2 pounds/ 1 kg mushrooms",
            "3 tablespoons butter",
            "2 tablespoons olive oil, more as needed",
            "1 large red onion, chopped",
            "3 cloves garlic",
            "1/2 cup/125 ml red wine",
            "1/2 cup/125 ml vegetable stock or water",
            "Handful fresh thyme leaves, chopped",
            "Kosher salt and freshly ground black pepper",
            "1 tablespoon flour",
            "1 handful fresh parsley, chopped",
            "1/4 cup/60 ml milk",
            "2 to 4 tablespoons butter",
            "Kosher salt and freshly ground pepper",
            "4 ounces/110 g Comte or Gruyere cheese, cut into very fine dice",
            "2 tablespoons grated Parmesan"
        ],
        "title": "Mushroom Parmentier",
        "picture_link": null
    },
    "DCBIlHUE8jD32M0vnghQkQTAijcYqim": {
        "ingredients": [
            "4 cups all purpose flour",
            "1/4 cup sugar",
            "1 teaspoon baking soda",
            "1/2 teaspoon ground ginger",
            "1/4 teaspoon salt",
            "1/4 cup (1/2 stick) chilled unsalted butter, cut into pieces",
            "1 3/4 cups (about) buttermilk",
            "2 tablespoons dark molasses"
        ],
        "picture_link": null,
        "instructions": "Preheat oven to 425°F. Flour heavy large baking sheet. Combine first 5 ingredients in large bowl. Add butter and rub in with fingertips until mixture resembles fine meal. Whisk 1 cup buttermilk and dark molasses in medium bowl to blend. Mix buttermilk mixture into dry ingredients. Gradually mix in enough remaining buttermilk to form soft dough. Knead on lightly floured surface just until dough holds together. Shape into 8-inch round, about 1 1/2 inches high. Cut into 4-wedges. Transfer wedges to prepared sheet, spacing apart. Bake until deep golden brown, about 30 minutes. Cool on racks.\nPreheat oven to 425°F. Flour heavy large baking sheet. Combine first 5 ingredients in large bowl. Add butter and rub in with fingertips until mixture resembles fine meal. Whisk 1 cup buttermilk and dark molasses in medium bowl to blend. Mix buttermilk mixture into dry ingredients. Gradually mix in enough remaining buttermilk to form soft dough. Knead on lightly floured surface just until dough holds together. Shape into 8-inch round, about 1 1/2 inches high. Cut into 4-wedges. Transfer wedges to prepared sheet, spacing apart. Bake until deep golden brown, about 30 minutes. Cool on racks.",
        "title": "Treacle Farls "
    },
    "4rsd0lqH26ZX3ePkTyuCZYaAI8o5H8a": {
        "instructions": "Special equipment: A small roasting pan and rack, butcher's twine\nPat the chicken dry inside and out with paper towels, and let sit at room temperature to take the chill off, about 30 minutes. Meanwhile, position an oven rack in the center of the oven, and preheat to 450 degrees F. Put a rack in a small roasting pan.\nSeason the cavity of the chicken generously with salt and pepper, and stuff it with the thyme and garlic. Tie the legs together with butcher's twine. Season the outside with salt (generously) and a few grinds of pepper, and place the chicken breast-side up on the rack. (Seasoning the chicken when on the rack could result in gravy that's too salty.)\nRoast the chicken until the skin is golden brown and crispy and a thermometer inserted in the deepest part of the thigh registers 165 to 170 degrees F, depending on how you like your dark meat, 50 minutes to 1 hour. Let the chicken rest on the rack for a few minutes, then carefully tip it forward to drain all the collected juices into the roasting pan. Discard the thyme and garlic. Let the chicken rest on a cutting board while you make the gravy. (To transfer the chicken easily, hold a wooden spoon handle in the cavity with one hand and use the other hand to lift the chicken with tongs.)\nRemove the rack from the pan, and pour the pan drippings into a small bowl. Skim off 2 tablespoons of the fat, and stir them into the flour and 2 tablespoons water in another small bowl. Heat the roasting pan over medium-high heat, add the wine, scrape up any browned bits and simmer until the wine reduces by half, 3 to 4 minutes. Add the chicken stock and any remaining pan drippings, bring to a simmer, add the flour mixture and whisk constantly until the liquid thickens into a gravy, 2 to 3 minutes. Season the gravy with salt and pepper.\nRemove the butcher's twine from the chicken. Snip off the wingtips using kitchen shears; reserve to make stock. Remove the leg quarters by slicing between the thigh and the body, then finding the hip joints near the backbone and slicing through them. Separate the drumsticks and thighs, and transfer to a platter. Sit the carcass upright; snip out the backbone and reserve it to make stock. Lay the breast skin-side up and slice in half through the breastbone. Separate the wings and breast, and transfer to the platter. Serve the chicken with the warm gravy. Reserve the carcass to make stock.",
        "ingredients": [
            "One 4- to 5-pound chicken, giblets removed and reserved for another use",
            "Kosher salt and freshly ground black pepper",
            "3 sprigs thyme",
            "3 cloves garlic, unpeeled",
            "2 tablespoons all-purpose flour",
            "1/2 cup dry white wine",
            "2 cups homemade chicken stock or low-sodium chicken broth"
        ],
        "title": "Simple Roast Chicken with Gravy",
        "picture_link": "RDLGosQABFiMZ8Pk3b0uh8HVe3mzwWK"
    },
    "Sxckw6IydQ/yO3Eu8iXMEwIAgcQ8Gyu": {
        "ingredients": [
            "1 3/4 cups all-purpose flour",
            "3/4 cup cornmeal (preferably stone-ground; not coarse)",
            "4 teaspoons baking powder",
            "1 teaspoon baking soda",
            "1 teaspoon salt",
            "1/2 stick (1/4 cup) cold unsalted butter, cut into 1/2-inch cubes",
            "6 oz extra-sharp Cheddar, coarsely grated (2 cups)",
            "3 tablespoons finely grated Parmigiano-Reggiano",
            "3 scallions, finely chopped",
            "1 1/3 cups well-shaken buttermilk"
        ],
        "picture_link": null,
        "instructions": "Put oven rack in middle position and preheat oven to 450°F. Butter 1 large baking sheet. Whisk together flour, cornmeal, baking powder, baking soda, and salt in a bowl, then blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal. Stir in cheeses and scallions with a wooden spoon, then add buttermilk and stir until just combined. Drop dough in 8 equal mounds about 2 inches apart on baking sheet. Bake until golden, about 15 minutes. Transfer to a rack and cool to warm, about 10 minutes, then cut in half horizontally.\nPut oven rack in middle position and preheat oven to 450°F. Butter 1 large baking sheet.\nWhisk together flour, cornmeal, baking powder, baking soda, and salt in a bowl, then blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal. Stir in cheeses and scallions with a wooden spoon, then add buttermilk and stir until just combined.\nDrop dough in 8 equal mounds about 2 inches apart on baking sheet. Bake until golden, about 15 minutes. Transfer to a rack and cool to warm, about 10 minutes, then cut in half horizontally.",
        "title": "Cheddar Buttermilk Biscuits "
    },
    "1p2SvjVDAIg.ht3g4bg3mYs7ix4Kv9C": {
        "ingredients": [
            "2 tablespoons olive oil, divided",
            "1 2 1/2-pound center-cut wild salmon fillet, skin and pinbones removed",
            "1/2 cup fresh orange juice",
            "1/4 cup fresh lemon juice",
            "1 teaspoon coarse kosher salt",
            "Peas and Pea Tendrils with Lemon Dressing",
            "Dill-Cucumber Sauce"
        ],
        "picture_link": "HcErQq04guri7miGxmYl46bAY30Ai6m",
        "instructions": "Brush small rimmed baking sheet with 1 tablespoon oil. Place salmon on prepared baking sheet. Mix orange juice and lemon juice in small bowl; pour over salmon. Drizzle remaining 1 tablespoon oil over salmon; sprinkle with coarse kosher salt and pepper. Let stand 15 minutes. Preheat broiler. Broil salmon, without turning fish over, until just opaque in center, watching closely and turning baking sheet once for even broiling, about 12 minutes. Using 2 wide spatulas, transfer salmon to platter. Surround with Peas and Pea Tendrils with Lemon Dressing. Serve with Dill-Cucumber Sauce.\nBrush small rimmed baking sheet with 1 tablespoon oil. Place salmon on prepared baking sheet. Mix orange juice and lemon juice in small bowl; pour over salmon. Drizzle remaining 1 tablespoon oil over salmon; sprinkle with coarse kosher salt and pepper. Let stand 15 minutes.\nPreheat broiler. Broil salmon, without turning fish over, until just opaque in center, watching closely and turning baking sheet once for even broiling, about 12 minutes. Using 2 wide spatulas, transfer salmon to platter. Surround with Peas and Pea Tendrils with Lemon Dressing. Serve with Dill-Cucumber Sauce.",
        "title": "Salmon with Peas, Pea Tendrils, and Dill-Cucumber Sauce "
    },
    "FCn.9oFZr5w5abLoVVW24DTtF7ogBEu": {
        "ingredients": [
            "1 tablespoon finely grated lemon zest",
            "3 tablespoons fresh lemon juice, divided",
            "4 large artichokes, trimmed (see method, below)",
            "1/2 cup finely grated Parmesan",
            "1/2 cup plain yogurt",
            "2 tablespoons olive oil",
            "Kosher salt, freshly ground pepper"
        ],
        "picture_link": "lScptsGK99Q6maZMYndwxnyOlQe0bl6",
        "instructions": "Place a metal steamer basket in a large saucepan and pour in water to a depth of 2\". Add 2 tablespoons lemon juice. Bring water to a boil, then add artichokes. Cover, reduce heat, and simmer artichokes until stems and hearts are easily pierced with a paring knife, 30–40 minutes. Meanwhile, blend Parmesan, yogurt, oil, lemon zest, remaining 1 tablespoon lemon juice, and 3 tablespoons water in a blender until smooth; season with salt and a generous amount of pepper. Serve artichokes with yogurt sauce for dipping.\nPlace a metal steamer basket in a large saucepan and pour in water to a depth of 2\". Add 2 tablespoons lemon juice. Bring water to a boil, then add artichokes. Cover, reduce heat, and simmer artichokes until stems and hearts are easily pierced with a paring knife, 30–40 minutes.\nMeanwhile, blend Parmesan, yogurt, oil, lemon zest, remaining 1 tablespoon lemon juice, and 3 tablespoons water in a blender until smooth; season with salt and a generous amount of pepper. Serve artichokes with yogurt sauce for dipping.",
        "title": "Artichokes with Parmesan–Black Pepper Yogurt "
    },
    "fZyjHw1dge9QkFEUMMbIolgWElQmZOy": {
        "instructions": "Special equipment: Candy thermometer\nPreheat the oven to 400 degrees F.\nPut the pumpkin seeds onto a baking sheet and place it in the top half of the oven for 20 to 25 minutes, or until the seeds start to brown slightly. Remove and set aside.\nGrease a second baking sheet with a small amount of butter, or spray with nonstick spray, and set aside.\nCombine the sugar, corn syrup and water in a large saucepan and place over medium-high heat. Bring to a boil and stir with a wooden spoon until the sugar dissolves. Clip the candy thermometer to the side of the saucepan and let the mixture boil until the thermometer reads 260 degrees (the hard-ball stage), about 10 minutes. Add the roasted pumpkin seeds, chili powder and cayenne and stir well. Let the thermometer come up to 300 degrees F (the hard-crack stage), and then remove the pan from the heat, stir in the vanilla and pour the brittle onto the greased baking sheet. Spread out with the wooden spoon and set aside to cool. When completely cool, break the brittle into small pieces. Store in an airtight container with waxed paper between the layers.",
        "ingredients": [
            "1 1/2 cups shelled pumpkin seeds",
            "Butter, for greasing pan, or nonstick cooking spray",
            "2 cups sugar",
            "1 cup light corn syrup",
            "1/2 cup water",
            "2 teaspoons chili powder",
            "1/4 teaspoon cayenne pepper",
            "1 teaspoon vanilla extract"
        ],
        "title": "Diablo Pumpkin Seed Brittle",
        "picture_link": null
    },
    "Ni1pDO2A5GN2dDVXHab5Gml99m7BwJW": {
        "instructions": "Preheat oven to 500 degrees. Lay the oysters on a bed of sea or rock salt on a sheet/baking tray. In a saute pan, melt butter on high heat and saute leeks until soft, about 3 to 4 minutes. Season. Deglaze with ponzu and reduce by 50 percent. Check again for seasoning. Remove from pan and let cool. Fill a small saucepan half way with water and bring to a boil. Place yolks in a small stainless bowl that will fit on top of the sauce pan (bain marie set up). Whisk the yolks and 1 teaspoon of ponzu over the hot water. Be careful not to overcook the yolks by removing the bowl periodically from the heat. Continue whisking until ribbons are formed in the yolks following the whisk. Season and check for flavor. Remove form heat and fold in the cooled leeks. Cool to room temperature. Top each oyster with the leek sabayon and place in oven and immediately switch the setting to broil. Bake for 3 to 5 minutes or until top is brown and bubbly.\nPLATING: Serve on a decorative plate lined with cold sea/rock salt.\nBEVERAGE Blanc de Blanc Champagne\nIn small sauce pan, very lightly coat with oil and saute the shallots, kaffir and ginger until fragrant, about 2 to 3 minutes. Add the cream and bring to a simmer. Reduce by 30 percent then transfer to a small bowl and refrigerate until cold. (It is recommended to do this a day ahead of time for deeper infusion.) Strain the mixture. In a food processor, add the salmon and cream and puree until very smooth. Season with black pepper only and check for seasoning. (Smoked salmon is usually very salty.) Transfer to a small bowl and fold in the zest, juice and chives. Transfer into medium ramekins and refrigerate until cold, at least 2 to 3 hours.\nPLATING: Serve the ramekins on plates surrounded by the pita chips. Garnish with chives.\nBEVERAGE Bright California chardonnay",
        "ingredients": [
            "2 dozen shucked oysters (large blue points), on the half shell",
            "Sea or rock salt, for baking",
            "1 tablespoon butter",
            "2 leeks, white part julienned",
            "1/2 cup ponzu plus 1 teaspoon",
            "4 egg yolks",
            "Salt and pepper, to taste",
            "Canola oil, for cooking",
            "2 large shallots, sliced",
            "5 kaffir lime leaves, shredded",
            "1 teaspoon minced ginger",
            "1 cup heavy cream",
            "8 ounces smoked salmon, roughly chopped",
            "1 lime, juiced, zest finely minced",
            "2 tablespoons chopped chives, plus extra for garnish",
            "Pita chips that have been dried in a 200 degree oven (1 to 2 hours) until crisp"
        ],
        "title": "Oyster-Leek Gratine with Ponzu Sabayon Kaffir Lime-Smoked Salmon Rillette",
        "picture_link": null
    },
    "798PLHo1dsSmGLAFH/p5YvziXWe9aUq": {
        "ingredients": [
            "2 pounds Italian prune plums",
            "1 cup packed light brown sugar",
            "1/4 cup granulated sugar",
            "3 tablespoons fresh lemon juice"
        ],
        "picture_link": null,
        "instructions": "Halve and pit plums and in a large saucepan cook with remaining ingredients over moderate heat, stirring, until plums release their liquid and mixture comes to a simmer. Simmer mixture, stirring, 5 minutes and cool slightly. In a blender purée mixture in 2 batches and pour through a fine sieve into a bowl. Chill mixture, covered, until cold, about 2 hours. Freeze mixture in an ice-cream maker. Transfer sorbet to an airtight container and put in freezer to harden. Sorbet keeps, covered and frozen, 1 week.\nHalve and pit plums and in a large saucepan cook with remaining ingredients over moderate heat, stirring, until plums release their liquid and mixture comes to a simmer. Simmer mixture, stirring, 5 minutes and cool slightly.\nIn a blender purée mixture in 2 batches and pour through a fine sieve into a bowl. Chill mixture, covered, until cold, about 2 hours. Freeze mixture in an ice-cream maker. Transfer sorbet to an airtight container and put in freezer to harden. Sorbet keeps, covered and frozen, 1 week.",
        "title": "Plum Sorbet "
    },
    "zp.SnRKMElKgjXLK8sseXSnQ1EDHS4.": {
        "instructions": "Bring the cider to a boil in a small saucepan over high heat; lower the heat and simmer until reduced by half, 15 to 18 minutes. Stir in the honey and apples, reduce the heat to low and simmer until thick enough to coat the back of a spoon, about 30 minutes.\nMeanwhile, combine the flour, oats, sugar, baking powder, cinnamon and salt in a blender until the oats are finely ground. Add the milk, butter and egg and blend until smooth, scraping down the sides of the blender occasionally.\nHeat a nonstick skillet over medium-low heat. With a paper towel, wipe the oil on the surface of the heated skillet. Ladle 1 tablespoon of the batter onto the skillet to make a pancake. Make 4 to 5 more pancakes, taking care to keep them evenly spaced apart. Cook until bubbles break the surface of the pancakes and the undersides are golden brown, about 2 minutes. Flip with a spatula and cook for 1 minute more.\nServe immediately with the apple compote, or transfer to a platter and cover loosely with foil to keep warm. Repeat with the remaining batter, wiping the griddle with the oiled paper towel as needed.",
        "ingredients": [
            "1 1/2 cups apple cider",
            "1 tablespoon honey",
            "2 Golden Delicious apples, peeled and cut into 1/2-inch chunks",
            "3/4 cup whole wheat flour",
            "3/4 cup quick-cooking oats",
            "2 tablespoons sugar",
            "1 teaspoon baking powder",
            "1/2 teaspoon ground cinnamon",
            "1/4 teaspoon fine salt",
            "1 cup lowfat (1-percent) milk",
            "3 tablespoons unsalted butter, melted and cooled",
            "1 large egg",
            "1 teaspoon canola oil"
        ],
        "title": "Cinnamon Oatmeal Pancakes with Honey Apple Compote",
        "picture_link": "imOtt1I9zSFrePCoOOOvmAhWIqKuYGy"
    },
    "MzgJjsApMzhI8t7c0aPu7h1gcBDbi/K": {
        "ingredients": [
            "3 lb medium sweet potatoes, peeled and each cut lengthwise into 8 spears",
            "1/4 cup vegetable oil",
            "1 1/4 teaspoons salt",
            "5 tablespoons unsalted butter",
            "1/3 cup molasses (not robust or blackstrap)",
            "1/3 cup bottled horseradish (including juice; 3 oz)"
        ],
        "picture_link": "MU3jMqyGrK3qqeK6wZ3ae4kBXqcwGha",
        "instructions": "Put oven rack in lower third of oven and preheat oven to 450°F. If potato spears are very long, halve them diagonally. Toss potatoes with oil and 3/4 teaspoon salt in a large bowl, then spread in 1 layer in a large shallow baking pan (1 inch deep). Roast in lower third of oven, turning once or twice, until tender, 18 to 22 minutes. Leave oven on. While potatoes roast, bring butter, molasses, horseradish (with juice), and remaining 1/2 teaspoon salt to a boil in a small heavy saucepan, stirring, then reduce heat and simmer, stirring occasionally, until slightly thickened and reduced to about 3/4 cup, about 5 minutes. Transfer mixture to a blender and purée 30 seconds (use caution when blending hot liquids). Pour glaze through a fine-mesh sieve into a heatproof bowl, pressing on and discarding solids. Drizzle glaze over cooked sweet potatoes and gently toss until coated. Just before serving, bake glazed sweet potatoes in lower third of oven until hot, 3 to 5 minutes.\nPut oven rack in lower third of oven and preheat oven to 450°F.\nIf potato spears are very long, halve them diagonally. Toss potatoes with oil and 3/4 teaspoon salt in a large bowl, then spread in 1 layer in a large shallow baking pan (1 inch deep). Roast in lower third of oven, turning once or twice, until tender, 18 to 22 minutes. Leave oven on.\nWhile potatoes roast, bring butter, molasses, horseradish (with juice), and remaining 1/2 teaspoon salt to a boil in a small heavy saucepan, stirring, then reduce heat and simmer, stirring occasionally, until slightly thickened and reduced to about 3/4 cup, about 5 minutes.\nTransfer mixture to a blender and purée 30 seconds (use caution when blending hot liquids). Pour glaze through a fine-mesh sieve into a heatproof bowl, pressing on and discarding solids. Drizzle glaze over cooked sweet potatoes and gently toss until coated.\nJust before serving, bake glazed sweet potatoes in lower third of oven until hot, 3 to 5 minutes.",
        "title": "Molasses Horseradish Sweet Potato Spears "
    }
}