[
    {
        "recipe_id": "JoDhYYMwDACSUd9McAZArZRgVke6iVm",
        "recipe_title": "Sauteed Potatoes with Smoked Slab Bacon",
        "original_instructions": "Preheat the oven to 400 degrees F.\nPlace the potatoes in the basket of a vegetable steamer. Steam until a sharp paring knife easily enters the flesh, 20 to 25 minutes. Transfer the potatoes to a bowl. When cool enough to handle, peel the potatoes and cut into 1/3-inch-thick slices.\nHeat the oil in a large skillet over medium-high heat. When it is hot, add the potatoes. Cook, tossing occasionally, until the potatoes are golden brown. Transfer to an ovenproof dish and bake for 20 to 30 minutes. This last step renders the potatoes crunchy on the outside and soft on the inside. A few minutes before the potatoes are ready, saute the bacon (or pancetta) over medium-high heat until golden. When the potatoes are ready, add the bacon, sprinkle with the chives and coarse salt; transfer to a serving dish or onto individual plates.",
        "ingredients": [
            "2 pounds all-purpose potatoes (see Note)",
            "2 tablespoons vegetable oil",
            "1 to 1 1/2 ounces slab bacon or pancetta, cut into small dice",
            "1 tablespoon finely chopped fresh chives",
            "Coarse salt"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Place approximately 225 g of potatoes in the basket of a vegetable steamer.",
            "Steam until a sharp paring knife easily enters the flesh, about 20 to 25 minutes.",
            "Transfer the potatoes to a bowl.",
            "When cool enough to handle, peel the potatoes and cut into 1/3-inch-thick slices.",
            "Heat about 0.75 tablespoons of vegetable oil in a large skillet over medium-high heat.",
            "When it is hot, add the sliced potatoes.",
            "Cook, tossing occasionally, until the potatoes are golden brown.",
            "Transfer the potatoes to an ovenproof dish and bake for 20 to 30 minutes.",
            "A few minutes before the potatoes are ready, saute about 15 g of slab bacon over medium-high heat until golden.",
            "When the potatoes are ready, add the bacon, sprinkle with a pinch of chopped chives and coarse salt.",
            "Transfer to a serving dish or onto an individual plate."
        ],
        "processed_ingredients": [
            "225.00 g potatoes",
            "0.75 tbsp vegetable oil",
            "15.00 g slab bacon",
            "1.00 tbsp chives",
            "0.25 tsp salt"
        ],
        "pure_ingredients": [
            "potato",
            "vegetable oil",
            "bacon",
            "chives",
            "salt"
        ],
        "cooking_time": "75 minutes",
        "required_tools": [
            "oven",
            "vegetable steamer",
            "paring knife",
            "bowl",
            "skillet",
            "ovenproof dish"
        ]
    },
    {
        "recipe_id": "V327lDFTdEof7bsYAJJVBSSKdWQsmzu",
        "recipe_title": "Green Beans in Pork Stock ",
        "original_instructions": "Bring ham hock and water to a boil with 2 1/2 teaspoons salt and 1 teaspoon pepper in a medium pot. Add green beans and cook, uncovered, until very soft, about 1 hour. Transfer ham hock to a cutting board and discard skin, then finely chop meat, discarding bone. Reserve 1 cup cooking liquid. Drain beans, then toss with ham and reserved cooking liquid. Season with salt and pepper.\nBring ham hock and water to a boil with 2 1/2 teaspoons salt and 1 teaspoon pepper in a medium pot. Add green beans and cook, uncovered, until very soft, about 1 hour.\nTransfer ham hock to a cutting board and discard skin, then finely chop meat, discarding bone.\nReserve 1 cup cooking liquid. Drain beans, then toss with ham and reserved cooking liquid. Season with salt and pepper.",
        "ingredients": [
            "1 meaty ham hock (about 10 ounces)",
            "2 quarts water",
            "2 pound green beans, trimmed"
        ],
        "step_by_step_instructions": [
            "Bring 1.25 ounces of meaty ham hock and 1 cup of water to a boil with 0.31 teaspoons salt and 0.12 teaspoons pepper in a medium pot.",
            "Add 0.25 pounds of green beans and cook, uncovered, until very soft, about 1 hour.",
            "Transfer ham hock to a cutting board and discard skin, then finely chop meat, discarding bone.",
            "Reserve 0.125 cups cooking liquid.",
            "Drain beans, then toss with ham and reserved cooking liquid.",
            "Season with salt and pepper."
        ],
        "processed_ingredients": [
            "1.25 oz ham hock",
            "1 cup water",
            "0.25 lb green beans",
            "0.31 tsp salt",
            "0.12 tsp pepper"
        ],
        "pure_ingredients": [
            "ham hock",
            "water",
            "green beans",
            "salt",
            "pepper"
        ],
        "cooking_time": "1 hour",
        "required_tools": [
            "medium pot",
            "cutting board",
            "knife"
        ]
    },
    {
        "recipe_id": "qElhwK4M2bc8.vA2vXZdsBC7lf0jcfu",
        "recipe_title": "Parsleyed Steamed Potatoes",
        "original_instructions": "Steam potatoes on a steamer rack set over boiling water, covered, until tender, 10 to 15 minutes. Toss with butter, parsley, and salt and pepper to taste.;",
        "ingredients": [
            "1/2 pound small potatoes (about 2 inches in diameter)",
            "1 tablespoon unsalted butter, softened",
            "3 tablespoons finely chopped fresh flat-leaf parsley",
            "Salt and pepper, to taste"
        ],
        "step_by_step_instructions": [
            "Steam 1/4 pound of small potatoes on a steamer rack set over boiling water, covered, until tender, about 10 to 15 minutes.",
            "Toss the steamed potatoes with 1/2 tablespoon of unsalted butter, 1 1/2 tablespoons of finely chopped fresh flat-leaf parsley, and salt and pepper to taste."
        ],
        "processed_ingredients": [
            "0.25 lb small potatoes",
            "0.50 tbsp unsalted butter",
            "1.50 tbsp fresh flat-leaf parsley",
            "0.13 tsp salt",
            "0.13 tsp pepper"
        ],
        "pure_ingredients": [
            "potatoes",
            "butter",
            "parsley",
            "salt",
            "pepper"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "steamer rack",
            "pot with lid",
            "bowl",
            "tongs or spoon"
        ]
    },
    {
        "recipe_id": "Sy82fR96fKUx/ytQ8.fm8vi5TkFpDYW",
        "recipe_title": "Pan Seared T-Bone Steak",
        "original_instructions": "Preheat the oven to 450 degrees F. A half-hour before cooking, remove steak from refrigerator.\nHeat a large skillet over high heat. Pat steak dry and season generously with salt and pepper. Add oil to hot skillet and when it begins to smoke add steak. Reduce heat slightly and cook steak until browned, about 4 minutes on each side. Transfer skillet to the oven. Roast until an instant-read thermometer inserted sideways into the steak registers 120 degrees F for medium-rare, about 6 to 8 minutes. Transfer steak to a cutting board and let it rest for 10 minutes. Cut steak from the bone and carve meat across the grain.",
        "ingredients": [
            "1 1/2 pounds bone-in T-bone steak",
            "Kosher salt and freshly ground black pepper",
            "1 tablespoon canola oil"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450 degrees F.",
            "Remove a portion of steak weighing approximately 8 ounces from the refrigerator, half an hour before cooking.",
            "Heat a large skillet over high heat.",
            "Pat the steak dry and season generously with salt and pepper.",
            "Add about 0.5 tablespoon of canola oil to the hot skillet.",
            "When the oil begins to smoke, add the steak to the skillet.",
            "Reduce heat slightly and cook the steak until browned, about 4 minutes on each side.",
            "Transfer the skillet to the preheated oven.",
            "Roast the steak until an instant-read thermometer inserted sideways into the steak registers 120 degrees F for medium-rare, about 6 to 8 minutes.",
            "Transfer the steak to a cutting board and let it rest for 10 minutes.",
            "Cut the steak from the bone and carve the meat across the grain."
        ],
        "processed_ingredients": [
            "8.00 oz T-bone steak",
            "0.50 tbsp canola oil",
            "0.25 tsp salt",
            "0.25 tsp black pepper"
        ],
        "pure_ingredients": [
            "T-bone steak",
            "salt",
            "black pepper",
            "canola oil"
        ],
        "cooking_time": "64 minutes",
        "required_tools": [
            "oven",
            "refrigerator",
            "large skillet",
            "instant-read thermometer",
            "cutting board",
            "knife"
        ]
    },
    {
        "recipe_id": "HERHvpAeijG15XkVikq7iMsjP0beW2u",
        "recipe_title": "Rye Bread Stuffing ",
        "original_instructions": "Preheat oven to 350°F with racks in upper and lower thirds. Toast bread chunks in two 4-sided sheet pans in oven until lightly browned, about 15 minutes, then transfer to a large bowl. Leave oven on. Meanwhile, cook caraway seeds in 6 tablespoons butter in a 12-inch heavy skillet over medium-high heat, stirring, until fragrant, about 2 minutes. Add celery, apples, onion, garlic, 3/4 teaspoon salt, and 1/2 teaspoon pepper and sauté until vegetables are softened and starting to brown, 12 to 15 minutes. Add stock, scraping up any brown bits. Add mixture to bread cubes, tossing to coat. Transfer to a 3-quart baking dish and dot with remaining 2 tablespoons butter. Bake, uncovered, in upper third of oven until stuffing is crisp on top, about 45 minutes.\nPreheat oven to 350°F with racks in upper and lower thirds.\nToast bread chunks in two 4-sided sheet pans in oven until lightly browned, about 15 minutes, then transfer to a large bowl. Leave oven on.\nMeanwhile, cook caraway seeds in 6 tablespoons butter in a 12-inch heavy skillet over medium-high heat, stirring, until fragrant, about 2 minutes. Add celery, apples, onion, garlic, 3/4 teaspoon salt, and 1/2 teaspoon pepper and sauté until vegetables are softened and starting to brown, 12 to 15 minutes. Add stock, scraping up any brown bits. Add mixture to bread cubes, tossing to coat.\nTransfer to a 3-quart baking dish and dot with remaining 2 tablespoons butter. Bake, uncovered, in upper third of oven until stuffing is crisp on top, about 45 minutes.\nWhat to drink: Josmeyer Les Folastries Gewürztraminer '05\nJosmeyer Les Folastries Gewürztraminer '05",
        "ingredients": [
            "1 (1-pound) unsliced loaf rye bread, cut into 1-inch chunks",
            "1 teaspoon caraway seeds",
            "1 stick unsalted butter, divided",
            "3 cups chopped celery",
            "2 Golden Delicious apples, peeled and chopped",
            "1 medium onion, finely chopped",
            "5 garlic cloves, finely chopped",
            "2 cups chicken stock or reduced-sodium chicken broth"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350°F with racks in upper and lower thirds.",
            "Cut 4 ounces of rye bread into 1-inch chunks.",
            "Toast bread chunks in two 4-sided sheet pans in oven until lightly browned, about 15 minutes, then transfer to a large bowl.",
            "Cook 0.25 teaspoon caraway seeds in 0.75 tablespoon butter in a heavy skillet over medium-high heat, stirring, until fragrant, about 2 minutes.",
            "Add 0.5 cup chopped celery, 0.5 apple chopped, 0.25 medium onion finely chopped, and 1 garlic clove finely chopped to the skillet.",
            "Season with 0.19 teaspoon salt and 0.13 teaspoon pepper, and sauté until vegetables are softened and starting to brown, 12 to 15 minutes.",
            "Add 0.5 cup chicken stock, scraping up any brown bits.",
            "Add mixture to bread cubes, tossing to coat.",
            "Transfer to a baking dish and dot with remaining 0.5 tablespoon butter.",
            "Bake, uncovered, in upper third of oven until stuffing is crisp on top, about 45 minutes."
        ],
        "processed_ingredients": [
            "4.00 oz rye bread",
            "0.25 tsp caraway seeds",
            "1.00 tbsp unsalted butter",
            "0.50 cup chopped celery",
            "0.50 Golden Delicious apple",
            "0.25 medium onion",
            "1.00 clove garlic",
            "0.50 cup chicken stock",
            "0.19 tsp salt",
            "0.13 tsp pepper"
        ],
        "pure_ingredients": [
            "rye bread",
            "caraway seeds",
            "butter",
            "celery",
            "apple",
            "onion",
            "garlic",
            "chicken stock",
            "salt",
            "pepper"
        ],
        "cooking_time": "72 minutes",
        "required_tools": [
            "oven",
            "sheet pans",
            "large bowl",
            "heavy skillet",
            "baking dish"
        ]
    }
]