[
    {
        "recipe_id": "pz8Ssa0pOqkk55QwM9aOLSvyuvURKJW",
        "recipe_title": "Sautéed Kale with Lime Pickle ",
        "original_instructions": "Heat ghee in a large skillet over medium-high heat. Add shallot and cook, stirring often, until beginning to brown, about 4 minutes. Working in batches, add kale, tossing and letting it cook down slightly before adding another handful or two, and adding a splash of water if pan looks dry. Add lime pickle and cook, tossing often, until kale is wilted and tender, 5–8 minutes; season with salt and pepper.\nHeat ghee in a large skillet over medium-high heat. Add shallot and cook, stirring often, until beginning to brown, about 4 minutes. Working in batches, add kale, tossing and letting it cook down slightly before adding another handful or two, and adding a splash of water if pan looks dry. Add lime pickle and cook, tossing often, until kale is wilted and tender, 5–8 minutes; season with salt and pepper.",
        "ingredients": [
            "3 tablespoons ghee (clarified butter) or unsalted butter",
            "1 large shallot, thinly sliced into rings",
            "2 bunches curly or Tuscan kale, ribs and stems removed, leaves torn into 2\" pieces",
            "2 tablespoons prepared lime pickle, chopped",
            "Kosher salt, freshly ground pepper"
        ],
        "step_by_step_instructions": [
            "Heat 1 tablespoon of ghee in a large skillet over medium-high heat.",
            "Add 0.5 ounces of shallot slices and cook, stirring often, until beginning to brown, about 4 minutes.",
            "Working in batches, add 3 ounces of kale, tossing and letting it cook down slightly before adding another handful or two, and adding a splash of water if the pan looks dry.",
            "Add 0.5 tablespoons of chopped lime pickle and cook, tossing often, until kale is wilted and tender, 5–8 minutes.",
            "Season with salt and pepper to taste."
        ],
        "processed_ingredients": [
            "1 tablespoon ghee",
            "0.5 ounce shallot",
            "3 ounce kale",
            "0.5 tablespoon lime pickle",
            "0.25 teaspoon salt",
            "0.25 teaspoon pepper"
        ],
        "pure_ingredients": [
            "ghee",
            "shallot",
            "kale",
            "lime pickle",
            "salt",
            "pepper",
            "water"
        ],
        "cooking_time": "12 minutes",
        "required_tools": [
            "large skillet",
            "knife",
            "cutting board",
            "spatula"
        ]
    },
    {
        "recipe_id": "H0tHTFIaM.VIEntG0QxFfF80zbRtlxO",
        "recipe_title": "Grilled Radicchio",
        "original_instructions": "Preheat the grill.\nCut the radicchio lengthwise into 1/4-inch slices, removing the core. In a small bowl, combine the remaining ingredients to make the marinade. Pour the marinade over the radicchio slices, letting them soak for a few minutes before placing on the grill. Grill for 3 to 4 minutes on each side, continuing to baste with marinade. Remove from the heat and serve.",
        "ingredients": [
            "2 heads radicchio, cleaned",
            "3 tablespoons olive oil",
            "1 tablespoon balsamic vinegar",
            "1 tablespoon Dijon mustard",
            "2 splashes Worcestershire sauce",
            "Dash salt and pepper"
        ],
        "step_by_step_instructions": [
            "Preheat the grill.",
            "Cut approximately 0.25 of a head of radicchio lengthwise into 1/4-inch slices, removing the core.",
            "In a small bowl, combine approximately 1.5 teaspoons olive oil, 0.5 teaspoons balsamic vinegar, 0.5 teaspoons Dijon mustard, 0.25 teaspoon Worcestershire sauce, and a dash of salt and pepper to make the marinade.",
            "Pour the marinade over the radicchio slices, letting them soak for a few minutes before placing on the grill.",
            "Grill the radicchio for 3 to 4 minutes on each side, continuing to baste with marinade.",
            "Remove from the heat and serve."
        ],
        "processed_ingredients": [
            "0.25 head radicchio",
            "1.50 tsp olive oil",
            "0.50 tsp balsamic vinegar",
            "0.50 tsp Dijon mustard",
            "0.25 tsp Worcestershire sauce",
            "1.00 dash salt",
            "1.00 dash pepper"
        ],
        "pure_ingredients": [
            "radicchio",
            "olive oil",
            "balsamic vinegar",
            "mustard",
            "Worcestershire sauce",
            "salt",
            "pepper"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "grill",
            "knife",
            "small bowl",
            "basting brush"
        ]
    },
    {
        "recipe_id": "uFkwHbMmoyR12e5lzGE.Y266WO/.57.",
        "recipe_title": "Marinated Cherry Tomatoes with Arugula",
        "original_instructions": "Combine the cherry tomatoes in a medium bowl with 1/4 teaspoon salt and 1/4 teaspoon pepper. Add the sugar, lemon juice, vinegar and 1 tablespoon of the olive oil. Marinate at room temperature for a minimum of 30 minutes and up to 3 hours.\nIf the marinated cherry tomatoes have released a lot of juice, pour a little off before adding the remaining 3 tablespoons olive oil.\nPlace the arugula in a salad bowl and season lightly with salt and pepper. Add the cherry tomato mixture and toss to combine. Top with the parmesan. Serve.",
        "ingredients": [
            "1 pint cherry tomatoes, halved",
            "Salt and freshly ground black pepper",
            "1/2 teaspoon sugar",
            "1 tablespoon lemon juice",
            "1 tablespoon red wine vinegar",
            "4 tablespoons extra-virgin olive oil",
            "6 ounces arugula, washed and dried",
            "2 ounces shaved Parmesan"
        ],
        "step_by_step_instructions": [
            "Combine 4 ounces of cherry tomatoes in a medium bowl with 0.06 teaspoon salt and 0.06 teaspoon pepper.",
            "Add 0.06 teaspoon sugar, 0.2 tablespoon lemon juice, 0.2 tablespoon red wine vinegar, and 0.8 tablespoon of olive oil.",
            "Marinate at room temperature for a minimum of 30 minutes and up to 3 hours.",
            "If the marinated cherry tomatoes have released a lot of juice, pour a little off before adding the remaining 2.4 tablespoons olive oil.",
            "Place 2 ounces of arugula in a salad bowl and season lightly with salt and pepper.",
            "Add the cherry tomato mixture and toss to combine.",
            "Top with 0.3 ounces of shaved Parmesan.",
            "Serve."
        ],
        "processed_ingredients": [
            "4.00 ounce cherry tomatoes",
            "0.06 teaspoon salt",
            "0.06 teaspoon pepper",
            "0.06 teaspoon sugar",
            "0.20 tablespoon lemon juice",
            "0.20 tablespoon red wine vinegar",
            "3.20 tablespoon olive oil",
            "2.00 ounce arugula",
            "0.30 ounce Parmesan"
        ],
        "pure_ingredients": [
            "tomatoes",
            "salt",
            "pepper",
            "sugar",
            "lemon",
            "vinegar",
            "oil",
            "arugula",
            "Parmesan"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "medium bowl",
            "salad bowl",
            "knife",
            "cutting board"
        ]
    },
    {
        "recipe_id": "L30WxtWpwEjNhswt6GBV1JWUtiCSiCG",
        "recipe_title": "Spicy Pig Skin and Corn Nut Snack Mix",
        "original_instructions": "Preheat the oven to 350 degrees F. Toss the pork rinds, tortilla chips, corn nuts and peanuts together in a large bowl.Whisk the lime zest and juice, Worcestershire, chili powder, cayenne and 1/2 teaspoon salt in a separate bowl. Pour the sauce over the snack mix and toss to coat well. Spread out on a rimmed baking sheet and bake until the mix is toasted and almost completely dry, about 10 minutes, tossing about halfway through.\nLet cool completely, and then store in an airtight container for up to 3 days.",
        "ingredients": [
            "7 cups pork rinds, broken into bite-size pieces (about 3 ounces)",
            "6 cups lime-flavored tortilla chips, broken into bite-size pieces (about 6 ounces)",
            "1 1/2 cups corn nuts",
            "1 1/2 cups honey roasted peanuts",
            "2 limes, zest from 2 and juice from 1",
            "2 teaspoons Worcestershire sauce",
            "1 teaspoon chili powder",
            "1/2 teaspoon cayenne pepper",
            "Kosher salt"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "In a large bowl, combine 1.17 cups of pork rinds, 1 cup of tortilla chips, 0.25 cups of corn nuts, and 0.25 cups of honey roasted peanuts.",
            "In a separate bowl, whisk together the zest and juice from 0.33 limes, 0.33 teaspoons of Worcestershire sauce, 0.17 teaspoons of chili powder, 0.08 teaspoons of cayenne pepper, and 0.08 teaspoons of salt.",
            "Pour the sauce over the snack mix and toss to coat well.",
            "Spread the coated mix on a rimmed baking sheet.",
            "Bake until the mix is toasted and almost completely dry, about 10 minutes, tossing about halfway through.",
            "Let the mix cool completely.",
            "Store the cooled mix in an airtight container for up to 3 days."
        ],
        "processed_ingredients": [
            "1.17 cups pork rinds",
            "1 cup tortilla chips",
            "0.25 cups corn nuts",
            "0.25 cups honey roasted peanuts",
            "0.33 limes",
            "0.33 teaspoons Worcestershire sauce",
            "0.17 teaspoons chili powder",
            "0.08 teaspoons cayenne pepper",
            "0.08 teaspoons salt"
        ],
        "pure_ingredients": [
            "pork",
            "corn",
            "peanuts",
            "lime",
            "Worcestershire sauce",
            "chili powder",
            "cayenne pepper",
            "salt"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "oven",
            "large bowl",
            "whisk",
            "rimmed baking sheet",
            "airtight container"
        ]
    },
    {
        "recipe_id": "UF9Y/LJ94vnMuX8YyHwLImACsd9QX.y",
        "recipe_title": "Baked Haddock, Ellida Style",
        "original_instructions": "Preheat the oven to 350 degrees F.\nGrease a baking dish with nonstick spray. Arrange the fish fillets in the prepared baking dish to cover the bottom. In a bowl, combine the bread crumbs with melted butter, crabmeat, and artichokes. Slice the tomato thinly and arrange the slices over the fish. Spread the cheese over the tomatoes. Top with the buttered crumb mixture. Bake for 20 to 25 minutes, or until fish is white and flaky. Variants: Add sliced bell peppers, avocado, or broccoli.",
        "ingredients": [
            "Nonstick cooking spray",
            "2 pounds fresh haddock fillets, or other delicate white fish",
            "2 cups garlic and herb flavored prepared bread crumbs",
            "1 stick (4 ounces) butter, melted",
            "4 ounces fresh chunk crabmeat",
            "4 artichoke hearts, chopped",
            "1 large beefsteak tomato",
            "1 cup shredded cheddar"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Grease a small baking dish with nonstick spray.",
            "Arrange approximately 4 ounces of haddock fillet in the prepared baking dish to cover the bottom.",
            "In a bowl, combine about 1/4 cup of garlic and herb flavored prepared bread crumbs with 1 tablespoon melted butter, 1 ounce of fresh chunk crabmeat, and 1 chopped artichoke heart.",
            "Slice a beefsteak tomato thinly and arrange about 1/4 of the slices over the fish.",
            "Spread approximately 1/4 cup of shredded cheddar over the tomato slices.",
            "Top with the buttered crumb mixture.",
            "Bake for 20 to 25 minutes, or until fish is white and flaky."
        ],
        "processed_ingredients": [
            "1 ounce nonstick cooking spray",
            "4 ounces haddock fillets",
            "0.25 cup garlic and herb flavored bread crumbs",
            "1 tablespoon butter",
            "1 ounce crabmeat",
            "1 artichoke heart",
            "0.25 large beefsteak tomato",
            "0.25 cup shredded cheddar"
        ],
        "pure_ingredients": [
            "haddock",
            "bread crumbs",
            "butter",
            "crabmeat",
            "artichoke",
            "tomato",
            "cheddar"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "oven",
            "baking dish",
            "bowl",
            "knife"
        ]
    },
    {
        "recipe_id": "JoDhYYMwDACSUd9McAZArZRgVke6iVm",
        "recipe_title": "Sauteed Potatoes with Smoked Slab Bacon",
        "original_instructions": "Preheat the oven to 400 degrees F.\nPlace the potatoes in the basket of a vegetable steamer. Steam until a sharp paring knife easily enters the flesh, 20 to 25 minutes. Transfer the potatoes to a bowl. When cool enough to handle, peel the potatoes and cut into 1/3-inch-thick slices.\nHeat the oil in a large skillet over medium-high heat. When it is hot, add the potatoes. Cook, tossing occasionally, until the potatoes are golden brown. Transfer to an ovenproof dish and bake for 20 to 30 minutes. This last step renders the potatoes crunchy on the outside and soft on the inside. A few minutes before the potatoes are ready, saute the bacon (or pancetta) over medium-high heat until golden. When the potatoes are ready, add the bacon, sprinkle with the chives and coarse salt; transfer to a serving dish or onto individual plates.",
        "ingredients": [
            "2 pounds all-purpose potatoes (see Note)",
            "2 tablespoons vegetable oil",
            "1 to 1 1/2 ounces slab bacon or pancetta, cut into small dice",
            "1 tablespoon finely chopped fresh chives",
            "Coarse salt"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "Place approximately 0.50 pound of potatoes in the basket of a vegetable steamer.",
            "Steam the potatoes until a sharp paring knife easily enters the flesh, about 20 to 25 minutes.",
            "Transfer the potatoes to a bowl.",
            "When cool enough to handle, peel the potatoes and cut into 1/3-inch-thick slices.",
            "Heat about 0.50 tablespoon of vegetable oil in a large skillet over medium-high heat.",
            "When the oil is hot, add the sliced potatoes.",
            "Cook, tossing occasionally, until the potatoes are golden brown.",
            "Transfer the potatoes to an ovenproof dish and bake for 20 to 30 minutes.",
            "A few minutes before the potatoes are ready, saute about 0.25 ounce of diced slab bacon over medium-high heat until golden.",
            "When the potatoes are ready, add the bacon to them.",
            "Sprinkle with about 0.25 tablespoon of finely chopped fresh chives and a pinch of coarse salt.",
            "Transfer to a serving dish or onto an individual plate."
        ],
        "processed_ingredients": [
            "0.50 lb potatoes",
            "0.50 tbsp vegetable oil",
            "0.25 oz slab bacon",
            "0.25 tbsp chives",
            "0.13 tsp salt"
        ],
        "pure_ingredients": [
            "potatoes",
            "vegetable oil",
            "bacon",
            "chives",
            "salt"
        ],
        "cooking_time": "50 minutes",
        "required_tools": [
            "oven",
            "vegetable steamer",
            "paring knife",
            "bowl",
            "skillet",
            "ovenproof dish"
        ]
    },
    {
        "recipe_id": "WmUnfAu5bSOMG6TBXhaODoJO9Y1fNsy",
        "recipe_title": "Mashed-Potato Pancakes",
        "original_instructions": "Preheat oven to 250 degrees F.\nIn a bowl combine well the potatoes and the egg, stir in the flour thoroughly, and stir in the onion, chives, and salt and pepper, to taste.\nIn a large heavy skillet, heat 1/8-inch of the oil over moderately high heat until it is hot but not smoking. Fry heaping tablespoons of the potato mixture, flattening them slightly with the back of the spoon, for 1 minute on each side, or until they are golden brown. Transfer the pancakes as they are cooked to paper towels to drain and if desired, keep them warm on a rack set on a baking sheet in a preheated 250 degree F oven. Serve the pancakes as an accompaniment to meat, poultry, or eggs.",
        "ingredients": [
            "2 cups mashed potatoes",
            "1 large egg, beaten lightly",
            "6 tablespoons all-purpose flour",
            "11/2 tablespoons grated onion",
            "2 tablespoons chives",
            "Salt and pepper",
            "Vegetable oil, for frying"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 250 degrees F.",
            "In a bowl, combine well 0.5 cups of mashed potatoes and 0.25 of a beaten egg.",
            "Stir in 1.5 tablespoons of all-purpose flour thoroughly.",
            "Stir in 0.38 tablespoons of grated onion.",
            "Add 0.5 tablespoons of chives and salt and pepper to taste.",
            "In a large heavy skillet, heat 0.03 cups of vegetable oil over moderately high heat until it is hot but not smoking.",
            "Fry heaping tablespoons of the potato mixture, flattening them slightly with the back of the spoon, for 1 minute on each side or until they are golden brown.",
            "Transfer the pancakes as they are cooked to paper towels to drain.",
            "If desired, keep them warm on a rack set on a baking sheet in a preheated 250 degree F oven.",
            "Serve the pancakes as an accompaniment to meat, poultry, or eggs."
        ],
        "processed_ingredients": [
            "0.50 cups mashed potatoes",
            "0.25 large egg",
            "1.50 tablespoons all-purpose flour",
            "0.38 tablespoons grated onion",
            "0.50 tablespoons chives",
            "0.03 cups vegetable oil",
            "1.00 teaspoon salt",
            "0.50 teaspoon pepper"
        ],
        "pure_ingredients": [
            "potato",
            "egg",
            "flour",
            "onion",
            "chives",
            "salt",
            "pepper",
            "vegetable oil"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "oven",
            "bowl",
            "skillet",
            "spoon",
            "paper towels",
            "baking sheet",
            "rack"
        ]
    },
    {
        "recipe_id": "V327lDFTdEof7bsYAJJVBSSKdWQsmzu",
        "recipe_title": "Green Beans in Pork Stock ",
        "original_instructions": "Bring ham hock and water to a boil with 2 1/2 teaspoons salt and 1 teaspoon pepper in a medium pot. Add green beans and cook, uncovered, until very soft, about 1 hour. Transfer ham hock to a cutting board and discard skin, then finely chop meat, discarding bone. Reserve 1 cup cooking liquid. Drain beans, then toss with ham and reserved cooking liquid. Season with salt and pepper.\nBring ham hock and water to a boil with 2 1/2 teaspoons salt and 1 teaspoon pepper in a medium pot. Add green beans and cook, uncovered, until very soft, about 1 hour.\nTransfer ham hock to a cutting board and discard skin, then finely chop meat, discarding bone.\nReserve 1 cup cooking liquid. Drain beans, then toss with ham and reserved cooking liquid. Season with salt and pepper.",
        "ingredients": [
            "1 meaty ham hock (about 10 ounces)",
            "2 quarts water",
            "2 pound green beans, trimmed"
        ],
        "step_by_step_instructions": [
            "Bring 0.31 lb ham hock and 0.63 quarts water to a boil with 0.25 teaspoons salt and 0.08 teaspoons pepper in a medium pot.",
            "Add 0.63 pound green beans and cook, uncovered, until very soft, about 1 hour.",
            "Transfer ham hock to a cutting board and discard skin, then finely chop meat, discarding bone.",
            "Reserve 0.31 cup cooking liquid.",
            "Drain beans, then toss with ham and reserved cooking liquid.",
            "Season with salt and pepper."
        ],
        "processed_ingredients": [
            "0.31 lb ham hock",
            "0.63 quarts water",
            "0.63 pound green beans",
            "0.25 teaspoons salt",
            "0.08 teaspoons pepper"
        ],
        "pure_ingredients": [
            "ham",
            "water",
            "green beans",
            "salt",
            "pepper"
        ],
        "cooking_time": "1 hour",
        "required_tools": [
            "medium pot",
            "cutting board",
            "knife"
        ]
    },
    {
        "recipe_id": "a/YpSh2h21F7oicYcgqO.3zg7YzdRmG",
        "recipe_title": "Caramelized-Shallot and Sage Mashed Potatoes ",
        "original_instructions": "Prepare perfect mashed potatoes . Meanwhile, heat oil in heavy medium skillet over high heat. Add shallots; sauté until tender, about 2 minutes. Reduce heat to medium-low; stir until shallots are golden, about 5 minutes longer. Add fresh sage, white balsamic vinegar, and sugar; stir until caramelized, about 2 minutes. Stir shallot-sage mixture into potatoes. Season with salt.\nPrepare perfect mashed potatoes . Meanwhile, heat oil in heavy medium skillet over high heat. Add shallots; sauté until tender, about 2 minutes. Reduce heat to medium-low; stir until shallots are golden, about 5 minutes longer. Add fresh sage, white balsamic vinegar, and sugar; stir until caramelized, about 2 minutes. Stir shallot-sage mixture into potatoes. Season with salt.",
        "ingredients": [
            "Perfect Mashed Potatoes",
            "2 tablespoons olive oil",
            "2 cups thinly sliced shallots",
            "1 teaspoon chopped fresh sage",
            "1 tablespoon white balsamic vinegar",
            "2 teaspoons sugar",
            "Salt"
        ],
        "step_by_step_instructions": [
            "Prepare a single serving of perfect mashed potatoes.",
            "While the potatoes are cooking, heat 0.67 tablespoon olive oil in a heavy medium skillet over high heat.",
            "Add approximately 0.5 cup thinly sliced shallots to the skillet and sauté until tender, about 2 minutes.",
            "Reduce heat to medium-low and continue stirring until the shallots are golden, about 5 minutes longer.",
            "Add 0.33 teaspoon chopped fresh sage, 0.33 tablespoon white balsamic vinegar, and 0.67 teaspoon sugar to the skillet and stir until the mixture is caramelized, about 2 minutes.",
            "Stir the shallot-sage mixture into the prepared mashed potatoes.",
            "Season the mashed potatoes with salt to taste."
        ],
        "processed_ingredients": [
            "0.67 tablespoon olive oil",
            "0.5 cup shallots",
            "0.33 teaspoon sage",
            "0.33 tablespoon white balsamic vinegar",
            "0.67 teaspoon sugar",
            "0.5 cup potato",
            "to taste salt"
        ],
        "pure_ingredients": [
            "potato",
            "olive oil",
            "shallots",
            "sage",
            "white balsamic vinegar",
            "sugar",
            "salt"
        ],
        "cooking_time": "9 minutes",
        "required_tools": [
            "skillet",
            "stirring spoon"
        ]
    },
    {
        "recipe_id": "ykkDMgYr.fctb9X64PUd7DcA/I.SbUK",
        "recipe_title": "Indian Harvest Jasmine Blend Rice",
        "original_instructions": "Bring water or stock and butter to boil. Add rice slowly, stirring constantly. Bring back to boil to a boil, reduce heat, simmer and stir gently once more. Cover and simmer for 9 minutes or just until rice begins to stick to the bottom of saucepan. Remove from heat, fluff with fork and let rest uncovered for 5 to 10 minutes to allow rice to \"dry\". Serve.",
        "ingredients": [
            "1 3/4 cups water or vegetable stock",
            "1 (8 ounce) package Jasmine Blend Indian Harvest rice",
            "1 teaspoon butter"
        ],
        "step_by_step_instructions": [
            "Bring 0.44 cups of water or vegetable stock and 0.25 teaspoons of butter to a boil.",
            "Add 2 ounces of Jasmine Blend rice slowly, stirring constantly.",
            "Bring the mixture back to a boil, then reduce the heat and simmer.",
            "Stir gently once more, cover, and simmer for 9 minutes or until the rice begins to stick to the bottom of the saucepan.",
            "Remove from heat, fluff with a fork, and let rest uncovered for 5 to 10 minutes to allow the rice to dry.",
            "Serve."
        ],
        "processed_ingredients": [
            "0.44 cup water",
            "0.25 teaspoon butter",
            "2 ounce Jasmine Blend rice"
        ],
        "pure_ingredients": [
            "water",
            "butter",
            "rice"
        ],
        "cooking_time": "19 minutes",
        "required_tools": [
            "saucepan",
            "fork"
        ]
    },
    {
        "recipe_id": "qElhwK4M2bc8.vA2vXZdsBC7lf0jcfu",
        "recipe_title": "Parsleyed Steamed Potatoes",
        "original_instructions": "Steam potatoes on a steamer rack set over boiling water, covered, until tender, 10 to 15 minutes. Toss with butter, parsley, and salt and pepper to taste.;",
        "ingredients": [
            "1/2 pound small potatoes (about 2 inches in diameter)",
            "1 tablespoon unsalted butter, softened",
            "3 tablespoons finely chopped fresh flat-leaf parsley",
            "Salt and pepper, to taste"
        ],
        "step_by_step_instructions": [
            "Place approximately 115 grams (or 1/4 lb) of small potatoes on a steamer rack over boiling water.",
            "Cover and steam the potatoes until they are tender, which should take about 10 to 15 minutes.",
            "Once tender, remove the potatoes and toss them with about 1/2 tablespoon of softened unsalted butter.",
            "Add around 1.5 tablespoons of finely chopped fresh flat-leaf parsley to the potatoes.",
            "Season the potatoes with salt and pepper to taste before serving."
        ],
        "processed_ingredients": [
            "115.00 g small potatoes",
            "0.50 tablespoon unsalted butter",
            "1.50 tablespoon fresh flat-leaf parsley",
            "0.25 teaspoon salt",
            "0.25 teaspoon pepper"
        ],
        "pure_ingredients": [
            "potatoes",
            "butter",
            "parsley",
            "salt",
            "pepper"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "steamer rack",
            "pot with lid",
            "knife",
            "cutting board",
            "mixing bowl",
            "spoon"
        ]
    },
    {
        "recipe_id": "XmFp49.xfwdShjO7atxjYOcK6zWG2Zu",
        "recipe_title": "Asian Pork Lettuce Cups",
        "original_instructions": "Watch how to make this recipe.\nIn a bowl, whisk the hoisin sauce with the vinegar, ginger and garlic.\nSoak the rice noodles in very hot water until soft, according to package instructions. Cut into smaller pieces for serving.\nHeat the oil in a skillet over medium heat, then add pork chop strips and quickly stir-fry until warmed through. Add the hoisin mixture and toss to coat. Remove from the heat.\nServe the pork family style in lettuce cups topped with chopped peanuts, mint, cilantro, bean sprouts and Sriracha and the rice noodles on the side.",
        "ingredients": [
            "1/3 cup hoisin sauce",
            "2 tablespoons rice wine vinegar",
            "2 teaspoons grated ginger",
            "1 clove garlic, grated",
            "One 14-ounce package rice vermicelli noodles",
            "2 tablespoons canola oil",
            "2 pounds cooked pork chops, sliced into strips",
            "1 head Bibb lettuce, separated into leaves",
            "Serving suggestions: chopped peanuts, mint leaves, cilantro leaves, bean sprouts and Sriracha"
        ],
        "step_by_step_instructions": [
            "Whisk together 1.33 tablespoons of hoisin sauce, 0.8 tablespoons of rice wine vinegar, 0.27 teaspoons of grated ginger, and 0.07 teaspoons of grated garlic in a bowl.",
            "Soak 2.33 ounces of rice vermicelli noodles in very hot water until soft, according to the package instructions. Cut into smaller pieces for serving.",
            "Heat 0.67 tablespoons of canola oil in a skillet over medium heat.",
            "Add 5.33 ounces of sliced cooked pork chop strips to the skillet and quickly stir-fry until warmed through.",
            "Add the hoisin mixture to the pork in the skillet and toss to coat.",
            "Remove from heat and serve the pork in Bibb lettuce cups.",
            "Top with a small amount of chopped peanuts, mint leaves, cilantro leaves, bean sprouts, and a dash of Sriracha.",
            "Serve the rice noodles on the side."
        ],
        "processed_ingredients": [
            "1.33 tablespoon hoisin sauce",
            "0.8 tablespoon rice wine vinegar",
            "0.27 teaspoon grated ginger",
            "0.07 teaspoon grated garlic",
            "2.33 ounce rice vermicelli noodles",
            "0.67 tablespoon canola oil",
            "5.33 ounce cooked pork chops",
            "1.67 ounce Bibb lettuce",
            "0.33 ounce chopped peanuts",
            "0.33 ounce mint leaves",
            "0.33 ounce cilantro leaves",
            "0.33 ounce bean sprouts",
            "0.33 teaspoon Sriracha"
        ],
        "pure_ingredients": [
            "hoisin sauce",
            "rice wine vinegar",
            "ginger",
            "garlic",
            "rice vermicelli noodles",
            "canola oil",
            "pork",
            "lettuce",
            "peanuts",
            "mint",
            "cilantro",
            "bean sprouts",
            "Sriracha"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "bowl",
            "skillet",
            "whisk",
            "knife"
        ]
    },
    {
        "recipe_id": "Bwihe/XPo/WHOs2gQTEqj8ln/rG2Xqm",
        "recipe_title": "Grilled Chicken Vegetable Soup",
        "original_instructions": "Watch how to make this recipe.\nHeat a grill pan over high heat for 5 minutes.\nRub a little olive oil all over the chicken breast and sprinkle all over with salt and pepper. Reduce the heat to medium-high and grill the chicken until cooked through, turning once, about 12 minutes. Set aside and keep warm.\nFill a small saucepan with 1/2 cup water, bring to a boil, add some salt, and cook the barley according to package instructions, until tender. Drain and rinse.\nBring the chicken broth and bay leaf to a simmer in a medium saucepan. Add the carrot, celery and zucchini. Cook until just tender, about 5 minutes. Discard the bay leaf.\nPlace the chicken breast on a cutting board and slice crosswise into thin slices. Spoon the vegetables and barley into serving bowls, then add the hot broth. Lay several slices of chicken over the surface of each bowl.",
        "ingredients": [
            "Extra-virgin olive oil",
            "12 to 14 ounces boneless, skinless chicken breast",
            "Kosher salt and freshly ground black pepper",
            "1/4 cup pearl barley",
            "4 cups reduced-sodium chicken broth",
            "1 bay leaf",
            "1 carrot, finely chopped",
            "1 rib celery, finely chopped",
            "1 small zucchini, finely chopped"
        ],
        "step_by_step_instructions": [
            "Heat a grill pan over high heat for 5 minutes.",
            "Rub 1 teaspoon of olive oil all over 5 ounces of chicken breast and sprinkle with 0.25 teaspoon of salt and 0.25 teaspoon of pepper.",
            "Reduce the heat to medium-high and grill the chicken until cooked through, turning once, about 12 minutes. Set aside and keep warm.",
            "Fill a small saucepan with 0.125 cup water, bring to a boil, add some salt, and cook 0.06 cup barley according to package instructions, until tender. Drain and rinse.",
            "Bring 1 cup chicken broth and 1/4 bay leaf to a simmer in a medium saucepan.",
            "Add 0.125 cup carrot, 0.125 cup celery, and 0.125 cup zucchini. Cook until just tender, about 5 minutes.",
            "Discard the bay leaf.",
            "Place the chicken breast on a cutting board and slice crosswise into thin slices.",
            "Spoon the vegetables and barley into a serving bowl, then add the hot broth.",
            "Lay several slices of chicken over the surface of the bowl."
        ],
        "processed_ingredients": [
            "1 teaspoon olive oil",
            "5 ounces chicken breast",
            "0.25 teaspoon salt",
            "0.25 teaspoon black pepper",
            "0.06 cup barley",
            "1 cup chicken broth",
            "0.25 bay leaf",
            "0.125 cup carrot",
            "0.125 cup celery",
            "0.125 cup zucchini"
        ],
        "pure_ingredients": [
            "olive oil",
            "chicken",
            "salt",
            "black pepper",
            "barley",
            "chicken broth",
            "bay leaf",
            "carrot",
            "celery",
            "zucchini"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "grill pan",
            "saucepan",
            "cutting board",
            "knife",
            "serving bowl"
        ]
    },
    {
        "recipe_id": "c/.KKVazrZkdco6P4pNLwylNoHb7aCa",
        "recipe_title": "Roasted Broccoli with Cherry Tomatoes",
        "original_instructions": "Preheat oven to 450 degrees F.\nAdd broccoli to a large bowl. Add the shallots, cherry tomatoes, garlic and red pepper flakes with 4 tablespoons oil in large bowl. Sprinkle with salt and pepper. Toss to coat and spread onto large baking sheet. Roast until the stems are tender-crisp and lightly golden brown, about 18 minutes. Grate the Parmesan over the broccoli while it's hot.",
        "ingredients": [
            "2 bunches broccoli, cut into 2 1/2-inch long florets",
            "1 medium shallot, roughly chopped",
            "1 pint cherry tomatoes, whole",
            "3 cloves garlic, roughly chopped",
            "1/2 teaspoon red pepper flakes",
            "4 tablespoons olive oil",
            "Salt and freshly ground black pepper",
            "1/3 cup grated Parmesan"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450 degrees F.",
            "Take a small portion of broccoli (about one-third of a bunch) and cut it into 2 1/2-inch long florets.",
            "In a large bowl, combine the broccoli florets with about 1/3 of a medium shallot, roughly chopped.",
            "Add approximately 1/3 pint of cherry tomatoes whole to the bowl.",
            "Include about 1 clove of garlic, roughly chopped, to the mixture.",
            "Sprinkle about 1/8 teaspoon of red pepper flakes into the bowl.",
            "Drizzle 1 tablespoon of olive oil over the mixture.",
            "Season with salt and freshly ground black pepper to taste.",
            "Toss everything to coat evenly.",
            "Spread the mixture onto a large baking sheet.",
            "Roast in the preheated oven until the broccoli stems are tender-crisp and lightly golden brown, about 18 minutes.",
            "Once roasted, grate about 1 tablespoon of Parmesan over the hot broccoli."
        ],
        "processed_ingredients": [
            "0.67 bunches broccoli",
            "0.33 medium shallot",
            "0.33 pint cherry tomatoes",
            "1 clove garlic",
            "0.13 teaspoon red pepper flakes",
            "1 tablespoon olive oil",
            "1 tablespoon Parmesan"
        ],
        "pure_ingredients": [
            "broccoli",
            "shallot",
            "cherry tomatoes",
            "garlic",
            "red pepper flakes",
            "olive oil",
            "salt",
            "black pepper",
            "Parmesan"
        ],
        "cooking_time": "18 minutes",
        "required_tools": [
            "oven",
            "large bowl",
            "large baking sheet",
            "grater"
        ]
    },
    {
        "recipe_id": "GRdO82cehholWJURZOgbX06lJioPFLm",
        "recipe_title": "Spinach-Cheese Swirls",
        "original_instructions": "Heat the oven to 400 degrees F. Beat the egg and water in a small bowl with a fork or whisk.\nStir the muenster cheese, parmesan cheese, onion and garlic powder in a medium bowl.\nUnfold the pastry sheet on a lightly floured surface. Brush the pastry sheet with the egg mixture. Top with the cheese mixture and spinach. Starting with a short side, roll up like a jelly roll. Cut into 20 (1/2-inch) slices. Place the slices, cut-side down, onto baking sheets. Brush the slices with the egg mixture.\nBake for 15 minutes or until the pastries are golden brown. Remove the pastries from the baking sheets and let cool on wire racks for 10 minutes.",
        "ingredients": [
            "1 egg",
            "1 tablespoon water",
            "1/2 cup shredded Muenster cheese or mozzarella cheese",
            "1/4 cup grated Parmesan cheese",
            "1 green onion, chopped (about 2 tablespoons)",
            "1/8 teaspoon garlic powder",
            "All-purpose flour",
            "1/2 of a 17.3-ounce package Pepperidge Farm Puff Pastry Sheets (1 sheet), thawed",
            "1 package (about 10 ounces) frozen chopped spinach, thawed and well drained"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 400 degrees F.",
            "In a small bowl, beat 0.5 egg with 0.5 tablespoon water using a fork or whisk.",
            "In a medium bowl, mix 0.25 cup shredded Muenster cheese, 0.125 cup grated Parmesan cheese, 1 tablespoon chopped green onion, and 0.06 teaspoon garlic powder.",
            "On a lightly floured surface, unfold the thawed puff pastry sheet.",
            "Brush the pastry sheet with the egg mixture.",
            "Top the pastry with the cheese mixture and 5 ounces of thawed and well-drained chopped spinach.",
            "Starting with a short side, roll up the pastry like a jelly roll.",
            "Cut the roll into 5 slices, each about 1/2-inch thick.",
            "Place the slices, cut-side down, onto a baking sheet.",
            "Brush the tops of the slices with the remaining egg mixture.",
            "Bake in the preheated oven for 15 minutes or until the pastries are golden brown.",
            "Remove the pastries from the baking sheet and let them cool on a wire rack for 10 minutes before serving."
        ],
        "processed_ingredients": [
            "0.5 egg",
            "0.5 tablespoon water",
            "0.25 cup shredded Muenster cheese",
            "0.125 cup grated Parmesan cheese",
            "1 tablespoon green onion",
            "0.06 teaspoon garlic powder",
            "1 sheet all-purpose flour",
            "5 ounces frozen chopped spinach",
            "1 sheet puff pastry"
        ],
        "pure_ingredients": [
            "egg",
            "water",
            "Muenster cheese",
            "Parmesan cheese",
            "green onion",
            "garlic powder",
            "flour",
            "puff pastry",
            "spinach"
        ],
        "cooking_time": "25 minutes",
        "required_tools": [
            "oven",
            "small bowl",
            "fork",
            "whisk",
            "medium bowl",
            "baking sheet",
            "wire rack"
        ]
    },
    {
        "recipe_id": "vP5Ax3hh7ABIVU1g4TCtmGSDrvE7dcm",
        "recipe_title": "Beef Miroton",
        "original_instructions": "In a large heavy skillet cook onions in 2 tablespoons oil over moderate heat, stirring, until golden and add flour. Cook mixture over moderately low heat, stirring, 2 minutes and stir in wine, tomato paste, broth and gravy. Simmer sauce, stirring, 3 minutes and stir in mustard.\nPreheat oven to 400 degrees. Spoon half of sauce into 2-quart shallow flameproof baking dish and arrange beef on it, overlapping slices. Spread remaining sauce over beef.\nIn a small bowl toss bread crumbs with remaining 1 1/2 tablespoons oil and sprinkle over sauce. Bake miroton in upper third of oven until just bubbling around edges, about 5 to 10 minutes. If crumbs are not golden, put miroton under broiler 1 to 2 minutes.",
        "ingredients": [
            "2 large onions, sliced thin",
            "3 1/2 tablespoons olive oil",
            "1 1/2 tablespoons all-purpose flour",
            "1/2 cup red wine",
            "2 teaspoons tomato paste",
            "1 cup beef broth",
            "1 cup beef gravy (reserved from rump roast)",
            "2 tablespoons Dijon mustard",
            "12 thin slices (about 1 1/4 pounds) leftover roast beef",
            "1 1/3 cups fresh bread crumbs"
        ],
        "step_by_step_instructions": [
            "In a large heavy skillet, cook approximately 0.33 of a large onion, sliced thin, in about 0.33 tablespoon of olive oil over moderate heat, stirring, until golden.",
            "Add about 0.25 tablespoon of all-purpose flour to the onions. Cook the mixture over moderately low heat, stirring, for 2 minutes.",
            "Stir in approximately 0.06 cup of red wine, 0.25 teaspoon of tomato paste, 0.17 cup of beef broth, and 0.17 cup of beef gravy.",
            "Simmer the sauce, stirring, for 3 minutes and then stir in about 0.33 teaspoon of Dijon mustard.",
            "Preheat the oven to 400 degrees Fahrenheit.",
            "Spoon half of the sauce into a shallow flameproof baking dish, approximately 0.33 of the dish.",
            "Arrange about 2 thin slices of leftover roast beef, overlapping on the sauce.",
            "Spread the remaining sauce over the beef.",
            "In a small bowl, toss about 0.22 cup of fresh bread crumbs with about 0.25 tablespoon of olive oil.",
            "Sprinkle the bread crumbs over the sauce.",
            "Bake the dish in the upper third of the oven until just bubbling around the edges, about 5 to 10 minutes.",
            "If the crumbs are not golden, put the dish under a broiler for 1 to 2 minutes."
        ],
        "processed_ingredients": [
            "0.33 large onion",
            "0.33 tbsp olive oil",
            "0.25 tbsp all-purpose flour",
            "0.06 cup red wine",
            "0.25 tsp tomato paste",
            "0.17 cup beef broth",
            "0.17 cup beef gravy",
            "0.33 tsp Dijon mustard",
            "2 slices leftover roast beef",
            "0.22 cup fresh bread crumbs"
        ],
        "pure_ingredients": [
            "onion",
            "olive oil",
            "flour",
            "red wine",
            "tomato paste",
            "beef broth",
            "beef gravy",
            "mustard",
            "beef",
            "bread"
        ],
        "cooking_time": "15 minutes",
        "required_tools": [
            "skillet",
            "baking dish",
            "oven",
            "broiler",
            "small bowl"
        ]
    },
    {
        "recipe_id": "FFyAsUf3nnwwbh9.BnmaUc6JEP0Z5.2",
        "recipe_title": "Szechuan Beef",
        "original_instructions": "Mix the sliced beef with soy sauce, cooking wine, and cornstarch and set aside. Heat the wok and 4 tablespoons of vegetable oil. Stir-fry the garlic and jalapeno pepper until fragrant, about 1 minute. Add the beef and the sauce ingredients and stir-fry over high heat just until the beef is no longer pink on the outside, about 2 to 3 minutes. Add the green onions during the last 1 minute of cooking.",
        "ingredients": [
            "1 pound flank steak, sliced very thinly",
            "1 tablespoon soy sauce",
            "1 teaspoon cooking wine",
            "2 teaspoons cornstarch",
            "4 tablespoons vegetable oil",
            "1 teaspoon sliced fresh garlic",
            "1 teaspoon sliced jalapeno pepper",
            "Six 1-inch sections green onion",
            "1/2 teaspoon salt",
            "1/2 teaspoon sugar",
            "1/4 teaspoon black pepper",
            "1/2 teaspoon sesame oil"
        ],
        "step_by_step_instructions": [
            "Mix 4 ounces of sliced beef with 0.75 teaspoon soy sauce, 0.25 teaspoon cooking wine, and 0.5 teaspoon cornstarch. Set aside.",
            "Heat a wok and add 1 tablespoon of vegetable oil.",
            "Stir-fry 0.25 teaspoon of sliced fresh garlic and 0.25 teaspoon of sliced jalapeno pepper until fragrant, about 1 minute.",
            "Add the beef and sauce mixture to the wok and stir-fry over high heat until the beef is no longer pink on the outside, about 2 to 3 minutes.",
            "Add 1 inch section of green onion during the last 1 minute of cooking.",
            "Season with 0.13 teaspoon salt, 0.13 teaspoon sugar, 0.06 teaspoon black pepper, and 0.13 teaspoon sesame oil."
        ],
        "processed_ingredients": [
            "4.00 oz flank steak",
            "0.75 tsp soy sauce",
            "0.25 tsp cooking wine",
            "0.50 tsp cornstarch",
            "1.00 tbsp vegetable oil",
            "0.25 tsp fresh garlic",
            "0.25 tsp jalapeno pepper",
            "1.00 inch green onion",
            "0.13 tsp salt",
            "0.13 tsp sugar",
            "0.06 tsp black pepper",
            "0.13 tsp sesame oil"
        ],
        "pure_ingredients": [
            "flank steak",
            "soy sauce",
            "cooking wine",
            "cornstarch",
            "vegetable oil",
            "garlic",
            "jalapeno pepper",
            "green onion",
            "salt",
            "sugar",
            "black pepper",
            "sesame oil"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "wok",
            "stirring utensil",
            "knife",
            "cutting board",
            "measuring spoons"
        ]
    },
    {
        "recipe_id": "nFgNpzTAz3IsMInbo/LanENFe2LnSme",
        "recipe_title": "Latkes",
        "original_instructions": "In a large bowl, combine by hand the squash, half of the onion, 1/8 cup egg substitute, 1/4 teaspoon salt, and 1/4 teaspoon pepper. In another large bowl, combine by hand the zucchini, half of the onion, 1/8 cup egg substitute, 1/4 teaspoon salt, and 1/4 teaspoon pepper.\nHeat a large non-stick griddle over high heat; it will be hot enough when a drop of water sizzles when dropped on the surface. Squeeze out the excess liquid from both the squash and zucchini mixtures. Working in batches so as not to overcrowd the griddle, carefully drop 1 heaping tablespoon of both batters onto the hot griddle and flatten with a spatula to form pancake shape. Cook for a couple minutes on each side or until golden brown. Repeat until no batter remains. Keep warm in a low oven (250 degrees F) until all latkes are made, if desired.",
        "ingredients": [
            "2 cups grated yellow squash (from 2 medium squash)",
            "1/2 cup grated onion",
            "1/4 cup egg substitute, divided",
            "1/2 teaspoon salt, divided",
            "1/2 teaspoon black pepper, divided",
            "2 cups grated zucchini (from 2 medium zucchini)",
            "Olive oil spray"
        ],
        "step_by_step_instructions": [
            "In a bowl, combine 0.5 cup grated squash, 2 tbsp grated onion, 1 tbsp egg substitute, 1/8 tsp salt, and 1/8 tsp black pepper by hand.",
            "In another bowl, combine 0.5 cup grated zucchini, 2 tbsp grated onion, 1 tbsp egg substitute, 1/8 tsp salt, and 1/8 tsp black pepper by hand.",
            "Heat a non-stick griddle over high heat until a drop of water sizzles when dropped on the surface.",
            "Squeeze out excess liquid from both the squash and zucchini mixtures.",
            "Drop 1 heaping tablespoon of each mixture onto the griddle and flatten with a spatula to form a pancake shape.",
            "Cook each side for a couple of minutes or until golden brown.",
            "Repeat until all batter is used.",
            "Keep warm in a low oven at 250 degrees F, if desired."
        ],
        "processed_ingredients": [
            "0.50 cup grated yellow squash",
            "2.00 tbsp grated onion",
            "1.00 tbsp egg substitute",
            "0.13 tsp salt",
            "0.13 tsp black pepper",
            "0.50 cup grated zucchini",
            "1.00 spray olive oil"
        ],
        "pure_ingredients": [
            "squash",
            "onion",
            "egg",
            "salt",
            "black pepper",
            "zucchini",
            "olive oil"
        ],
        "cooking_time": "30 minutes",
        "required_tools": [
            "bowl",
            "griddle",
            "spatula",
            "oven"
        ]
    },
    {
        "recipe_id": "BXcbNShfdC.zhEh5biwQoyoTGn8zuq2",
        "recipe_title": "Black-Bean Burgers ",
        "original_instructions": "Pulse 1 can beans in a food processor with mayonnaise, bread crumbs, cumin, oregano, and cayenne until a coarse purée forms. Transfer to a bowl and stir in cilantro and remaining can beans. Form mixture into 4 patties. Heat oil in a 12-inch heavy skillet over medium-high heat until it shimmers. Cook burgers until outsides are crisp and lightly browned, turning once, about 5 minutes total. Serve on buns.\nPulse 1 can beans in a food processor with mayonnaise, bread crumbs, cumin, oregano, and cayenne until a coarse purée forms. Transfer to a bowl and stir in cilantro and remaining can beans. Form mixture into 4 patties.\nHeat oil in a 12-inch heavy skillet over medium-high heat until it shimmers. Cook burgers until outsides are crisp and lightly browned, turning once, about 5 minutes total. Serve on buns.",
        "ingredients": [
            "2 (14-ounce) cans black beans, rinsed and drained, divided",
            "3 tablespoons mayonnaise",
            "1/3 cup plain dry bread crumbs",
            "2 teaspoons ground cumin",
            "1 teaspoon dried oregano, crumbled",
            "1/4 teaspoon cayenne",
            "1/4 cup finely chopped cilantro",
            "3 tablespoons vegetable oil",
            "4 soft hamburger buns",
            "Accompaniments: sour cream; salsa; lettuce"
        ],
        "step_by_step_instructions": [
            "Pulse 3.5 ounces of black beans in a food processor with 0.75 tablespoons of mayonnaise, 1.5 tablespoons of bread crumbs, 0.38 teaspoons of ground cumin, 0.19 teaspoons of dried oregano, and 0.05 teaspoons of cayenne until a coarse purée forms.",
            "Transfer the purée to a bowl and stir in 0.06 cups of finely chopped cilantro and 3.5 ounces of remaining black beans.",
            "Form the mixture into 1 patty.",
            "Heat 0.75 tablespoons of vegetable oil in a 12-inch heavy skillet over medium-high heat until it shimmers.",
            "Cook the burger until the outside is crisp and lightly browned, turning once, about 2.5 minutes total.",
            "Serve the burger on 1 soft hamburger bun."
        ],
        "processed_ingredients": [
            "7.00 oz black beans",
            "0.75 tbsp mayonnaise",
            "1.50 tbsp bread crumbs",
            "0.38 tsp ground cumin",
            "0.19 tsp dried oregano",
            "0.05 tsp cayenne",
            "0.06 cup cilantro",
            "0.75 tbsp vegetable oil",
            "1.00 soft hamburger bun"
        ],
        "pure_ingredients": [
            "black beans",
            "mayonnaise",
            "bread crumbs",
            "cumin",
            "oregano",
            "cayenne",
            "cilantro",
            "vegetable oil",
            "hamburger buns",
            "sour cream",
            "salsa",
            "lettuce"
        ],
        "cooking_time": "5 minutes",
        "required_tools": [
            "food processor",
            "bowl",
            "skillet"
        ]
    },
    {
        "recipe_id": "Sy82fR96fKUx/ytQ8.fm8vi5TkFpDYW",
        "recipe_title": "Pan Seared T-Bone Steak",
        "original_instructions": "Preheat the oven to 450 degrees F. A half-hour before cooking, remove steak from refrigerator.\nHeat a large skillet over high heat. Pat steak dry and season generously with salt and pepper. Add oil to hot skillet and when it begins to smoke add steak. Reduce heat slightly and cook steak until browned, about 4 minutes on each side. Transfer skillet to the oven. Roast until an instant-read thermometer inserted sideways into the steak registers 120 degrees F for medium-rare, about 6 to 8 minutes. Transfer steak to a cutting board and let it rest for 10 minutes. Cut steak from the bone and carve meat across the grain.",
        "ingredients": [
            "1 1/2 pounds bone-in T-bone steak",
            "Kosher salt and freshly ground black pepper",
            "1 tablespoon canola oil"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 450 degrees F.",
            "Remove the steak from the refrigerator 30 minutes before cooking.",
            "Heat a large skillet over high heat.",
            "Pat the steak dry and season generously with salt and pepper.",
            "Add oil to the hot skillet. When it begins to smoke, add the steak.",
            "Reduce heat slightly and cook the steak until browned, about 4 minutes on each side.",
            "Transfer the skillet to the oven.",
            "Roast until an instant-read thermometer inserted sideways into the steak registers 120 degrees F for medium-rare, about 6 to 8 minutes.",
            "Transfer the steak to a cutting board and let it rest for 10 minutes.",
            "Cut the steak from the bone and carve the meat across the grain."
        ],
        "processed_ingredients": [
            "0.75 lb T-bone steak",
            "0.50 tsp salt",
            "0.50 tsp black pepper",
            "0.50 tbsp canola oil"
        ],
        "pure_ingredients": [
            "steak",
            "salt",
            "pepper",
            "oil"
        ],
        "cooking_time": "58 minutes",
        "required_tools": [
            "oven",
            "skillet",
            "thermometer",
            "cutting board",
            "knife"
        ]
    },
    {
        "recipe_id": "Dr8M9gq99YYpcIkUYgJZDguJCN6ny4G",
        "recipe_title": "Blueberry Muffins",
        "original_instructions": "Cream butter and sugar. Add milk and egg and beat until smooth. Sift together flour, baking powder and salt. Add to creamed mixture. Mix until moistened. Toss blueberries with flour and fold into batter. Fill a well-greased muffin pan 2/3 full with the batter. Bake at 400 degrees for 20 minutes.",
        "ingredients": [
            "3/4 cup butter",
            "1 cup sugar",
            "3/4 cup milk",
            "1 egg",
            "1 3/4 cup sifted flour",
            "2 1/2 teaspoons baking powder",
            "1/2 teaspoon salt",
            "1 cup blueberries",
            "1 tablespoon flour"
        ],
        "step_by_step_instructions": [
            "Cream 0.19 cup butter and 0.25 cup sugar.",
            "Add 0.19 cup milk and 0.25 egg, then beat until smooth.",
            "Sift together 0.44 cup flour, 0.63 teaspoon baking powder, and 0.13 teaspoon salt.",
            "Add the sifted mixture to the creamed mixture and mix until moistened.",
            "Toss 0.25 cup blueberries with 0.25 tablespoon flour and fold into the batter.",
            "Fill a well-greased muffin pan 2/3 full with the batter.",
            "Bake at 400 degrees for 20 minutes."
        ],
        "processed_ingredients": [
            "0.19 cup butter",
            "0.25 cup sugar",
            "0.19 cup milk",
            "0.25 egg",
            "0.44 cup flour",
            "0.63 teaspoon baking powder",
            "0.13 teaspoon salt",
            "0.25 cup blueberries",
            "0.25 tablespoon flour"
        ],
        "pure_ingredients": [
            "butter",
            "sugar",
            "milk",
            "egg",
            "flour",
            "baking powder",
            "salt",
            "blueberries"
        ],
        "cooking_time": "20 minutes",
        "required_tools": [
            "muffin pan",
            "oven",
            "mixing bowl",
            "sifter",
            "spoon"
        ]
    },
    {
        "recipe_id": "LbJoVWDY/xeh4XfjuCmxmKWhQWPgbLq",
        "recipe_title": "Microwave Spiced Cauliflower \"Couscous\" with Raisins and Coconut",
        "original_instructions": "Spread the coconut out in an 8-inch square baking dish and microwave on high in 1-minute intervals, tossing in between, until the coconut is light golden brown, 6 to 8 minutes. Transfer the coconut to a small bowl and reserve. Wipe out the baking dish.\nTrim the cauliflower florets, cutting away as much stem as possible and discarding. In 2 batches, break up the florets into a food processor and pulse until the mixture resembles grains of couscous, until you have about 4 cups total. Put the cauliflower grains into the baking dish along with the ginger, coriander, cumin, turmeric, 1 tablespoon olive oil, 1 1/2 teaspoons salt and 1/4 teaspoon black pepper. Stir well, making sure that the cauliflower is coated in the spices. Cover the bowl tightly with plastic wrap and microwave on high for 3 minutes. Peel back the plastic wrap, being careful not to burn yourself with the steam, and check if the cauliflower is crisp-tender. If not, stir, cover again and cook for an additional 1 to 2 minutes.\nOnce the cauliflower couscous is cooked, fold in the raisins, the remaining tablespoon olive oil and half of the coconut. Transfer the mixture to a serving bowl and garnish with the cilantro and the remaining coconut. Serve immediately or at room temperature.",
        "ingredients": [
            "1/2 cup unsweetened shredded coconut",
            "1 large head cauliflower (about 2 pounds), separated into 1-inch florets",
            "1 teaspoon finely minced ginger",
            "1/4 teaspoon ground coriander",
            "1/4 teaspoon ground cumin",
            "1/4 teaspoon ground turmeric",
            "2 tablespoons extra-virgin olive oil",
            "Kosher salt and freshly ground black pepper",
            "1/3 cup raisins",
            "1/4 cup cilantro leaves (not packed)"
        ],
        "step_by_step_instructions": [
            "Spread approximately 0.06 cup of shredded coconut in a baking dish and microwave on high in 1-minute intervals, tossing in between, until the coconut is light golden brown, about 6 to 8 minutes.",
            "Transfer the coconut to a small bowl and reserve. Wipe out the baking dish.",
            "Trim about 0.25 pound of cauliflower florets, cutting away as much stem as possible.",
            "Break up the florets into a food processor and pulse until the mixture resembles grains of couscous, aiming for about 0.5 cup total.",
            "Put the cauliflower grains into the baking dish along with 0.13 teaspoon finely minced ginger, 0.03 teaspoon ground coriander, 0.03 teaspoon ground cumin, 0.03 teaspoon ground turmeric, 0.25 tablespoon olive oil, 0.19 teaspoon salt, and 0.03 teaspoon black pepper.",
            "Stir well, ensuring that the cauliflower is coated in the spices.",
            "Cover the dish tightly with plastic wrap and microwave on high for 3 minutes.",
            "Peel back the plastic wrap carefully to check if the cauliflower is crisp-tender. If not, stir, cover again, and cook for an additional 1 to 2 minutes.",
            "Once cooked, fold in approximately 0.04 cup raisins, 0.25 tablespoon olive oil, and half of the toasted coconut.",
            "Transfer the mixture to a serving bowl and garnish with about 0.03 cup cilantro leaves and the remaining coconut.",
            "Serve immediately or at room temperature."
        ],
        "processed_ingredients": [
            "0.06 cup shredded coconut",
            "0.25 pound cauliflower",
            "0.13 teaspoon ginger",
            "0.03 teaspoon ground coriander",
            "0.03 teaspoon ground cumin",
            "0.03 teaspoon ground turmeric",
            "0.50 tablespoon olive oil",
            "0.19 teaspoon salt",
            "0.03 teaspoon black pepper",
            "0.04 cup raisins",
            "0.03 cup cilantro leaves"
        ],
        "pure_ingredients": [
            "coconut",
            "cauliflower",
            "ginger",
            "coriander",
            "cumin",
            "turmeric",
            "olive oil",
            "salt",
            "black pepper",
            "raisins",
            "cilantro"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "microwave",
            "8-inch square baking dish",
            "food processor",
            "small bowl",
            "plastic wrap"
        ]
    },
    {
        "recipe_id": "uEZTJHsEDtlWDZlDA5XsE/lShXZpKra",
        "recipe_title": "Yorkshire Pudding",
        "original_instructions": "In a large bowl, combine flour, salt, and pepper. Make a well in the center and add eggs and add 1/4 of the milk. Using a whisk, combine the eggs and milk, then incorporate the flour; beginning with the inner rim of the well. Continue whisking until a smooth, stiff batter forms. Stir in half of the remaining milk. Cover with plastic wrap and let stand at room temperature for 30 minutes.\nHeat oven to 400 degrees F. Place 12 (3/4-cup) capacity muffin tins in oven until very hot, about 5 minutes.\nStir enough of the remaining milk into the batter until it is the consistency of heavy cream. Transfer 1 to 2 teaspoons of drippings into each muffin tin. Pour the batter in the muffin tins, filling them about 1/3 full; the batter should sizzle in the hot drippings. Return to oven and bake until puffed, browned, and crisp, 25 to 30 minutes. Yorkshire pudding is best served hot from the oven, but they can be kept warm in a low oven for about 15 minutes.",
        "ingredients": [
            "2 cups all-purpose flour",
            "1 teaspoon coarse salt",
            "Freshly ground pepper",
            "4 large eggs",
            "3 to 3 1/2 cups whole milk",
            "6 to 8 tablespoons drippings from roasting pan, vegetable oil or lard"
        ],
        "step_by_step_instructions": [
            "In a large bowl, combine 0.33 cup all-purpose flour, a pinch of salt, and a dash of freshly ground pepper.",
            "Make a well in the center and add 1 large egg and 1/4 cup of whole milk.",
            "Using a whisk, combine the egg and milk, then incorporate the flour, beginning with the inner rim of the well.",
            "Continue whisking until a smooth, stiff batter forms.",
            "Stir in an additional 1/4 cup of whole milk.",
            "Cover the bowl with plastic wrap and let stand at room temperature for 30 minutes.",
            "Heat the oven to 400 degrees F.",
            "Place a muffin tin with a capacity of 3/4-cup in the oven until very hot, about 5 minutes.",
            "Stir enough of the remaining milk into the batter until it is the consistency of heavy cream.",
            "Transfer 1 teaspoon of vegetable oil into each muffin tin.",
            "Pour the batter into the muffin tins, filling them about 1/3 full; the batter should sizzle in the hot oil.",
            "Return to the oven and bake until puffed, browned, and crisp, 25 to 30 minutes."
        ],
        "processed_ingredients": [
            "0.33 cup all-purpose flour",
            "0.25 teaspoon salt",
            "0.25 teaspoon pepper",
            "1 large egg",
            "0.50 cup whole milk",
            "1 teaspoon vegetable oil"
        ],
        "pure_ingredients": [
            "flour",
            "salt",
            "pepper",
            "eggs",
            "milk",
            "vegetable oil"
        ],
        "cooking_time": "65 minutes",
        "required_tools": [
            "large bowl",
            "whisk",
            "plastic wrap",
            "oven",
            "muffin tin"
        ]
    },
    {
        "recipe_id": "HERHvpAeijG15XkVikq7iMsjP0beW2u",
        "recipe_title": "Rye Bread Stuffing ",
        "original_instructions": "Preheat oven to 350°F with racks in upper and lower thirds. Toast bread chunks in two 4-sided sheet pans in oven until lightly browned, about 15 minutes, then transfer to a large bowl. Leave oven on. Meanwhile, cook caraway seeds in 6 tablespoons butter in a 12-inch heavy skillet over medium-high heat, stirring, until fragrant, about 2 minutes. Add celery, apples, onion, garlic, 3/4 teaspoon salt, and 1/2 teaspoon pepper and sauté until vegetables are softened and starting to brown, 12 to 15 minutes. Add stock, scraping up any brown bits. Add mixture to bread cubes, tossing to coat. Transfer to a 3-quart baking dish and dot with remaining 2 tablespoons butter. Bake, uncovered, in upper third of oven until stuffing is crisp on top, about 45 minutes.\nPreheat oven to 350°F with racks in upper and lower thirds.\nToast bread chunks in two 4-sided sheet pans in oven until lightly browned, about 15 minutes, then transfer to a large bowl. Leave oven on.\nMeanwhile, cook caraway seeds in 6 tablespoons butter in a 12-inch heavy skillet over medium-high heat, stirring, until fragrant, about 2 minutes. Add celery, apples, onion, garlic, 3/4 teaspoon salt, and 1/2 teaspoon pepper and sauté until vegetables are softened and starting to brown, 12 to 15 minutes. Add stock, scraping up any brown bits. Add mixture to bread cubes, tossing to coat.\nTransfer to a 3-quart baking dish and dot with remaining 2 tablespoons butter. Bake, uncovered, in upper third of oven until stuffing is crisp on top, about 45 minutes.\nWhat to drink: Josmeyer Les Folastries Gewürztraminer '05\nJosmeyer Les Folastries Gewürztraminer '05",
        "ingredients": [
            "1 (1-pound) unsliced loaf rye bread, cut into 1-inch chunks",
            "1 teaspoon caraway seeds",
            "1 stick unsalted butter, divided",
            "3 cups chopped celery",
            "2 Golden Delicious apples, peeled and chopped",
            "1 medium onion, finely chopped",
            "5 garlic cloves, finely chopped",
            "2 cups chicken stock or reduced-sodium chicken broth"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350°F with racks in upper and lower thirds.",
            "Cut approximately 0.12 lb of rye bread into 1-inch chunks.",
            "Toast the bread chunks on a 4-sided sheet pan in the oven until lightly browned, about 15 minutes. Transfer to a large bowl.",
            "In a 12-inch heavy skillet, cook 0.12 tsp of caraway seeds in 0.75 tbsp of butter over medium-high heat, stirring, until fragrant, about 2 minutes.",
            "Add 0.38 cups of chopped celery, 0.25 of a peeled and chopped Golden Delicious apple, 0.12 of a finely chopped medium onion, 0.62 of a finely chopped garlic clove, 0.09 tsp of salt, and 0.06 tsp of pepper. Sauté until vegetables are softened and starting to brown, about 12 to 15 minutes.",
            "Add 0.25 cups of chicken stock, scraping up any brown bits.",
            "Add the mixture to the toasted bread cubes, tossing to coat.",
            "Transfer to a small baking dish and dot with 0.25 tbsp of the remaining butter.",
            "Bake uncovered in the upper third of the oven until the stuffing is crisp on top, about 45 minutes."
        ],
        "processed_ingredients": [
            "0.12 lb rye bread",
            "0.12 tsp caraway seeds",
            "1 tbsp unsalted butter",
            "0.38 cups celery",
            "0.25 Golden Delicious apple",
            "0.12 medium onion",
            "0.62 cloves garlic",
            "0.25 cups chicken stock",
            "0.09 tsp salt",
            "0.06 tsp pepper"
        ],
        "pure_ingredients": [
            "rye bread",
            "caraway seeds",
            "butter",
            "celery",
            "apple",
            "onion",
            "garlic",
            "chicken stock",
            "salt",
            "pepper"
        ],
        "cooking_time": "75 minutes",
        "required_tools": [
            "oven",
            "sheet pan",
            "large bowl",
            "heavy skillet",
            "baking dish"
        ]
    },
    {
        "recipe_id": "BjPXEp4Oqpp.riJi80i/KqyAXXCkyZK",
        "recipe_title": "Grilled Eggplant Roulades Olivo ",
        "original_instructions": "Prepare grill. Trim eggplant and cut lengthwise into 1/4-inch-thick slices. Using a total of 3 tablespoons oil for eggplant, lightly brush both sides of each slice with some oil and grill in batches on an oiled rack set 5 to 6 inches over glowing coals until golden brown and tender, about 3 minutes on each side. (Alternatively, broil eggplant under a preheated broiler about 3 inches from heat.) With a metal spatula transfer eggplant as grilled to a platter and keep warm, loosely covered. Cut an X in blossom end of each plum tomato. Have ready a bowl of ice and cold water. In a small saucepan of boiling water blanch tomatoes 10 seconds and transfer with a slotted spoon to ice water to stop cooking. Peel tomatoes and seed. Chop blanched and dried tomatoes. Mince onion and garlic. In a 10-inch heavy skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and sauté onion, garlic, and pine nuts, stirring, until onion and pine nuts are golden. Add blanched and dried tomatoes and herbs and sauté, stirring, until liquid tomatoes give off is evaporated, about 3 minutes. Add goat cheese and Parmesan and cook, stirring, just until melted. Remove skillet from heat and season filling with salt and pepper. Put a generous tablespoon filling at wide end of an eggplant slice and roll up slice toward narrow end, enclosing filling. Make more roulades in same manner and arrange on a warm platter.\nPrepare grill.\nTrim eggplant and cut lengthwise into 1/4-inch-thick slices. Using a total of 3 tablespoons oil for eggplant, lightly brush both sides of each slice with some oil and grill in batches on an oiled rack set 5 to 6 inches over glowing coals until golden brown and tender, about 3 minutes on each side. (Alternatively, broil eggplant under a preheated broiler about 3 inches from heat.) With a metal spatula transfer eggplant as grilled to a platter and keep warm, loosely covered.\nCut an X in blossom end of each plum tomato. Have ready a bowl of ice and cold water. In a small saucepan of boiling water blanch tomatoes 10 seconds and transfer with a slotted spoon to ice water to stop cooking. Peel tomatoes and seed. Chop blanched and dried tomatoes. Mince onion and garlic.\nIn a 10-inch heavy skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and sauté onion, garlic, and pine nuts, stirring, until onion and pine nuts are golden. Add blanched and dried tomatoes and herbs and sauté, stirring, until liquid tomatoes give off is evaporated, about 3 minutes. Add goat cheese and Parmesan and cook, stirring, just until melted. Remove skillet from heat and season filling with salt and pepper.\nPut a generous tablespoon filling at wide end of an eggplant slice and roll up slice toward narrow end, enclosing filling. Make more roulades in same manner and arrange on a warm platter.",
        "ingredients": [
            "1 medium eggplant",
            "4 tablespoons olive oil",
            "3 plum tomatoes",
            "5 dried tomatoes packed in oil",
            "1 small onion",
            "1 garlic clove",
            "2 tablespoons pine nuts",
            "2 tablespoons finely chopped mixed fresh herbs (such as basil, mint, parsley, and tarragon leaves)",
            "1/4 cup crumbled soft mild goat cheese (about 2 ounces)",
            "1 tablespoon freshly grated Parmesan"
        ],
        "step_by_step_instructions": [
            "Prepare the grill or preheat a broiler.",
            "Trim 0.25 lb eggplant and cut lengthwise into 1/4-inch-thick slices.",
            "Using 0.75 tablespoon olive oil, lightly brush both sides of each slice with oil.",
            "Grill eggplant slices on an oiled rack set 5 to 6 inches over glowing coals until golden brown and tender, about 3 minutes on each side, or broil about 3 inches from heat.",
            "Transfer grilled eggplant to a platter and keep warm, loosely covered.",
            "Cut an X in blossom end of 0.75 plum tomato.",
            "Have ready a bowl of ice and cold water. In a small saucepan of boiling water, blanch tomatoes for 10 seconds and transfer with a slotted spoon to ice water to stop cooking.",
            "Peel and seed the blanched tomatoes.",
            "Chop the blanched and 0.75 dried tomato.",
            "Mince 0.25 small onion and 0.25 garlic clove.",
            "In a 10-inch heavy skillet, heat 0.25 tablespoon olive oil over moderately high heat until hot but not smoking.",
            "Sauté onion, garlic, and 0.25 tablespoon pine nuts, stirring, until onion and pine nuts are golden.",
            "Add blanched and dried tomatoes and 0.5 tablespoon finely chopped mixed fresh herbs, and sauté, stirring, until liquid tomatoes give off is evaporated, about 3 minutes.",
            "Add 0.06 cup crumbled goat cheese and 0.25 tablespoon Parmesan and cook, stirring, just until melted.",
            "Remove skillet from heat and season filling with salt and pepper.",
            "Put a generous tablespoon of filling at the wide end of an eggplant slice and roll up slice toward narrow end, enclosing filling.",
            "Make more roulades in the same manner and arrange on a warm platter."
        ],
        "processed_ingredients": [
            "0.25 lb eggplant",
            "1 tablespoon olive oil",
            "0.75 plum tomato",
            "0.75 dried tomato",
            "0.25 small onion",
            "0.25 garlic clove",
            "0.25 tablespoon pine nuts",
            "0.5 tablespoon finely chopped mixed fresh herbs",
            "0.06 cup crumbled goat cheese",
            "0.25 tablespoon Parmesan"
        ],
        "pure_ingredients": [
            "eggplant",
            "olive oil",
            "tomato",
            "onion",
            "garlic",
            "pine nuts",
            "herbs",
            "goat cheese",
            "Parmesan"
        ],
        "cooking_time": "45 minutes",
        "required_tools": [
            "grill or broiler",
            "knife",
            "cutting board",
            "brush",
            "platter",
            "bowl",
            "saucepan",
            "slotted spoon",
            "skillet",
            "spatula"
        ]
    },
    {
        "recipe_id": "/jsWyN1MURqvFKYKJ3QkHvWbADzQH8m",
        "recipe_title": "Flank Steak Roulade over Arugula and Sweet and Sour Onions",
        "original_instructions": "For the roulade: Preheat oven to 350 degrees F.\nCoat the portobello mushrooms in oil, salt and black pepper and place on a sheet pan. Roast in the oven for 15 minutes or until fully cooked. Chill and thinly slice.\nWorking on a cutting board, spread out a piece of the sliced flank steak. Place a thin line of spinach across the edge of the flank meat. Repeat with the sliced portobello mushrooms and sweet and sour onions. Firmly roll the ingredients up in the flank steak. Secure with a toothpick. Repeat until all the flank meat is stuffed and rolled. Coat a large saute pan with cooking oil and place over high heat. Season each flank steak roulade with salt and pepper. Sear each roulade in the pan by placing the seam side down to ensure closure. Cook until browned on all sides and cooked to desired doneness, about 6 minutes. Slice each roulade on the bias into 1-inch pieces. Serve over arugula and sweet and sour red onions.\nFor the onions: In a saute pan over medium heat, add the cooking oil and sliced onions. Cook for a few moments while stirring, until the onions start to turn translucent. Add the sugar and salt and continue to cook until onions begin to soften, but are still firm to the touch. Add the red wine vinegar and cook until almost all the vinegar has been reduced. Turn the onions out on to a sheet pan to cool.",
        "ingredients": [
            "6 medium portobello mushrooms, stemmed and gilled",
            "Salt and fresh ground black pepper",
            "2 pounds flank steak, thinly sliced on the diagonal against the grain (a.k.a carne asada)",
            "2 cups spinach, collapsed",
            "1 cup sweet and sour onions, plus more for serving, recipe follows",
            "1/4 cup cooking oil",
            "4 cups arugula leaves",
            "1/4 cup cooking oil",
            "5 red onions, sliced",
            "4 tablespoons sugar",
            "1 tablespoon salt",
            "3/4 cup red wine vinegar"
        ],
        "step_by_step_instructions": [
            "Preheat oven to 350 degrees F.",
            "Coat approximately 1 medium portobello mushroom in oil, salt, and black pepper, and place on a sheet pan. Roast in the oven for 15 minutes or until fully cooked. Chill and thinly slice.",
            "Spread out about 5 ounces of sliced flank steak on a cutting board.",
            "Place a thin line of roughly 1/3 cup of spinach across the edge of the flank steak.",
            "Add a few slices of the roasted portobello mushrooms and about 2 tablespoons of sweet and sour onions.",
            "Firmly roll the ingredients up in the flank steak and secure with a toothpick.",
            "Repeat the rolling process if more portions are required.",
            "Coat a large sauté pan with cooking oil and place over high heat.",
            "Season the roulade with salt and black pepper.",
            "Sear the roulade in the pan by placing the seam side down to ensure closure.",
            "Cook until browned on all sides and to desired doneness, about 6 minutes.",
            "Slice the roulade on the bias into 1-inch pieces.",
            "Serve over about 1 cup of arugula and additional sweet and sour onions if desired.",
            "For the sweet and sour onions: In a sauté pan over medium heat, add roughly 1 tablespoon of cooking oil and about 1 onion sliced.",
            "Cook for a few moments while stirring until the onions start to turn translucent.",
            "Add about 0.8 tablespoons of sugar and a bit of salt and continue to cook until onions begin to soften but are still firm to the touch.",
            "Add about 2.5 tablespoons of red wine vinegar and cook until almost all the vinegar has been reduced.",
            "Turn the onions out onto a sheet pan to cool."
        ],
        "processed_ingredients": [
            "1.00 medium portobello mushroom",
            "5.00 oz flank steak",
            "0.33 cup spinach",
            "2.00 tbsp sweet and sour onions",
            "1.00 tbsp cooking oil",
            "1.00 cup arugula",
            "1.00 onion",
            "0.80 tbsp sugar",
            "0.16 tbsp salt",
            "2.50 tbsp red wine vinegar"
        ],
        "pure_ingredients": [
            "mushroom",
            "salt",
            "black pepper",
            "beef",
            "spinach",
            "onion",
            "cooking oil",
            "arugula",
            "sugar",
            "vinegar"
        ],
        "cooking_time": "40 minutes",
        "required_tools": [
            "oven",
            "sheet pan",
            "cutting board",
            "toothpick",
            "sauté pan"
        ]
    },
    {
        "recipe_id": "SUHW9hh20KTtJQn8kGVG7cjmmPvwFG2",
        "recipe_title": "Chicken Sandwiches with Chive Butter ",
        "original_instructions": "Combine butter, chives, mustard and cayenne in small bowl; blend well. Season to taste with salt and pepper. (Butter can be made 1 day ahead. Cover; chill. Bring to room temperature before continuing.) Spread chive butter on 1 side of each bread slice. Place chicken on buttered side of 2 bread slices. Top chicken with some watercress. Press remaining 2 bread slices, buttered side down, onto watercress. Cut each sandwich into 4 pieces. Arrange any remaining watercress on 2 plates. Top with sandwiches.\nCombine butter, chives, mustard and cayenne in small bowl; blend well. Season to taste with salt and pepper. (Butter can be made 1 day ahead. Cover; chill. Bring to room temperature before continuing.)\nSpread chive butter on 1 side of each bread slice. Place chicken on buttered side of 2 bread slices. Top chicken with some watercress. Press remaining 2 bread slices, buttered side down, onto watercress. Cut each sandwich into 4 pieces. Arrange any remaining watercress on 2 plates. Top with sandwiches.",
        "ingredients": [
            "3 tablespoons butter, room temperature",
            "1 1/2 tablespoons minced fresh chives or green onion tops",
            "1/2 teaspoon Dijon mustard",
            "Pinch of cayenne pepper",
            "4 large slices whole wheat sandwiches bread",
            "8 ounces purchased roast chicken, thinly sliced",
            "1 small bunch watercress, thick stems trimmed"
        ],
        "step_by_step_instructions": [
            "Combine 0.75 tablespoons of butter, 0.38 tablespoons of minced fresh chives, 0.13 teaspoons of Dijon mustard, and a pinch of cayenne pepper in a small bowl; blend well.",
            "Season the butter mixture to taste with salt and pepper.",
            "Spread the chive butter on one side of each of the two slices of whole wheat sandwich bread.",
            "Place 2 ounces of thinly sliced roast chicken on the buttered side of one bread slice.",
            "Top the chicken with a small amount of watercress.",
            "Press the second bread slice, buttered side down, onto the watercress.",
            "Cut the sandwich into 4 pieces.",
            "Arrange any remaining watercress on a plate and top with the sandwich pieces."
        ],
        "processed_ingredients": [
            "0.75 tablespoon butter",
            "0.38 tablespoon fresh chives",
            "0.13 teaspoon Dijon mustard",
            "0.01 teaspoon cayenne pepper",
            "2 slices whole wheat sandwiches bread",
            "2 ounce roast chicken",
            "15 g watercress"
        ],
        "pure_ingredients": [
            "butter",
            "chives",
            "mustard",
            "cayenne",
            "bread",
            "chicken",
            "watercress",
            "salt",
            "pepper"
        ],
        "cooking_time": "10 minutes",
        "required_tools": [
            "small bowl",
            "knife",
            "plate"
        ]
    },
    {
        "recipe_id": "LAkmYziTR8qjSUauy.kCHF/nnPouBUm",
        "recipe_title": "Crispy Potato Cakes with Farmer Cheese, Scallion, Black Pepper and Kale Chips",
        "original_instructions": "Preheat the oven to 350 degrees F.\nLightly drizzle the kale with canola oil and season with salt and pepper. Lay on a baking sheet in a single layer, and bake until just crisp, 12 to 15 minutes.\nReduce the oven to 250 degrees F.\nMeanwhile, mix the onions, potatoes, egg and 3 tablespoons of the flour in a large bowl until combined. If the mixture feels very wet, add a little more of the flour.\nHeat 1/2 inch canola oil in a large high-sided saute pan over medium heat until it begins to sizzle. Spoon 1 heaping tablespoon of the potatoes per pancake into the pan, spreading into a 2-inch round with a fork. Cook until the bottom is browned, about 5 minutes, and then flip and cook 5 minutes more. Transfer to paper towels to drain and season with salt. Keep the pancakes warm on a wire rack set in a shallow baking pan in the oven.\nCombine the cheese, parsley and green onions in a small bowl and season with salt and pepper.\nPlace the pancakes on a serving platter or cutting board, top each with a dollop of the cheese, and garnish with the kale chips.",
        "ingredients": [
            "1 pound kale, stemmed",
            "Canola oil",
            "Kosher salt and freshly ground black pepper",
            "1/4 cup grated Spanish onion",
            "2 or 3 russet potatoes (1 pound), peeled, coarsely grated, and squeezed dry",
            "1 large egg, lightly whisked",
            "1/4 cup all-purpose flour",
            "1 1/2 cups fresh farmer cheese",
            "1/4 cup fresh parsley, finely chopped",
            "2 green onions, dark and pale green parts finely chopped"
        ],
        "step_by_step_instructions": [
            "Preheat the oven to 350 degrees F.",
            "Lightly drizzle approximately 2 ounces of kale with canola oil and season with a pinch of salt and pepper. Lay on a baking sheet in a single layer and bake until just crisp, 12 to 15 minutes.",
            "Reduce the oven to 250 degrees F.",
            "In a large bowl, mix about 1 tablespoon of grated Spanish onion, 5 ounces of grated and dried russet potatoes, 1/4 of a large egg (equivalent to about 12 grams), and 1 tablespoon of flour until combined. If the mixture feels very wet, add a little more flour.",
            "Heat 1/2 inch of canola oil in a large high-sided sauté pan over medium heat until it begins to sizzle.",
            "Spoon 1 heaping tablespoon of the potato mixture per pancake into the pan, spreading into a 2-inch round with a fork. Cook until the bottom is browned, about 5 minutes, and then flip and cook 5 minutes more.",
            "Transfer the pancakes to paper towels to drain and season with a pinch of salt. Keep the pancakes warm on a wire rack set in a shallow baking pan in the oven.",
            "In a small bowl, combine approximately 5 ounces of farmer cheese, 1 tablespoon of finely chopped parsley, and 1 tablespoon of finely chopped green onions. Season with a pinch of salt and pepper.",
            "Place the pancakes on a serving platter or cutting board, top each with a dollop of the cheese mixture, and garnish with the kale chips."
        ],
        "processed_ingredients": [
            "2.00 oz kale",
            "1.00 tbsp canola oil",
            "0.50 tsp salt",
            "0.50 tsp black pepper",
            "1.00 tbsp grated Spanish onion",
            "5.00 oz russet potatoes",
            "12.00 g egg",
            "1.00 tbsp all-purpose flour",
            "5.00 oz farmer cheese",
            "1.00 tbsp parsley",
            "1.00 tbsp green onions"
        ],
        "pure_ingredients": [
            "kale",
            "canola oil",
            "salt",
            "black pepper",
            "Spanish onion",
            "potato",
            "egg",
            "flour",
            "farmer cheese",
            "parsley",
            "onion"
        ],
        "cooking_time": "35 minutes",
        "required_tools": [
            "oven",
            "baking sheet",
            "large bowl",
            "saute pan",
            "paper towels",
            "wire rack",
            "shallow baking pan",
            "small bowl",
            "serving platter",
            "cutting board"
        ]
    }
]