{
    "Au1K9ZmKOFRP7P8Je0SFRV9ZC/Q0Mwa": {
        "instructions": "Heat oil in a large straight-sided skillet or a Dutch oven. Season chicken pieces with salt and pepper and add them to hot oil to sear. Remove to a plate.\nSaute onion until soft then add turmeric, crushed red pepper flakes, apricots, olives, lemon zest and chicken stock. Stir and cook for a few minutes.\nReturn chicken to pan, bring to a boil and then partially cover and lower to a simmer. Simmer for 20 more minutes. Tear fresh cilantro over chicken before serving.",
        "ingredients": [
            "1/8 cup olive oil",
            "1 (4-lb.) chicken, cut into 10 pieces",
            "1 cup dried apricots",
            "1 cup crushed, pitted green olives",
            "1 red onion, cut into eighths",
            "1 Tbs. crushed red pepper flakes",
            "1 Tbs. cumin",
            "1 cup chicken stock",
            "zest of 1 lemon",
            "1/2 bunch fresh cilantro",
            "salt and pepper to taste"
        ],
        "title": "Chicken Tajine",
        "picture_link": null
    },
    "Y2O9LUGRWyRvuUQlExFDKMuFB36dXyC": {
        "instructions": "Before cooking the rice, rinse several times in running water until the water runs clear. Drain in a colander for about 1 hour. Cook on the stovetop or in an electric rice cooker according to package directions.\nIn a small saucepan over low heat, combine vinegar, sugar and salt. Stir gently to dissolve salt and sugar. Cool to room temperature.\nWhile the rice is still warm, transfer to a large non-reactive bowl. Gradually drizzle the vinegar mixture over the rice, fanning the rice as you go. Use a rice paddle to mix gently without mashing the grains. Keep the rice covered with a damp cloth at room temperature until ready to make sushi. Do not refrigerate.",
        "ingredients": [
            "3 cups short-grain white rice",
            "1/4 cup rice wine vinegar",
            "1/4 cup sugar",
            "1 teaspoon salt"
        ],
        "title": "Sushi Rice",
        "picture_link": "iUIbFrvH5xElQ3MTGJkAI2kiiuZNxOu"
    },
    "3npyGhq/bn2XM.CdHzMhyLQtJDyDfX2": {
        "instructions": "Preheat oven to 350 degrees F.\nTake a 2-ounce piece of meat and dip in oil on both sides then press in bread crumbs to coat on both sides. Roll firmly and place in an oiled 2-inch deep casserole dish side by side with sides touching. When all are rolled, place one bay leaf and a half of a onion ring in between each rolled spidini. Place dish uncovered in the oven for 15 minutes. Remove from the oven and let sit. Cut spidini's into bite size portions discarding the bay leaves.",
        "ingredients": [
            "1 pound veal or beef (bottom round), cut into 2-ounce slices",
            "1/2 cup seasoned bread crumbs",
            "Dried bay leaves, 1 for every 2 spidini's",
            "1 large onion, cut in rings",
            "1/2 cup extra-virgin olive oil",
            "Salt and pepper"
        ],
        "title": "Spidini's",
        "picture_link": null
    },
    "IZ3VUqLWTm.a84vvtVRiiBiaMAQtKn.": {
        "instructions": "Whisk the buttermilk, mayonnaise, Worcestershire sauce, onion powder, onion flakes, garlic powder, chives, dill and parsley in a bowl; add 1/2 teaspoon salt and 1/4 teaspoon pepper.\nPhotograph by Andrew McCaul",
        "ingredients": [
            "2/3 cup buttermilk",
            "1/4 cup mayonnaise",
            "2 teaspoons Worcestershire sauce",
            "1/2 teaspoon onion powder",
            "1/2 teaspoon dried onion flakes",
            "1/4 teaspoon garlic powder",
            "1 tablespoon chopped fresh chives",
            "1 tablespoon chopped fresh dill",
            "1 tablespoon chopped fresh parsley",
            "Kosher salt and freshly ground pepper"
        ],
        "title": "Light Ranch Dressing",
        "picture_link": "9yEwvks5Gqd6A9rcG3icJP4iO1Zzz2O"
    },
    "Ox3.IN5KB7keCov7eArGTSxuBvcMc4W": {
        "instructions": "Preheat oven to 425 degrees F.\nIn a large bowl, mix together olive oil, paprika and cinnamon. Toss the potato strips into mixture, to coat well, and spread onto baking sheet in a single layer. Sprinkle with salt and brown sugar.\nBake for 30 minutes, turning every 10 minutes.",
        "ingredients": [
            "4 tablespoons olive oil",
            "1 teaspoon paprika",
            "1 teaspoon ground cinnamon",
            "2 sweet potatoes, peeled and cut lengthwise into 1/2-inch wide strips",
            "1/2 teaspoon salt",
            "2 tablespoons brown sugar"
        ],
        "title": "Memphis Sweet Potato Fries",
        "picture_link": "ja3DbBexqmWNQ7jenjtijygZeDtLiBC"
    },
    "hcIAEo7v1aBEcOaQc/QV7flM06rfcnC": {
        "instructions": "In a saucepan, combine the peaches, sugar and brandy. Cook over medium heat until peaches become tender, about 10 minutes. Remove peaches from the heat and refrigerate until completely cooled. Fold cooled fruit mixture into whipped cream. Refrigerate for several hours. Serve in chilled brandy snifter glasses. Garnish with a few sliced peaches.",
        "ingredients": [
            "2 cups peeled and sliced peaches",
            "1/4 cup sugar",
            "1/4 cup brandy",
            "2 cups whipped cream",
            "4 thin peach slices"
        ],
        "title": "Brandied Peach Fool",
        "picture_link": null
    },
    "UTGix.XDl3pFyho7UkHzFzgcswE6aDq": {
        "instructions": "Whip butter with an electric mixer until fluffy. Add the garlic, mustard, thyme, lemon juice, Old Bay, salt, pepper, and panko, and mix well. Line a small sheet pan with parchment paper or waxed paper and lay salmon, skin side down, on pan. Blot salmon with paper towels to remove any moisture. \"Crust\" the salmon while the butter is still soft, allowing a 1/4-inch crust. At this point, the salmon may be refrigerated (cover with plastic wrap after butter has hardened).\nPreheat the oven to 425 degrees F.\nBake for approximately 10 minutes for a still slightly pink fish. Use 2 long flat spatulas, coming in from either end, to lift the salmon off the paper and transfer to a serving platter.",
        "ingredients": [
            "1 pound butter",
            "1/4 cup minced garlic",
            "1 cup whole grain mustard",
            "1/4 cup chopped fresh thyme",
            "2 lemons, juiced",
            "2 tablespoons Old Bay seasoning",
            "2 tablespoons salt",
            "2 teaspoons freshly ground black pepper",
            "3 cups panko bread crumbs (Japanese bread crumbs) Do not substitute regular bread crumbs",
            "1 (3 to 4 pound) side of salmon, skin on, pin bones removed"
        ],
        "title": "Odyssey's Mustard Crusted Side of Salmon",
        "picture_link": null
    },
    "zcRPFkj1PngunfP24hASFNLzIG2Yspe": {
        "instructions": "Slice the tomatoes 1/4-inch thick. Lay them out in a shallow baking pan and sprinkle with salt. Place the tomato slices in a colander and allow time for the salt to pull the water out of the tomatoes, approximately 30 minutes. In a skillet, heat the oil for deep-frying over medium high heat. Dip the tomatoes into buttermilk, then dredge them in flour. Deep-fry until golden brown. Keep warm.\nMeanwhile, prepare Hollandaise Sauce.\nTo assemble each serving, place 2 fried tomatoes on a plate. Top with 2 strips of cooked bacon in a criss-cross fashion. Top bacon with a poached egg, spoon on Hollandaise Sauce.\nCombine all ingredients in the top of a double boiler, over boiling water. Stir until thick, approximately 3 minutes; set aside until ready to use. Do not reheat or cover the pot. Thin, if needed with a little chicken broth. Stir in the vinegar.",
        "ingredients": [
            "3 or 4 large firm green tomatoes",
            "Salt",
            "2 cups vegetable or peanut oil, for deep-frying",
            "1 cup buttermilk",
            "2 cups self-rising flour",
            "6 slices bacon, cut in half and cooked until crisp",
            "6 eggs, poached",
            "Hollandaise sauce, recipe follows",
            "2 egg yolks",
            "4 tablespoons cream",
            "2 large tablespoons butter",
            "1/2 lemon, juiced",
            "Pinch salt",
            "Pinch sugar",
            "Chicken broth, optional",
            "1 tablespoon white vinegar"
        ],
        "title": "Paula's Fried Green Tomato and Egg Hollandaise",
        "picture_link": "KSGz0R..v0BXlT9/uSe4kkvqSGN91WC"
    },
    "VUg1QdyE9kUr5Dt6p8DLolrPWuMFnku": {
        "instructions": "Make the Go-To Chocolate Chip Cookies, substituting 10 to 12 ounces dark chocolate chips for the semisweet chips, and folding in 1/4 cup finely chopped crystallized ginger with the chocolate chips. Top each cookie with a little chopped crystallized ginger. Bake as directed.",
        "ingredients": [],
        "title": "Ginger Dark Chocolate Chip",
        "picture_link": null
    },
    "gHKcpUySIHgUKxDgTl.jMCqlhC5os6O": {
        "instructions": "Cook potatoes until they are fork tender in boiling water. Drain the potatoes and cool them completely. Soak the raisins in hot water for 15 minutes and then drain. Combine all the ingredients and mix them thoroughly, but gently. Chill for 24 hours before serving.",
        "ingredients": [
            "2 cups medium diced sweet potatoes",
            "1/2 cup raisins",
            "2/3 cup finely diced red onion",
            "1/3 cup finely diced celery",
            "2 teaspoons freshly grated ginger",
            "1/2 cup mayonnaise",
            "1 tablespoon finely chopped parsley"
        ],
        "title": "Sweet Potato Salad",
        "picture_link": "HzJecK3Rh7o1w5VAy392jrf65kgI1ju"
    },
    "789fj81smq9yd4AHxqDLESZaZK6Rmci": {
        "instructions": "Heat a sauce pot over medium heat with a drizzle of olive oil. Gently cook mushrooms 5 minutes, season lightly with salt and pepper. Add a splash of sherry and cook off. Add beef stock and 1 cup water and simmer over low heat.\nWhisk eggs in a bowl with a pinch of salt and a splash of water, about 2 teaspoons. Sprinkle the flour while you whisk and add a dash of freshly grated nutmeg. Heat a drizzle of olive oil at a time in a small nonstick pan over medium-high heat. Add a small ladle of eggs to the pan and swirl it around. Flip the egg crepe after 30 to 40 seconds and cook 15 to 20 seconds on the other side. Stack up the egg crepes and when you've used the last, 6 to 8 crepes, roll the crepes and slice into 1-inch strips.\nDivide the crepe strips evenly among 4 bowls and top with 2 tablespoons chopped chives then ladle the beef and mushroom broth over top and serve immediately.",
        "ingredients": [
            "Extra-virgin olive oil, for drizzling",
            "8 white mushrooms, thinly sliced",
            "Salt and freshly ground black pepper",
            "A splash sherry",
            "4 cups beef stock",
            "1 cup water plus 2 teaspoons",
            "3 eggs",
            "2 teaspoons all-purpose flour",
            "Dash nutmeg",
            "2 tablespoons chopped fresh chives"
        ],
        "title": "Fritatten Soupe",
        "picture_link": "rXySq96y9HM.d5xhCjLK.j3OMNhNTiS"
    },
    "aU/P9BwePLHC4J0Etwgw3HHYyGQt34u": {
        "instructions": "Special equipment: 8 wooden skewers\nWhisk the maple syrup and mustard in a small bowl.\nCut the Cheddar into 8 cubes about 3/4-inch square. Core the apple but leave the peel, cut into 8 even pieces. Thread a piece of apple and a cheese cube onto each skewer.\nServe the cheese skewers with the mustard sauce for dipping.",
        "ingredients": [
            "2 tablespoons whole-grain mustard",
            "1 tablespoon regular or low-carb maple syrup",
            "4 ounces sharp Cheddar",
            "1/2 large apple, like Gala, Macoun, or MacIntosh"
        ],
        "title": "Cheddar Apple Skewers",
        "picture_link": null
    },
    "BNISIkNT2G4VcAAS6Rayqb7eH6MQ4RS": {
        "instructions": "In small bowl toss together mango, avocado, onion, cilantro, lemon juice, jalapeno pepper (if desired), salt and pepper.\n2. Spoon mango mixture on top of Keebler® Town House® Original crackers. Serve immediately.",
        "ingredients": [
            "1 1/2 cups finely chopped mango or fresh pineapple",
            "1 large avocado, halved, seeded, peeled, and finely chopped",
            "1 small onion, finely chopped",
            "2 tablespoons chopped fresh cilantro",
            "1 tablespoon lemon juice or lime juice",
            "1 tablespoon finely chopped jalapeno pepper (optional)",
            "1/8 teaspoon salt",
            "1/8 teaspoon pepper",
            "40 Keebler® Town House® Original crackers"
        ],
        "title": "Town Houseandreg; Crackers with Avocado and Mango Salsa",
        "picture_link": null
    },
    "6I.0OYUwQ6ogGBCTI0IJ3W6VPIFD6q.": {
        "instructions": "Melt butter in medium saucepan over medium heat and sweat onions and garlic. Add rum, bring to a boil and reduce to 1/4 cup. Add stock, bring to a boil and reduce heat. Whisk in ancho puree, molasses and pepper and simmer until reduced to 1 cup. Preheat grill. Season steaks on both sides with salt. Cook for 2-3 minutes on each side until medium-rare.",
        "ingredients": [
            "2 tablespoons unsalted butter",
            "1 red onion, finely chopped",
            "3 cloves garlic, finely chopped",
            "1 cup Myer's dark rum",
            "3 cups chicken stock",
            "2 tablespoons ancho puree",
            "1/4 cup molasses",
            "2 teaspoons coarsely ground black pepper",
            "4 filet mignon steaks, 8 ounces each",
            "Salt, to taste"
        ],
        "title": "Pan Sauteed Filet of Beef with Spicy Rum-Black Pepper Glaze and Wild Mushroom Salad",
        "picture_link": null
    },
    "S4.pKQOnbuizfvGU1C7KEmy70bnHq9e": {
        "instructions": "Mix pork, green onions, eggs and soy sauce in bowl. Season with salt and pepper. Lay out one lumpia wrapper on clean surface. Spread 1-2 tablespoons of mixture in a thin line against the edge of wrapper. Roll tightly, very long and thin, leaving the edges open. Seal opposite end with water.\nDeep fry at 350 degrees until golden brown, about 3-5 minutes. Drain on paper towels. Before serving, cut them in half. Serve with sweet sour or vinegar and garlic dipping sauce.\nMix together all ingredients.\nIn a small pan combine vinegar, soy sauce, ketchup, water, sugar and salt, and boil for 2 minutes. Thicken with cornstarch mixture.",
        "ingredients": [
            "1 lb lean ground pork",
            "3 green onions, chopped",
            "2 eggs, beaten",
            "2 tbsp soy sauce",
            "Salt and pepper to taste",
            "20 lumpia wrappers, square",
            "Vinegar Dipping Sauce, for serving",
            "Sweet and Sour Sauce, for serving",
            "1/2 cup white vinegar",
            "3 garlic cloves, crushed",
            "Salt and cracked black pepper to taste",
            "1/4 cup white vinegar",
            "1/4 cup soy sauce",
            "1/4 cup ketchup",
            "1/2 cup water",
            "2 tbsp sugar",
            "salt to taste",
            "1 tbsp cornstarch dissolved in 2 tbsp water"
        ],
        "title": "Lumpia Shanghai",
        "picture_link": null
    },
    "5fR9cR.bVK6BvuQtkhkjhL/hUVCrVU2": {
        "instructions": "Watch how to make this recipe.\nCut each banana into 6 chunks and freeze until rock solid, preferably overnight.\nPut the banana chunks and vanilla bean seeds or extract in a food processor and process. Hang on, your food processor may jolt in the very beginning! The bananas will look crumbly at first, then gooey and eventually light and creamy- just like ice cream. Stop the food processor frequently to scrape down the sides of the bowl and break up any clumps. Serve right away or scrape into a container and freeze until ready to serve.",
        "ingredients": [
            "3 large ripe bananas, peeled",
            "Seeds from 1 vanilla bean, or 1 teaspoon pure vanilla extract"
        ],
        "title": "Vanilla Banana Ice Cream",
        "picture_link": "hbEcIECcULFJmnsme44NC5vaPc4RvIe"
    },
    "V9AT25J9rCe73AQN1tt8qNFSLhRHudC": {
        "instructions": "1. Pour vegetable oil into a cast iron or fry pan and heat until oil shimmers. Sprinkle hamburger patty with salt and pepper on both sides and add to hot fry pan.\n2. While burger is cooking, add onion roll, cut side down, to fry pan. Heat until grilled, 2 to 3 minutes, then remove.\n3. Cook burger to desired doneness and turn off heat. Lay Swiss cheese on burger and cover pan until melted.\n4. On bottom of onion roll, spread steak sauce and layer with lettuce and burger. Top with fried onions and blue cheese dressing. Add Vlasic® Ovals Hamburger Dill Chips and top with onion roll.",
        "ingredients": [
            "2 teaspoons vegetable oil",
            "6 oz. ground beef patty or veggie patty",
            "1/4 teaspoon kosher salt",
            "1/8 teaspoon pepper",
            "1 onion roll",
            "1 slice Swiss cheese",
            "1 teaspoon steak sauce",
            "1 tablespoon fried onion strings",
            "1 tablespoon blue cheese dressing",
            "Vlasic® Ovals Hamburger Dill Chips",
            "3 tablespoons shredded iceberg lettuce"
        ],
        "title": "Vlasicandreg; Steakhouse Burger",
        "picture_link": null
    },
    "yN./470yaVNJlVuZv.PNVSqmHtgDOcS": {
        "instructions": "Remove the peels from the citrus carefully, making sure not to include any of the pith. Place the peels in a large container and add the vodka (reserve the vodka bottle for later). Infuse until the alcohol strips the oils and color out of the peels, 12 to 24 hours.\nMeanwhile, make the simple syrup. Combine the sugar and 1 cup water in a small saucepan and bring to a boil. Cook, stirring, until the sugar dissolves. Remove from the heat and let cool completely.\nFill the vodka bottle with about 27 ounces of the infused vodka and 7 ounces of the simple syrup and place in the freezer. Serve ice cold in chilled small copita or shot glasses.",
        "ingredients": [
            "12 large, thick-skinned lemons or 8 Valencia oranges or 5 Ruby Red grapefruit, depending on which citrus type you want to use",
            "1 liter inexpensive vodka, such as Smirnoff or Tito's",
            "1 cup sugar"
        ],
        "title": "GZ's Cello",
        "picture_link": "KAiGaCzPevHoMZ4xBslz2H1WBrLj3Ky"
    },
    "JcDrvER9qikoZVsUViXurPtsz4zV6NC": {
        "instructions": "Heat the oven to 400 degrees F.\nTear bread into pieces and place on baking sheet. Toast bread until deep golden brown, 10 minutes. Transfer to a food processor and coarsely grind into bread crumbs.\nWhile bread toasts pound out chicken breasts to 1/4-inch thick. Season the chicken with salt and pepper. Coat chicken with flour, reserve. Beat egg with splash of water in shallow dish.\nTransfer bread crumbs to a plate and season with herbs and poultry seasoning.\nHeat a thin layer of olive oil in a large skillet over medium-high heat.\nCoat chicken in egg then bread crumbs and add to pan. Saute until golden and firm, 3 to 4 minutes on each side.",
        "ingredients": [
            "1/2 loaf baguette bread - day old is fine",
            "4 pieces chicken breast halves",
            "Salt and freshly ground black pepper",
            "All-purpose flour, for dredging",
            "1 large egg",
            "Several sprigs fresh thyme, leaves finely chopped",
            "2 to 3 sprigs fresh rosemary, leaves finely chopped",
            "A handful fresh chives, finely chopped",
            "1 1/2 teaspoons poultry seasoning",
            "Olive oil, for sauteing cutlets"
        ],
        "title": "Chicken Cutlets with Herbs",
        "picture_link": "m0Oli/3u.Am/9zk8kCSE5A3DoAlzEa."
    },
    "F70sxaUrQ3pNhoE578d/4HdhrophTGi": {
        "instructions": "In a bowl combine the gingerroot, garlic, lime juice, oil, thyme, salt and pepper. Arrange the swordfish steaks in a shallow glass baking dish and spoon the marinade over them. Let the fish marinate, covered and chilled, turning once, for an hour. Meanwhile, make the pesto. In a food processor combine all the ingredients and transfer to a bowl.\nPlace swordfish steaks on your grill. Cook the steaks 4 inches above the coals for 3 to 4 minutes on each side, or until firm to the touch. Alternatively, broil them under a preheated broiler 4 inches from the heat for 3 to 4 minutes on each side. Serve with pesto.",
        "ingredients": [
            "2 teaspoons minced gingerroot",
            "2 cloves garlic, minced",
            "3 tablespoons fresh lime juice",
            "2 tablespoons olive oil",
            "2 tablespoons minced thyme",
            "Salt and pepper",
            "4 swordfish steaks, (about 6 ounces each and 1-inch thick)",
            "1/3 cup olive oil",
            "1/2 cup freshly grated Parmesan cheese",
            "1/3 cup pine nuts",
            "Salt and freshly grated black pepper",
            "2 cups coarsely chopped fresh basil leaves"
        ],
        "title": "Grilled Swordfish with Pesto",
        "picture_link": null
    },
    "wBR2SB9odiwOaksy0zBBOqj9A75AHr6": {
        "instructions": "Fill cones with snow, drizzle with syrup and juice lime on top. Enjoy.",
        "ingredients": [
            "4 cone cups",
            "1 small squirt bottle ginger syrup",
            "1 lime, cut in quarters, zip locked",
            "Fresh white (not yellow) snow"
        ],
        "title": "Ginger-Lime Cones",
        "picture_link": null
    },
    "mT0UEJcar0dlKtiGKzxHa34PZREG1Q.": {
        "instructions": "Chop 24 ounces semisweet chocolate; microwave three-quarters of the chocolate in 30-second intervals, stirring until melted. Add the remaining chocolate; stir until smooth.\nFill 2 molds with the chocolate using a piping bag; scrape off the excess. Freeze 15 minutes, then pop out the pieces. Glue the halves together with melted chocolate.\nRepeat with 24 ounces white chocolate, microwaving at 20-second intervals. Repeat as necessary until the set is complete. Wrap in plastic and freeze until ready to play.",
        "ingredients": [
            "24 ounces semisweet chocolate",
            "24 ounces white chocolate"
        ],
        "title": "Chocolate Chess Pieces",
        "picture_link": "E.MvMyRylZBwRKnlEmTpXV2naoSvBRS"
    },
    "dbHf5W246OGE8tAEvtlf.0JjzxphBuC": {
        "instructions": "Frost rims of 2 cups with sugar. Pass it through the fire, gilding the edge little by little. Add the tequila and the coffee liqueur to them tilting the cup a little towards the fire so that the liqueur begins to flame. Dust with cinnamon. Immediately add hot coffee and a scoop of vanilla ice cream. Top with a cherry.",
        "ingredients": [
            "2 teaspoons sugar, divided",
            "3 ounces tequila, divided",
            "3 ounces coffee liqueur (recommended: Kalhua), divided",
            "Ground cinnamon, to dust",
            "2 cups prepared coffee, divided",
            "2 scoops vanilla ice cream, divided",
            "2 cherries"
        ],
        "title": "Mexican Coffee",
        "picture_link": "zyHwyvpuAZ1jXd4Fdgyd3Lzl4IA8Yy6"
    },
    "8eiXDDbhS.oQQQr/RwoFQM7/zjTIiE6": {
        "instructions": "Pit cherries over a bowl. In a saute pan dissolve sugar in 1 cup water, add lemon zest and bring to a boil. Mix arrowroot with a little cold water to make a paste. Whisk arrowroot paste into boiling syrup and cook, stirring, until thickened. Add cherries and poach over low heat for 5 to 7 minutes until tender. Heat Kirsch in a separate saucepan. Pour over cherries and CAREFULLY ignite with a long match. Shake pan until flames die down. Scoop ice cream into 4 glass bowls. Spoon cherries and syrup over and serve immediately.;",
        "ingredients": [
            "1 pound fresh Bing cherries",
            "1/4 cup sugar",
            "1 cup water",
            "1-inch strip lemon zest",
            "1 teaspoon arrowroot",
            "1/4 cup Kirsch",
            "1 quart vanilla ice cream"
        ],
        "title": "Cherries Jubilee",
        "picture_link": null
    },
    "/OCJ62BL4ZmNphW/0ttmqGzk28LLFaa": {
        "instructions": "Mix the flour with 1/4 teaspoon each salt and pepper in a large bowl. Add the artichoke hearts and toss. Heat the olive oil in a large skillet over high heat. Add the artichoke hearts and fry until golden brown and crisp, about 3 minutes per side. Transfer to a paper towel-lined plate to drain. Remove the skillet from the heat and reserve the frying oil.\nSeason the tomatoes with salt and pepper. Divide the mozzarella, tomatoes, prosciutto and fried artichokes among plates. Top with the basil and olives and drizzle with some of the reserved frying oil.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "1/4 cup all-purpose flour",
            "Kosher salt and freshly ground pepper",
            "1 14-ounce can artichoke hearts in water, drained and patted dry",
            "1/2 cup extra-virgin olive oil",
            "1 pound small tomatoes, quartered",
            "1 1-pound ball fresh mozzarella cheese, sliced",
            "8 thin slices prosciutto (about 1/4 pound)",
            "1 cup fresh basil leaves",
            "1/2 cup green olives (preferably Sicilian), smashed and pitted"
        ],
        "title": "Caprese Salad With Prosciutto and Fried Artichokes",
        "picture_link": "BBdqPtfaCB1kKi0AA8dJnFwEpdd0QT6"
    },
    "0bCoUIJqHE6WunLx0W75.j5gc3OMT3.": {
        "instructions": "Preheat oven to 375 degrees F.\nPlace English muffins on a baking sheet lined with aluminum foil.\nTop with barbecue sauce, scallion and chicken.\nSprinkle with cheese and bake for 12 to 15 minutes until cheese is melted.",
        "ingredients": [
            "2 whole-wheat English muffins, sliced",
            "1/4 cup barbecue sauce",
            "1 medium scallion, finely chopped",
            "3 ounces grilled chicken breast, diced",
            "1/2 cup shredded part-skim mozzarella cheese"
        ],
        "title": "BBQ Chicken Pizza Snacks",
        "picture_link": null
    },
    "z18.EmWD5jIyB/7tUC/qSQVhT7T5aiO": {
        "instructions": "Preheat the oven to 400 degrees F. Place the chicken in a baking dish; sprinkle both sides with salt and pepper and arrange skin side up. Loosen the skin from each chicken breast and slip a basil leaf between the skin and the meat. Add the garlic to the baking dish. Place a slice of lemon on top of each piece of chicken. Drizzle with oil. Bake, basting occasionally with pan juices and turning the chicken and the baking dish occasionally so the chicken browns evenly, 35 to 40 minutes. If using a whole chicken, the baking time will be about 50 minutes. To serve, place a browned lemon slice and garlic clove on top of each portion of chicken.;",
        "ingredients": [
            "4 chicken breast halves with skin and bones (8 to 10 ounces each), fat trimmed or 1 whole chicken (about 2 pounds) cut up",
            "Salt and freshly ground black pepper",
            "4 large basil leaves",
            "4 cloves garlic, bruised with the side of a knife",
            "4 thin lemon slices",
            "1 tablespoon extra virgin olive oil"
        ],
        "title": "Famous Lemon and Basil Chicken",
        "picture_link": null
    },
    "rOOtLssqf6NiVcSbZoreWZzhbpy9K5q": {
        "instructions": "Preheat the oven to 375 degrees F. Line an 8-inch-square baking dish with aluminum foil, leaving an overhang. Whisk the flour, sugar and salt in a bowl. Work in the butter with your fingers to make a crumbly dough.\nRefrigerate 2 tablespoons of the dough for topping. Press the remaining dough into the baking dish; freeze until firm, about 10 minutes.\nBake the crust, 15 minutes. Spread the preserves on top, leaving a 1/2-inch border; crumble the reserved dough on top. Return to the oven and bake until the edges are golden brown, 25 more minutes. Let cool 20 minutes, then lift out of the pan and cut into squares.\nPhotograph by Christina Holmes",
        "ingredients": [
            "1 1/2 cups all-purpose flour",
            "1/3 cup sugar",
            "Pinch of salt",
            "10 tablespoons unsalted butter, at room temperature",
            "6 tablespoons preserves (any flavor)"
        ],
        "title": "Jam Shortbread",
        "picture_link": "Z4MMHCTEjcUchBCXRDGrBkX2yRoj2V."
    },
    "ENWhfdpRt1XnwA5WTQZs8EWObJaaJ6y": {
        "instructions": "In a large container with a fitted lid, combine the vodka, Pimm's, lemon and lime juices, honey, hot sauce and 1 scant teaspoon pepper. Cover and shake to blend. Refrigerate at least 1 hour.\nFill a pitcher with ice and the lemon and lime slices. Shake the chilled vodka mixture and pour into the pitcher. Using a long wooden spoon, stir to blend while adding the lemon-lime soda. Taste. You may find you want to add another splash of vodka. Pour into tall glasses.\nPhotograph by James Wojcik",
        "ingredients": [
            "1 1/2 cups vodka",
            "1/2 cup Pimm's No. 1",
            "1 cup fresh lemon juice",
            "1/2 cup fresh lime juice",
            "1/2 cup honey",
            "2 teaspoons hot sauce, preferably Tabasco",
            "Coarsely ground black pepper",
            "1 lemon, thinly sliced",
            "1 lime, thinly sliced",
            "1 cup chilled lemon-lime soda"
        ],
        "title": "Spicy Holiday Lemonade",
        "picture_link": "r0kh9Zc6I2fd3noLG15ey.fDhGFCPgW"
    },
    "ZjVi.GLRz3YRklnQ9a0yWPalIyN.16G": {
        "instructions": "Cream the cheese in an electric mixer fitted with a paddle attachment until just smooth. Add the sour cream, lemon juice, dill, horseradish, salt, and pepper, and mix. Add the smoked salmon and mix well. Chill and serve with crudites or crackers.\nIf you can find it, I prefer Norwegian salmon; it's drier and less salty than other smoked salmon.",
        "ingredients": [
            "8 ounces cream cheese, at room temperature",
            "1/2 cup sour cream",
            "1 tablespoon freshly squeezed lemon juice",
            "1 tablespoon minced fresh dill",
            "1 teaspoon prepared horseradish, drained",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "1/4 pound (4 ounces) smoked salmon, minced"
        ],
        "title": "Smoked Salmon Spread",
        "picture_link": null
    },
    "20D558WpBfZd4Da4Af.6KHtbZPfgm0i": {
        "instructions": "Preheat the oven to 375 degrees F. Lightly butter 6 (6-ounce) ramekins.\nWhisk the oats, flour, brown sugar, pecans, and salt in a medium bowl. Rub in the butter with your fingertips until it is in even, pea-size pieces. Peel, core, and coarsely chop the apples and divide evenly among the ramekins. Scatter the crisp topping evenly over the fruit in each ramekin.\nTransfer the ramekins to a baking sheet and cook until the fruit bubbles around the sides and the top is golden, about 30 minutes.\nPreheat a broiler. Place the crisps about 4 inches from the broiler and cook until golden brown, about 30 seconds. Let cool about 15 minutes before serving. Serve warm with whipped cream, if using.\nIn our diabetic-friendly desserts, we use small amounts of sweeteners in accordance with guidelines set up by the American Diabetic Association. As with all sweets, moderation is important.",
        "ingredients": [
            "2/3 cup rolled oats",
            "1/3 cup all-purpose flour",
            "1/3 cup dark brown sugar",
            "1/3 cup pecans, toasted, chopped",
            "Pinch fine salt",
            "6 tablespoons cold unsalted butter, cut into bits",
            "4 medium baking apples, such as Braeburn, Rome, or Golden Delicious,",
            "Unsweetened whipped cream, optional"
        ],
        "title": "Apple Crisp",
        "picture_link": "QJONeS883DRJULt9eyRvCfjqoEkbOzK"
    },
    "F.o/eN2np0fL.BTF8l0ZnYZayP/4MTW": {
        "instructions": "In a large wok over medium heat, heat oil. Stir-fry salt and spinach for 1 minute. When spinach has wilted add sugar and garlic and stir-fry 2 to 3 minutes more. Plate spinach, serve warm or cold.",
        "ingredients": [
            "2 teaspoons canola oil",
            "1/4 teaspoon salt",
            "3/4 pound spinach, fresh, washed with stems removed",
            "1/2 teaspoon sugar",
            "1 teaspoon garlic, minced"
        ],
        "title": "Stir-Fried Spinach with Garlic",
        "picture_link": null
    },
    "pjo9sAaxI309iVtE2zNFn2MGqM4hb/i": {
        "instructions": "In a pitcher, combine the simple syrup, apple juice, rum, and sparkling water. To serve, fill a martini shaker with ice and add about 1 cup of the rum mixture. Shake well and pour into martini glasses. Garnish with apple slices and serve.\nIn a small saucepan, combine the sugar, water, and ginger over medium heat. Bring to a boil, reduce the heat, and simmer for 5 minutes, stirring occasionally, until the sugar has dissolved. Remove the pan from the heat and allow the syrup to cool, about 20 minutes. Strain before using.",
        "ingredients": [
            "1 1/3 cups Ginger Simple Syrup, recipe follows",
            "1 1/2 cups 100% apple juice, chilled",
            "1 cup dark rum, chilled",
            "1/2 cup club soda or sparkling water, chilled",
            "Ice",
            "1 green or red apple, unpeeled, cored and thinly sliced",
            "1 cup sugar",
            "1 cup water",
            "1 (2-inch) piece of fresh ginger, peeled and chopped"
        ],
        "title": "Ginger and Apple Martinis",
        "picture_link": "WOR3Ey3azx1c/m.69EUComiUEEy7doq"
    },
    "0ptpEnGjK2M098OjJrVZ2GoGIy5.xN2": {
        "instructions": "Heat oil in a 10-inch skillet over medium-high heat. Add sausage, onion and garlic and cook until vegetables are tender, stirring frequently.\nStir in rice, broth and salsa. Heat to a boil. Reduce heat to low. Cover and cook for 15 minutes. Stir in peas and cook, covered, 5 minutes or until thoroughly cooked. Stir in cilantro.\nSwanson Kitchen Tip: This recipe is also great using Swanson® Natural Goodness™ or Certified Organic Chicken Broth in place of the regular chicken broth.",
        "ingredients": [
            "1 tablespoon vegetable oil",
            "1 package (3 1/2 ounces) chorizo sausage, cut up",
            "1 medium onion, chopped",
            "2 cloves garlic, minced",
            "3/4 cup uncooked regular long-grain white rice",
            "1 3/4 cups Swanson® Chicken Broth",
            "1/2 cup Pace® Chunky Salsa",
            "1/2 cup frozen peas",
            "Chopped fresh cilantro leaves"
        ],
        "title": "Zesty Rice with Chorizo",
        "picture_link": "EIR3lPaSwXQAZSMjM47.deLFoaptBoS"
    },
    "k6MrQRW4JDysYg31kM22kk.diqjJPfC": {
        "instructions": "In a medium pot over medium-high heat, pour in the olive oil. Add the onions and cook until lightly browned, about 5 minutes. Add the garlic and season with salt and pepper, to taste. Give it a stir and cook for another minute. Add the tomatoes, sugar, and basil. Reduce the heat a bit and simmer for 10 to 15 minutes.",
        "ingredients": [
            "3 tablespoons olive oil",
            "1 medium onion, chopped",
            "3 cloves garlic, chopped",
            "Salt and pepper",
            "One 28-ounce can whole tomatoes, crushed (or 2 pounds fresh tomatoes, chopped)",
            "Pinch sugar",
            "2 tablespoons chopped fresh basil leaves"
        ],
        "title": "Freshly \"Canned\" Tomato Sauce",
        "picture_link": "UQB25gTnscZks9qkqYhqUVqjwqkGCry"
    },
    "G/BOxo.By6dY1dMv1myyflB3yocvTQS": {
        "instructions": "In a skillet over medium heat, saute the chicken skin until it releases its fat and the fat begins to turn golden brown, about 20 minutes. Remove the chicken skin and pour off half of the rendered fat, or schmaltz.\nAdd the onions to the pan with the remaining chicken fat and cook until the onions are translucent, tender, and caramelized, about 10 minutes. Season with salt, to taste. Remove half of the onions from the pan and set aside. Raise the heat to medium-high and add the reserved chicken fat and chicken livers to the remaining onions. Saute the livers, turning once, until cooked on the outside but still lightly pink inside, about 5 minutes. Roughly chop the chicken livers by hand and season with salt and cracked black pepper. Spoon the chopped liver onto matzo and top with minced egg and the reserved schmaltz fried onions.",
        "ingredients": [
            "Reserved skin from 1 chicken, about 1 cup",
            "1 onion, thinly sliced",
            "1 pound chicken livers, trimmed and rinsed well",
            "Kosher salt and freshly cracked black pepper",
            "Matzo, broken into bite-sized shards",
            "2 eggs, boiled and finely minced"
        ],
        "title": "\"What am I...?\" Chopped Liver with Schmaltz Fried Onions",
        "picture_link": "Magqg5h4Xo8PcKEO2GLThez2.NI1RB2"
    },
    "t7GgVJrkVPbVwe.7ACHICLw.mkQDMO6": {
        "instructions": "Cut the beef into thin strips and slice the onion. Heat 2 tablespoons of oil in a large skillet over a high flame. Season the beef with salt and pepper. Saute the beef until it just begins to brown. Add the orange juice, bouillon cubes and pepper flakes. Simmer until the beef is just done. If the sauce is thin, strain through a colander, reserving the beef. Return the sauce to a saucepan over a high heat. Reduce until the sauce reaches a desirable consistency or thicken with a little cornstarch.",
        "ingredients": [
            "2 pounds beef top round",
            "2 small onions",
            "2 tablespoons cooking oil",
            "1/2 can orange juice concentrate",
            "2 cubes beef bouillon",
            "1/2 teaspoon hot red pepper flakes"
        ],
        "title": "Spicy Orange Beef",
        "picture_link": null
    },
    "qumYw7OYewR8XkdPrXgSTcaSnQDhBoK": {
        "instructions": "Combine the yogurt, 2 tablespoons water, rice vinegar, olive oil, chives, parsley, garlic and 1/2 teaspoon each salt and pepper in a blender or food processor and blend until smooth. Cover and chill for 30 minutes before serving. The dressing will keep, refrigerated, for up to 3 days.",
        "ingredients": [
            "3/4 cup 2-percent Greek yogurt",
            "2 tablespoons rice vinegar",
            "2 tablespoons olive oil",
            "1/2 cup chopped fresh chives (from a small bunch)",
            "1/2 cup chopped fresh parsley",
            "1 small garlic clove",
            "Kosher salt and freshly ground black pepper"
        ],
        "title": "Greek Yogurt Herb Dressing",
        "picture_link": "JHK3yJCFzTCkyZ0a0IaMqgShBYrpw5K"
    },
    "e4I.oPhRL5KN2P/PNCWND62OapxWT8y": {
        "instructions": "Special equipment: Cocktail shaker, martini glass\nFor the syrup: Combine the honey and 1/2 cup water in a small saucepan over medium heat and stir until combined. Remove and cool.\nFor the vesper: Combine the aperitif, grapefruit juice, vodka and syrup to taste in a cocktail shaker with ice. Shake well and strain into a chilled martini glass. Garnish with grapefruit peel.",
        "ingredients": [
            "1/2 cup clover honey",
            "2 ounces French aperitif wine, such as Lillet Jean Reserve or Lillet Blanc",
            "2 ounces fresh ruby red grapefruit juice",
            "1 1/2 ounces grapefruit vodka",
            "Grapefruit peel, for garnish"
        ],
        "title": "Grapefruit Vesper",
        "picture_link": "fz5SAEjIbmxbM3n/sYWln9ePhNs32a6"
    },
    "ZIPTITvjdxYJ5mbB1JFzi0rS/wjy7nC": {
        "instructions": "In a medium bowl, mix the pork, soy sauce and 1 tablespoon cornstarch with a chopstick. Form into large meatballs. On a small plate, sprinkle the remaining 1 tablespoon cornstarch and roll the meatballs in the cornstarch.\nIn a wok or large skillet over medium-high heat, add the vegetable oil. Brown the meatballs in hot wok until deep golden brown. Remove from the wok. Drain on paper towels and keep warm.\nWipe the wok or skillet clean with a paper towel. Return the wok to high heat and cook cabbage until just wilted.\nPlace the cooked cabbage on the bottom of a large soup pot or casserole dish. Add the meatballs and broth. Cover and simmer until meatballs are cooked through, about 6 to 7 minutes. Stir and serve warm.",
        "ingredients": [
            "1 pound ground pork",
            "2 tablespoons low-sodium soy sauce",
            "2 tablespoons cornstarch",
            "1 tablespoon vegetable oil",
            "1 medium head Napa cabbage, cut into 1-inch pieces",
            "Two 14.5-ounce cans chicken broth"
        ],
        "title": "Lion's Head",
        "picture_link": null
    },
    "yjT4KValOpxcpTKkLdYMNIdkBfbNDVm": {
        "instructions": "Special equipment: Four 2-cup individual baking dishes\nPreheat the oven to 400 degrees F.\nSprinkle the chicken with salt and pepper. Heat 2 tablespoons oil and the butter in a large skillet over medium-high heat. Add the chicken, 1/4 teaspoon salt, 1/4 teaspoon pepper and the nutmeg and saute until cooked through, about 5 minutes.\nAdd the celery, carrots, garlic and onions and saute until translucent, 3 to 4 minutes. Add the beans and mushrooms and continue to cook until the vegetables have softened, 4 minutes. Sprinkle the flour over the vegetables and cook for 2 minutes. Stir in the chicken broth, bring to a simmer and cook for 2 minutes. Stir in the milk and peas and cook until thick and creamy, 8 to 10 minutes. Remove from the heat. Divide the filling evenly among the 4 baking dishes.\nPlace a phyllo dough sheet on top of each baking dish and brush the top with oil. Bake until golden brown, about 10 minutes.",
        "ingredients": [
            "1 1/4 pounds boneless chicken breasts, cut into 1-inch cubes",
            "Sea salt and black pepper",
            "3 tablespoons olive oil, plus more for brushing",
            "1 tablespoon unsalted butter",
            "Pinch fresh grated nutmeg",
            "3 stalks celery, chopped",
            "2 medium carrots, chopped (about 1 cup)",
            "2 cloves garlic, minced",
            "1 small onion, chopped",
            "6 ounces green beans, snipped and cut into 1/2-inch pieces (about 1 cup)",
            "6 white mushrooms, thinly sliced",
            "2 tablespoons all-purpose flour",
            "1 cup low-sodium chicken broth",
            "3 cups low-fat milk",
            "1 cup frozen green peas, thawed",
            "4 sheets frozen phyllo dough, thawed"
        ],
        "title": "The Son's Chicken Pot Pie",
        "picture_link": null
    },
    "fDAUucUCkJD/cLpJwqtdzz34sOgRJVy": {
        "instructions": "Watch how to make this recipe.\nCombine the tomatillo, avocado, jalapeno and lime juice in a medium bowl. Drizzle with a little olive oil, add cilantro and season with salt and pepper, to taste. Let sit at room temperature for 15 minutes before serving.\nPut the vinegar and chipotle puree in a food processor and pulse a few times to combine. Add the remaining ingredients and pulse until slightly smooth.\nPut the sour cream into a medium bowl, add the salsa and stir to combine.\nHeat the oil in a medium saute pan over high heat. Add the onion and cook until soft, about 3 minutes. Add the mango, *habanero, vinegar and 1/4 cup water and cook, stirring occasionally, until the mango is very soft, about 15 minutes.\nTransfer to a food processor; add the honey and salt and pepper, to taste, and pulse until smooth. Strain through a mesh strainer into a bowl. Let cool to room temperature before serving. The sauce can be stored, covered, in the refrigerator for 1 week. Bring to room temperature before serving.\nPut the lemon juice, orange juice, mustard, honey, basil and salt and pepper, to taste, in a blender and blend until smooth. With the motor running, add the oil until emulsified. Reserve 1/4 cup of the dressing for the fish.\nCombine the cabbage and carrot in a large bowl; add half of the dressing and toss to coat. Add more dressing and salt and pepper, if needed.\nPreheat the grill to high or grill pan over high heat.\nBrush both sides of the fish with oil and season with salt and pepper, to taste. Grill until golden brown and slightly charred on both sides and just cooked through, about 4 minutes per side. Remove to a plate and drizzle the fish with the reserved dressing. Let cool slightly, then using a fork, flake into large pieces.\nGrill the tortillas until slightly charred and just warmed through, about 5 seconds per side. Transfer the tortillas on a flat surface and fill the center of each with some of the fish, red slaw, salsa, hot sauce and cilantro leaves...fold and eat.",
        "ingredients": [
            "2 large tomatillo, husked and rinsed and diced",
            "1 ripe Hass avocado, halved, pitted and diced",
            "1 or 2 jalapeno or serrano peppers, finely diced (depending on how spicy you like it)",
            "2 limes, juiced",
            "Extra-virgin olive oil",
            "1/4 cup freshly chopped cilantro leaves",
            "Salt and freshly ground black pepper",
            "2 tablespoons red wine vinegar",
            "2 teaspoons chipotle in adobo puree",
            "3 plum tomatoes, grilled or roasted until blackened, halved, seeded and diced",
            "1/4 cup finely diced red onion",
            "3 cloves garlic, finely chopped",
            "1 tablespoon finely chopped Mexican oregano",
            "3 tablespoons chopped fresh cilantro leaves",
            "Pinch salt and freshly ground black pepper",
            "1 cup sour cream or creme fraiche",
            "2 tablespoons canola oil",
            "1 small Spanish onion, chopped",
            "2 very ripe mangoes, halved and flesh chopped",
            "*1 habanero, roasted and chopped (See Cook's Note)",
            "1/4 cup rice wine vinegar",
            "1/4 cup water",
            "2 tablespoons clover honey",
            "Pinch salt and freshly ground black pepper",
            "1/4 cup lemon juice",
            "1/4 cup orange juice",
            "2 tablespoons Dijon mustard",
            "2 tablespoons clover honey",
            "1/4 cup freshly chopped basil leaves",
            "Salt and freshly ground black pepper",
            "1/2 cup canola oil",
            "2 cups finely shredded napa cabbage",
            "2 cups finely shredded red cabbage",
            "1 large carrot, peeled and julienned",
            "3 (8-ounce) red snapper or mahi mahi fillets",
            "Canola oil",
            "Salt and freshly ground black pepper",
            "1/4 cup reserved dressing, from the slaw",
            "8 (6-inch) flour or corn tortillas",
            "Cilantro leaves"
        ],
        "title": "Throwdown's Fish Tacos",
        "picture_link": "322H13btcMEK3QqIT7lzV04DmRmEQyi"
    },
    "mIVsaZQvg6dWIeXO2LpePzEBJ4DpBt6": {
        "instructions": "Add softened ice cream to a mixer with paddle attachment, or mixed by hand in a bowl. Whip the ice cream for 3 to 4 minutes, increasing the air volume in the ice cream. Add the spices and the honey and mix for additional 2 to 3 minutes. Remove from the mixer and put into a shallow pan. Freeze until set, about 1 to 2 hours.\nPreheat the oven to 350 degrees F.\nArrange the apples, evenly in a ring pattern in the crust, starting on the outer edge going to center. In a bowl, add the melted butter, nutmeg, cinnamon and sugar and stir to combine. Pour the mixture over the apples. Bake until the apples have softened, about 30 to 35 minutes.\nIn a small bowl, add the butter and sugar and whisk well until smooth. Set aside.\nRemove the tart from the oven and dollop with the sweet butter topping. Return the tart to the oven until the topping has crusted, about 15 minutes. Remove from oven and allow to rest for 10 to 15 minutes before serving.\nTop each warm slice with honey ice cream and enjoy.",
        "ingredients": [
            "1 pint good quality vanilla ice cream, softened",
            "Pinch ground mace or ground cinnamon",
            "Pinch salt",
            "2 tablespoons honey",
            "1 (9-inch) tart crust, store-bought or homemade",
            "2 pounds apples (Golden Delicious, Granny Smith or Pippin), peeled, cored and thinly sliced",
            "3 tablespoons salted butter, melted",
            "1 teaspoon ground nutmeg",
            "1 teaspoon ground cinnamon",
            "1/4 cup granulated sugar",
            "1/4 cup granulated sugar",
            "1/4 pound butter, cut into pats, room temperature"
        ],
        "title": "Apple Tart with Honey Ice Cream",
        "picture_link": null
    },
    "w9e6ieZGiz9osxzjVeWfu7tnL2FzqRa": {
        "instructions": "Watch how to make this recipe.\nFor the mayonnaise: In a small bowl, mix together mayonnaise, garlic, and rosemary; set aside.\nFor the burgers: Preheat a gas or charcoal grill or place a grill pan over medium-high heat. In a large bowl, add the ground chicken, 1/2 teaspoon salt, 1/4 teaspoon pepper, and 1/2 of the mayonnaise mixture. Using clean hands, gently combine the ingredients and form the chicken mixture into 4 patties. Place the burgers on the grill and cook for about 7 minutes on each side. Transfer to paper towels and let rest for a few minutes.\nBrush the cut side of each roll with the olive oil and 1 teaspoon of the mayonnaise mixture. Grill for 1 to 2 minutes until slightly golden.\nTo assemble the burgers: Spread a dollop of the remaining mayonnaise mixture on the tops and bottoms of the toasted buns. Place the chicken burgers on the bottom halves of the buns. Top each with 1/4 cup of arugula and finish with the top half of the bun.",
        "ingredients": [
            "1 cup mayonnaise",
            "1/4 cup chopped fresh rosemary leaves",
            "1 clove garlic, minced",
            "1 pound ground chicken",
            "1/2 teaspoon kosher salt",
            "1/4 teaspoon freshly ground black pepper",
            "4 sandwich rolls or burger buns",
            "1/4 cup olive oil",
            "1 cup arugula, divided"
        ],
        "title": "Chicken Burgers with Garlic-Rosemary Mayonnaise",
        "picture_link": "XUUgq/OB6PagFJeolq9muVg7P0zg9cK"
    },
    "U8IjsrgGgIMUrVn4Rd.rFXGjCNe1t12": {
        "instructions": "1. Melt 8 ounces of the chocolate as directed on package. Beat cream cheese, confectioners' sugar, nutmeg and extract in large bowl with electric mixer on medium speed mixer until well blended and smooth. Add melted chocolate; beat until well mixed. Cover. Refrigerate at least 4 hours or until firm.\n2. Shape into 24 (about 3/4-inch) balls. Place on wax paper-lined tray. Refrigerate until ready to dip.\n3. Coat only 12 truffles at a time. Melt 4 ounces of the remaining chocolate in small microwavable bowl on MEDIUM (50% power) 1 1/2 minutes, stirring after 1 minute. Using a fork, dip 1 truffle at a time into the melted chocolate. Tap back of fork 2 or 3 times against edge of dish to allow excess chocolate to drip off. Place truffles on wax paper-lined tray. (If there are any \"bald\" spots on truffle, cover with melted chocolate that remains on the fork). Sprinkle truffles with nutmeg. Repeat with remaining 4 ounces chocolate and remaining truffles.\n4. Refrigerate 1 hour or until chocolate is set. Store truffles between layers of wax paper in airtight container in refrigerator up to 1 week.",
        "ingredients": [
            "1 pound white baking chocolate, divided",
            "4 ounces (1/2 package) cream cheese, softened",
            "1/4 cup confectioners' sugar",
            "1/4 teaspoon McCormick® Nutmeg, Ground",
            "1/4 teaspoon McCormick® Imitation Rum Extract",
            "Additional McCormick® Nutmeg, ground for sprinkling"
        ],
        "title": "Eggnog Truffles",
        "picture_link": "Rxptg2FQHPh5EiKjkc/EDgZbLu0givG"
    },
    "gKNDBrwyg93SPpz/y.Nt.8ZMcW7HQQC": {
        "instructions": "Preheat the oven to 375 degrees F.\nSlice the potatoes 1/8 inch thick, using a mandoline if you have one, or the slicer attachment of a food processor. In a bowl, toss the slices with the salt, then place them in a colander set over a bowl or the sink to drain for about 30 minutes. (It is important to rid the potatoes of any excess moisture that will make the pastry soggy during baking.) In a bowl, mix the potato slices with the onion, thyme, and butter, and set aside.\nLine a baking pan with parchment paper. Lay the 10 by 8-inch sheet of pastry on a work surface. Spread the potato mixture evenly over the pastry, leaving a 1-inch border all around. (You might think that you have too much potato, but pile it on, as the mixture loses volume during cooking.) Brush the border with egg wash and top with the 11 by 9-inch sheet of pastry, stretching it over the potatoes.\nCrimp the edges with a fork to prevent the pastry sheets from separating. Trim off any excess pastry and generously brush the top with egg wash. Poke a small vent hole in the center of the pastry to ensure an even rise. Crisscross the top with the back of the knife for decoration.\nBake until golden brown, about 60 minutes. Test the potatoes for doneness by inserting a small paring knife into the galette. If they are done, so is the pastry. If there is any sign of resistance, decrease the oven temperature to 300 degrees F and bake, testing frequently, another 15 minutes.\nTo serve, carefully transfer the galette to a large serving platter. Slice horizontally all around to separate the top and bottom crusts. Lift the top crust to expose the potatoes. Spoon creme fraeche evenly over them, reposition the top crust, and serve immediately. Slice the galette at the table.",
        "ingredients": [
            "5 medium yellow-fleshed potatoes such as Dutch yellow (about 2 pounds), peeled",
            "1 tablespoon salt",
            "1 small onion, finely diced",
            "8 sprigs of thyme, picked and finely chopped",
            "2 tablespoons unsalted butter, melted",
            "2 sheets puff pastry, 10 by 8 inches and 11 by 9 inches",
            "1 large egg, beaten, for egg wash",
            "1/4 cup plus 2 tablespoons creme fraeche"
        ],
        "title": "Ken's Potato Galette",
        "picture_link": "r6oa2ljtyeZWCvUAav.6EbvihiXNPDq"
    },
    "8TvkWFfpRKQ9vsMnsjXRdLYOGjzeCKy": {
        "instructions": "Watch how to make this recipe.\nPlace enough water in the bottom of a 4-quart saucepan to come 1 inch up the sides. Bring to a simmer over medium heat.\nMelt the chocolate chips with the liqueur and vanilla in a medium metal bowl set over the simmering water, stirring often with a rubber or silicone spatula. Combine the tofu, chocolate mixture and honey in a blender or food processor and spin until smooth, about 1 minute. Pour the filling into the crust and refrigerate for 2 hours, or until the filling sets firm.\nPreheat the oven to 350 degrees F.\nSpin the cookies and sugar in a food processor until fine crumbs. Then drizzle in the butter, pulsing to combine. Press this mixture firmly and evenly into the bottom, up the sides and just over the lip of a 9-inch metal pie pan.\nBake on the middle rack of the oven until crust is set and appears dry, 18 to 20 minutes. Remove from the oven and cool completely, about 1 hour.",
        "ingredients": [
            "13 ounces semisweet chocolate chips",
            "1/3 cup coffee liqueur",
            "1 teaspoon vanilla extract",
            "1 pound silken tofu, drained",
            "1 tablespoon honey",
            "1 (9-inch) prepared chocolate wafer crust, recipe follows",
            "6 1/2 ounces chocolate wafer cookies",
            "1 tablespoon sugar",
            "3 ounces unsalted butter, melted and slightly cooled"
        ],
        "title": "Moo-Less Chocolate Pie",
        "picture_link": "s6q4NAq9ofhiuMQmnZq8MhiFXZQ9AvC"
    },
    "P1x9ZRS9MNvBbA99fDeCMYTXh/QjGT.": {
        "instructions": "For the polenta: Bring the stock to a simmer in a saucepan over medium-high heat, and then reduce the heat to medium. Next, add the cornmeal and cook with a stirring motion until thickened, 12 to 15 minutes. Next, reduce the heat to low, add the butter, parsley and thyme and finish cooking until the cream has been absorbed, 3 to 4 minutes. The polenta should be semi-tight and creamy; liquid levels will vary with the moistness of the cornmeal.\nFor the sauce: In a small saucepan over medium heat, bring the veal stock to a simmer. Then add the cream and garlic. Reduce the heat to medium and allow further simmering for 2 to 3 minutes. Remove from the heat and hold for plating.\nFor the scallops: Add the oil to a large saute pan over high heat and bring to verge of smoking. During this process, place paper towels down on a flat counter, and then place the scallops on the towels and pat dry.\nMix the salt and pepper together. Once the pan is hot, sprinkle both sides of the scallops with the salt and pepper mixture. Then add to pan and sear the first side, about 2 minutes. Reduce the heat and flip to sear the second side for a final 1 to 1 1/2 minutes. Once cooked, remove the scallops from the pan and serve atop the polenta. Finish with the demi-glace sauce and garnish with chives",
        "ingredients": [
            "1 cup chicken stock",
            "1/4 cup cornmeal",
            "1 tablespoon butter",
            "1 tablespoon minced fresh parsley",
            "1 tablespoon minced fresh thyme",
            "1/4 cup good veal stock",
            "2 tablespoons heavy cream",
            "1 tablespoon minced garlic",
            "1 tablespoon grapeseed oil",
            "12 large scallops",
            "1 teaspoon sea salt",
            "1 teaspoon ground pepper",
            "Fresh chives, for serving"
        ],
        "title": "Seared Scallops, Polenta, Demi-Glace",
        "picture_link": "KC4syAppSyYr26RnqoDKxe.YkXxzCs6"
    },
    "LXU2XHX89fsFZfXqjAwrccrnS7.Gu52": {
        "instructions": "Two days before frying, set up a large deep fryer with burner base and propane tank, meant for frying turkey, according to manufacturer's instructions. Measure the amount of oil needed by placing the wrapped turkey in the pot and filling the pot with water to cover the turkey by 1 inch. Remove the turkey and mark the water level on the side of the pot.\nCombine all ingredients, except turkey and oil, in a large saucepan and bring to a boil. Reduce heat and simmer 10 minutes. Cool. Following package instructions, fill the injector that comes with turkey fry kit with butter mixture; inject butter mixture in turkey all over. Refrigerate turkey for at least 4 hours and up to 24 hours before frying.\nFill the fryer with oil up to the marked line, attach a deep fry thermometer to the pot, and heat oil to 350 degrees F. Put the turkey on the fry stand, attach to the metal hanger that comes with kit, and slowly lower into the hot oil. Cook turkey 4 minutes per pound; when done, turkey will float to the surface. Meat should register 180 degrees F on meat thermometer. Let turkey rest for at least 20 minutes before carving.\nYou can also use the butter mixture to baste a turkey in a 325 degrees F oven every 20 minutes until an internal temperature of 180 degrees F is reached.",
        "ingredients": [
            "1/2 cup (1 stick) unsalted butter",
            "2 tablespoons Original TABASCO® brand Pepper Sauce",
            "1/4 cup water",
            "1 teaspoon salt",
            "1/2 teaspoon freshly ground pepper",
            "1/2 teaspoon cayenne pepper",
            "1 (12- to 14-pound) turkey, rinsed and trussed",
            "Up to 4 gallons peanut oil",
            "Turkey Fry Kit with Injector"
        ],
        "title": "Spicy Pepper Butter Fried Turkey",
        "picture_link": null
    },
    "qV6QnbNaFfsfTzTDcYnrw9vdetQ6fJG": {
        "instructions": "Preheat oven to 250 degrees F.\nTrim the goose. With a sharp knife, cut away excess fat and skin that hangs at both ends of the goose. Trim thoroughly. Fat can be discarded or used to render goose fat.\nSalt the cavity and prick thoroughly with a fork on both sides of the bird (25 to 30 pricks). Make sure to prick through the skin and subcutaneous fat only; do not prick the flesh of the goose.\nPlace the goose on a rack set in a large roasting pan. Place the pan in the oven and roast the goose at 250 degrees F. After 1 hour, prick the goose thoroughly on one side and turn it over, and prick thoroughly on the other side. Continue to roast with the newly turned side up. Repeat this procedure every hour.\nAfter 4 hours of roasting, prick and turn once again. Increase the oven temperature to 350 degrees F. Continue roasting, pricking, and turning once for an additional 75 minutes.\nWhen the goose is done, let it sit for 15 minutes before carving. Season well with salt and pepper before serving.",
        "ingredients": [
            "1 (14 pound goose",
            "Salt and pepper to taste"
        ],
        "title": "Old-Fashioned Crispy Roast Goose",
        "picture_link": null
    }
}