{
    "7NADeAf2HDeHtVIchthhDpYPA7L.GOC": {
        "instructions": "Finely chop papaya, pineapple and ginger in processor. With machine running, add 1 cup juice; process until mixture is almost smooth. Pour into large pitcher. Mix in remaining juice. (Can be made 6 hours ahead. Refrigerate.) Stir in crushed ice. Gradually pour in sparkling water. Stir until blended and serve.",
        "ingredients": [
            "2 cups chopped peeled seeded papaya (about 1 large)",
            "2 cups cubed peeled fresh pineapple",
            "2 teaspoons grated peeled fresh ginger",
            "4 cups chilled tropical fruit juice blend (such as pineapple, orange and banana)",
            "2 cups crushed ice",
            "2 cups chilled bottled sparkling water"
        ],
        "title": "Tropical Fruit Sparkler",
        "picture_link": null
    },
    "/gRbfqPUroYvzGDbzZ5oiVMTPwI/Zwi": {
        "instructions": "Prepare the rhubarb by putting it in a saucepan with the sugar and 1/4-cup/60 ml water. Bring to a simmer and cook until soft. If it seems too runny, simply leave on the heat, stirring, to let some of the liquid evaporate. Remove the pan from the heat and set aside.\nBeat the egg white to stiff peaks with the pinch of salt. Heat the sugar with 3 tablespoons of water to thread stage. Cook's Note: Which is just before it starts to color.\nWith the beaters going, pour the sugar-water mixture into the beaten egg whites and continue beating until the stiff meringue is cooled. Meanwhile, beat the cream to peaks with the vanilla extract. Fold the two mixtures together.\nSpoon the rhubarb in the bottoms of 4 coupes. Top with parfait. Cover and refrigerate for a couple of hours before serving.",
        "ingredients": [
            "2 cups/300 g sliced rhubarb",
            "1/4 cup/55 g sugar",
            "1/4 cup plus 3 tablespoons water",
            "1 egg white",
            "Pinch salt",
            "1/3 cup sugar",
            "2/3 cup/150 ml heavy cream",
            "1 teaspoon vanilla extract"
        ],
        "title": "Rhubarb Parfait",
        "picture_link": null
    },
    "UllkWUoRxcBJTQeLFJyjF7viqdVgti.": {
        "instructions": "In a very large pot combine beer and lemon with 3 cups water. In a coffee grinder or spice mill, grind spices to a coarse powder; add to pot. Bring to a boil over medium-high heat, reduce heat to medium and simmer vigorously, 10 minutes. Add crabs and cover pot tightly. Bring to a boil and simmer 8 minutes. Serve on lots of newspapers with a small hammer, picks and lemon.;",
        "ingredients": [
            "24 ounces beer (2 bottles)",
            "1 lemon, quartered",
            "1 1/2 tablespoons black peppercorns",
            "1 small dried red chili",
            "1 teaspoon cayenne",
            "1 tablespoon coriander seeds",
            "2 teaspoons brown mustard seeds",
            "1/4 teaspoon whole allspice",
            "4 cloves",
            "4 bay leaves",
            "1 tablespoon celery seed",
            "2 teaspoons dill seed",
            "1 dozen blue crabs (such as Maryland Blues)"
        ],
        "title": "Spicy Crab Boil",
        "picture_link": null
    },
    "ZgNFz2VxtnVxYif/l8FBaEplS7Pp0/i": {
        "instructions": "Heat the vegetable oil in a large saucepan over medium-high heat. Add the onion and poblano and cook, stirring, until softened, 5 to 8 minutes. Add the tomatoes, garlic and cumin; season with salt and pepper. Cook until the liquid thickens, about 3 minutes. Add 5 cups water. Increase the heat to high and bring to a simmer, then reduce the heat to maintain a simmer and cook 10 minutes.\nMeanwhile, combine the chorizo, crushed tortilla chips, cilantro and a pinch each of salt and pepper in a small bowl; mix with your hands until just combined. Form into 1-inch meatballs (about 20).\nAdd the meatballs to the soup and simmer until just cooked through, 5 to 8 minutes. Remove from the heat and season with salt and pepper. Ladle the soup into bowls; top with the cheese and cilantro. Serve with lime wedges and tortilla chips.\nPhotograph by Charles Masters",
        "ingredients": [
            "1 tablespoon vegetable oil",
            "1 onion, chopped",
            "1 poblano chile pepper, seeded and chopped",
            "1 15-ounce can diced tomatoes",
            "4 cloves garlic, minced",
            "1 teaspoon ground cumin",
            "Kosher salt and freshly ground pepper",
            "8 ounces fresh chorizo, casings removed",
            "1/4 cup finely crushed tortilla chips, plus more chips for serving",
            "1 tablespoon chopped fresh cilantro, plus more for topping",
            "1 cup shredded cheddar cheese (about 4 ounces)",
            "Lime wedges, for serving"
        ],
        "title": "Mexican Chorizo Meatball Soup",
        "picture_link": "XP2tbMIb6xhPw.nkrPDT8nNtRCaTaCe"
    },
    "rn5hdyWP3VoPHHyPWdSTIzp7j9K0wlu": {
        "instructions": "Combine milk, cream, cookies, 8 tablespoons sugar, and vanilla bean in a medium saucepan and bring to a simmer. Turn off heat and let rest for 5 minutes. Bloom gelatin in a bowl of cold water. Puree the amaretto cookie mixture. Remove gelatin, combine with all other ingredients. Pass through a chinois. Cool and pour into 4 individual ramekins. Refrigerate until set, about 1 1/2 hours. Combine cherries, Vin Santo, and 1/4 cup sugar in pot. Simmer for 5 minutes. Remove from heat and let cool.\nTo serve, turn each ramekin upside-down over a dessert plate to release panna cotta. Top with a spoonful of marmallata.\nThis recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
        "ingredients": [
            "1 cup milk",
            "3 cups cream",
            "15 amaretto cookies",
            "8 tablespoons sugar, plus 1/4 cup",
            "1 vanilla bean, split and scraped",
            "5 sheets gelatin",
            "2 cups pitted cherries",
            "1/4 cup Vin Santo"
        ],
        "title": "Cookies and Cream",
        "picture_link": null
    },
    "GhElKerf72aDbxfWVb2rrP3B2J0LqCe": {
        "instructions": "Toss the cucumber, vinegar, sugar and 2 teaspoons salt in a medium bowl and set aside at room temperature, tossing occasionally, until juicy, about 30 minutes.\nMeanwhile, put the almonds in a large skillet and heat over medium, swirling them around until golden and toasted in spots, about 3 minutes. Set aside to cool.\nAdd the oil and garlic, the cucumber mixture along with any collected juices, 6 ice cubes and all but 2 tablespoons each of the almonds and parsley to a blender. Blend on high until very smooth. Refrigerate until chilled, about 2 hours.\nPour into 2-ounce shot glasses. Sprinkle each with the reserved almonds and parsley.",
        "ingredients": [
            "3 large cucumbers, peeled and cut into 1/2-inch chunks",
            "1 tablespoon red wine vinegar",
            "1 teaspoon sugar",
            "Kosher salt",
            "1/3 cup sliced, skin-on almonds",
            "3 tablespoons extra-virgin olive oil",
            "1 small garlic clove, chopped",
            "1/2 small bunch parsley, leaves roughly chopped"
        ],
        "title": "Green Gazpacho Soup Shooters",
        "picture_link": "aUF7EeaQ3M5Cn1T.wUbnogZbWHeqsqu"
    },
    "XFFWVINThPIMBIpFq3IDHQlKIcGpvy6": {
        "instructions": "In a medium skillet, bring 1 inch of water to a boil, reduce heat to simmer, pierce the casings of 4 pieces of bratwurst and set into a medium skillet. Simmer sausages 10 minutes, then remove to a cutting board, pour water out of pan and return pan to stovetop, adjusting heat to medium high heat. Slice sausages on an angle, 6 cuts per wurst. Add 1 tablespoon extra-virgin olive oil, 1 turn of the pan, and set slices into hot skillet. Brown 1 to 2 minutes on each side.\nPlace sauerkraut into a colander. Rinse and squeeze dry. Add to the browned bratwurst slices. Stir in sweet red pepper relish and warm through another 1 to 2 minutes. Transfer to a serving dish and place along side cocktail or quartered sliced dark bread. To serve, spoon sliced wurst and sauerkraut onto bread.",
        "ingredients": [
            "4 bratwurst sausages, 1 package, found in packaged meats case",
            "1 tablespoon extra-virgin olive oil, 1 turn of the pan",
            "1 pound sauerkraut, rinsed and drained",
            "1 cup sweet red pepper relish",
            "1 loaf pumpernickel cocktail bread, 2-inch square loaves of bread, recommended: Pepperidge Farm brand or quarter several slices of any sliced, store bought dark or whole grain bread, as substitute"
        ],
        "title": "Bratwurst with Sweet-and-Sour Kraut and Dark Bread",
        "picture_link": "JJiMuEqJZ.fGjMnByUm3xt3nhpt7C8i"
    },
    "AM6Cic6koKXRtcjCg0pT6zZQaP.oSQW": {
        "instructions": "Mix 1 cup cooked spaghetti, 1 beaten egg and 1/4 cup grated parmesan. Wrap the spaghetti mixture around 12 cooked mini meatballs. Fry in 2 inches of 350 degrees F vegetable oil until golden, 5 minutes. Garnish with parsley and serve on skewers with marinara sauce.\nPhotograph by Charles Masters",
        "ingredients": [],
        "title": "Spaghetti-and-Meatball Skewers",
        "picture_link": "2xKB.sWhOCh6SvOqC7GifnecTubI336"
    },
    "19z2qy06Ayp6WIhhK4uEAahhntKtRp6": {
        "instructions": "Put the clams in a large pot or Dutch oven with 1 cup water. Cover and cook over medium-high heat until the clams start opening, about 5 minutes; as the clams open, transfer them to a bowl using tongs. (Discard any unopened clams.) Add the cooking liquid to the bowl with the clams (strain through a paper towel-lined sieve if sandy). Cover to keep warm.\nWipe the pot clean and reduce the heat to medium. Add the olive oil and chorizo. Cook, stirring occasionally, until the chorizo is lightly browned, about 3 minutes. Add the leek, bell pepper, garlic and bay leaves. Cook, stirring occasionally, until the vegetables are tender, about 4 minutes. Add the rice; cook, stirring, until lightly toasted, about 2 minutes. Add the chicken broth and 1 cup water; bring to a boil, then reduce the heat to medium. Cover and simmer, stirring once or twice, until the rice is tender, about 15 minutes. Discard the bay leaves.\nMeanwhile, puree the parsley with 1/3 cup water in a blender until smooth. Stir the lima beans, parsley puree, and the clams and their juices into the rice mixture. Cook until the lima beans are tender, 3 to 4 minutes.\nPhotograph by Antonis Achilleos",
        "ingredients": [
            "2 pounds littleneck clams (about 24), scrubbed",
            "1 tablespoon extra-virgin olive oil",
            "1 fully cooked chorizo sausage, sliced 1/2 inch thick",
            "1 leek (white and light green parts), halved lengthwise and sliced",
            "1 red bell pepper, finely chopped",
            "3 cloves garlic, minced",
            "2 bay leaves",
            "1 cup arborio rice",
            "2 cups low-sodium chicken broth",
            "1/2 cup fresh parsley",
            "1 cup frozen baby lima beans, thawed"
        ],
        "title": "Spanish Rice with Clams",
        "picture_link": "Rc2RzvaFla/P4fr86boyUWG1H3XYsz."
    },
    "EtnHT80heFkb3qoW1Weq3p3uka/gxI.": {
        "instructions": "For the Thai Paste: Preheat the oven to 400 degrees F. Spread the cashews on a baking tray and roast until golden brown, about 10 minutes. Cool.\nIn a small pan, cook the ginger in the plum wine until the wine evaporates. With a mortar and pestle or in a blender, puree all of the Thai Paste ingredients. Reserve.\nFor the Salad: In a medium bowl, combine the papaya, onion, cilantro, and jalapeno. In a small bowl, whisk together the lime juice, vinegar, and honey. At serving time, toss the dressing with the salad and season with salt and pepper, to taste.\nRaise the oven temperature to 450 degrees F. Season the pork medallions with salt and pepper and flatten slightly with a cleaver or a heavy plate. In an ovenproof skillet, heat the peanut oil. Over high heat, brown both sides of the medallions. Transfer to the oven and roast until medium rare, about 15 minutes. Remove the medallions to a plate and keep warm.\nPour the grease from the skillet and deglaze the pan with port. Pour in the stock and cook over high heat until the sauce thickens slightly. Whisk in 1/4 cup of the Thai paste and season, to taste, with salt, pepper, and lime juice. Keep warm.\nCut each medallion into slices. Pour a little sauce into the center of 4 warmed plates and arrange slices of the pork on 1 side of the sauce. Mound a little salad in each radicchio leaf, set alongside the slices of pork, and garnish with a few cilantro leaves.",
        "ingredients": [
            "4 ounces (3/4 cup) unsalted raw cashews",
            "1-ounce peeled, fresh ginger",
            "1/2 cup plum wine",
            "1/4 cup peanut oil",
            "1/2 cup sliced green onions",
            "1/2 cup chopped cilantro leaves",
            "6 garlic cloves",
            "1 chile pepper, jalapeno or red serrano, cored, seeded, and coarsely chopped",
            "1 1/2 tablespoons turmeric",
            "1 tablespoon honey",
            "1 tablespoon sesame oil",
            "1 tablespoon balsamic vinegar",
            "1 tablespoon cumin",
            "1 teaspoon freshly ground white pepper",
            "1/2 teaspoon coarse salt",
            "1 or 2 papayas or mangoes (12 ounces each), peeled, seeded, and diced",
            "1/2 red onion, diced",
            "1/4 cup cilantro leaves",
            "1/4 jalapeno pepper, cored, seeded, and chopped fine",
            "2 limes, juiced",
            "1 tablespoon balsamic vinegar",
            "1 teaspoon honey",
            "Salt",
            "Freshly ground white pepper",
            "4 radicchio leaves",
            "1 1/2 pounds pork loin, cut into 4 (6-ounce) medallions",
            "Freshly ground pepper",
            "1 tablespoon peanut oil",
            "1/2 cup port",
            "1 cup veal stock",
            "Lime juice"
        ],
        "title": "Pork Loin with Thai Sauce and Papaya Salad",
        "picture_link": null
    }
}