{
    "F7hgJTpFu4ndOjYhx6HCdKn/an0Quci": {
        "instructions": "Preheat oven at 350 degrees F.\nCut the plums in half, and remove the pits. Place the plums in a baking dish, skin-side down, and sprinkle with sugar, and cinnamon, and grate a little lemon zest over the top.\nPlace the baking dish in the oven and roast for about 30 minutes, or until soft.\nServe over warm bread that has been buttered or 'buttered and honeyed.'",
        "ingredients": [
            "6 to 8 ripe purple prune plums",
            "2 tablespoons brown sugar",
            "1 1/2 teaspoons ground cinnamon",
            "Pinch salt",
            "Zest of 1/2 lemon"
        ],
        "title": "Roasted Cinnamon Plums",
        "picture_link": null
    },
    "NUaNhgIU3TK0uDEfuRklPTVIJYyj2sO": {
        "ingredients": [
            "8 ounces feta cheese, crumbled (about 1 1/3 cups)",
            "1 cup whole-milk ricotta cheese",
            "1/4 cup finely chopped scallion",
            "1/4 cup pine nuts, toasted lightly and cooled",
            "2 tablespoons chopped fresh dill, or to taste",
            "2 teaspoons fresh lemon juice, or to taste",
            "Accompaniment: crackers or toast points"
        ],
        "picture_link": null,
        "instructions": "In a food processor blend cheeses until smooth. Add remaining ingredients and pulse motor until combined well but still chunky. Spread may be made 3 days ahead and chilled, covered.\nIn a food processor blend cheeses until smooth.\nAdd remaining ingredients and pulse motor until combined well but still chunky. Spread may be made 3 days ahead and chilled, covered.\nServe spread chilled or at room temperature with crackers or toast points.\nServe spread chilled or at room temperature with crackers or toast points.",
        "title": "Dilled Feta Ricotta Spread "
    },
    "qnlDXmPpOGLPKcMM79jcs6HgIi.COSO": {
        "instructions": "In a small food processor make a puree of the herbs, ginger and jalapeno pepper. Mix this into the yogurt and add the scallion and cumin. Season the sauce with salt and pepper and blend in any of the other optional ingredients\nServe very cold; great against hot steak.",
        "ingredients": [
            "1/4 cup (packed) each mint, parsley and cilantro leaves",
            "Nickel size round of fresh ginger",
            "1 fresh jalapeno pepper, seeded",
            "2 cups yogurt, preferably whole milk",
            "1 scallion, thinly sliced",
            "1/2 teaspoon toasted ground cumin",
            "Salt to taste",
            "Optional additions: 1/2 to 1 cup grated seeded cucumbers, or seeded diced tomatoes or 1/4 cup puree of roasted red peppers"
        ],
        "title": "Yogurt Based Sauces",
        "picture_link": null
    },
    "DMpybPFXx1r4U.csFCVwQisu3y0B0PW": {
        "instructions": "Special equipment: Chilled cocktail glasses\nMix and stir the rum, Watermelon Puree, orange juice and lime juice. Serve over ice in chilled cocktail glasses.\nMuddle the watermelon, liqueur and basil in a glass until you reach a thick and slightly chunky puree consistency.",
        "ingredients": [
            "8 cups (64 ounces) white rum",
            "4 cups (32 ounces) Watermelon Puree, recipe follows",
            "3 cups (24 ounces) orange juice",
            "1 cup (8 ounce) lime juice",
            "5 cups fresh watermelon, cubed",
            "5 ounces orange-flavored cognac liqueur, such as Grand Marnier",
            "15 fresh basil leaves, shredded"
        ],
        "title": "Rum Punch",
        "picture_link": "PHZxpLabgwlyfpv5GGKEIIolEmhKn06"
    },
    "RyteBzyXDSi068iWzEMaSeY5Tumi98m": {
        "instructions": "In a large pitcher combine the rose, orange-flavored liqueur, cantaloupe syrup, cantaloupe, and honeydew melon. Stir in the water. Pour into serving glasses and enjoy.\nTo make Cantaloupe Syrup:\nSeed and peel the cantaloupe and then cut the melon into chunks. Transfer to a blender and process with the simple syrup until smooth. Pour in the vanilla extract and mix to combine. Store the mixture in the refrigerator until ready to use, up to 3 days.",
        "ingredients": [
            "1 bottle sparkling rose wine, chilled",
            "1/4 cup orange-flavored liqueur",
            "1 cup cantaloupe syrup, recipe below",
            "2 cups sliced cantaloupe melon",
            "2 cups sliced honeydew melon",
            "1/2 cup water",
            "1 small cantaloupe",
            "2 cups simple syrup (equal parts sugar and water, cooked until sugar is dissolved, then cooled)",
            "1 teaspoons vanilla extract"
        ],
        "title": "Melon-Rose Sangria",
        "picture_link": null
    },
    "pz8Ssa0pOqkk55QwM9aOLSvyuvURKJW": {
        "ingredients": [
            "3 tablespoons ghee (clarified butter) or unsalted butter",
            "1 large shallot, thinly sliced into rings",
            "2 bunches curly or Tuscan kale, ribs and stems removed, leaves torn into 2\" pieces",
            "2 tablespoons prepared lime pickle, chopped",
            "Kosher salt, freshly ground pepper"
        ],
        "picture_link": "4aDJrHIX.2uEqErfXMOuSxRLwFDNIwu",
        "instructions": "Heat ghee in a large skillet over medium-high heat. Add shallot and cook, stirring often, until beginning to brown, about 4 minutes. Working in batches, add kale, tossing and letting it cook down slightly before adding another handful or two, and adding a splash of water if pan looks dry. Add lime pickle and cook, tossing often, until kale is wilted and tender, 5–8 minutes; season with salt and pepper.\nHeat ghee in a large skillet over medium-high heat. Add shallot and cook, stirring often, until beginning to brown, about 4 minutes. Working in batches, add kale, tossing and letting it cook down slightly before adding another handful or two, and adding a splash of water if pan looks dry. Add lime pickle and cook, tossing often, until kale is wilted and tender, 5–8 minutes; season with salt and pepper.",
        "title": "Sautéed Kale with Lime Pickle "
    },
    "H0tHTFIaM.VIEntG0QxFfF80zbRtlxO": {
        "instructions": "Preheat the grill.\nCut the radicchio lengthwise into 1/4-inch slices, removing the core. In a small bowl, combine the remaining ingredients to make the marinade. Pour the marinade over the radicchio slices, letting them soak for a few minutes before placing on the grill. Grill for 3 to 4 minutes on each side, continuing to baste with marinade. Remove from the heat and serve.",
        "ingredients": [
            "2 heads radicchio, cleaned",
            "3 tablespoons olive oil",
            "1 tablespoon balsamic vinegar",
            "1 tablespoon Dijon mustard",
            "2 splashes Worcestershire sauce",
            "Dash salt and pepper"
        ],
        "title": "Grilled Radicchio",
        "picture_link": null
    },
    "uFkwHbMmoyR12e5lzGE.Y266WO/.57.": {
        "instructions": "Combine the cherry tomatoes in a medium bowl with 1/4 teaspoon salt and 1/4 teaspoon pepper. Add the sugar, lemon juice, vinegar and 1 tablespoon of the olive oil. Marinate at room temperature for a minimum of 30 minutes and up to 3 hours.\nIf the marinated cherry tomatoes have released a lot of juice, pour a little off before adding the remaining 3 tablespoons olive oil.\nPlace the arugula in a salad bowl and season lightly with salt and pepper. Add the cherry tomato mixture and toss to combine. Top with the parmesan. Serve.",
        "ingredients": [
            "1 pint cherry tomatoes, halved",
            "Salt and freshly ground black pepper",
            "1/2 teaspoon sugar",
            "1 tablespoon lemon juice",
            "1 tablespoon red wine vinegar",
            "4 tablespoons extra-virgin olive oil",
            "6 ounces arugula, washed and dried",
            "2 ounces shaved Parmesan"
        ],
        "title": "Marinated Cherry Tomatoes with Arugula",
        "picture_link": null
    },
    "doIm9.k5gOngIPrw0rfa8suMP9Lu5hS": {
        "instructions": "Preheat oven to 325 degrees F.\nIf using vacuum-packed chestnuts arrange them in a shallow baking pan in one layer and bake in upper third of oven 6 to 8 minutes, or until hot and outsides are dry. If roasting chestnuts roast as per method below.\nIn a large bowl, sift together the confectioners' sugar and salt. Add hot chestnuts to sugar mixture, tossing gently to coat, and put a rack over baking pan.\nIn a 3-quart saucepan heat 1 1/2 inches oil over moderate heat until a deep-fat thermometer registers 350 degrees F. Working in batches of 8, fry chestnuts 1 to 2 minutes, or until brown and crisp. With a slotted spoon transfer chestnuts as fried to rack. Return oil to 350 degrees F between batches and carefully skim caramelized sugar from surface of oil as necessary.\nChestnuts are best served immediately but may be made 1 hour ahead and kept, uncovered, at room temperature.",
        "ingredients": [
            "1 pound jar vacuum-packed whole chestnuts (not canned) or 1 pound roasted chestnuts (method below)",
            "1 cup confectioners' sugar",
            "1 tablespoon salt",
            "4 cups vegetable oil for deep-frying"
        ],
        "title": "Caramelized Chestnuts",
        "picture_link": null
    },
    "L30WxtWpwEjNhswt6GBV1JWUtiCSiCG": {
        "instructions": "Preheat the oven to 350 degrees F. Toss the pork rinds, tortilla chips, corn nuts and peanuts together in a large bowl.Whisk the lime zest and juice, Worcestershire, chili powder, cayenne and 1/2 teaspoon salt in a separate bowl. Pour the sauce over the snack mix and toss to coat well. Spread out on a rimmed baking sheet and bake until the mix is toasted and almost completely dry, about 10 minutes, tossing about halfway through.\nLet cool completely, and then store in an airtight container for up to 3 days.",
        "ingredients": [
            "7 cups pork rinds, broken into bite-size pieces (about 3 ounces)",
            "6 cups lime-flavored tortilla chips, broken into bite-size pieces (about 6 ounces)",
            "1 1/2 cups corn nuts",
            "1 1/2 cups honey roasted peanuts",
            "2 limes, zest from 2 and juice from 1",
            "2 teaspoons Worcestershire sauce",
            "1 teaspoon chili powder",
            "1/2 teaspoon cayenne pepper",
            "Kosher salt"
        ],
        "title": "Spicy Pig Skin and Corn Nut Snack Mix",
        "picture_link": "uHc8UOkFhFUtLuUzdWUwYvfNq1zWi1G"
    },
    "UF9Y/LJ94vnMuX8YyHwLImACsd9QX.y": {
        "instructions": "Preheat the oven to 350 degrees F.\nGrease a baking dish with nonstick spray. Arrange the fish fillets in the prepared baking dish to cover the bottom. In a bowl, combine the bread crumbs with melted butter, crabmeat, and artichokes. Slice the tomato thinly and arrange the slices over the fish. Spread the cheese over the tomatoes. Top with the buttered crumb mixture. Bake for 20 to 25 minutes, or until fish is white and flaky. Variants: Add sliced bell peppers, avocado, or broccoli.",
        "ingredients": [
            "Nonstick cooking spray",
            "2 pounds fresh haddock fillets, or other delicate white fish",
            "2 cups garlic and herb flavored prepared bread crumbs",
            "1 stick (4 ounces) butter, melted",
            "4 ounces fresh chunk crabmeat",
            "4 artichoke hearts, chopped",
            "1 large beefsteak tomato",
            "1 cup shredded cheddar"
        ],
        "title": "Baked Haddock, Ellida Style",
        "picture_link": null
    },
    "JoDhYYMwDACSUd9McAZArZRgVke6iVm": {
        "instructions": "Preheat the oven to 400 degrees F.\nPlace the potatoes in the basket of a vegetable steamer. Steam until a sharp paring knife easily enters the flesh, 20 to 25 minutes. Transfer the potatoes to a bowl. When cool enough to handle, peel the potatoes and cut into 1/3-inch-thick slices.\nHeat the oil in a large skillet over medium-high heat. When it is hot, add the potatoes. Cook, tossing occasionally, until the potatoes are golden brown. Transfer to an ovenproof dish and bake for 20 to 30 minutes. This last step renders the potatoes crunchy on the outside and soft on the inside. A few minutes before the potatoes are ready, saute the bacon (or pancetta) over medium-high heat until golden. When the potatoes are ready, add the bacon, sprinkle with the chives and coarse salt; transfer to a serving dish or onto individual plates.",
        "ingredients": [
            "2 pounds all-purpose potatoes (see Note)",
            "2 tablespoons vegetable oil",
            "1 to 1 1/2 ounces slab bacon or pancetta, cut into small dice",
            "1 tablespoon finely chopped fresh chives",
            "Coarse salt"
        ],
        "title": "Sauteed Potatoes with Smoked Slab Bacon",
        "picture_link": null
    },
    "jVcnUuBTjjWK6AlCJI2Wnx7P0bkD8cS": {
        "instructions": "Combine all the ingredients in large mixing bowl and mix at slow speed until smooth. If stiffer icing is needed, or if the weather is very warm, add a little extra sugar. This recipe is enough to cover and fill a 9- by 13-inch sheet cake or two 9-inch layers.",
        "ingredients": [
            "1 cup unsalted butter or margarine, room temperature (use vegetable shortening when pure white icing is needed)",
            "1/2 cup milk, room temperature",
            "1/4 teaspoon salt",
            "2 teaspoons vanilla or other desired flavoring",
            "2 pounds confectioners' sugar"
        ],
        "title": "Basic Buttercream Icing",
        "picture_link": null
    },
    "WmUnfAu5bSOMG6TBXhaODoJO9Y1fNsy": {
        "instructions": "Preheat oven to 250 degrees F.\nIn a bowl combine well the potatoes and the egg, stir in the flour thoroughly, and stir in the onion, chives, and salt and pepper, to taste.\nIn a large heavy skillet, heat 1/8-inch of the oil over moderately high heat until it is hot but not smoking. Fry heaping tablespoons of the potato mixture, flattening them slightly with the back of the spoon, for 1 minute on each side, or until they are golden brown. Transfer the pancakes as they are cooked to paper towels to drain and if desired, keep them warm on a rack set on a baking sheet in a preheated 250 degree F oven. Serve the pancakes as an accompaniment to meat, poultry, or eggs.",
        "ingredients": [
            "2 cups mashed potatoes",
            "1 large egg, beaten lightly",
            "6 tablespoons all-purpose flour",
            "11/2 tablespoons grated onion",
            "2 tablespoons chives",
            "Salt and pepper",
            "Vegetable oil, for frying"
        ],
        "title": "Mashed-Potato Pancakes",
        "picture_link": null
    },
    "LUMdnBvQn5EoIdn8OO5ek5imGAgfYp2": {
        "instructions": "In a large glass bowl, combine the heavy whipping cream and sugar. Beat with a hand mixer until thick and foamy. Add a small drizzle of coconut extract. Continue to whip until soft peaks appear.\nUsing a serrated knife cut the red velvet cake into 1-inch squares. Add about 1/3 of the squares to the bottom of the trifle bowl. Spread a layer of the whipped cream on top of the cake squares, followed by a layer of toasted coconut. Repeat layering 2 more times and serve.",
        "ingredients": [
            "Carton heavy whipping cream, cold",
            "Powdered sugar",
            "Coconut extract",
            "1 store-bought red velvet cake (unfrosted)",
            "Toasted coconut flakes"
        ],
        "title": "No Recipe Recipe: Red Velvet Trifle",
        "picture_link": "fjbiPAE0Kn.OKY5QSVVWQ0OlMUDlcdG"
    },
    "V327lDFTdEof7bsYAJJVBSSKdWQsmzu": {
        "ingredients": [
            "1 meaty ham hock (about 10 ounces)",
            "2 quarts water",
            "2 pound green beans, trimmed"
        ],
        "picture_link": null,
        "instructions": "Bring ham hock and water to a boil with 2 1/2 teaspoons salt and 1 teaspoon pepper in a medium pot. Add green beans and cook, uncovered, until very soft, about 1 hour. Transfer ham hock to a cutting board and discard skin, then finely chop meat, discarding bone. Reserve 1 cup cooking liquid. Drain beans, then toss with ham and reserved cooking liquid. Season with salt and pepper.\nBring ham hock and water to a boil with 2 1/2 teaspoons salt and 1 teaspoon pepper in a medium pot. Add green beans and cook, uncovered, until very soft, about 1 hour.\nTransfer ham hock to a cutting board and discard skin, then finely chop meat, discarding bone.\nReserve 1 cup cooking liquid. Drain beans, then toss with ham and reserved cooking liquid. Season with salt and pepper.",
        "title": "Green Beans in Pork Stock "
    },
    "x58Uk7UxvntNefim2A6S7RQ2.f/Hnzq": {
        "instructions": "Line an 8-by-8-inch baking pan with aluminum foil and lightly grease with vegetable spray. Sprinkle the peanuts over the bottom of the pan. Put the milk and sugar in a medium, heavy-bottomed saucepan fitted with a candy thermometer. Boil over medium heat, occasionally stirring to keep from sticking. Cook until the mixture reaches 240 degrees F (soft ball). Remove from the heat and gently place the butter, peanut butter and vanilla in the pan, taking care not to disturb the syrup. Do not stir. Let the mixture cool down for 5 minutes, then beat vigorously with a spoon or the flat beater of a stationary mixer until dense and smooth. Turn the fudge into the prepared pan, spreading it evenly with a metal spatula. With a sharp knife, score into portions. Let set, 45 minutes then cut into 1 1/3-inch squares.",
        "ingredients": [
            "Non-stick vegetable spray",
            "1/4 cup roasted, unsalted peanuts, coarsely chopped",
            "1 cup milk",
            "2 1/2 cups sugar",
            "3 tablespoons unsalted butter",
            "6 ounces creamy peanut butter",
            "1 teaspoon vanilla extract"
        ],
        "title": "Peanut Butter Fudge",
        "picture_link": null
    },
    "KoF8FbfNVaW3w/QbWuUopb/ZLU0KLsC": {
        "instructions": "1. Preheat oven to 350 degrees F.\n2. Place the peaches and pineapple in an 8-inch by 8-inch baking dish.\n3. Stir together the flour, sugar and cinnamon in a medium bowl. Cut in butter until mixture is crumbly and butter pieces are about the size of a pea. Sprinkle evenly over fruit.\n4. Bake 30 minutes or until topping is crisp and golden. Serve warm with ice cream, if desired.",
        "ingredients": [
            "2 cans (15.25 oz. each) Del Monte Yellow Cling Sliced Peaches, drained",
            "1 can (15.25 oz.) Del Monte Pineapple Chunks in 100% Juice, drained",
            "1/2 cup all-purpose flour",
            "1/2 cup packed dark brown sugar",
            "1/4 tsp. ground cinnamon",
            "1/3 cup cold butter or margarine",
            "(Optional) low-fat vanilla ice cream or frozen yogurt"
        ],
        "title": "Fruit Crumble",
        "picture_link": "wzSXy2Nntf0NjF9gGDTVFew3CFstqJi"
    },
    "a/YpSh2h21F7oicYcgqO.3zg7YzdRmG": {
        "ingredients": [
            "Perfect Mashed Potatoes",
            "2 tablespoons olive oil",
            "2 cups thinly sliced shallots",
            "1 teaspoon chopped fresh sage",
            "1 tablespoon white balsamic vinegar",
            "2 teaspoons sugar",
            "Salt"
        ],
        "picture_link": "d2Ap8HE3g7.xVgbGaecQKiX9aexWStS",
        "instructions": "Prepare perfect mashed potatoes . Meanwhile, heat oil in heavy medium skillet over high heat. Add shallots; sauté until tender, about 2 minutes. Reduce heat to medium-low; stir until shallots are golden, about 5 minutes longer. Add fresh sage, white balsamic vinegar, and sugar; stir until caramelized, about 2 minutes. Stir shallot-sage mixture into potatoes. Season with salt.\nPrepare perfect mashed potatoes . Meanwhile, heat oil in heavy medium skillet over high heat. Add shallots; sauté until tender, about 2 minutes. Reduce heat to medium-low; stir until shallots are golden, about 5 minutes longer. Add fresh sage, white balsamic vinegar, and sugar; stir until caramelized, about 2 minutes. Stir shallot-sage mixture into potatoes. Season with salt.",
        "title": "Caramelized-Shallot and Sage Mashed Potatoes "
    },
    "ykkDMgYr.fctb9X64PUd7DcA/I.SbUK": {
        "instructions": "Bring water or stock and butter to boil. Add rice slowly, stirring constantly. Bring back to boil to a boil, reduce heat, simmer and stir gently once more. Cover and simmer for 9 minutes or just until rice begins to stick to the bottom of saucepan. Remove from heat, fluff with fork and let rest uncovered for 5 to 10 minutes to allow rice to \"dry\". Serve.",
        "ingredients": [
            "1 3/4 cups water or vegetable stock",
            "1 (8 ounce) package Jasmine Blend Indian Harvest rice",
            "1 teaspoon butter"
        ],
        "title": "Indian Harvest Jasmine Blend Rice",
        "picture_link": null
    },
    "A7zd51R/YubKVB7B91SzH6AGzTdVXqO": {
        "ingredients": [
            "1 pound 2 ounces raspberries (4 1/2 cups)",
            "3/4 cup sugar",
            "2 1/2 tablespoons raspberry vinegar",
            "2 tablespoons water"
        ],
        "picture_link": null,
        "instructions": "Bring berries, sugar, vinegar, and water to a boil in a small heavy saucepan, stirring until sugar is dissolved. Reduce heat and simmer, uncovered, stirring occasionally, 20 minutes. Strain thourough a fine-mesh sieve into a bowl, pressing gently on and then discarding solids. You should have about 1 cup syrup. If more, boil until reduced. Cool, then chill, covered.\nBring berries, sugar, vinegar, and water to a boil in a small heavy saucepan, stirring until sugar is dissolved. Reduce heat and simmer, uncovered, stirring occasionally, 20 minutes. Strain thourough a fine-mesh sieve into a bowl, pressing gently on and then discarding solids. You should have about 1 cup syrup. If more, boil until reduced. Cool, then chill, covered.",
        "title": "Raspberry Zing Syrup "
    },
    "qElhwK4M2bc8.vA2vXZdsBC7lf0jcfu": {
        "instructions": "Steam potatoes on a steamer rack set over boiling water, covered, until tender, 10 to 15 minutes. Toss with butter, parsley, and salt and pepper to taste.;",
        "ingredients": [
            "1/2 pound small potatoes (about 2 inches in diameter)",
            "1 tablespoon unsalted butter, softened",
            "3 tablespoons finely chopped fresh flat-leaf parsley",
            "Salt and pepper, to taste"
        ],
        "title": "Parsleyed Steamed Potatoes",
        "picture_link": null
    },
    "XmFp49.xfwdShjO7atxjYOcK6zWG2Zu": {
        "instructions": "Watch how to make this recipe.\nIn a bowl, whisk the hoisin sauce with the vinegar, ginger and garlic.\nSoak the rice noodles in very hot water until soft, according to package instructions. Cut into smaller pieces for serving.\nHeat the oil in a skillet over medium heat, then add pork chop strips and quickly stir-fry until warmed through. Add the hoisin mixture and toss to coat. Remove from the heat.\nServe the pork family style in lettuce cups topped with chopped peanuts, mint, cilantro, bean sprouts and Sriracha and the rice noodles on the side.",
        "ingredients": [
            "1/3 cup hoisin sauce",
            "2 tablespoons rice wine vinegar",
            "2 teaspoons grated ginger",
            "1 clove garlic, grated",
            "One 14-ounce package rice vermicelli noodles",
            "2 tablespoons canola oil",
            "2 pounds cooked pork chops, sliced into strips",
            "1 head Bibb lettuce, separated into leaves",
            "Serving suggestions: chopped peanuts, mint leaves, cilantro leaves, bean sprouts and Sriracha"
        ],
        "title": "Asian Pork Lettuce Cups",
        "picture_link": "JKr33fVF/LBd3sUvVa05D6Unpy35Wyq"
    },
    "Bwihe/XPo/WHOs2gQTEqj8ln/rG2Xqm": {
        "instructions": "Watch how to make this recipe.\nHeat a grill pan over high heat for 5 minutes.\nRub a little olive oil all over the chicken breast and sprinkle all over with salt and pepper. Reduce the heat to medium-high and grill the chicken until cooked through, turning once, about 12 minutes. Set aside and keep warm.\nFill a small saucepan with 1/2 cup water, bring to a boil, add some salt, and cook the barley according to package instructions, until tender. Drain and rinse.\nBring the chicken broth and bay leaf to a simmer in a medium saucepan. Add the carrot, celery and zucchini. Cook until just tender, about 5 minutes. Discard the bay leaf.\nPlace the chicken breast on a cutting board and slice crosswise into thin slices. Spoon the vegetables and barley into serving bowls, then add the hot broth. Lay several slices of chicken over the surface of each bowl.",
        "ingredients": [
            "Extra-virgin olive oil",
            "12 to 14 ounces boneless, skinless chicken breast",
            "Kosher salt and freshly ground black pepper",
            "1/4 cup pearl barley",
            "4 cups reduced-sodium chicken broth",
            "1 bay leaf",
            "1 carrot, finely chopped",
            "1 rib celery, finely chopped",
            "1 small zucchini, finely chopped"
        ],
        "title": "Grilled Chicken Vegetable Soup",
        "picture_link": "7NYSe/Y7v3Y1j1OVn3vRs83EBQ/Y8pi"
    },
    "VyhUZNubKAebugiAW0A6MBHp.b.TuCK": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 350 degrees F. Butter a 2-quart baking dish.\nFor the filling: Toss the apples, butterscotch chips, brown sugar, flour, cinnamon, allspice, and lemon juice together in a large bowl. Add to the buttered baking dish and dot with butter.\nFor the topping: In a separate bowl, combine the flour, sugar, oats, and salt. Blend the butter into the mixture until it forms pea size lumps. Stir in the pecans and sprinkle over the filling.\nBake until the apples are tender and butterscotch is bubbling, about 45 minutes. Let cool for 5 minutes before serving. Plate with a scoop of butter pecan ice cream on top.",
        "ingredients": [
            "5 Granny Smith apples (about 2 pounds), peeled and roughly chopped",
            "1 (11-ounce) bag butterscotch chips",
            "1/4 cup light brown sugar",
            "1/4 cup all-purpose flour",
            "1/2 teaspoon ground cinnamon",
            "1/4 teaspoon ground allspice",
            "1 lemon, juiced",
            "3 tablespoons unsalted butter, cubed, plus more for greasing",
            "3/4 cup all-purpose flour",
            "1/4 cup light brown sugar",
            "1/2 cup quick oats",
            "Pinch kosher salt",
            "1/2 cup butter",
            "3/4 cup pecans, chopped",
            "Butter pecan ice cream, for serving"
        ],
        "title": "Butterscotch Apple Crisp",
        "picture_link": "pRf/vbSWqSYUJaKezsfhS7bslSvmUzG"
    },
    "sQxMhaZpnPka9WovyxjSSR50YD6GLFy": {
        "ingredients": [
            "4 ounces milk chocolate, finely chopped",
            "1/2 teaspoon kosher salt",
            "3/4 cup heavy cream",
            "2 tablespoons unsalted butter, room temperature"
        ],
        "picture_link": "Lfxjkt49escw7AQtfVro5Q.tZ8Tfo/u",
        "instructions": "Place chocolate and salt in a medium heatproof bowl. Heat cream in a small saucepan just until steaming (do not bring to a boil) and pour over chocolate. Let sit until chocolate is melted, about 5 minutes. Add butter and whisk until butter is melted and incorporated and mixture is smooth. Serve warm.\nPlace chocolate and salt in a medium heatproof bowl. Heat cream in a small saucepan just until steaming (do not bring to a boil) and pour over chocolate. Let sit until chocolate is melted, about 5 minutes. Add butter and whisk until butter is melted and incorporated and mixture is smooth. Serve warm.",
        "title": "Milk Chocolate Sauce "
    },
    "ORCpoCfvR34/p70fmnybBbWA1mJx4Ua": {
        "instructions": "Combine all ingredients in a large bowl. Refrigerate for 1 hour. May also be used as a great marinade for chicken, shrimp or beef.",
        "ingredients": [
            "1/2 cup soy sauce",
            "2 teaspoon dark sesame oil",
            "Juice of 2 oranges",
            "2 tablespoon honey",
            "2 tablespoon ginger, peeled and minced",
            "1/2 cup scallion, chopped",
            "2 teaspoon garlic, minced",
            "2 teaspoon sesame seeds, toasted"
        ],
        "title": "Teriyaki Sauce",
        "picture_link": null
    },
    "c/.KKVazrZkdco6P4pNLwylNoHb7aCa": {
        "instructions": "Preheat oven to 450 degrees F.\nAdd broccoli to a large bowl. Add the shallots, cherry tomatoes, garlic and red pepper flakes with 4 tablespoons oil in large bowl. Sprinkle with salt and pepper. Toss to coat and spread onto large baking sheet. Roast until the stems are tender-crisp and lightly golden brown, about 18 minutes. Grate the Parmesan over the broccoli while it's hot.",
        "ingredients": [
            "2 bunches broccoli, cut into 2 1/2-inch long florets",
            "1 medium shallot, roughly chopped",
            "1 pint cherry tomatoes, whole",
            "3 cloves garlic, roughly chopped",
            "1/2 teaspoon red pepper flakes",
            "4 tablespoons olive oil",
            "Salt and freshly ground black pepper",
            "1/3 cup grated Parmesan"
        ],
        "title": "Roasted Broccoli with Cherry Tomatoes",
        "picture_link": "lKD0BIbeeFM4cyDmtORHDR7uvnYARHe"
    },
    "Ni8qew/gtxun1z8yTsdn7w/SlWvlocW": {
        "ingredients": [
            "1 Granny Smith apple",
            "1/2 medium green cabbage, halved lengthwise and sliced very thin (about 4 cups)",
            "1/2 medium red cabbage, halved lengthwise and sliced very thin (about 4 cups)",
            "2 carrots, shredded fine",
            "1/2 cup mayonnaise",
            "1 tablespoon honey",
            "2 teaspoons cider vinegar",
            "1/2 teaspoon salt"
        ],
        "picture_link": null,
        "instructions": "In a large bowl, whisk together dressing ingredients. Shred apple coarse and add to dressing with cabbage and carrots. Toss cole slaw well.\nIn a large bowl, whisk together dressing ingredients.\nShred apple coarse and add to dressing with cabbage and carrots. Toss cole slaw well.",
        "title": "Cole Slaw "
    },
    "GRdO82cehholWJURZOgbX06lJioPFLm": {
        "instructions": "Heat the oven to 400 degrees F. Beat the egg and water in a small bowl with a fork or whisk.\nStir the muenster cheese, parmesan cheese, onion and garlic powder in a medium bowl.\nUnfold the pastry sheet on a lightly floured surface. Brush the pastry sheet with the egg mixture. Top with the cheese mixture and spinach. Starting with a short side, roll up like a jelly roll. Cut into 20 (1/2-inch) slices. Place the slices, cut-side down, onto baking sheets. Brush the slices with the egg mixture.\nBake for 15 minutes or until the pastries are golden brown. Remove the pastries from the baking sheets and let cool on wire racks for 10 minutes.",
        "ingredients": [
            "1 egg",
            "1 tablespoon water",
            "1/2 cup shredded Muenster cheese or mozzarella cheese",
            "1/4 cup grated Parmesan cheese",
            "1 green onion, chopped (about 2 tablespoons)",
            "1/8 teaspoon garlic powder",
            "All-purpose flour",
            "1/2 of a 17.3-ounce package Pepperidge Farm Puff Pastry Sheets (1 sheet), thawed",
            "1 package (about 10 ounces) frozen chopped spinach, thawed and well drained"
        ],
        "title": "Spinach-Cheese Swirls",
        "picture_link": "2fZiy8V52CdWRHAEPWEZ5i52PNXhz/."
    },
    "vP5Ax3hh7ABIVU1g4TCtmGSDrvE7dcm": {
        "instructions": "In a large heavy skillet cook onions in 2 tablespoons oil over moderate heat, stirring, until golden and add flour. Cook mixture over moderately low heat, stirring, 2 minutes and stir in wine, tomato paste, broth and gravy. Simmer sauce, stirring, 3 minutes and stir in mustard.\nPreheat oven to 400 degrees. Spoon half of sauce into 2-quart shallow flameproof baking dish and arrange beef on it, overlapping slices. Spread remaining sauce over beef.\nIn a small bowl toss bread crumbs with remaining 1 1/2 tablespoons oil and sprinkle over sauce. Bake miroton in upper third of oven until just bubbling around edges, about 5 to 10 minutes. If crumbs are not golden, put miroton under broiler 1 to 2 minutes.",
        "ingredients": [
            "2 large onions, sliced thin",
            "3 1/2 tablespoons olive oil",
            "1 1/2 tablespoons all-purpose flour",
            "1/2 cup red wine",
            "2 teaspoons tomato paste",
            "1 cup beef broth",
            "1 cup beef gravy (reserved from rump roast)",
            "2 tablespoons Dijon mustard",
            "12 thin slices (about 1 1/4 pounds) leftover roast beef",
            "1 1/3 cups fresh bread crumbs"
        ],
        "title": "Beef Miroton",
        "picture_link": null
    },
    "oNPIOO7QWgJ/Xw36YOlUMxAZjc7aVsW": {
        "instructions": "Melt the butter in a saucepan over low heat. Whisk in the flour, and add the milk slowly, whisking as you go. Let the sauce simmer over a very low flame for about 10 minutes. Stir in the cheese, dry mustard, Worcestershire, salt, white pepper and cayenne.",
        "ingredients": [
            "2 ounces butter",
            "2 ounces all-purpose flour",
            "1 quart whole milk",
            "8 ounces sharp white Cheddar, shredded",
            "1/2 teaspoon dry mustard",
            "2 teaspoons Worcestershire sauce",
            "1 teaspoon salt",
            "1/4 teaspoon white pepper",
            "1/4 teaspoon cayenne, or to taste"
        ],
        "title": "White Cheddar Mornay",
        "picture_link": null
    },
    "FFyAsUf3nnwwbh9.BnmaUc6JEP0Z5.2": {
        "instructions": "Mix the sliced beef with soy sauce, cooking wine, and cornstarch and set aside. Heat the wok and 4 tablespoons of vegetable oil. Stir-fry the garlic and jalapeno pepper until fragrant, about 1 minute. Add the beef and the sauce ingredients and stir-fry over high heat just until the beef is no longer pink on the outside, about 2 to 3 minutes. Add the green onions during the last 1 minute of cooking.",
        "ingredients": [
            "1 pound flank steak, sliced very thinly",
            "1 tablespoon soy sauce",
            "1 teaspoon cooking wine",
            "2 teaspoons cornstarch",
            "4 tablespoons vegetable oil",
            "1 teaspoon sliced fresh garlic",
            "1 teaspoon sliced jalapeno pepper",
            "Six 1-inch sections green onion",
            "1/2 teaspoon salt",
            "1/2 teaspoon sugar",
            "1/4 teaspoon black pepper",
            "1/2 teaspoon sesame oil"
        ],
        "title": "Szechuan Beef",
        "picture_link": null
    },
    "nFgNpzTAz3IsMInbo/LanENFe2LnSme": {
        "instructions": "In a large bowl, combine by hand the squash, half of the onion, 1/8 cup egg substitute, 1/4 teaspoon salt, and 1/4 teaspoon pepper. In another large bowl, combine by hand the zucchini, half of the onion, 1/8 cup egg substitute, 1/4 teaspoon salt, and 1/4 teaspoon pepper.\nHeat a large non-stick griddle over high heat; it will be hot enough when a drop of water sizzles when dropped on the surface. Squeeze out the excess liquid from both the squash and zucchini mixtures. Working in batches so as not to overcrowd the griddle, carefully drop 1 heaping tablespoon of both batters onto the hot griddle and flatten with a spatula to form pancake shape. Cook for a couple minutes on each side or until golden brown. Repeat until no batter remains. Keep warm in a low oven (250 degrees F) until all latkes are made, if desired.",
        "ingredients": [
            "2 cups grated yellow squash (from 2 medium squash)",
            "1/2 cup grated onion",
            "1/4 cup egg substitute, divided",
            "1/2 teaspoon salt, divided",
            "1/2 teaspoon black pepper, divided",
            "2 cups grated zucchini (from 2 medium zucchini)",
            "Olive oil spray"
        ],
        "title": "Latkes",
        "picture_link": "CP13hD2CtqRMETYKALpm9Z0i6nuMbYm"
    },
    "gTGlT91q2TkSe9ax0E6FjSEwctmkiVe": {
        "instructions": "Blend the coconut milk, chia seeds, honey, cinnamon, ginger, vanilla, oranges and 3 ice cubes in a blender on low speed until everything begins to combine. Raise the setting to high and blend until everything is well combined and the smoothie begins to have a creamy consistency. Taste; if you like it colder, add more ice cubes and blend until smooth.\nPour into two glasses and garnish with a sprinkle of cinnamon and chia seeds if using.",
        "ingredients": [
            "1 teaspoon alcohol-free vanilla extract",
            "2 seedless oranges, peeled and segmented",
            "1 cup unsweetened coconut milk",
            "1 tablespoon chia seeds, plus more for garnish, optional",
            "2 teaspoons honey",
            "1 teaspoon cinnamon, plus more for garnish, optional",
            "1 teaspoon chopped peeled gingerroot (about one 1/2-inch piece)"
        ],
        "title": "Orange-Spice Chia Smoothie",
        "picture_link": null
    },
    "BXcbNShfdC.zhEh5biwQoyoTGn8zuq2": {
        "ingredients": [
            "2 (14-ounce) cans black beans, rinsed and drained, divided",
            "3 tablespoons mayonnaise",
            "1/3 cup plain dry bread crumbs",
            "2 teaspoons ground cumin",
            "1 teaspoon dried oregano, crumbled",
            "1/4 teaspoon cayenne",
            "1/4 cup finely chopped cilantro",
            "3 tablespoons vegetable oil",
            "4 soft hamburger buns",
            "Accompaniments: sour cream; salsa; lettuce"
        ],
        "picture_link": "JswuG2t842d44T33MtK4UaARqfoJC.2",
        "instructions": "Pulse 1 can beans in a food processor with mayonnaise, bread crumbs, cumin, oregano, and cayenne until a coarse purée forms. Transfer to a bowl and stir in cilantro and remaining can beans. Form mixture into 4 patties. Heat oil in a 12-inch heavy skillet over medium-high heat until it shimmers. Cook burgers until outsides are crisp and lightly browned, turning once, about 5 minutes total. Serve on buns.\nPulse 1 can beans in a food processor with mayonnaise, bread crumbs, cumin, oregano, and cayenne until a coarse purée forms. Transfer to a bowl and stir in cilantro and remaining can beans. Form mixture into 4 patties.\nHeat oil in a 12-inch heavy skillet over medium-high heat until it shimmers. Cook burgers until outsides are crisp and lightly browned, turning once, about 5 minutes total. Serve on buns.",
        "title": "Black-Bean Burgers "
    },
    "A3byGDauJETic8WWNcaP6UFqZ7hno4e": {
        "instructions": "Preheat a large skillet or saute pan with 1 inch of oil, on medium heat.\nIn a saucepan, melt the butter and saute the ginger until soft. Add the blueberries, sugar, and lemon juice and simmer for 10 minutes until soft. Whisk in the cornstarch, stir 3 minutes, and let cool.\nPlace small mound of filling on in the center of the egg roll skin and slightly wet edges. Fold over for a very tight seal. Shallow fry both sides until brown, about 2 minutes a side. Meanwhile, mix the zest with the whipped cream. Plating: Place small mound of leftover filling on a small plate. Place the pie on top. Drizzle with Maple syrup. Top with cream and powdered sugar. Garnish with remaining berries.",
        "ingredients": [
            "Grapeseed oil, for frying",
            "1 tablespoon butter",
            "1 tablespoon minced ginger",
            "2 pints fresh blueberries, plus 1/2 cup fresh blueberries, for plating",
            "1/2 cup sugar",
            "2 lemons, zested and juiced",
            "1 tablespoon cornstarch mixed with 1 teaspoon water",
            "4 large egg roll skins",
            "1 cup whipped cream, slightly sweetened",
            "Maple syrup, for plating",
            "Powdered sugar, for plating"
        ],
        "title": "Fried Ginger-Blueberry Pie with Lemon Cream",
        "picture_link": null
    },
    "Sy82fR96fKUx/ytQ8.fm8vi5TkFpDYW": {
        "instructions": "Preheat the oven to 450 degrees F. A half-hour before cooking, remove steak from refrigerator.\nHeat a large skillet over high heat. Pat steak dry and season generously with salt and pepper. Add oil to hot skillet and when it begins to smoke add steak. Reduce heat slightly and cook steak until browned, about 4 minutes on each side. Transfer skillet to the oven. Roast until an instant-read thermometer inserted sideways into the steak registers 120 degrees F for medium-rare, about 6 to 8 minutes. Transfer steak to a cutting board and let it rest for 10 minutes. Cut steak from the bone and carve meat across the grain.",
        "ingredients": [
            "1 1/2 pounds bone-in T-bone steak",
            "Kosher salt and freshly ground black pepper",
            "1 tablespoon canola oil"
        ],
        "title": "Pan Seared T-Bone Steak",
        "picture_link": "8556CajbM/XTe2PQeW8vTs.x0d7XM/e"
    },
    "JZQhHTZR3wy0k7Qo9.He2PdoSBcFhnW": {
        "instructions": "Preheat the oven to 375 degrees F.\nSpray a baking sheet (or baking pan) with nonstick spray and set aside.\nUsing a blender or food processor, grind cereal to a breadcrumb-like consistency. Transfer to a small bowl and set aside.\nCrush potato chips in a sealed bag, and then add to the bowl of cereal crumbs. Add spices and mix well.\nPlace chicken pieces in a separate bowl, cover with hot sauce, and toss to coat.\nGive each chicken piece a shake so it's not dripping with sauce, and then coat evenly with crumb mixture. Lay crumb-covered nuggets on the baking sheet.\nBake in the oven for 10 minutes.\nFlip nuggets over and bake until outsides are crispy and chicken is cooked throughout, about 10 more minutes.\nServe with carrot sticks, if using. Enjoy!",
        "ingredients": [
            "1/4 cup high-fiber bran cereal twigs (recommended: Fiber One Original)",
            "1 ounce fat-free BBQ-flavored potato chips (recommended: Pringles Light Fat-Free Barbecue Potato Crisps)",
            "Dash onion powder",
            "Dash garlic powder",
            "Dash cayenne pepper",
            "Dash black pepper",
            "Dash salt",
            "8 ounces raw boneless skinless lean chicken breast, cut into 10 nuggets",
            "3 tablespoons Frank's RedHot Original Cayenne Pepper Sauce",
            "Carrot sticks, as optional accompaniment"
        ],
        "title": "H-O-T Hot Boneless Buffalo Wings",
        "picture_link": "MfcPAVg.KXGbQtv1mXjpMwJz7NLRHaG"
    },
    "Dr8M9gq99YYpcIkUYgJZDguJCN6ny4G": {
        "instructions": "Cream butter and sugar. Add milk and egg and beat until smooth. Sift together flour, baking powder and salt. Add to creamed mixture. Mix until moistened. Toss blueberries with flour and fold into batter. Fill a well-greased muffin pan 2/3 full with the batter. Bake at 400 degrees for 20 minutes.",
        "ingredients": [
            "3/4 cup butter",
            "1 cup sugar",
            "3/4 cup milk",
            "1 egg",
            "1 3/4 cup sifted flour",
            "2 1/2 teaspoons baking powder",
            "1/2 teaspoon salt",
            "1 cup blueberries",
            "1 tablespoon flour"
        ],
        "title": "Blueberry Muffins",
        "picture_link": null
    },
    "LbJoVWDY/xeh4XfjuCmxmKWhQWPgbLq": {
        "instructions": "Spread the coconut out in an 8-inch square baking dish and microwave on high in 1-minute intervals, tossing in between, until the coconut is light golden brown, 6 to 8 minutes. Transfer the coconut to a small bowl and reserve. Wipe out the baking dish.\nTrim the cauliflower florets, cutting away as much stem as possible and discarding. In 2 batches, break up the florets into a food processor and pulse until the mixture resembles grains of couscous, until you have about 4 cups total. Put the cauliflower grains into the baking dish along with the ginger, coriander, cumin, turmeric, 1 tablespoon olive oil, 1 1/2 teaspoons salt and 1/4 teaspoon black pepper. Stir well, making sure that the cauliflower is coated in the spices. Cover the bowl tightly with plastic wrap and microwave on high for 3 minutes. Peel back the plastic wrap, being careful not to burn yourself with the steam, and check if the cauliflower is crisp-tender. If not, stir, cover again and cook for an additional 1 to 2 minutes.\nOnce the cauliflower couscous is cooked, fold in the raisins, the remaining tablespoon olive oil and half of the coconut. Transfer the mixture to a serving bowl and garnish with the cilantro and the remaining coconut. Serve immediately or at room temperature.",
        "ingredients": [
            "1/2 cup unsweetened shredded coconut",
            "1 large head cauliflower (about 2 pounds), separated into 1-inch florets",
            "1 teaspoon finely minced ginger",
            "1/4 teaspoon ground coriander",
            "1/4 teaspoon ground cumin",
            "1/4 teaspoon ground turmeric",
            "2 tablespoons extra-virgin olive oil",
            "Kosher salt and freshly ground black pepper",
            "1/3 cup raisins",
            "1/4 cup cilantro leaves (not packed)"
        ],
        "title": "Microwave Spiced Cauliflower \"Couscous\" with Raisins and Coconut",
        "picture_link": null
    },
    "uEZTJHsEDtlWDZlDA5XsE/lShXZpKra": {
        "instructions": "In a large bowl, combine flour, salt, and pepper. Make a well in the center and add eggs and add 1/4 of the milk. Using a whisk, combine the eggs and milk, then incorporate the flour; beginning with the inner rim of the well. Continue whisking until a smooth, stiff batter forms. Stir in half of the remaining milk. Cover with plastic wrap and let stand at room temperature for 30 minutes.\nHeat oven to 400 degrees F. Place 12 (3/4-cup) capacity muffin tins in oven until very hot, about 5 minutes.\nStir enough of the remaining milk into the batter until it is the consistency of heavy cream. Transfer 1 to 2 teaspoons of drippings into each muffin tin. Pour the batter in the muffin tins, filling them about 1/3 full; the batter should sizzle in the hot drippings. Return to oven and bake until puffed, browned, and crisp, 25 to 30 minutes. Yorkshire pudding is best served hot from the oven, but they can be kept warm in a low oven for about 15 minutes.",
        "ingredients": [
            "2 cups all-purpose flour",
            "1 teaspoon coarse salt",
            "Freshly ground pepper",
            "4 large eggs",
            "3 to 3 1/2 cups whole milk",
            "6 to 8 tablespoons drippings from roasting pan, vegetable oil or lard"
        ],
        "title": "Yorkshire Pudding",
        "picture_link": null
    },
    "HERHvpAeijG15XkVikq7iMsjP0beW2u": {
        "ingredients": [
            "1 (1-pound) unsliced loaf rye bread, cut into 1-inch chunks",
            "1 teaspoon caraway seeds",
            "1 stick unsalted butter, divided",
            "3 cups chopped celery",
            "2 Golden Delicious apples, peeled and chopped",
            "1 medium onion, finely chopped",
            "5 garlic cloves, finely chopped",
            "2 cups chicken stock or reduced-sodium chicken broth"
        ],
        "picture_link": "NL.DGJBYHzAH4M/Rcgk9WqPjlHPisdK",
        "instructions": "Preheat oven to 350°F with racks in upper and lower thirds. Toast bread chunks in two 4-sided sheet pans in oven until lightly browned, about 15 minutes, then transfer to a large bowl. Leave oven on. Meanwhile, cook caraway seeds in 6 tablespoons butter in a 12-inch heavy skillet over medium-high heat, stirring, until fragrant, about 2 minutes. Add celery, apples, onion, garlic, 3/4 teaspoon salt, and 1/2 teaspoon pepper and sauté until vegetables are softened and starting to brown, 12 to 15 minutes. Add stock, scraping up any brown bits. Add mixture to bread cubes, tossing to coat. Transfer to a 3-quart baking dish and dot with remaining 2 tablespoons butter. Bake, uncovered, in upper third of oven until stuffing is crisp on top, about 45 minutes.\nPreheat oven to 350°F with racks in upper and lower thirds.\nToast bread chunks in two 4-sided sheet pans in oven until lightly browned, about 15 minutes, then transfer to a large bowl. Leave oven on.\nMeanwhile, cook caraway seeds in 6 tablespoons butter in a 12-inch heavy skillet over medium-high heat, stirring, until fragrant, about 2 minutes. Add celery, apples, onion, garlic, 3/4 teaspoon salt, and 1/2 teaspoon pepper and sauté until vegetables are softened and starting to brown, 12 to 15 minutes. Add stock, scraping up any brown bits. Add mixture to bread cubes, tossing to coat.\nTransfer to a 3-quart baking dish and dot with remaining 2 tablespoons butter. Bake, uncovered, in upper third of oven until stuffing is crisp on top, about 45 minutes.\nWhat to drink: Josmeyer Les Folastries Gewürztraminer '05\nJosmeyer Les Folastries Gewürztraminer '05",
        "title": "Rye Bread Stuffing "
    },
    "uaJzAZOnMpHQqjET.RjTdT6rAoqQfq.": {
        "ingredients": [
            "5 cups fresh (or frozen, thawed) blueberries",
            "1/3 cup sugar",
            "2 teaspoons finely grated lemon zest",
            "3 tablespoons fresh lemon juice",
            "1 tablespoon cornstarch",
            "1/4 teaspoon kosher salt",
            "2/3 cup all-purpose flour",
            "2/3 cup coarse-grind cornmeal or polenta",
            "1/3 cup sugar",
            "1 teaspoon kosher salt",
            "10 tablespoons chilled unsalted butter, cut into pieces",
            "1 cup fresh corn kernels (from about 1 large ear)"
        ],
        "picture_link": "pz/pni0K/R6mCc.9chQPoClM8utrzJW",
        "instructions": "Make the filling: Toss blueberries, sugar, lemon zest, lemon juice, cornstarch, and salt in a shallow 2-qt. baking dish.\nToss blueberries, sugar, lemon zest, lemon juice, cornstarch, and salt in a shallow 2-qt. baking dish.\nMake the topping and assemble: Preheat oven to 375°F. Whisk flour, cornmeal, sugar, and salt in a medium bowl to combine. Using your hands, work butter into dry ingredients until no dry spots remain and mixture holds together when squeezed. Add corn and toss to evenly distribute. Press topping between your fingers and break into large pieces over filling. Bake crisp until topping is golden brown and juices are thick and bubbling, 50–60 minutes. Transfer to a wire rack and let cool 30 minutes before serving.\nPreheat oven to 375°F. Whisk flour, cornmeal, sugar, and salt in a medium bowl to combine. Using your hands, work butter into dry ingredients until no dry spots remain and mixture holds together when squeezed. Add corn and toss to evenly distribute. Press topping between your fingers and break into large pieces over filling.\nBake crisp until topping is golden brown and juices are thick and bubbling, 50–60 minutes. Transfer to a wire rack and let cool 30 minutes before serving.\nDo Ahead Crisp can be made 1 day ahead. Store tightly covered at room temperature.\nCrisp can be made 1 day ahead. Store tightly covered at room temperature.",
        "title": "Blueberry and Corn Crisp "
    },
    "BjPXEp4Oqpp.riJi80i/KqyAXXCkyZK": {
        "ingredients": [
            "1 medium eggplant",
            "4 tablespoons olive oil",
            "3 plum tomatoes",
            "5 dried tomatoes packed in oil",
            "1 small onion",
            "1 garlic clove",
            "2 tablespoons pine nuts",
            "2 tablespoons finely chopped mixed fresh herbs (such as basil, mint, parsley, and tarragon leaves)",
            "1/4 cup crumbled soft mild goat cheese (about 2 ounces)",
            "1 tablespoon freshly grated Parmesan"
        ],
        "picture_link": null,
        "instructions": "Prepare grill. Trim eggplant and cut lengthwise into 1/4-inch-thick slices. Using a total of 3 tablespoons oil for eggplant, lightly brush both sides of each slice with some oil and grill in batches on an oiled rack set 5 to 6 inches over glowing coals until golden brown and tender, about 3 minutes on each side. (Alternatively, broil eggplant under a preheated broiler about 3 inches from heat.) With a metal spatula transfer eggplant as grilled to a platter and keep warm, loosely covered. Cut an X in blossom end of each plum tomato. Have ready a bowl of ice and cold water. In a small saucepan of boiling water blanch tomatoes 10 seconds and transfer with a slotted spoon to ice water to stop cooking. Peel tomatoes and seed. Chop blanched and dried tomatoes. Mince onion and garlic. In a 10-inch heavy skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and sauté onion, garlic, and pine nuts, stirring, until onion and pine nuts are golden. Add blanched and dried tomatoes and herbs and sauté, stirring, until liquid tomatoes give off is evaporated, about 3 minutes. Add goat cheese and Parmesan and cook, stirring, just until melted. Remove skillet from heat and season filling with salt and pepper. Put a generous tablespoon filling at wide end of an eggplant slice and roll up slice toward narrow end, enclosing filling. Make more roulades in same manner and arrange on a warm platter.\nPrepare grill.\nTrim eggplant and cut lengthwise into 1/4-inch-thick slices. Using a total of 3 tablespoons oil for eggplant, lightly brush both sides of each slice with some oil and grill in batches on an oiled rack set 5 to 6 inches over glowing coals until golden brown and tender, about 3 minutes on each side. (Alternatively, broil eggplant under a preheated broiler about 3 inches from heat.) With a metal spatula transfer eggplant as grilled to a platter and keep warm, loosely covered.\nCut an X in blossom end of each plum tomato. Have ready a bowl of ice and cold water. In a small saucepan of boiling water blanch tomatoes 10 seconds and transfer with a slotted spoon to ice water to stop cooking. Peel tomatoes and seed. Chop blanched and dried tomatoes. Mince onion and garlic.\nIn a 10-inch heavy skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and sauté onion, garlic, and pine nuts, stirring, until onion and pine nuts are golden. Add blanched and dried tomatoes and herbs and sauté, stirring, until liquid tomatoes give off is evaporated, about 3 minutes. Add goat cheese and Parmesan and cook, stirring, just until melted. Remove skillet from heat and season filling with salt and pepper.\nPut a generous tablespoon filling at wide end of an eggplant slice and roll up slice toward narrow end, enclosing filling. Make more roulades in same manner and arrange on a warm platter.",
        "title": "Grilled Eggplant Roulades Olivo "
    },
    "sqZhNW8Cq4QQWjiimLBcNZrkiCpLZtm": {
        "instructions": "For the cupcakes: Preheat the oven to 350 degrees F. Line a cupcake pan with 12 liners.\nHeat the milk in the microwave for 1 minute, stir and then add 30 more seconds. Place the tea bags in the milk and allow steeping for 5 minutes.\nSift together the flour, baking soda and salt. In the bowl of an electric stand mixer fitted with a paddle attachment, mix the granulated sugar, oil, vanilla and the eggs, 1 at a time. Alternate adding the flour and only 1/2 cup of the tea until incorporated. Reserve 1/2 cup of the tea for the frosting.\nFill the cupcake liners and bake for 15 minutes. Rotate the pan and continue until the cupcake tops spring back and a tester comes out clean, about 5 more minutes. Allow to cool completely before frosting.\nFor the frosting: Cream the butter in the bowl of an electric stand mixer fitted with a paddle attachment. Add the lemon zest. Slowly alternate adding the confectioners' sugar and 1/2 cup reserved tea until you reach the desired frosting consistency.\nFrost the cooled cupcakes and serve.\nThis recipe was created by a contestant during a cooking competition. The Food Network Kitchens have not tested it for home use, therefore, we cannot make any representation as to the results.",
        "ingredients": [
            "3/4 cup whole milk",
            "10 black tea bags",
            "1 1/2 cups all-purpose flour",
            "1 teaspoon baking soda",
            "1/4 teaspoon salt",
            "1 cup granulated sugar",
            "1/2 cup canola oil",
            "1 teaspoon vanilla extract",
            "2 eggs",
            "2 sticks unsalted butter, softened",
            "Zest of 1 lemon",
            "2 cups confectioners' sugar"
        ],
        "title": "Sweet Tea Cupcakes with Lemon Sweet Tea Frosting",
        "picture_link": "THI0m/W.OCBsVRpELxvVqqi0CspioB2"
    },
    "/jsWyN1MURqvFKYKJ3QkHvWbADzQH8m": {
        "instructions": "For the roulade: Preheat oven to 350 degrees F.\nCoat the portobello mushrooms in oil, salt and black pepper and place on a sheet pan. Roast in the oven for 15 minutes or until fully cooked. Chill and thinly slice.\nWorking on a cutting board, spread out a piece of the sliced flank steak. Place a thin line of spinach across the edge of the flank meat. Repeat with the sliced portobello mushrooms and sweet and sour onions. Firmly roll the ingredients up in the flank steak. Secure with a toothpick. Repeat until all the flank meat is stuffed and rolled. Coat a large saute pan with cooking oil and place over high heat. Season each flank steak roulade with salt and pepper. Sear each roulade in the pan by placing the seam side down to ensure closure. Cook until browned on all sides and cooked to desired doneness, about 6 minutes. Slice each roulade on the bias into 1-inch pieces. Serve over arugula and sweet and sour red onions.\nFor the onions: In a saute pan over medium heat, add the cooking oil and sliced onions. Cook for a few moments while stirring, until the onions start to turn translucent. Add the sugar and salt and continue to cook until onions begin to soften, but are still firm to the touch. Add the red wine vinegar and cook until almost all the vinegar has been reduced. Turn the onions out on to a sheet pan to cool.",
        "ingredients": [
            "6 medium portobello mushrooms, stemmed and gilled",
            "Salt and fresh ground black pepper",
            "2 pounds flank steak, thinly sliced on the diagonal against the grain (a.k.a carne asada)",
            "2 cups spinach, collapsed",
            "1 cup sweet and sour onions, plus more for serving, recipe follows",
            "1/4 cup cooking oil",
            "4 cups arugula leaves",
            "1/4 cup cooking oil",
            "5 red onions, sliced",
            "4 tablespoons sugar",
            "1 tablespoon salt",
            "3/4 cup red wine vinegar"
        ],
        "title": "Flank Steak Roulade over Arugula and Sweet and Sour Onions",
        "picture_link": null
    },
    "SUHW9hh20KTtJQn8kGVG7cjmmPvwFG2": {
        "ingredients": [
            "3 tablespoons butter, room temperature",
            "1 1/2 tablespoons minced fresh chives or green onion tops",
            "1/2 teaspoon Dijon mustard",
            "Pinch of cayenne pepper",
            "4 large slices whole wheat sandwiches bread",
            "8 ounces purchased roast chicken, thinly sliced",
            "1 small bunch watercress, thick stems trimmed"
        ],
        "picture_link": null,
        "instructions": "Combine butter, chives, mustard and cayenne in small bowl; blend well. Season to taste with salt and pepper. (Butter can be made 1 day ahead. Cover; chill. Bring to room temperature before continuing.) Spread chive butter on 1 side of each bread slice. Place chicken on buttered side of 2 bread slices. Top chicken with some watercress. Press remaining 2 bread slices, buttered side down, onto watercress. Cut each sandwich into 4 pieces. Arrange any remaining watercress on 2 plates. Top with sandwiches.\nCombine butter, chives, mustard and cayenne in small bowl; blend well. Season to taste with salt and pepper. (Butter can be made 1 day ahead. Cover; chill. Bring to room temperature before continuing.)\nSpread chive butter on 1 side of each bread slice. Place chicken on buttered side of 2 bread slices. Top chicken with some watercress. Press remaining 2 bread slices, buttered side down, onto watercress. Cut each sandwich into 4 pieces. Arrange any remaining watercress on 2 plates. Top with sandwiches.",
        "title": "Chicken Sandwiches with Chive Butter "
    },
    "XNRODd0jRRJNEsJb9OyY5CSH/sqW2ru": {
        "ingredients": [
            "4-6 unsalted matzohs",
            "1 cup (2 sticks) unsalted butter or unsalted Passover margarine",
            "1 cup firmly packed brown sugar",
            "3/4 cup coarsely chopped chocolate chips or semi-sweet chocolate"
        ],
        "picture_link": null,
        "instructions": "Preheat the oven to 375°F. Line a large (or two smaller) cookie sheet completely with foil. Cover the bottom of the sheet with baking parchment — on top of the foil. This is very important since the mixture becomes sticky during baking. Line the bottom of the cookie sheet evenly with the matzohs, cutting extra pieces, as required, to fit any spaces. In a 3-quart, heavy-bottomed saucepan, combine the butter or margarine and the brown sugar. Cook over medium heat, stirring constantly, until the mixture comes to a boil (about 2 to 4 minutes). Boil for 3 minutes, stirring constantly. Remove from the heat and pour over the matzoh, covering completely. Place the baking sheet in the oven and immediately reduce the heat to 350°. Bake for 15 minutes, checking every few minutes to make sure the mixture is not burning (if it seems to be browning too quickly, remove the pan from the oven, lower the heat to 325°, and replace the pan). Remove from the oven and sprinkle immediately with the chopped chocolate or chips. Let stand for 5 minutes, then spread the melted chocolate over the matzoh. While still warm, break into squares or odd shapes. Chill, still in the pan, in the freezer until set. This makes a good gift.\nPreheat the oven to 375°F. Line a large (or two smaller) cookie sheet completely with foil. Cover the bottom of the sheet with baking parchment — on top of the foil. This is very important since the mixture becomes sticky during baking.\nLine the bottom of the cookie sheet evenly with the matzohs, cutting extra pieces, as required, to fit any spaces.\nIn a 3-quart, heavy-bottomed saucepan, combine the butter or margarine and the brown sugar. Cook over medium heat, stirring constantly, until the mixture comes to a boil (about 2 to 4 minutes). Boil for 3 minutes, stirring constantly. Remove from the heat and pour over the matzoh, covering completely.\nPlace the baking sheet in the oven and immediately reduce the heat to 350°. Bake for 15 minutes, checking every few minutes to make sure the mixture is not burning (if it seems to be browning too quickly, remove the pan from the oven, lower the heat to 325°, and replace the pan).\nRemove from the oven and sprinkle immediately with the chopped chocolate or chips. Let stand for 5 minutes, then spread the melted chocolate over the matzoh. While still warm, break into squares or odd shapes. Chill, still in the pan, in the freezer until set.\nThis makes a good gift.\nVariation: You can also use coarsely chopped white chocolate (or a combination of white and dark), and chopped or slivered toasted almonds (sprinkled on top as the chocolate sets). You can also omit the chocolate for a caramel-alone buttercrunch.\nYou can also use coarsely chopped white chocolate (or a combination of white and dark), and chopped or slivered toasted almonds (sprinkled on top as the chocolate sets). You can also omit the chocolate for a caramel-alone buttercrunch.",
        "title": "My Trademark, Most Requested, Absolutely Magnificent Caramel Matzoh Crunch "
    },
    "LAkmYziTR8qjSUauy.kCHF/nnPouBUm": {
        "instructions": "Preheat the oven to 350 degrees F.\nLightly drizzle the kale with canola oil and season with salt and pepper. Lay on a baking sheet in a single layer, and bake until just crisp, 12 to 15 minutes.\nReduce the oven to 250 degrees F.\nMeanwhile, mix the onions, potatoes, egg and 3 tablespoons of the flour in a large bowl until combined. If the mixture feels very wet, add a little more of the flour.\nHeat 1/2 inch canola oil in a large high-sided saute pan over medium heat until it begins to sizzle. Spoon 1 heaping tablespoon of the potatoes per pancake into the pan, spreading into a 2-inch round with a fork. Cook until the bottom is browned, about 5 minutes, and then flip and cook 5 minutes more. Transfer to paper towels to drain and season with salt. Keep the pancakes warm on a wire rack set in a shallow baking pan in the oven.\nCombine the cheese, parsley and green onions in a small bowl and season with salt and pepper.\nPlace the pancakes on a serving platter or cutting board, top each with a dollop of the cheese, and garnish with the kale chips.",
        "ingredients": [
            "1 pound kale, stemmed",
            "Canola oil",
            "Kosher salt and freshly ground black pepper",
            "1/4 cup grated Spanish onion",
            "2 or 3 russet potatoes (1 pound), peeled, coarsely grated, and squeezed dry",
            "1 large egg, lightly whisked",
            "1/4 cup all-purpose flour",
            "1 1/2 cups fresh farmer cheese",
            "1/4 cup fresh parsley, finely chopped",
            "2 green onions, dark and pale green parts finely chopped"
        ],
        "title": "Crispy Potato Cakes with Farmer Cheese, Scallion, Black Pepper and Kale Chips",
        "picture_link": "VRPYSZQGuV92gmy8DVSajSNlBH2KzJ."
    }
}