{
    "UFGRWVKy2dnlupUUfAz0B7g216Ra2Yi": {
        "instructions": "Preheat oven to 375. Beat sugar and eggs together until thoroughly blended. Add lemon rind and melted butter. Mix to blend. Sift together dry ingredients. Add all at once to egg mixture. Stir just to blend. Allow mix to sit at room temperature for approximately 10 minutes. While mix is resting, generously butter Madeleine molds. Spoon mix into molds, filling approximately 3/4 full. Bake approximately 15 minutes or until edges are golden brown. Turn over immediately onto cooling screen. Wipe out each mold cavity, rebutter and fill again until desired number or all mix is used. Store in airtight container until ready to use.;",
        "ingredients": [
            "1/2 cup granulated sugar",
            "2 large eggs",
            "Grated rind of one lemon",
            "4 ounces (one stick) butter, melted",
            "3/4 teaspoon baking powder",
            "3/4 cups all purpose flour",
            "1/4 teaspoon salt"
        ],
        "title": "Madeleines",
        "picture_link": null
    },
    "wFZldijQ7FmEOzxqPemiq7l8KmfQNXK": {
        "instructions": "Preheat oven to 325 degrees F.\nCook sausage in a medium saute pan until golden brown and fat has rendered. Remove the sausage with a slotted spoon to a plate lined with paper towels. Add the onion and carrot to the pan and cook until soft. Add the garlic and cook for 1 minute.\nPlace the beans in a large bowl, stir in the cooked onion mixture, rum, honey, molasses, sugar, and cooked chorizo. Season with salt and pepper, to taste. Transfer the mixture to a casserole or baking dish and pour 3 cups of the stock over. Bake the beans, covered, for 20 minutes. Check to see if the mixture is dry and add more stock, if needed. Continue baking an additional 20 minutes. Uncover and bake for 15 minutes, remove from the oven, and fold in the cilantro, if using. Let sit for 10 minutes before serving.",
        "ingredients": [
            "1/2 pound chorizo sausage, diced",
            "1 large Spanish onion, finely diced",
            "1 large carrot, diced",
            "4 cloves garlic, finely chopped",
            "1 pound black beans, soaked, cooked until tender and drained well",
            "1 cup dark rum",
            "1/8 cup honey, or more to taste",
            "1/8 cup molasses, or more to taste",
            "3 tablespoons dark brown sugar",
            "Salt and freshly ground pepper",
            "3 to 5 cups homemade chicken stock or low-sodium canned chicken broth",
            "1/4 cup chopped fresh cilantro leaves, optional"
        ],
        "title": "Honey-Rum Black Beans",
        "picture_link": null
    },
    "ib8PbQo8Xo1eHzkbgYfUfz6Q1tWRpcK": {
        "ingredients": [
            "1/2 cup well-shaken low-fat buttermilk",
            "2 tablespoons low-fat sour cream",
            "1 tablespoon mayonnaise",
            "3/4 teaspoon finely chopped fresh tarragon or 1/4 teaspoon dried tarragon, crumbled",
            "1/2 teaspoon minced garlic, mashed to a paste with 1/4 teaspoon salt",
            "1/4 teaspoon dry mustard, or to taste",
            "1/2 cup finely chopped red onion",
            "1 small head red leaf lettuce (1/2 pound), torn into pieces",
            "1 bunch watercress, coarse stems discarded",
            "1 cup thinly sliced seedless cucumber (usually plastic-wrapped)"
        ],
        "picture_link": null,
        "instructions": "Make dressing: Whisk together all dressing ingredients in a small bowl with salt and pepper to taste.\nWhisk together all dressing ingredients in a small bowl with salt and pepper to taste.\nMake salad: Soak onion in 1 cup cold water 10 minutes, then drain well in a sieve. Toss lettuce, watercress, and cucumber together in a bowl and divide among 6 plates. Spoon dressing over, then sprinkle salads with onion.\nSoak onion in 1 cup cold water 10 minutes, then drain well in a sieve.\nToss lettuce, watercress, and cucumber together in a bowl and divide among 6 plates. Spoon dressing over, then sprinkle salads with onion.",
        "title": "Red Leaf Lettuce, Watercress, and Cucumber Salad with Buttermilk Dressing "
    },
    "evw4EqGPK7PWkXctJkUsT7hExUvHruW": {
        "instructions": "In a large mixing bowl, beat the 3 eggs with the milk. Slowly mix in the flour and salt. On a floured surface roll out dough until it is about 1/2-inch thick. Cut into small pieces about 1/2 by 1/2-inch in diameter and boil in a large pot for 10 to 15 minutes. Drain and rinse in cold water. Refrigerate if not being used immediately. When ready to serve, melt the butter in a frying pan and saute for a few minutes, until golden brown.",
        "ingredients": [
            "4 cups all-purpose flour",
            "3 eggs",
            "1 cup milk",
            "Dash salt",
            "1 tablespoon butter"
        ],
        "title": "Spaetzle",
        "picture_link": null
    },
    "nk4Z1nF3FmKfvhY7SS1qFMKibNaPgKS": {
        "instructions": "Heat oil in a 12-inch nonstick skillet over moderate heat until hot but not smoking, then cook cumin and red pepper flakes, stirring, 1 minute. Add onion and bell pepper and cook, stirring, until softened. Add chorizo and saute over moderately high heat, stirring, until sausage begins to brown, about 3 minutes. Add rice, crumbling it, and salt. Saute, stirring, until some grains begin to turn golden, about 3 minutes. Add peas and saute, stirring, just until peas are heated through. Remove from heat and stir in pumpkinseeds and cilantro.",
        "ingredients": [
            "1/4 cup extra-virgin olive oil",
            "1 tablespoon cumin seeds",
            "1/2 teaspoon dried hot red pepper flakes",
            "1 large onion, chopped",
            "1 large red bell pepper, chopped",
            "2 (3 to 4 ounces) Spanish chorizo (spicy dried pork sausage) links, quartered lengthwise and cut into 1/4-inch-thick pieces",
            "4 cups cold cooked rice",
            "1 1/2 teaspoons salt",
            "1 (10-ounce) package frozen peas",
            "1/3 cup hulled (green) pumpkinseeds, toasted",
            "1/2 cup finely chopped fresh cilantro, or to taste"
        ],
        "title": "\"Paella\" Fried Rice",
        "picture_link": null
    },
    "JTYPlC0zHvtdkuF/6HFzlGJGy.4eQe6": {
        "instructions": "Remove black skin from sole and then cut off tail and head. Measure butter. Chop parsley finely. Season fish with salt and pepper and lightly coat in flour. Place 1/4 cup of fresh butter in a pan on a moderate heat and when hot add the fish -- cook 2 minutes on each side. Place parsley in tea towel -- dampen tea towel and ring out excess moisture. Place sole (after filleting) onto a serving dish. Sprinkle with dampened parsley. Add the rest of the butter and lemon juice to pan. Heat until just browned and pour over the fish. Serve immediately.",
        "ingredients": [
            "1 sole, cleaned",
            "1/2 cup fresh butter",
            "Handful chopped parsley",
            "Salt and black pepper",
            "Flour, to coat",
            "1 lemon, juiced"
        ],
        "title": "SOLE MEUNIERE",
        "picture_link": "6G1/wANIOWcdIVM6o/CE86HbqqZguLa"
    },
    "T2sxo8PdSp9FNv/yksA.Z5IHvS3ni0S": {
        "instructions": "In a large heavy pot, melt the butter over medium heat. Stir in the leeks, onions and shallots and toss to coat with the butter. Cook onions until they begin to soften. Cover and continue to stir occasionally. When the onions begin to turn golden, turn up the heat to medium high and add the pinch of sugar and nutmeg. Continue to cook until onions turn a rich golden brown. Season onions with salt and pepper. Add red wine and bring to a simmer. Cook for 3-5 minutes. Pour in warm stock and bring to a simmer. Preheat oven to 400 degrees. Ladle soup into ovenproof bowls and place bowls on baking sheet. Top each bowl with slice of bread and sprinkle with cheese. Bake for 15 minutes or until bubbly.",
        "ingredients": [
            "4 tablespoons butter",
            "Salt",
            "1 large leek, white part sliced",
            "Pepper",
            "2 large Spanish onions, sliced",
            "3/4 cup red wine",
            "4 shallots, sliced",
            "6 cups low sodium beef stock, warmed",
            "Pinch of sugar",
            "1 teaspoon nutmeg",
            "1/2 lb Swiss cheese, grated",
            "4 slices sourdough bread"
        ],
        "title": "Onion Soup Gratin",
        "picture_link": null
    },
    ".//VYtwEd.LHH2dbrMnJpAK820fjmHi": {
        "instructions": "Mix spice ingredients in a small bowl and rub into desired steak.",
        "ingredients": [
            "1/3 cup coarse black pepper",
            "1 tablespoon garlic powder",
            "Dash ground cumin",
            "1/3 cup coarse sea salt",
            "1 tablespoon paprika",
            "1 tablespoon dried oregano",
            "1 tablespoon beef base"
        ],
        "title": "Stumps Special Recipe (Dry Rub)",
        "picture_link": null
    },
    "VYJ7dxRZXF54nJQOdfa3Ec5CC9Dd5mi": {
        "instructions": "Watch how to make this recipe.\nSteam or boil the fish 7 to 8 minutes. Remove the fish and let cool 3 minutes, then very carefully peel and discard the skin. Slowly remove the meat from the bones using a fork or small knife (take your time with this as the more you pay attention, the fewer small bones you will find in your finished meal).\nChop the baked potato into bite-size chunks and add the fish to the potatoes. Top with the bacon and onions, then add vinegar and pepper, to taste. Mix all the ingredients together to a hash, using a fork, and enjoy!",
        "ingredients": [
            "3 large fresh whole spot fish, cleaned",
            "1 large Yukon gold baking potato, peeled and boiled",
            "1/4 cup chopped freshly cooked bacon",
            "1/4 cup finely chopped yellow onion",
            "Cider vinegar",
            "Freshly ground black pepper"
        ],
        "title": "Buddy's Fish Hash",
        "picture_link": "Z1E730MdFvppbwyi6eFtYmmjogK8kje"
    },
    "497Tf.6XiKtZglcTmBmpWxWQ68n.6bO": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 400 degrees F.\nPut a 10-inch cast iron skillet in the oven and heat it for at least 30 minutes. Meanwhile, prepare the batter.\nWhisk together the flour, cornmeal, sugar, baking powder and salt in a large bowl. In a medium bowl, whisk together the milk, eggs and melted butter.\nMake a well in the center of the dry ingredients and pour the wet mixture into the well. Use a fork or spatula to stir the batter until evenly combined.\nRemove the hot skillet from the oven, add the fat and swirl to coat the bottom. Pour the batter into the skillet and, using a spatula, spread the batter evenly across the pan. Bake until lightly golden brown, firm and springy to the touch, about 25 to 30 minutes (see Cook's Note). Remove from the oven and serve directly from the skillet, if desired.",
        "ingredients": [
            "2 cups all-purpose flour",
            "2 cups finely ground yellow cornmeal",
            "2 tablespoons sugar",
            "2 teaspoons baking powder",
            "2 teaspoons salt",
            "2 1/4 cups milk",
            "2 large eggs",
            "6 tablespoons butter, melted and slightly cooled",
            "2 tablespoons rendered bacon fat, butter, shortening or vegetable oil"
        ],
        "title": "Gina's Crusty Cornbread",
        "picture_link": "2ZqyguWfnifsXacNYBdun4WVVafDIH6"
    },
    "ynpn7Ggz/5auzmWbxcB5GYDO78mCC8.": {
        "instructions": "Watch how to make this recipe.\nSalsa:\nIn a bowl toss all of the salsa ingredients together and set aside.\nPork chops:\nHeat an outdoor grill or grill pan over medium-high heat.\nBrush the pork chops with the oil. In a small bowl combine the chili powder, salt and pepper. Generously sprinkle the rub over both sides of each pork chop. Grill the chops until cooked through, about 4 to 6 minutes per side. (Set 1 chop aside for Online Round 2 Recipe, Orzo Soup with Pork.) Arrange the chops on a serving platter and let rest 5 minutes before serving.\nServe the chops with the peach salsa.",
        "ingredients": [
            "1/2 red onion, diced (reserve the other half for Online Round 2 Recipe Orzo Soup with Pork)",
            "2 peaches, halved, pitted and diced",
            "1 tablespoon lime juice",
            "1 teaspoon olive oil",
            "1 tablespoon chopped cilantro leaves",
            "Pinch kosher salt and freshly ground black pepper",
            "5 pork chops, end cut",
            "2 tablespoons canola oil",
            "2 tablespoons chili powder",
            "1 tablespoon salt",
            "1 tablespoon freshly ground black pepper"
        ],
        "title": "Grilled Pork Chops with Peach Salsa",
        "picture_link": "7YIZXZQ/uJ6bDaDEnqQ/MyhIu9CXvUe"
    },
    "Dw0VeUl40HX4HgShQ/hRz40Ufl0NdhG": {
        "instructions": "Preheat oven to 350 degrees. Mix all ingredients gently, without breaking up crabmeat. Roll into small rounds and pan fry in oil. Heat through in oven. Serve with favorite accompaniment.;",
        "ingredients": [
            "1 pound jumbo lump crabmeat",
            "2 tablespoons mayonnaise",
            "1/2 teaspoon salt",
            "1/2 teaspoon dried mustard",
            "1/2 teaspoon cayenne pepper",
            "1/2 teaspoon Worcestershire sauce",
            "2 lightly beaten eggs",
            "1/2 small onion, finely chopped",
            "17 saltine crackers, finely chopped",
            "1/3 cup corn oil"
        ],
        "title": "Robert Duvall's Crabcake Recipe",
        "picture_link": null
    },
    "hLo2zmqV4fB37BQEbKjbV1I6UxfYhcq": {
        "ingredients": [
            "1/4 cup honey",
            "1/2 teaspoon freshly ground black pepper",
            "12 fresh figs",
            "1/4 cup soft fresh goat cheese"
        ],
        "picture_link": "VfKrZPXahpgn3egsHT0Hu6Wq71Bve.G",
        "instructions": "Combine honey and pepper in small pitcher; stir to blend. Starting at stem end, cut each fig into quarters, stopping 1/2 inch from bottom to leave base intact. Gently press figs open. Spoon 1 teaspoon cheese into center of each. Arrange figs on platter; drizzle with peppered honey.\nCombine honey and pepper in small pitcher; stir to blend. Starting at stem end, cut each fig into quarters, stopping 1/2 inch from bottom to leave base intact. Gently press figs open. Spoon 1 teaspoon cheese into center of each. Arrange figs on platter; drizzle with peppered honey.",
        "title": "Fresh Figs with Goat Cheese and Peppered Honey "
    },
    "nkdXwAh6jGudhqbmdOoXelKmruUs38.": {
        "instructions": "Peel and chop banana. Freeze for at least 1 hour.\nPlace frozen yogurt, skim milk, and malted milk powder in a sturdy blender. Puree until smooth. Add frozen banana chunks and continue to puree until smooth. Blend in chocolate syrup until completely mixed. Serve in chilled glasses.",
        "ingredients": [
            "1 large banana",
            "1 1/2 cups frozen vanilla nonfat yogurt",
            "1/2 cup skim milk",
            "2 tablespoons malted milk powder",
            "1/4 cup chocolate syrup"
        ],
        "title": "Chocolate Malted Milk Shake",
        "picture_link": null
    },
    "Q/BIzpHkttO7bmgcQPvnKM7oP6sxTWS": {
        "instructions": "In a large mixing bowl, toss cucumbers with salt to coat, then cover with ice cubes and refrigerate. After 1 to 2 hours, drain, rinse thoroughly and strain to remove excess water. Set aside.\nIn a saute pan, heat the olive oil over medium heat. Add the asparagus, carrots, peppers, onions and garlic and saute for 3 minutes or until the vegetables are just beginning to soften. Transfer to a large bowl. Add the cucumbers, oregano, thyme and peppercorns and gently toss to combine.\nReturn the saute pan to medium heat and add the vinegars, sugar, fennel seeds and bay leaves. Simmer until the sugar has dissolved, stirring constantly, about 3 minutes. Pour the syrup over the vegetable mixture and toss to coat.\nCool to room temperature, then cover and refrigerate. These are best eaten a few days after they have been made, but can be eaten after chilling for a few hours.",
        "ingredients": [
            "20 asparagus spears, cut in half",
            "20 baby carrots",
            "2 medium bell peppers, cut into thin slices",
            "2 medium red onions cut into slices",
            "2 medium cucumbers cut into spears",
            "1 1/2 Tbs. kosher salt",
            "4 Tbs. olive oil",
            "2 Tbs. finely chopped garlic",
            "1 Tbs. fresh oregano",
            "1 Tbs. fresh thyme",
            "1 tsp. crushed black pepper",
            "1 1/2 cup white wine vinegar",
            "1/2 cup balsamic vinegar",
            "4 Tbs. sugar",
            "1 Tbs. fennel seeds",
            "3 bay leaves, crumbled"
        ],
        "title": "Fresh Garden Pickles",
        "picture_link": null
    },
    "ngxT5fCBHoaiPJq0ZJs7k8T5DwKrUiK": {
        "instructions": "Dip chops in olive oil; coat with cheese. Dip in eggs, then in bread crumbs to coat nicely.\nHeat some butter (or olive oil) in a skillet. Add breaded chops and fry, over medium high heat, uncovered, for about 4 to 5 minutes a side or until just pink in the middle, and browned on outside.\nRemove chops to a plate and serve as is, with lemon wedges or with couscous, or lima bean puree (recipe follows).",
        "ingredients": [
            "4 rib lamb chops, trimmed of excess fat",
            "Olive oil",
            "1/2 cup freshly grated Parmesan cheese",
            "2 eggs lightly beaten",
            "1/2 cup fresh bread crumbs",
            "2 tablespoons unsalted butter or olive oil",
            "Lemon wedges"
        ],
        "title": "Breaded Lamb Rib Chops",
        "picture_link": null
    },
    "oFLpzMl.fBQB4hknaePIpDe0UPFShhK": {
        "ingredients": [
            "2 sticks (1 cup) unsalted butter, cut into pieces",
            "4 garlic cloves, minced",
            "1 tablespoon kosher salt",
            "1/2 cup finely chopped fresh flat-leaf parsley",
            "2 large round loaves of crusty bread, halved horizontally"
        ],
        "picture_link": null,
        "instructions": "Prepare grill for cooking. Heat butter with garlic and salt over moderate heat, stirring, until melted. Transfer to a bowl and cool. Stir in parsley and pepper to taste. Brush cut sides of bread with half of garlic butter. Grill bread, cut sides down, 5 to 6 inches over glowing coals 2 minutes. Turn bread over and brush with remaining garlic butter. Grill until golden brown, 2 to 3 minutes more.\nPrepare grill for cooking.\nHeat butter with garlic and salt over moderate heat, stirring, until melted. Transfer to a bowl and cool. Stir in parsley and pepper to taste.\nBrush cut sides of bread with half of garlic butter. Grill bread, cut sides down, 5 to 6 inches over glowing coals 2 minutes. Turn bread over and brush with remaining garlic butter. Grill until golden brown, 2 to 3 minutes more.",
        "title": "Grilled Herb Garlic Bread "
    },
    "GoE7reL.X3hmT9qf2gkAgebxuQqi5ri": {
        "instructions": "Fill a saucepot with 1-inch of water. Place mussels in pot, cover, and steam until mussels open, discarding any that do not open. Remove mussels from pan and chill.\nIn a mixing bowl, combine cucumber, tomatoes, onion, garlic, tomato paste, hot sauce, cilantro and lime juice and season with salt and pepper. When mussels are cold, split the shells, leaving the mussel on the half-shell and discarding the other half. Spoon some of the mixture on top of mussel. Garnish with sour cream, if desired.",
        "ingredients": [
            "16 to 24 large fresh mussels in shell, debearded and well scrubbed",
            "1/2 cucumber, peeled, seeded and diced small",
            "2 tomatoes, seeds removed and diced small",
            "1 red onion, finely chopped",
            "2 cloves garlic, finely chopped",
            "2 teaspoons tomato paste",
            "2 dashes hot sauce (recommended: Tobasco)",
            "2 teaspoons finely chopped fresh cilantro",
            "1 lime, juiced",
            "Salt and freshly ground black pepper",
            "1/2 cup sour cream, as garnish, optioinal"
        ],
        "title": "Mussels Gazpacho",
        "picture_link": "mvgkSFA.JkjdQU3N7wCXT.anssrjEjC"
    },
    "xWkwZxXWqwZ95v1wJ9IjvSamGhcTS9W": {
        "instructions": "Watch how to make this recipe.\nCombine the butter and peanut butter in a 4-quart microwave-safe bowl and cover with plastic wrap. Microwave for 2 minutes on high. Stir and microwave on high for 2 more minutes. (Use caution when removing this mixture from the microwave, it will be very hot.) Add the vanilla and powdered sugar to the peanut butter mixture and stir to combine with a wooden spoon. The mixture will become hard to stir and lose its sheen. Spread into a buttered 8 by 8-inch pan lined with parchment paper. Fold the excess parchment paper so it covers the surface of the fudge and refrigerate until cool, about 2 hours. Cut into 1-inch pieces and store in an airtight container at room temperature for up to a week.",
        "ingredients": [
            "8 ounces unsalted butter, plus more for greasing pan",
            "1 cup smooth peanut butter",
            "1 teaspoon vanilla extract",
            "1 pound powdered sugar"
        ],
        "title": "Peanut Butter Fudge",
        "picture_link": "niutU/IBJniUymgE76jhr4Ku60VRBPa"
    },
    "C69169z616FHTsVCPnRYkRS.QMR2BCC": {
        "instructions": "Preheat oven to 350 degrees F. Line an 8-inch square metal cake pan with parchment.\nIn large bowl, whisk together 4 tablespoons melted butter and the melted chocolate. Blend in granulated sugar, 1/4 cup brown sugar, and vanilla. Whisk in egg. Then stir in flour. Spread in pan and bake for 15 minutes, remove and leave oven on.\nHeat 1/2 cup butter and 3/4 cup of the brown sugar in a medium saucepan over medium-high heat. Boil for 2 minutes. Pour over brownie base and bake 7 minutes more. Remove from oven and sprinkle with milk chocolate, let sit 5 minutes, and spread to cover the top. Dust with ground almonds and then pecans. Sprinkle with salt. Press down pecans. Cool, then freeze 30 minutes before cutting. Serve at room temperature.",
        "ingredients": [
            "4 tablespoons unsalted butter, melted, plus 1/2 cup butter for toffee",
            "2 ounces bittersweet chocolate, melted",
            "1/4 cup granulated sugar",
            "1/4 cup packed dark brown sugar, plus 3/4 cup for toffee",
            "1 teaspoon vanilla extract",
            "1 large fresh egg, slightly beaten",
            "1/2 cup all-purpose flour",
            "3/4 cup chopped quality milk chocolate",
            "2 tablespoons ground almonds",
            "1 cup chopped roasted and salted pecans",
            "1/8 teaspoon Maldon or other sea salt crystals"
        ],
        "title": "Sweet and Salty Double Nut Toffee Brownie Bars",
        "picture_link": null
    },
    "yN3PgJ/uu4aNS4gzZeekTybg.WkSpz6": {
        "ingredients": [
            "2 heads radicchio, cut in half, then sliced thinly",
            "2/3 cup mayonnaise",
            "2 tablespoons sugar",
            "1 teaspoon dried fennel seed",
            "3/4 cup roughly grated or julienned carrots",
            "1/3 cup white wine vinegar",
            "Salt and pepper"
        ],
        "picture_link": null,
        "instructions": "In a large mixing bowl, toss all the ingredients together. Serve chilled.\nIn a large mixing bowl, toss all the ingredients together. Serve chilled.",
        "title": "Radicchio & Carrot Slaw "
    },
    "fJDEiew/hEEF6wdqTVPT7zvnXL5eMMu": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 325 degrees F. Brush a baking sheet with 1 teaspoon of the oil.\nFinely chop the mushroom stems and set aside. Place the mushroom caps on the prepared baking sheet and bake for 12 minutes.\nMeanwhile, heat the remaining 1 teaspoon oil in a medium skillet over medium heat. Add the mushroom stems, spinach, onion, and garlic and saute until the spinach wilts, about 6 minutes. Add the tomatoes and cook for 2 minutes more. Turn off the heat and stir in the parsley, salt, pepper and 2 tablespoons each of the pecorino and panko.\nPreheat the broiler. Divide the spinach mixture evenly among the mushroom caps. Sprinkle each with the remaining 1 tablespoon pecorino and panko, then broil until golden brown, 2 to 3 minutes. Serve warm.",
        "ingredients": [
            "2 teaspoons extra-virgin olive oil",
            "12 large white mushrooms, brushed clean, stems removed and reserved",
            "1/2 cup baby spinach, finely chopped",
            "1/2 onion, minced",
            "2 cloves garlic, chopped",
            "1/2 cup cherry tomatoes, finely chopped",
            "2 tablespoons flat-leaf parsley, chopped",
            "1/8 teaspoon salt, plus additional for sprinkling on mushroom caps",
            "Pinch freshly ground black pepper",
            "3 tablespoons grated Pecorino Romano cheese",
            "3 tablespoons panko (Japanese breadcrumbs)"
        ],
        "title": "Stuffed Mushrooms",
        "picture_link": "H6A3ekNg2g91NWGCTzlkSZjNZ0m851S"
    },
    "Y6HU217JvQ6oMkHVuuN8M3RrqSJN6dq": {
        "instructions": "Mix ingredients together in a small bowl and set aside to allow flavors to develop.;",
        "ingredients": [
            "1/2 cup sour cream",
            "1 1/2 teaspoons horseradish"
        ],
        "title": "Horseradish Sour Cream",
        "picture_link": null
    },
    "ze7aqNXmu013/3GwzaFoCixmVLHNAua": {
        "instructions": "Place a large skillet over medium heat. Add a small amount of butter.\nSlice the baguette in half lengthwise. Spread 1 tablespoon butter evenly on one half of the bread and the mustard on the other. Layer the ham, roast pork, cheese and pickles on the bottom half; close with the top.\nPlace the sandwich in the skillet and press down with your hands, a spatula or another skillet; cook for about 30 seconds, flip and cook on the other side until golden and the cheese is melted. Slice in half.\nPhotograph by Jim Franco",
        "ingredients": [
            "1 tablespoon unsalted butter, softened, plus more for the pan",
            "1 12-inch Cuban baguette or soft hoagie roll",
            "1 tablespoon yellow mustard",
            "2 1/2 slices ham (about 3 ounces)",
            "2 slices roast or pressed pork (2 to 3 ounces)",
            "2 1/2 slices swiss cheese (about 2 ounces)",
            "3 dill pickle slices"
        ],
        "title": "Puerto Sagua Cuban Sandwich",
        "picture_link": "gbuYIlA2SoNn4Cfokkk0dX.VAGnyYZm"
    },
    "lnqCd6sMB3USVvuNgcjCiGvg7sY2NSW": {
        "instructions": "Heat a couple of inches of vegetable oil in a heavy pot or Dutch oven over medium to medium-low heat until a deep-fry thermometer inserted in the oil registers 340 degrees F.\nIn a mixing bowl, combine the flour, granulated sugar, baking powder, cinnamon and salt. In a separate bowl, beat the eggs with a fork, then add the milk, melted butter and vanilla. Gently fold the dry and wet ingredients together until just combined (do not over-mix). Fold in the apples, adding enough to make a very chunky batter.\nDrop heaping tablespoons of batter into the hot oil, 6 to 8 at a time. Fry until golden brown, 4 to 6 minutes. Remove and drain on paper towels. Dust generously with powdered sugar and serve warm with sausage and bacon!",
        "ingredients": [
            "Vegetable oil, for deep-frying",
            "2 cups all-purpose flour",
            "1/2 cup plus 3 tablespoons granulated sugar",
            "2 1/4 teaspoons baking powder",
            "2 teaspoons ground cinnamon",
            "1 1/4 teaspoons salt",
            "2 large eggs",
            "3/4 cup whole milk",
            "2 tablespoons melted butter",
            "2 teaspoons vanilla extract",
            "2 Granny Smith apples, cored and cut into small dice",
            "Powdered sugar, for dusting, optional",
            "Serving suggestions: breakfast sausage and bacon"
        ],
        "title": "Apple Fritters",
        "picture_link": "c24gWKsZeKAfcdqf1xjfUZuCmy934VG"
    },
    "jq3OAoAsJWwuxDGzAGf5ZpJUCDkwbUq": {
        "instructions": "Watch how to make this recipe.\nPut the potatoes in a medium pot, cover with water, salt the water and bring to boil over medium heat. Cook until tender, then drain and return the potatoes to the pot. Heat a little oil over medium heat, in a medium saute pan and add the bacon and cook until it begins to crisp. Stir in the orange zest and juice and the potatoes. Mash to desired consistency with some chicken stock to thin the potatoes, if desired. Stir in the coriander, cumin, cinnamon and hot sauce. Transfer to a serving bowl and serve.",
        "ingredients": [
            "2 1/2 pounds sweet potatoes, peeled and cut into small chunks or thin slices",
            "Salt",
            "1 tablespoon oil, extra-virgin olive oil or vegetable oil",
            "2 slices smoky bacon, finely chopped",
            "1 orange, zested and juiced",
            "Chicken stock, as needed",
            "1 teaspoon coriander, 1/3 palmful",
            "1/2 teaspoon ground cumin, 1/3 palmful",
            "1/4 teaspoon ground cinnamon",
            "A few dashes hot sauce, to taste"
        ],
        "title": "Orange Scented Mashed Sweet Potatoes",
        "picture_link": "PAcAvPzxQoZRPpYAoP8mTRFsBk5Lray"
    },
    "fdqv9nttsCaWQnJnxbDtHaoccLGHFv2": {
        "instructions": "Blend half the butter with the chili paste and 1/4 teaspoon salt in a mini food processor until smooth.\nCut a piece of parchment or wax paper about 12 inches long. Mound the butter on the parchment, shaping it into a rough 4 by 1-inch rectangle. Set aside.\nBlend the remaining butter with the cilantro and 1/4 teaspoon salt in the mini food processor until smooth. Mound the cilantro butter lengthwise alongside the chili butter. Fold the parchment over the butter. Holding the bottom parchment down with one hand, press a wooden spoon handle, sharpening steel, or pastry scraper up against the butter, pressing the top paper into the bottom of the butter mound so the paper becomes taut against the butter, shaping it into a tight log. Twist the ends of the paper like a party favor. Refrigerate until firm, about 1 hour.\nSlice the butter into pats, unwrap and serve.",
        "ingredients": [
            "1 stick unsalted butter, softened",
            "1 to 2 teaspoons Asian chili paste, such as Sriracha",
            "Kosher salt",
            "2 tablespoons chopped fresh cilantro"
        ],
        "title": "Spiced Herb Butter for Corn",
        "picture_link": null
    },
    "FnpomMvXwvI31eiEUbzjyoqER8MTbiG": {
        "instructions": "Pulse the cheese, mayonnaise and pepperoncini in a food processor until combined. Season with salt and pepper. Cover and chill at least 3 hours.\nSlice the rolls; place a chicken breast on each roll and top with about 2 tablespoons of the cheese mixture. Wrap the sandwiches in foil and keep chilled until ready to use.\nPreheat a grill to medium. Place the foil-wrapped sandwiches cheese-side down on the grill and heat through, flipping once, 3 to 5 minutes per side. Serve with your favorite hot sauce.\nPhotograph by Andrew McCaul",
        "ingredients": [
            "1 1/2 cups shredded best-quality sharp cheddar cheese",
            "1/2 cup mayonnaise",
            "1/4 cup drained, chopped pepperoncini",
            "Kosher salt and freshly ground pepper",
            "4 large Hawaiian sweet rolls (or potato rolls)",
            "4 prepared fried boneless chicken breasts",
            "Hot sauce, for serving"
        ],
        "title": "Ode to the Rooster",
        "picture_link": "kUcyYHnJZK92AOpnN3VRXWZj02b/N4G"
    },
    "eesxaNiGdz5wuw/OuQ.BAlfvY0fnghS": {
        "ingredients": [
            "1 1/2 cups paprika",
            "3/4 cups sugar",
            "3 3/4 tablespoons onion powder"
        ],
        "picture_link": null,
        "instructions": "Stir together the ingredients in a small bowl. Stored in an airtight container in a cool, dry place, this seasoning will last for up to 6 months.\nStir together the ingredients in a small bowl. Stored in an airtight container in a cool, dry place, this seasoning will last for up to 6 months.",
        "title": "Neely's Barbecue Seasoning "
    },
    "TlzgFNLLk6cpYUvHbHKkZS2saaQRxO2": {
        "instructions": "Cook ham hocks, whole onions, whole garlic, bay leaf, water and broth in a large saucepan for 1 1/2 hours or until meat falls off bone. Add clean, roughly cut collard greens with stems removed. Cook uncovered for another 1 1/2 hours turning greens occasionally. Serve as side vegetable.",
        "ingredients": [
            "4 ham hocks",
            "2 yellow onions",
            "3 cloves garlic",
            "1 bay leaf",
            "2 cups water",
            "16 ounces chicken broth",
            "12 bunches collard greens"
        ],
        "title": "Jolly Greens",
        "picture_link": null
    },
    "UbDrjUl4hscU9P1Nk6jiqyQl3B6lEYq": {
        "instructions": "Combine 8 tablespoons of the butter, egg yolk, sugar, pinch of salt and flour. When ingredients are completely blended, divide the dough in half. Roll each dough half into a cylinder, about 1 1/2 inches in diameter and 6 inches long. Wrap each cylinder in wax paper and then in foil. Refrigerate until hard or for at least 2 hours. Preheat the oven to 375 degrees. Grease 2 cookie sheets with remaining tablespoon of butter. Remove dough from fridge and slice each cylinder crosswise into 1/4-inch rounds. Place the rounds on the prepared cookie sheets, but don't crowd them as they spread during baking. Brush the tops with reserved egg white. Center some sliced almonds on each cookie and bake for 12 to 14 minutes or until the edges begin to brown. Cool on a cookie rack. Delicious served with strawberries simply macerated in sugar.",
        "ingredients": [
            "9 tablespoons butter, at room temperature",
            "1 egg, separated",
            "6 tablespoons superfine sugar",
            "Pinch salt",
            "1 cup all purpose flour",
            "1/2 cup sliced (not slivered) almonds"
        ],
        "title": "Butter Cookies",
        "picture_link": null
    },
    "88zJmsniuC8Au45gE2Xrqn9VE/Nhv4C": {
        "ingredients": [
            "1/2 cup light mayonnaise",
            "1 teaspoon grated orange peel",
            "2 teaspoons minced peeled fresh ginger",
            "1 tablespoon fresh lime juice"
        ],
        "picture_link": null,
        "instructions": "Whisk mayonnaise, orange peel, fresh ginger, and lime juice in a small bowl to blend.\nWhisk mayonnaise, orange peel, fresh ginger, and lime juice in a small bowl to blend.",
        "title": "Orange and Ginger Mayonnaise "
    },
    "lKqkzOKx5jOlAGSRnCL8rh3t7kqP296": {
        "instructions": "Clean and scale fish. Stuff abundant quantities of fresh herbs into the cavity, then add slices of lemon, and chopped garlic. Brush skin on both sides with olive oil, season with salt and pepper, and if desired put into fish-grilling basket and clamp shut. Grill for approximately 6 minutes on each side, turning fish only once. Garnish with more fresh herbs and sliced lemon and serve. Roast potatoes and grilled summer vegetables go well with this dish. Tip: Bluefish caught early in the season, though smaller, are much less oily than those caught later in the summer.;",
        "ingredients": [
            "Bluefish, or other fish suitable for grilling",
            "Fresh herbs such as rosemary, thyme, and parsley",
            "Lemon slices",
            "Chopped garlic",
            "Olive oil, for brushing fish"
        ],
        "title": "Grilled Bluefish",
        "picture_link": null
    },
    "3065WWOugGCbs5kjBxTSShuUsBk7RA2": {
        "instructions": "In a large saucepan cover beets with salted water by 1 inch. Simmer beets, covered, 35 to 45 minutes, or until tender, and drain in a colander. Cool beets until they can be handled and slip off skins and stems. Cut beets lengthwise into wedges. Beets may be prepared up to this point 2 days ahead and chilled, covered. Bring beets to room temperature before proceeding.\nIn a large skillet stir together vinegar, syrup or honey, and oil and add beets. Cook beet mixture with salt and pepper to taste over moderate heat, stirring, until heated through and coated well. Sprinkle about half of thyme over beets and toss gently.\nServe beets sprinkled with remaining thyme.",
        "ingredients": [
            "3 1/2 pounds beets (4 pounds with greens attached, reserving greens for another use), scrubbed and trimmed, leaving about 1-inch of stems attached",
            "3 tablespoons balsamic vinegar",
            "2 tablespoons pure maple syrup or honey",
            "1 tablespoon olive oil",
            "1 1/2 teaspoons minced fresh thyme leaves"
        ],
        "title": "Balsamic-Glazed Beets",
        "picture_link": null
    },
    "eJjeun1Jh4tCffcSNtml/eCZ.UqYIMO": {
        "instructions": "Soak noodles for about 30 minutes in warm water to rehydrate.\nHeat grapeseed oil over medium-high heat in a wok and add carrots, celery, and zucchini and stir-fry until they begin to soften, about 5 minutes. Add the shiitake mushrooms and cook until they begin to give up their juices. Season the chicken with salt and pepper, to taste. Then, add ginger root and chicken to pan and stir-fry until the chicken begins to lightly brown.\nReduce heat to medium, and cook until the chicken stock reduces by half.\nDrain noodles, toss with chicken mixture and serve.",
        "ingredients": [
            "8 ounces sai fun noodles (cellophane noodles made of mung bean flour, aka bean thread noodles)",
            "2 tablespoons grapeseed oil",
            "2 large carrots, peeled and cut into thin julienne strips",
            "2 celery stalks, well-scrubbed and diced small",
            "2 small zucchini, peeled and cut into thin julienne strips",
            "2 cups (about 3 ounces) shiitake mushrooms, brushed cleaned, trimmed, and sliced",
            "4 boneless chicken thighs (about 1 pound), sliced julienne",
            "Salt and freshly ground black pepper",
            "1 (1-ounce) piece peeled fresh ginger root (1 to 1 1/2-inch piece), sliced thin on a mandoline and cut julienne",
            "2 cups low-sodium chicken stock"
        ],
        "title": "Chicken Long Rice",
        "picture_link": null
    },
    "ua1yS6cdX2TtKNQAiP./3GJW8cyI3Cq": {
        "instructions": "Bring lots of salted water to a boil in a pot large enough to hold the beef. (If it does not fit, cut the fillet of beef in half.) Add the meat and cover the pot so that the water returns quickly to the boil. When the water is back at a boil, uncover the pot and boil the beef anywhere from 14 to 17 minutes depending upon how rare you like it. While the beef is boiling, in another saucepan cook the potatoes in salted water for 20 minutes or until just tender. In a third shallow saucepan or in a Chinese style bamboo steamer, cook the carrots and leeks, covered, for 10 to 15 minutes or until just tender. To serve, remove the beef from the water and let it rest for 10 minutes. Remove the strings, slice, and serve half of it (reserve half for another dinner) with horseradish garlic mayonnaise and surrounded by half of vegetables (saving half for second time around soup, see below.)",
        "ingredients": [
            "1 fillet of beef (3 1/2 pounds), without fat, and tied",
            "8 new potatoes, peeled and quartered",
            "8 carrots, peeled and cut into 1inch chunks",
            "8 thin whole leeks, with 2 inches of green left on, washed"
        ],
        "title": "Sunday Startup Boiled Fillet of Beef and Steamed Vegetables",
        "picture_link": null
    },
    "zve73uUcvEwr7qGt8YfyXuMj6xAdvEO": {
        "instructions": "While still warm cut potatoes into 1/4-inch chunks or medium dice. Then whisk together tarragon vinegar, salt, mustard and olive oil. Drizzle vinaigrette over warm potatoes.;",
        "ingredients": [
            "3 cups (2 pounds) potatoes, cooked and peeled",
            "1/4 cup white wine",
            "2 tablespoon tarragon vinegar",
            "1 teaspoon dijon",
            "6 tablespoons olive oil",
            "Salt",
            "Pepper",
            "Parsley"
        ],
        "title": "French Potato Salad",
        "picture_link": null
    },
    "craHbsQQZRqIg2efEnUIaWYqGByGFc6": {
        "instructions": "Add the iced tea and lemonade to a pitcher and stir to combine. Divide evenly between two chilled pint glasses. Top each glass with 2 cups beer. Garnish with lemon wedges.",
        "ingredients": [
            "1 cup store-bought peach-flavored sweetened iced tea, chilled",
            "2 cups store-bought lemonade, chilled",
            "4 cups light lager beer, chilled",
            "Lemon wedges, for garnish"
        ],
        "title": "Sweet Tea-and-Lemonade Lager",
        "picture_link": "3Gj81SMw.Cmfn/wVCaIn7kKOuIFARX6"
    },
    "BKkOfZifRgxJDnfLXMRyhUcFu1pfIIO": {
        "instructions": "Whisk together the flour, baking soda and salt in a medium bowl. Beat the sugars and butter with an electric mixer on medium-high speed until light and fluffy, about 5 minutes. Beat in the vanilla and egg until incorporated. Adjust the speed to medium-low and add the flour in 2 batches, mixing until incorporated. Mix in the chocolate chips. Refrigerate the dough for at least 30 minutes.\nPreheat a waffle iron to medium-low. Generously spray the top and bottom of the waffle iron with cooking spray. Scoop tablespoons of the dough, roll into balls and flatten slightly. Working in batches, place 1 dough round onto each section of the waffle iron, close gently and cook until slightly crisp, 3 to 6 minutes.\nServe the cookies warm or store in an airtight container at room temperature for up to 1 day.\nCopyright 2013 Television Food Network, G.P. All rights reserved\nFrom Food Network Kitchens",
        "ingredients": [
            "1 1/4 cups all-purpose flour",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon fine salt",
            "1/3 cup packed light brown sugar",
            "1/3 cup sugar",
            "1 stick unsalted butter, room temperature",
            "1/2 teaspoon pure vanilla extract",
            "1 large egg",
            "1/2 cup semisweet chocolate chips",
            "Nonstick cooking spray",
            "Special equipment: waffle iron (preferably Belgian style)"
        ],
        "title": "Waffled Chocolate Chip Cookies",
        "picture_link": "I7iqxSroKlhfKIkXaftvyyzpd8pOhDq"
    },
    "De1Ik9qaNstbmhOAxsxRgFkhGfwDLEK": {
        "instructions": "Preheat a grill to medium-high.\nCombine mayonnaise and lime juice in a small bowl. Season, to taste, with salt and cayenne pepper.\nGrill the corn until it is golden brown, turning often and brushing with butter after each turn. Once the corn is cooked to your liking, brush with the mayonnaise mixture and serve.",
        "ingredients": [
            "1 cup mayonnaise",
            "2 key limes, juiced",
            "Salt",
            "Cayenne pepper",
            "4 ears corn, husked",
            "1 stick butter"
        ],
        "title": "Key Lime Corn",
        "picture_link": null
    },
    "7y.c8113d4phiPjj8zvv0p2vBes9qCS": {
        "instructions": "Shape the beef into 4 (1/2-inch-thick) burgers.\nLightly oil the grill rack and heat the grill to medium. Grill the burgers for 10 minutes for medium or to desired doneness, turning the burgers over once halfway through grilling.\nHeat the soup and hot sauce in a 1-quart saucepan over medium heat to a boil. Reduce the heat to low. Cover and cook for 5 minutes. Top the burgers with the soup mixture. Sprinkle with the cheese. Serve the burgers on the buns with the lettuce, onion and tomato, if desired.\nServing Suggestion: Serve with carrot and celery sticks with ranch dressing for dipping. For dessert serve chocolate chip cookies topped with vanilla ice cream.\nCost per recipe: $7.98",
        "ingredients": [
            "1 pound ground beef",
            "1 can (10 3/4 ounces) Campbell's® Condensed Tomato Soup (Regular or Healthy Request®)",
            "1/2 teaspoon Louisiana-style hot sauce",
            "1/2 cup crumbled blue cheese or 4 slices blue cheese",
            "4 Pepperidge Farm® Classic Hamburger Buns, split",
            "Lettuce leaves, red onion slices, tomato slices (optional)"
        ],
        "title": "Buffalo Burgers",
        "picture_link": "vA7ULpU7ZwcMTDVtDrPxuueL5lSExTO"
    },
    ".9SszDZspwTG/75N4sDRuSlKhou5fSO": {
        "ingredients": [
            "2 stalks red Swiss chard, chopped",
            "1/4 cup chopped spinach leaves",
            "1/4 cup chopped purple kale",
            "1 teaspoon loose green tea leaves",
            "6 cups still water"
        ],
        "picture_link": "15TIxq7KCsozqZXczPMF3sZ20VcgnFK",
        "instructions": "1. Place the chard, spinach, kale, and tea leaves in a blender with 1 cup of the water. Puree until fairly smooth, for about 1 minute. 2. Strain through a fine-mesh sieve into a large pitcher, using a ladle or rubber spatula to extract as much juice as possible. Add the remaining water, stir gently, and serve.\n1. Place the chard, spinach, kale, and tea leaves in a blender with 1 cup of the water. Puree until fairly smooth, for about 1 minute.\n2. Strain through a fine-mesh sieve into a large pitcher, using a ladle or rubber spatula to extract as much juice as possible. Add the remaining water, stir gently, and serve.",
        "title": "Liquid Iron "
    },
    "htWBk.a0pfve5pxvNxrIzkzrThhF5Hq": {
        "instructions": "Make the sauce: Bring the milk to a simmer in a saucepan with the bay leaf and garlic. Cover, turn off the heat and let infuse, about 15 minutes. Melt the butter in a saucepan. Whisk in the flour and cook for a minute to remove the raw flour taste. Gradually whisk in the milk. Cook over medium-high heat, stirring, until thick. Stir in the Gruyere, season with salt and pepper and reserve.\nHeat the oven to 425 degrees F/210 degrees C.\nMake the gratin: Bring a large pot of water to the boil. Salt it, as for pasta, and blanch the cauliflower until just shy of being tender, about 5 minutes. Drain well. Pat dry and season with salt and pepper. Toss with the sauce and dump into a gratin dish. Scatter over the breadcrumbs and Parmesan and bake until bubbling and gratineed on top, 5 to 10 minutes.",
        "ingredients": [
            "1 1/2 cups/750 ml milk",
            "1 bay leaf",
            "1 clove garlic, split",
            "3 tablespoons butter",
            "3 tablespoons flour",
            "1/2 cup/50 g grated Gruyere cheese",
            "Kosher salt and freshly ground black pepper",
            "Kosher salt",
            "1 pound/500 g cauliflower florets",
            "Freshly ground black pepper",
            "1/4 cup/20 g breadcrumbs",
            "2 to 3 tablespoons grated Parmesan cheese"
        ],
        "title": "Cauliflower Gratin",
        "picture_link": null
    },
    "Yxhvo9Cv2NAhIOvPdJSKKfsdBXMCBDe": {
        "instructions": "In a large saucepan, cover the eggs with an inch of water. Bring the eggs to a boil, then turn off the water and cover for 15 to 20 minutes.\nDrain the eggs and cover with very cold water. Carefully peel the eggs. Slice lengthwise and separate the yolks, putting them in a bowl, and set the whites aside. Mash the yolks and mix with the mayonnaise, mustard, horseradish, hot sauce and salt. Spoon or pipe the yolk mixture into the whites. Dust with paprika and chill for 30 minutes before serving.",
        "ingredients": [
            "1 dozen large eggs",
            "1/2 cup mayonnaise, such as Hellman's",
            "1 tablespoon Dijon mustard",
            "2 teaspoons horseradish",
            "1 teaspoon hot sauce, such as Frank's Hot Sauce",
            "1/2 teaspoon salt",
            "Paprika, to top"
        ],
        "title": "Deviled Eggs",
        "picture_link": null
    },
    "3B0LlbGtAlrfbzyRxpHgtABr2.qqbjC": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 350 degrees F.\nIn a heated skillet, cook the onions, adding a little water to prevent them from burning. Cook until lightly brown, adding more water, if needed. Add the squash, season with salt and pepper, to taste, and cook until the squash is tender, about 8 to 10 minutes. Remove the skillet from the heat and stir in the mayonnaise, 1 cup of the cheese and 1 cup of the crumbled crackers. Pour the mixture into a 1 1/2-quart baking dish. Sprinkle with remaining cheese and top with remaining 1/4 cup of butter crackers. Bake until the casserole is bubbly around edges, about 25 minutes. Remove the casserole from the oven and serve hot.",
        "ingredients": [
            "1 small Vidalia onion, chopped (about 3/4 cup)",
            "Water",
            "2 pounds yellow squash, cut into 1/2 to 1-inch cubes",
            "Kosher salt and freshly cracked black pepper",
            "1 cup good quality mayonnaise",
            "1 1/2 cups grated Gruyere cheese",
            "1 1/4 cups crushed butter crackers, divided"
        ],
        "title": "Squash Casserole",
        "picture_link": "bQhnDju/wZ.pI6NLyhFqlWXJXHAGDhG"
    },
    "xSR3uDxw1MLDwaomGqi8S9R0B2HWCo2": {
        "ingredients": [
            "2 1/2 tablespoons honey mustard (available at specialty foods shops and some supermarkets)",
            "1 teaspoon grated peeled fresh gingerroot",
            "2 tablespoons red-wine vinegar",
            "1 teaspoon soy sauce",
            "1 small garlic clove, minced and mashed to a paste with 1/4 teaspoon salt",
            "1/2 cup vegetable oil",
            "1 tablespoon minced fresh chives"
        ],
        "picture_link": null,
        "instructions": "In a bowl whisk together the mustard, the gingerroot, the vinegar, the soy sauce, and the garlic paste, add the oil in a stream, whisking, and whisk the dressing until it is emulsified. Stir in the chives and salt and pepper to taste. Toss the dressing with salad greens.\nIn a bowl whisk together the mustard, the gingerroot, the vinegar, the soy sauce, and the garlic paste, add the oil in a stream, whisking, and whisk the dressing until it is emulsified. Stir in the chives and salt and pepper to taste. Toss the dressing with salad greens.",
        "title": "Honey Mustard Dressing "
    },
    "W7Qz/drHF8y.BBqilJYAlbFVKMOxPVW": {
        "instructions": "Toast nuts on sheet pan for 10 minutes in a preheated 350 degrees F oven.\nMelt butter with cayenne, sugar and rosemary. Put toasted nuts in large saute pan, add butter mixture, lemon zest, salt and stir over medium heat until thoroughly mixed and butter cooks away. Adjust seasoning, as needed. Serve in paper cones with fresh rosemary garnish.",
        "ingredients": [
            "4 cups mixed, raw unsalted nuts",
            "4 tablespoon unsalted butter",
            "1 teaspoon cayenne pepper",
            "Brown sugar, to taste",
            "1/4 cup fresh rosemary, leaves, plus more for garnish",
            "2 lemons, zested",
            "Maldon sea salt or fleur de sel"
        ],
        "title": "Nutcracker Cones",
        "picture_link": null
    },
    "WXL5D8zbCTpdxNlkVwCwm9kGi8O9N2a": {
        "instructions": "Place potatoes in a large saucepan, add cold water just to cover and 1 tablespoon of salt. Bring to a boil over high heat and cook until tender. Drain well and run through a food mill set over a large bowl.\nWhile the potatoes are cooking, combine the milk, garlic puree and butter in a small saucepan and bring to a simmer over low heat. Stir the milk mixture into the potatoes until combined. Fold in the mascarpone and season well with salt and pepper. Keep warm over in a bain marie or double boiler until serving.",
        "ingredients": [
            "3 pounds Idaho potatoes, peeled and cut into large dice",
            "Kosher salt",
            "1 1/2 cups whole milk",
            "6 cloves roasted garlic cloves, pureed",
            "1/2 stick unsalted butter",
            "8 ounces mascarpone cheese",
            "Freshly ground black pepper"
        ],
        "title": "Mashed Potatoes with Roasted Garlic and Mascarpone Cheese",
        "picture_link": "3Oz.WlAx7FIHBBJr8osZJtGKOtGDzBG"
    },
    "0sZ4Z7I3UrDlbnbOasUK7gIEu4k8fF.": {
        "instructions": "Insert skewers in tomatoes and lay on open flame or cut in half. Lay cut side down on baking sheet and broil. Char until skin is blackened and peeling. Remove from flame and rest on plate. Peel off charred skin. Using a fork mash tomatoes, and add salt. In a mortar smash garlic, peppers and cilantro. Mix with pureed tomatoes. Heat some of the oil in a saucepan and caramelize onion. Add heated oil caramelized onion mixture to tomatoes.",
        "ingredients": [
            "8 to 10 plum tomatoes, washed",
            "Salt, to taste",
            "4 cloves garlic",
            "1/2 jalapeno or Scotch bonnet pepper",
            "2 sprigs cilantro/culantro",
            "1/3 cup corn oil",
            "1 small sliced onion"
        ],
        "title": "Tomato Choka",
        "picture_link": null
    },
    "MT.vKKOOtkc51N/fp.KgS0lL0Gp1Czm": {
        "instructions": "In a bowl, cover the beans with water, and soak overnight in a cool or refrigerated place. After draining the beans, peel off the outer skins.\nIn the bowl of a food processor, pulse the beans until the are finely ground. Turn the mixture out into a bowl.\nIn the bowl of the same food processor, put the onion, garlic, and scallions; process until finely chopped. Add onion mixture to beans, and add the rest of the spices. Put the mixture into the refrigerator for 1/2 hour.\nHeat the oil to 350 degrees F, using a # 40 ice cream scooper or a tablespoon, drop the mixture into the oil, and fry until golden brown. Drain on paper towels or brown paper bags.\nServe with Cilantro Yogurt Sauce.\nPut the yogurt, cilantro, cucumber, garlic, lime juice, and sugar in a bowl and mix to combine. Season with salt and pepper, to taste. Put mixture into the refrigerator until ready to serve.",
        "ingredients": [
            "1 pound dried black-eye peas, picked through and rinsed",
            "1 medium onion, minced",
            "6 garlic cloves, minced",
            "6 scallions, chopped",
            "1/2 cup chopped parsley",
            "1 teaspoon ground allspice",
            "1/2 teaspoon cayenne powder",
            "1 to 2 teaspoons kosher salt",
            "Freshly ground black pepper",
            "Vegetable oil, for frying",
            "Cilantro Yogurt Sauce, for dipping, recipe follows",
            "1 cup plain yogurt",
            "1/2 cup chopped cilantro",
            "1 cup grated and squeezed cucumber",
            "1 garlic clove, minced",
            "2 tablespoons lime juice",
            "1 teaspoon sugar",
            "Salt",
            "Pepper"
        ],
        "title": "Black-Eye Pea Fritter",
        "picture_link": null
    },
    "OnqqqIFFmUr.VZ51APAN/fotbKPXXam": {
        "instructions": "1. Spray large skillet with cooking spray; heat over medium heat. Add chicken and undrained tomatoes; cook 10 minutes or until chicken pieces are no longer pink in centers and liquid has evaporated, stirring frequently.\n2. Spread chicken mixture evenly onto bottom half of each tortilla to within 1 inch of edge. Sprinkle 1/2 cup cheese over chicken mixture on each tortilla. Fold each tortilla in half to cover filling.\n3. Clean skillet. Spray with additional cooking spray; heat over medium-high heat. Cook quesadillas 3 minutes on each side or until golden brown on both sides. Cut into wedges to serve.",
        "ingredients": [
            "PAM® Original No-Stick Cooking Spray",
            "1/2 pound boneless skinless chicken breasts, cut into 1/2-inch pieces",
            "1 can (10 oz each) Ro*Tel® Mexican Diced Tomatoes with Lime Juice & Cilantro, undrained",
            "4 flour tortillas (10 inch)",
            "2 cups shredded Cheddar and Monterey Jack cheese blend (2 cups = 8 oz)"
        ],
        "title": "Ultimate Chicken Quesadilla",
        "picture_link": "A9JrJmCnML6UDucKOD75jBd5ouggMUq"
    },
    "gG7s4NiO23yOkpNb1XyzAKIlUbMu4li": {
        "instructions": "Preheat a wood fire or outdoor charcoal grill to medium heat.\nIn a Dutch oven placed on the grill grate or directly on the embers of the fire, cook bacon until crisp. Add onions and cook until transparent, about 5 minutes.\nPut potatoes into a large mixing bowl. Add parsley, seasoned salt and pepper, to taste. Mix all ingredients well. Put potatoes into the Dutch oven, and add water and butter. Cook, covered, until potatoes are browned and tender, about 20 minutes. Serve warm.",
        "ingredients": [
            "1/4 pound bacon, cut into 1-inch pieces",
            "1 small onion, chopped",
            "2 1/2 pounds russet potatoes, peeled and cut into bite-size chunks",
            "1/4 cup chopped parsley leaves",
            "1 tablespoon seasoned salt",
            "Freshly ground black pepper",
            "1/2 cup water",
            "2 tablespoons butter, cut into small pieces"
        ],
        "title": "Dutch Oven Potatoes",
        "picture_link": "6G1/wANIOWcdIVM6o/CE86HbqqZguLa"
    },
    "FfuVzq2NNsf09p7HD25ZMH7oShn2JiG": {
        "instructions": "Sort the beans to make sure they are free of stones or other debris. Rinse, then cover with cold water, refrigerate, and soak overnight. The next day, drain the beans, place them in a large pot, and cover with the stock. Bring to a boil, then lower the heat and simmer the beans for 1 1/2 to 2 hours, or until they are tender. Add 1 teaspoon of salt in the final 15 minutes of cooking. The addition of salt earlier in the cooking process will result in tough beans.\nRemove the beans with a slotted spoon and transfer to a large mixing bowl. Add all the remaining seasoning and other ingredients to the warm beans in the bowl and toss together. Adjust the salt and add freshly ground pepper to taste. Serve warm or chilled.",
        "ingredients": [
            "1 pound dried Great Northern, navy, pea or other white beans",
            "2 quarts chicken stock",
            "1 teaspoon salt",
            "1/3 cup olive oil",
            "2 tablespoons chopped garlic",
            "1/4 cup chopped fresh flatleaf parsley",
            "2 tablespoons chopped fresh thyme",
            "1/2 teaspoon dried red pepper flakes",
            "1/4 cup fresh lemon juice",
            "Salt and freshly ground black pepper to taste"
        ],
        "title": "Tuscan White Beans with Olive Oil",
        "picture_link": null
    },
    "IIvBh0HOmd84X8D9K5kzdEPGJnQJmN2": {
        "instructions": "Toss lettuce with lemon juice and divide among 4 cocktail glasses, filling them halfway. Place seafood on lettuce bed and chill in refrigerator while making sauce.\nFor sauce, combine cream and mayonnaise, then add tomato paste and mix until light pink. Place a spoonful of sauce over seafood and dust with cayenne and parsley. Serve with garnish of sliced lemon.",
        "ingredients": [
            "1/4 head lettuce, sliced finely",
            "1 teaspoon lemon juice",
            "6 ounces shrimp, cooked and peeled, cut into small pieces",
            "12 oysters",
            "1/8 cup cream, whipped",
            "1/2 cup mayonnaise",
            "1/8 cup tomato paste",
            "Cayenne pepper, to taste",
            "Parsley, to garnish, finely chopped",
            "1 lemon, quartered"
        ],
        "title": "Prawn and Oyster Cocktail",
        "picture_link": null
    },
    "z0iPyL7wVfa2CD2AFFCYWP.GNT3ip/6": {
        "instructions": "In a saute pan with straight sides or a medium pot, add the olive oil and raise the heat to medium-high. Add the onions and season with a pinch of salt and grind or 2 of pepper. Cook the onions, stirring and moving around, until tender and translucent, about 4 minutes. Add the garlic and lower the heat. Continue cooking until fragrant and tender, about 2 minutes. Add the string beans and season with salt and pepper. Stir to coat, and then add the chicken stock. Raise the heat to a simmer and cover. Cook until the green beans are very tender, about 25 minutes. Spritz with lemon just before serving.",
        "ingredients": [
            "2 tablespoons olive oil",
            "1/2 cup onions, halved and sliced",
            "Salt and freshly ground black pepper",
            "1 clove garlic, grated (on a rasp)",
            "1 1/2 pounds fresh string beans, sliced into thirds",
            "1 cup chicken stock",
            "Lemon wedge, for spritzing"
        ],
        "title": "Easy String Beans and Onions",
        "picture_link": "muGnQMT5ajkxCmgPTvqAvZc0wVZ5kRC"
    },
    "E78Zxnuhl873RQpybkp8q5QTjTBEj7m": {
        "instructions": "In a large pot of boiling water, boil the stone crab claws for 8 minutes. Bring the internal temperature of the claws down to 70 degrees F by immersing them in a pot of 50 degree F water for another 8 minutes. Refrigerate with plenty of ice.\nCrack the claws and serve.",
        "ingredients": [
            "8 (12-ounce) stone crab claws"
        ],
        "title": "Everglades City Stone Crab",
        "picture_link": "gMaqbqjfFxkgbofY.V386idb7L4e.fe"
    },
    "EcO3M.ksHfUCoPwe2qFFnj8IEOCjrZC": {
        "instructions": "Heat the broth and potatoes in a 3-quart saucepan over medium-high heat to a boil.\nReduce the heat to medium. Cover and cook for 10 minutes or until the potatoes are tender. Drain, reserving the broth.\nMash the potatoes with 1/4 cup broth, cream, butter and black pepper. Add additional broth, if needed, until desired consistency. Serve with the gravy.\nUltimate Mashed Potatoes: Stir 1/2 cup sour cream, 3 slices bacon, cooked and crumbled (reserve some for garnish), and 1/4 cup chopped fresh chives into the hot mashed potatoes. Sprinkle with the reserved bacon.",
        "ingredients": [
            "3 1/2 cup Swanson® Chicken Broth (Regular, Natural Goodness¿ or Certified Organic)",
            "5 large potatoes, cut into 1-inch pieces (about 7 1/2 cups)",
            "1/2 cup light cream",
            "2 tablespoon butter",
            "Generous dash ground black pepper",
            "1 can (14.5 ounces) Campbell's Turkey Gravy"
        ],
        "title": "Ultra Creamy Mashed Potatoes",
        "picture_link": "Hw5w68jy.X6mdxcbwIMSzAyOM54VOZu"
    },
    "W.cJv8BJyrTfBNKxOIY6SBoU8d2OIze": {
        "instructions": "Rinse the grated potatoes in a bowl of cold water. Remove the potato shred with your fingers to a clean kitchen towel. Roll up in the towel and squeeze dry.\nPlace the beets and onions in a large colander and strongly squeeze out the excess moisture.\nIn a bowl, stir together the potato, beets, onion, eggs, flour, salt, and pepper to taste.\nHeat 1/4 cup of the canola oil in a cast-iron skillet over medium-high heat. Add 4 heaping tablespoons of batter to the pan to form 4 pancakes; flatten slightly. Cook about 5 minute, turning once, until golden brown on both sides. Keep warm on a rack set over a baking sheet in a low oven. Repeat with the remaining potato mixture and 1 1/3 tablespoons of oil.\nTop each pancake with a teaspoon of sour cream or yogurt and sprinkle with fresh dill. Serve at once.",
        "ingredients": [
            "1 large (8 ounce) baking potato (such as Caribe), peeled and coarsely grated",
            "2 medium (4 ounces) red beets, peeled and coarsely grated",
            "1 small yellow onion, coarsely grated",
            "1 large egg, lightly beaten",
            "1/4 cup flour",
            "3/4 teaspoon salt",
            "Freshly ground black pepper to taste",
            "1/3 cup canola oil",
            "1/4 cup sour cream or yogurt, for garnish",
            "2 tablespoons minced fresh dill, for garnish (do not use dried dill)"
        ],
        "title": "Kevin Johnson Grange Hall Beet and Potato Latkes",
        "picture_link": null
    },
    "0Ktha1D.Y06dvW8tq20iQXx7oCRPS2q": {
        "instructions": "Mash the avocado with a fork in a shallow bowl until chunky. Season with fine salt and black pepper.\nToast the bread until browned and crisp. Lightly rub 1 side of each slice with the cut side of the garlic until fragrant; discard the garlic. Lightly brush the toasts with oil, and season with fine salt and pepper. Divide the mashed avocado evenly among the toasts, and top with more flaky sea salt, more black pepper and red pepper flakes if using.",
        "ingredients": [
            "One 8-ounce ripe avocado, halved, pitted and peeled",
            "Fine salt and freshly ground black pepper",
            "4 slices whole grain or whole wheat bread",
            "1 clove garlic, peeled and halved",
            "2 tablespoons extra-virgin olive oil or unsalted butter, softened",
            "Flaky sea salt, for serving",
            "Crushed red pepper flakes, optional"
        ],
        "title": "Avocado Toasts",
        "picture_link": "cts7Z0oxTHEXjBFsodvgbpkUIJT31/6"
    },
    "FJiiGZxdmEQS3KUqeCIKBBOnFSKeBcG": {
        "ingredients": [
            "8 ounces uncooked large shrimp, peeled, deveined",
            "1 teaspoon coarse salt",
            "1/4 cup olive oil",
            "1 tablespoon chopped garlic",
            "1 small bay leaf",
            "1 1-inch piece dried red chili pepper, seeded",
            "1 tablespoon minced fresh parsley"
        ],
        "picture_link": null,
        "instructions": "Place shrimp in bowl; sprinkle with coarse salt and toss. Let stand 15 minutes. Heat oil in medium skillet over high heat. Add garlic, bay leaf and dried pepper and stir 1 minutes. Add shrimp; stir until just cooked through, about 3 minutes. Transfer to serving dish. Sprinkle with parsley.\nPlace shrimp in bowl; sprinkle with coarse salt and toss. Let stand 15 minutes.\nHeat oil in medium skillet over high heat. Add garlic, bay leaf and dried pepper and stir 1 minutes. Add shrimp; stir until just cooked through, about 3 minutes. Transfer to serving dish. Sprinkle with parsley.",
        "title": "Garlic Shrimp "
    },
    "JrIE7aGIW6toDAStG0bxKbFrfvLbpoy": {
        "instructions": "Watch how to make this recipe.\nBoil potatoes in salted water until very tender; about 20 minutes. Cut the florets off the broccoli and add to boiling potatoes, about 7 minutes. Drain and place back into pot.\nHeat the milk, cream, and butter in a small saucepan. Pour sauce into the potatoes and broccoli, mash together. Season, to taste, with salt and pepper.",
        "ingredients": [
            "4 pounds Yukon gold or russet potatoes, quartered",
            "2 (about 6 cups) broccoli heads",
            "1/2 cup whole milk",
            "1/2 cup heavy cream",
            "1/2 stick butter",
            "Salt and freshly ground black pepper"
        ],
        "title": "Smashed Potatoes and Broccoli",
        "picture_link": "ut0kjMPV5ulzbT3EX7AO7qNKwquBIiu"
    },
    "pelIyR1clj7QPP6t4CwyCBtrnsoNY.q": {
        "ingredients": [
            "1 large lemon, cut crosswise into 1/4-inch-thick rounds",
            "1/2 cup fresh lemon juice",
            "1 tablespoon coarse sea salt"
        ],
        "picture_link": null,
        "instructions": "Combine all ingredients in small skillet. Bring to boil over high heat, stirring to dissolve salt. Cover; reduce heat to low. Simmer until lemon slices are almost tender (peel will look translucent), about 10 minutes. Cool. DO AHEAD: Can be made 1 week ahead. Transfer to bowl. Cover; chill.\nCombine all ingredients in small skillet. Bring to boil over high heat, stirring to dissolve salt. Cover; reduce heat to low. Simmer until lemon slices are almost tender (peel will look translucent), about 10 minutes. Cool. DO AHEAD: Can be made 1 week ahead. Transfer to bowl. Cover; chill.",
        "title": "Quick-Preserved Lemon "
    },
    "yS/iskOvR3OKbhVMNq5QOUZxWBNKLMu": {
        "instructions": "Remove the stems and seeds from your choice of dried chiles. Pour boiling water over the chiles to cover and soak 30 minutes. Drain the chiles and puree them thoroughly in a food mill or food processor fitted with a metal blade. If you use a food mill, the result will be a smooth paste. If you use a food processor, you may want to press the paste through a sieve to produce a totally smooth paste. The paste can be stored, covered and refrigerated 10 days to 2 weeks; if covered with oil, it will keep in the refrigerator several months.;",
        "ingredients": [
            "Any combination of: 6 ounces dried Ancho, Chipotle, Cascabel, or other chiles"
        ],
        "title": "Chili Paste (Puree)",
        "picture_link": null
    },
    "y.UwCXxAyp4InCY0vfQVHjSKjRX99AC": {
        "instructions": "Heat oven to 375 degrees F. Using 1 tablespoon of the butter, butter 9-inch pie pan. Combine sugar and cinnamon; sprinkle 2 tablespoons of the mixture over buttered pan. Sprinkle 3 tablespoons of the nuts over sugar mixture.\nSeparate dough into 8 rolls; cut each into quarters. Place half of pieces evenly over nuts; sprinkle with 1 tablespoon of the sugar mixture. Dot with remaining tablespoon butter; top with remaining roll pieces and sugar mixture.\nBake at 375 degrees F for 18 to 20 minutes or until golden brown. Drizzle icing over rolls; sprinkle with remaining nuts. Cut into wedges. Serve warm.",
        "ingredients": [
            "2 tablespoons butter, softened",
            "1/4 cup sugar",
            "1 teaspoon cinnamon",
            "1/4 cup finely chopped nuts",
            "1 (12.4-oz.) can Pillsbury® Refrigerated Cinnamon Rolls with Icing"
        ],
        "title": "Iced Cinnamon Roll Coffee Cake",
        "picture_link": null
    },
    "jH3Xxoi//RAjSk1qEjpXqbRZ0mCRhza": {
        "ingredients": [
            "1 pint (2 cups) softened coffee ice cream",
            "3 ounces (6 tablespoons) dark rum, or to taste",
            "1/4 teaspoon ground cinnamon",
            "1/2 cup whipped cream",
            "Garnish: unsweetened cocoa powder and cinnamon sticks"
        ],
        "picture_link": null,
        "instructions": "In a blender, blend ice cream, rum and ground cinnamon until smooth but still thick and pour into 2 chilled stemmed glasses. Top drinks with whipped cream and garnish with cocoa powder and cinnamon sticks.\nIn a blender, blend ice cream, rum and ground cinnamon until smooth but still thick and pour into 2 chilled stemmed glasses. Top drinks with whipped cream and garnish with cocoa powder and cinnamon sticks.",
        "title": "Cappuccino Rum Shake "
    },
    "e1OS3LZN.eQHG1UaJHGl170DtLlCdbm": {
        "instructions": "Place the eggs in a medium pot and cover with cold water by 1 inch. Bring to a boil over medium-high heat; boil for 30 seconds then remove from the heat, cover, and let stand for 15 minutes. Drain the eggs and run under cold water until cool. Carefully peel the eggs and halve each lengthwise. Carefully remove and reserve the yolks.\nPlace the yolks in a food processor with the mayonnaise, creme fraiche, Dijon, paprika and 1/4 teaspoon salt. Process until smooth, and then season with salt and pepper. Transfer the mixture to a resealable plastic bag with a corner snipped off.\nPipe the yolk mixture into the eggs. Top each egg with a scant teaspoon of the tobiko, a small dollop of creme fraiche and a piece of chive.",
        "ingredients": [
            "8 large eggs",
            "3 tablespoons mayonnaise",
            "1 tablespoon creme fraiche or sour cream, plus more for topping",
            "1 teaspoon Dijon mustard",
            "1/4 teaspoon paprika",
            "Kosher salt and freshly ground black pepper",
            "4 tablespoons orange tobiko (flying fish roe) or other caviar (about 1/4 ounce)",
            "Sixteen 1/2-inch-long pieces fresh chive"
        ],
        "title": "Deviled Eggs with Caviar",
        "picture_link": "7NYSe/Y7v3Y1j1OVn3vRs83EBQ/Y8pi"
    },
    "0cfJNcV85UBuv2pJBchTqdrlYhGrPWe": {
        "instructions": "Heat oven to 425 degrees F. Lightly spray cookie sheet with cooking spray.\nIn medium bowl, mix chicken and 1/2 cup of the enchilada sauce.\nUnroll dough; place on cookie sheet. Starting at center, press out dough into 14x10-inch rectangle; cut into 4 (7x5-inch) rectangles. Spoon about 1/3 cup chicken mixture onto half of each rectangle, spreading to within 1/2 inch of edge. Sprinkle 2 tablespoons cheese over each.\nFold dough in half over filling; press edges firmly with fork to seal. Prick tops with fork.\nBake 10 to 12 minutes or until golden brown.\nMeanwhile, heat remaining enchilada sauce until hot. Serve with foldovers for dipping.\nAnother spicy cheese you can use is Monterey Jack cheese with jalapeno peppers or, as it's also known, pepper Jack cheese.",
        "ingredients": [
            "1 1/2cups shredded cooked chicken",
            "1 can (10 ounce) Old El Paso® red enchilada sauce",
            "1 can Pillsbury® refrigerated classic pizza crust",
            "1/2 cup shredded taco-seasoned cheese blend or Cheddar cheese (2 ounce)"
        ],
        "title": "Chicken Enchilada Foldovers",
        "picture_link": null
    },
    "iyX3vooiIYzS2LGSNlM.aGbxbOcWAb2": {
        "instructions": "Preheat oven to 350 degrees F.\nCombine cake mix, eggs, coffee, oil and flour in large bowl. Beat on low speed until all ingredients are moistened; then beat on high speed for 2 minutes. Dough will be sticky. Fold in chocolate pieces, pecans and candy until evenly distributed. Using about half of the batter, drop by heaping tablespoonfuls onto ungreased baking sheet, spacing 2 inches apart.\nBake for 12 to 14 minutes. Let the cookies cool on the baking sheet on a wire rack for 4 to 5 minutes or until firm. With a metal spatula, transfer the cookies to the wire rack to cool. Repeat with the remaining batter. Serve slightly warm or store in an airtight container for up to 2 weeks.",
        "ingredients": [
            "1 box (18 1/4 ounces) devil's food cake mix",
            "2 eggs",
            "1/4 cup hot coffee or hot water",
            "1/2 cup vegetable oil",
            "2 tablespoons all-purpose flour",
            "1 cup semisweet chocolate pieces",
            "1 cup chopped pecans",
            "3/4 cup bits of chocolate-toffee candy"
        ],
        "title": "Devil's Food Cookies",
        "picture_link": "bvIag4dEGmUd1y.R73Tja7a2CgTKu2a"
    },
    "/DSD1w8wF.lSS73A3Iq5LAxGMhesZbO": {
        "instructions": "Rub the sides of a bowl with garlic, then discard. In bowl whisk together mustard, honey and vinegar. While whisking, slowly add olive oil. Season with salt and pepper.",
        "ingredients": [
            "1 clove garlic, peeled and sliced in half",
            "1 cup olive oil",
            "1 tablespoons Dijon mustard",
            "1 tablespoons honey",
            "3 tablespoons white wine vinegar",
            "Salt",
            "Pepper"
        ],
        "title": "Honey Mustard Vinaigrette",
        "picture_link": null
    },
    "Y3kdsaHmprtZBICPJgDjjgr18ikRdAm": {
        "instructions": "Blanch asparagus in 2 batches in a large saucepan of boiling salted water 1 minute. Transfer to a colander and rinse under cold running water to stop cooking. Drain well and pat dry.\nWhisk together mayonnaise, soy sauce, sugar, lemon juice, and wasabi paste until sugar is dissolved.\nServe asparagus with dip.",
        "ingredients": [
            "3 pounds thin to medium asparagus, trimmed",
            "1 cup mayonnaise",
            "4 teaspoons soy sauce",
            "1 1/2 teaspoons sugar",
            "2 teaspoons fresh lemon juice",
            "2 teaspoons wasabi paste"
        ],
        "title": "Asparagus with Wasabi-Mayonnaise Dip",
        "picture_link": null
    },
    "yeoOf2S7d/XSWSWOK3YuVDFobnjCEji": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 400 degrees F.\nCut the larger Brussels sprouts into quarters; halve the smaller ones.\nPlace the Brussels sprouts in a large baking dish or on a baking sheet. Add the garlic, sprinkle with salt and pepper, and pour over the olive oil. Toss to coat. Transfer to the oven and roast for 35 minutes. Crank up the oven to 450 degrees F and roast until tender and the outer leaves are browned and crispy, another 10 minutes. Transfer to a serving dish. Serve immediately.",
        "ingredients": [
            "1 1/2 pounds Brussels sprouts",
            "4 cloves garlic, chopped",
            "Salt and fresh ground pepper",
            "1/4 cup olive oil"
        ],
        "title": "Crispy Brussels Sprouts",
        "picture_link": "HBnVzxouaZ6Dt.j2cpcmXLkTkWP0qw6"
    },
    "mOIw0J6gO/EyK1.Qa2I71Y3Buic55/a": {
        "instructions": "Combine butter, honey and lavender in a small saucepan and heat, whisking occasionally, until butter is melted and mixture is just coming to a simmer. Remove from heat and let sit in pan for 30 minutes. Remove lavender and discard. Pour syrup through a fine strainer and into a bowl or measuring cup to remove any stray lavender leaves.\nPreheat gas grill to medium and lightly oil grate. Place all fruits on a rimmed baking sheet and brush with honey glaze. Grill until fruit is heated through, slightly tender and caramelized - about four minutes total for bananas, six for pineapple and peaches. As the fruits cook, brush them once or twice with additional glaze and turn once. Serve immediately with a scoop of vanilla ice cream if desired.",
        "ingredients": [
            "1/2-cup unsalted butter, melted",
            "1/2-cup honey",
            "1 small bunch lavender",
            "1 large ripe pineapple, peeled, quartered, cored and cut into half-inch-thick wedges",
            "3 slightly under-ripe bananas, peeled and sliced in half lengthwise",
            "3 ripe but firm peaches, peeled, halved, pitted",
            "1 pint vanilla ice cream, optional"
        ],
        "title": "Honey and Lavender Glazed Fruit",
        "picture_link": null
    },
    "bYRyrvwq71Z2hwnSlvyzfwYj0peIed2": {
        "instructions": "Preheat oven to 425 degrees F.\nToss the potatoes, garlic, and rosemary with the oil, salt and pepper on a baking sheet. Arrange potatoes cut side down and roast until fork tender, 20 to 25 minutes. Serve hot.",
        "ingredients": [
            "6 to 8 medium (about 1 1/2 pounds), Yukon gold potatoes, cut in wedges",
            "8 cloves garlic, left in their skins",
            "1 tablespoon chopped fresh rosemary leaves",
            "3 tablespoons extra-virgin olive oil",
            "Kosher salt freshly ground black pepper"
        ],
        "title": "Roasted Yukon Potatoes with Rosemary",
        "picture_link": "rihd5TAppCPiQGekWb4C/rjP9g2jsEi"
    },
    "XzTwnUwCjtGKnPmySdrbNnuPyXALu.W": {
        "instructions": "Preheat grill to medium.\nTrim asparagus approximately 1 1/2 inches from the bottoms. Slightly peel the asparagus from just below the tip to the end. Put into a large bowl and drizzle with olive oil. Season with salt and pepper and toss.\nWrap the ham tightly around each asparagus stalk. Put on the grill and cook the asparagus turning frequently until slightly charred, 2 to 3 minutes. Transfer to a serving platter and serve.",
        "ingredients": [
            "1 bunch large asparagus",
            "2 tablespoons extra-virgin olive oil",
            "1 1/2 teaspoons salt",
            "1 1/2 teaspoons coarse ground black pepper",
            "1/4 pound thinly sliced capicola ham, halved"
        ],
        "title": "Grilled Ham Wrapped Asparagus",
        "picture_link": "J/eVoY3uHii4E35WoooyrATXurn1drW"
    },
    "E9c51266vA3C/QKzSzVjgpdtkctC0je": {
        "instructions": "In a large saute pan over medium-high heat, add the olive oil and then add the beef cubes. Saute the beef cubes until brown, about 2 minutes per side. Add the shallots, cook about 3 to 4 minutes, or until translucent. Whisk the arrowroot into the white wine until it dissolves. Add the wine mixture, and cook until the liquid is reduced by half. Add the mushrooms and cook for 2 minutes.\nAdd the rosemary, thyme, basil leaves, salt, and pepper, to taste. Stir in the sour cream and pour over the cooked pasta.",
        "ingredients": [
            "2 tablespoons olive oil",
            "2 pounds beef tenderloin, medium-cubed",
            "1/2 cup minced shallots",
            "1 teaspoon arrowroot powder",
            "1/2 cup white wine",
            "1/2 cup each shiitake, baby bench and key mushrooms, sliced",
            "1 tablespoon chopped fresh rosemary",
            "1 tablespoon chopped fresh thyme leaves",
            "1 tablespoon chopped fresh basil leaves",
            "Kosher salt and freshly ground black pepper, to taste",
            "1/4 cup nonfat sour cream",
            "1 box whole wheat pasta, cooked according to package directions"
        ],
        "title": "Beef Stroganoff",
        "picture_link": null
    },
    "SD7P/x9UbxPas7jSjwpiYPZyGRJFVY.": {
        "instructions": "In a bowl, combine condensed cheese soup and the shredded cheese. Spread mixture on baguette slices. Butter the outside of the sandwiches.\nHeat large frying pan or griddle over medium-high heat. Place sandwiches in the pan and cook until golden brown, approximately 2 minutes. Flip sandwiches and cook second side. Cover frying pan to ensure that the cheese melts. Serve as \"dunkers\" with mugs of Spicy Tomato-Cheese Soup.\nCombine all ingredients in a medium saucepan. Heat thoroughly, over medium heat, stirring occasionally.\nServe in mugs with Grilled Cheese Dippers.",
        "ingredients": [
            "1 can condensed Southwest-style pepper jack soup",
            "8 ounces Mexican-style shredded cheese",
            "1 baguette French bread, sliced 1/2-inch thick",
            "1/2 stick butter, softened",
            "Spicy Tomato-Cheese Soup, recipe follows",
            "1 can condensed tomato soup",
            "1 can condensed Cheddar cheese soup",
            "3 cups spicy tomato juice",
            "2 teaspoons hot pepper sauce",
            "1 teaspoon dried basil"
        ],
        "title": "Grilled Cheese Dippers with Spicy Tomato-Cheese Soup",
        "picture_link": null
    },
    "a.1GEGOQ.9KdiL4ib.gRmXZfCZLLHIa": {
        "instructions": "1. PREHEAT oven to 350degrees F. Grease bottom and side of 9-inch springform pan.\n2. PRESS cookie crumbs onto bottom of prepared pan. Place in freezer for 5 minutes.\n3. BEAT cream cheese, Coffee-mate and 1/4 cup sugar in large mixer bowl until creamy. Beat in eggs one at a time, beating well after each addition. Pour filling into crust.\n4. BAKE for 45 to 50 minutes or until edges are set but center still moves slightly.\n5. COMBINE sour cream, remaining sugar and vanilla extract in medium bowl; mix well. Spread over surface of warm cheesecake. Bake for 5 minutes. Remove from oven and cool on wire rack. Refrigerate for several hours or overnight. Remove side of springform pan.",
        "ingredients": [
            "2 cups ground chocolate-mint sandwich cookies (such as Oreos Mint N' Cream)",
            "3 pkgs. (8 oz. each) cream cheese, at room temperature",
            "1 cup Peppermint Mocha Flavor NESTLÉ COFFEE-MATE Powdered Coffee Creamer",
            "3/4 cup granulated sugar, divided",
            "3 large eggs",
            "1 container (16 oz.) sour cream, at room temperature",
            "1 teaspoon vanilla extract"
        ],
        "title": "Peppermint Mocha Cheesecake",
        "picture_link": "/6o2pDB881xz2Upoe4i5N.j6xK5Sv6K"
    },
    "Nkto1RgbKgXoCwJceUDoKaMwbFZNfDm": {
        "ingredients": [
            "1/2 pound (2 sticks) unsalted butter; cut into chunks",
            "5 garlic cloves, crushed and peeled",
            "1/2 teaspoon red pepper flakes",
            "1 tablespoon fresh thyme leaves"
        ],
        "picture_link": null,
        "instructions": "Combine all the ingredients in a medium saucepan and heat over medium heat until the butter melts, then bring just to a simmer and simmer gently for 2 to 4 minutes. Let stand for at least 1 hour to bring out the flavors. Reheat over low heat to melt the butter before using.\nCombine all the ingredients in a medium saucepan and heat over medium heat until the butter melts, then bring just to a simmer and simmer gently for 2 to 4 minutes. Let stand for at least 1 hour to bring out the flavors.\nReheat over low heat to melt the butter before using.",
        "title": "Butter Baste "
    },
    "TNOSFqIKWdnTjNzM6XJYq31UIm9sROm": {
        "instructions": "Bring 3 quarts of water to a boil in a large saucepan. Add the quinoa, stir once and return to a boil. Cook, uncovered, over moderate heat 10 minutes. Strain and rinse well with cold water. Shake the sieve well to remove all moisture.\nWhen dry, transfer the quinoa to a large bowl. Add the remaining salad ingredients and toss well. Serve on lettuce-lined plates, topped with avocado slices and optional cracked pepper garnish.",
        "ingredients": [
            "1 1/2 cups quinoa",
            "5 pickling cucumbers, peeled and cut into 1/4-inch dice",
            "1 small red onion, cut into 1/4-inch dice",
            "1 bunch Italian parsley, leaves only, chopped",
            "2 bunches mint, leaves only, chopped",
            "1/2 cup olive oil",
            "1/4 cup red wine vinegar",
            "Juice of 1 lemon",
            "1 1/2 teaspoons salt",
            "3/4 teaspoon freshly ground black pepper",
            "6 romaine lettuce leaves",
            "1 avocado, peeled, seeded and sliced, for garnish",
            "Cracked Black Pepper Garnish, (optional)"
        ],
        "title": "Aztecan Quinoa Salad",
        "picture_link": null
    },
    "6UFRectP5uhQPNAd54iG4kA.pC6Z/JC": {
        "instructions": "Place tenderloin in the freezer for 2 hours.\nPreheat the oven to 200 degrees F.\nRemove the tenderloin from the freezer. Using an electric knife, cut the beef into 3/8-inch thick slices. Place slices of beef, 1 at a time, between 2 pieces of plastic wrap. Squirt the beef lightly with water and squirt the top of the plastic wrap as well. Pound to no less than 1/8-inch thickness. Lightly brush each slice of beef on both sides with vegetable oil and season with salt and pepper on both sides. Set aside.\nHeat a large cast iron skillet over high heat for 3 to 4 minutes. Reduce heat to medium and turn skillet upside down over burner. Brush the pan lightly with oil. Place 2 to 3 slices of beef on the pan at a time and sear for 10 seconds on each side. Remove to an ovenproof platter and keep in warm oven. Repeat until all of the beef has been cooked. Serve immediately.",
        "ingredients": [
            "1 pound beef tenderloin, trimmed",
            "Vegetable oil",
            "Kosher salt",
            "Freshly ground black pepper"
        ],
        "title": "Beef Paillard",
        "picture_link": null
    },
    "XzpqVebgmEdHx8UxGTnpgof9e3uOaP6": {
        "ingredients": [
            "8 ounces hot Italian turkey sausages, casings removed",
            "1 cup chopped red onion",
            "3 tablespoons butter",
            "3/4 teaspoon dried thyme",
            "1 10-ounce russet potato, peeled, cut into 1/2-inch cubes",
            "1 cup chopped red bell pepper",
            "1 15-ounce can sliced pickled beets, drained, cut into 1/2-inch pieces",
            "4 tablespoons chopped fresh parsley",
            "3/4 cup crumbled Maytag blue cheese",
            "4 eggs"
        ],
        "picture_link": null,
        "instructions": "Heat large nonstick skillet over medium-high heat. Add sausage and sauté until cooked through, about 10 minutes. Using slotted spoon, transfer sausage to bowl. Add onion, 1 tablespoon butter and thyme to skillet; stir 3 minutes. Add potato and bell pepper; season with salt and pepper. Reduce heat to low. Cover and cook until potato is tender, stirring occasionally, about 10 minutes. Increase heat to medium-high. Stir sausage, beets and half of parsley into potato. Cook without stirring until hash begins to brown on bottom, about 5 minutes. Sprinkle cheese over. Remove from heat. Cover and let stand 5 minutes. Melt 2 tablespoons butter in medium skillet over medium-high heat. Add eggs and fry to desired doneness. Divide hash among plates; top with eggs. Sprinkle with remaining parsley.\nHeat large nonstick skillet over medium-high heat. Add sausage and sauté until cooked through, about 10 minutes. Using slotted spoon, transfer sausage to bowl. Add onion, 1 tablespoon butter and thyme to skillet; stir 3 minutes. Add potato and bell pepper; season with salt and pepper. Reduce heat to low. Cover and cook until potato is tender, stirring occasionally, about 10 minutes.\nIncrease heat to medium-high. Stir sausage, beets and half of parsley into potato. Cook without stirring until hash begins to brown on bottom, about 5 minutes. Sprinkle cheese over. Remove from heat. Cover and let stand 5 minutes.\nMelt 2 tablespoons butter in medium skillet over medium-high heat. Add eggs and fry to desired doneness.\nDivide hash among plates; top with eggs. Sprinkle with remaining parsley.",
        "title": "Blue and Red Flannel Hash "
    },
    "6/qz6L9/l1RHwPtn9LICAXtzGezNsf2": {
        "instructions": "Preheat oven to 350 degrees F.\nPut pecans in a pie plate and roast in the oven until nutty smelling and toasty, about 5 minutes.\nMeanwhile, remove ice cream from freezer and let stand at room temperature or at least 15 minutes to soften.\nRemove nuts from the oven and let cool. Turn off oven.\nChoose 4 to 6 clear plastic parfait glasses, beer glasses, or any see-through unbreakable glass of at least 12-ounce capacity.\nIn each of the glasses, put about 2 tablespoons caramel or butterscotch sauce in bottom. Top with a layer of softened ice cream, packing it down slightly and being careful not to smear the sides of the glass too much (if you do smear glass while making layers, wipe down inside with paper towels as you work). Sprinkle with a teaspoon or so of pecans. Continue layering in the same fashion: sauce, ice cream, pecans until you reach the top of the glass. Make the last layer sauce and sprinkle it with pecans.\nWrap the glasses tightly with plastic wrap and put in freezer (or outside in the snow) until ready to serve.",
        "ingredients": [
            "1 quart good-quality vanilla ice cream",
            "1 cup chopped pecans",
            "8-ounce jar good-quality caramel or butterscotch sauce"
        ],
        "title": "Pecan-Caramel Parfaits",
        "picture_link": null
    },
    "ZC8UmaG6W4UQL7lh0LxyrRMSGEbvHky": {
        "ingredients": [
            "1 1/2 cups all purpose flour",
            "2 tablespoons sugar",
            "3/4 teaspoon salt",
            "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
            "2 tablespoons chilled nonhydrogenated solid vegetable shortening, cut into 1/2-inch cubes",
            "2 tablespoons (or more) ice water",
            "3 medium Granny Smith apples (1 1/4 pounds total), peeled, cored, cut into 1/2-inch cubes (about 4 cups)",
            "2 firm but ripe medium Anjou or Bartlett pears (about 18 ounces), peeled, cored, cut into 1/2-inch cubes (about 2 1/2 cups)",
            "1 cup assorted moist plump dried fruit (such as raisins, cherries, and diced apricots)",
            "7 tablespoons orange marmalade, divided",
            "4 tablespoons sugar, divided",
            "1 teaspoon finely grated peeled fresh ginger",
            "3/4 teaspoon ground ginger",
            "Nonstick vegetable-oil spray",
            "Vanilla ice cream or sweetened whipped cream"
        ],
        "picture_link": "PPEM2cq5OGinKCuHhV17FIz4AKPpiky",
        "instructions": "For crust: Mix flour, sugar, and salt in processor. Add butter and shortening; pulse until coarse meal forms. Add 2 tablespoons ice water; pulse until moist clumps form, adding more water by teaspoonfuls if dry. Gather dough into ball; flatten into disk and wrap in plastic. Chill 2 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled. Let stand at room temperature 30 minutes before continuing.\nMix flour, sugar, and salt in processor. Add butter and shortening; pulse until coarse meal forms. Add 2 tablespoons ice water; pulse until moist clumps form, adding more water by teaspoonfuls if dry. Gather dough into ball; flatten into disk and wrap in plastic. Chill 2 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled. Let stand at room temperature 30 minutes before continuing.\nFor filling: Preheat oven to 425°F. Mix apples, pears, dried fruit, 3 tablespoons marmalade, 3 tablespoons sugar, fresh ginger, and ground ginger in large bowl to coat. Roll crust out between 2 large sheets of waxed paper to 13-inch round. Place sheet of parchment on rimless baking sheet; spray parchment with nonstick spray. Remove top sheet of waxed paper from crust. Invert crust onto parchment, then peel off second sheet of waxed paper. Spoon filling onto crust, leaving 2-inch border around edges. Fold crust border up and over filling, folding and pleating occasionally. Brush crust edges lightly with water. Sprinkle damp crust with remaining 1 tablespoon sugar. Bake galette 50 minutes. Reduce heat to 400°F. Loosely cover filling with small sheet of foil. Bake until crust is deep golden and filling is tender, about 20 minutes longer. Slide knife or offset spatula under galette to loosen from parchment. Cool galette slightly on sheet on rack. Heat remaining 4 tablespoons marmalade and 1 tablespoon water in small saucepan over medium heat, stirring often, until marmalade melts. Spoon marmalade glaze over filling. Serve galette warm or at room temperature with vanilla ice cream or sweetened whipped cream.\nPreheat oven to 425°F. Mix apples, pears, dried fruit, 3 tablespoons marmalade, 3 tablespoons sugar, fresh ginger, and ground ginger in large bowl to coat.\nRoll crust out between 2 large sheets of waxed paper to 13-inch round. Place sheet of parchment on rimless baking sheet; spray parchment with nonstick spray. Remove top sheet of waxed paper from crust. Invert crust onto parchment, then peel off second sheet of waxed paper. Spoon filling onto crust, leaving 2-inch border around edges. Fold crust border up and over filling, folding and pleating occasionally.\nBrush crust edges lightly with water. Sprinkle damp crust with remaining 1 tablespoon sugar.\nBake galette 50 minutes. Reduce heat to 400°F. Loosely cover filling with small sheet of foil.\nBake until crust is deep golden and filling is tender, about 20 minutes longer. Slide knife or offset spatula under galette to loosen from parchment. Cool galette slightly on sheet on rack.\nHeat remaining 4 tablespoons marmalade and 1 tablespoon water in small saucepan over medium heat, stirring often, until marmalade melts. Spoon marmalade glaze over filling.\nServe galette warm or at room temperature with vanilla ice cream or sweetened whipped cream.",
        "title": "Christmas Gallete "
    },
    "m6BTPq4vovZQGtJ.4EhJ2tK/uMq/th2": {
        "instructions": "Special equipment: A 9-inch fluted tart pan with a removable bottom\nFor the pastry: Whisk together the flour, granulated sugar and salt in a large bowl. Cut the butter in with a pastry blender or two knives until the mixture resembles coarse meal with a few pea-sized pieces. Add 4 tablespoons of the water and stir with a fork until a shaggy dough starts to form. Add 1 to 2 more tablespoons water if you need to, but stop before the dough gets too wet. It should just hold together when you squeeze it in your hand.\nGather the dough into a rough ball in the bowl with your hands. Put a piece of plastic wrap on the counter and set the dough on it. Wrap the dough and flatten it into a 6-inch disc. Refrigerate until cold, at least 1 hour.\nFor the filling: Meanwhile, place the almonds in the bowl of a food processor and pulse until very finely ground. Add the granulated sugar, butter, salt and almond extract and blend until smooth. Add the eggs and blend until smooth. Add the flour and pulse until just combined.\nHeat the oven to 375 degrees F. On a lightly floured surface with a lightly floured rolling pin, roll the dough out to an 11-inch circle. Ease the dough into a 9-inch tart pan with a removable bottom. Gently press in the edges, then run a rolling pin over the top to trim the edges. Refrigerate for at least 30 minutes or freeze for 15 minutes. Line the cold pastry with parchment paper and fill with pie weights or dried beans. Place the lined tart pan on a baking sheet and bake until set and dry, about 20 minutes. Reduce the oven temperature to 350 degrees F.\nScrape the filling into the tart pan and spread it out evenly. Top evenly with the raspberries and sprinkle with the sliced almonds. Bake until the filling is puffed and golden brown, 35 to 40 minutes. Transfer to a rack to cool. Serve warm or at room temperature sprinkled with confectioners' sugar.",
        "ingredients": [
            "1 1/2 cups all-purpose flour, plus more for the work surface",
            "1 tablespoon granulated sugar",
            "1/2 teaspoon kosher salt",
            "8 tablespoons (1 stick) cold unsalted butter, cut into pieces",
            "4 to 6 tablespoons ice water",
            "1 cup (4 ounces) whole blanched, raw almonds",
            "1/2 cup granulated sugar",
            "4 tablespoons (1/2 stick) unsalted butter, at room temperature",
            "1/2 teaspoon kosher salt",
            "1 teaspoon almond extract",
            "2 large eggs",
            "3 tablespoons all-purpose flour",
            "1 1/2 cups (6 ounces) fresh raspberries",
            "2 tablespoons sliced almonds",
            "Confectioners' sugar, for sprinkling"
        ],
        "title": "Raspberry Frangipane Tart",
        "picture_link": "QUj7O7kLlVLf7pzImszrhUFX/.1zzga"
    },
    "yyeKzS/DUxEajB8mQGeyjZYsqpEbYQ.": {
        "instructions": "Preheat the oven to 350 degrees F. Toast the walnuts until lightly browned, 12 to 15 minutes. Let cool, then finely grind them in a food processor. Sift flour and salt into a bowl and set aside. In the bowl of a stand mixer fitted with a paddle attachment on low speed, beat together the butter and sugar until lightened, about 4 minutes. Add the yolk and mix until fully incorporated. Add the dry ingredients and walnuts and mix just to combine. If the dough is soft, wrap it tightly in plastic and refrigerate for 30 minutes. Otherwise, roll out the dough about 1/2 inch thick on a lightly floured work surface into a 6-by-7-inch rectangle. Using a ruler, square the edges as much as possible. Using a sharp knife, cut the dough into1-inch squares. Place them about 2 inches apart on a parchment-lined baking sheet. Sprinkle lightly with sea salt. Preheat the oven to 350 degrees F. Bake the cookies until they are firm, about 10 to 12 minutes. Remove to a wire rack to cool. Store in airtight containers for up to 2 weeks.",
        "ingredients": [
            "1/2 cup (2 ounces) walnut pieces",
            "1 3/4 cups (89ounces) flour",
            "1/2 teaspoon kosher salt",
            "1 cup (8 ounces) unsalted butter",
            "3/4 cup (5 1/2 ounces) sugar",
            "1 egg yolk",
            "Maldon sea salt"
        ],
        "title": "Walnut Shortbread Cookies",
        "picture_link": null
    },
    "cFEwPOzfv2mydLbSmvId9OUNS72EdXe": {
        "instructions": "Make the meatballs: Preheat the oven to 400 degrees F and line a baking sheet with parchment paper. Heat 1 tablespoon vegetable oil in a large nonstick skillet over medium-high heat. Add the cabbage and season with 1/4 teaspoon salt; cook, stirring occasionally, until softened, about 4 minutes. Transfer the cabbage to a plate to cool. Wipe out the pan, then add the remaining 1 tablespoon vegetable oil and the mushrooms. Season with 1/4 teaspoon salt and a few grinds of pepper and cook, stirring occasionally, until lightly browned, about 5 minutes. Transfer the mushrooms to the plate with the cabbage to cool.\nLightly beat the eggs and egg white in a large bowl. Add the pork, scallions, garlic, ginger, soy sauce, sesame oil, sugar and cornstarch. Add the cabbage, mushrooms and a few grinds of pepper and mix with your hands until just combined (do not overmix). Dampen your hands and shape the meat mixture into 18 balls (about 2 inches each); arrange on the prepared baking sheet.\nMake the sauce: Mix the hoisin sauce, Sriracha, vinegar, sugar and 1 tablespoon water in a bowl; set aside 1/2 cup for serving. Brush the meatballs with the remaining sauce and sprinkle with the sesame seeds. Bake until cooked through, 18 to 22 minutes. Serve in lettuce leaves with the reserved sauce.\nPhotograph by Christina Holmes",
        "ingredients": [
            "For the meatballs:",
            "2 tablespoons vegetable oil",
            "3 cups thinly sliced green cabbage (about 1/4 head)",
            "Kosher salt",
            "8 ounces shiitake mushrooms, stems removed, caps thinly sliced",
            "Freshly ground white pepper",
            "2 large eggs plus 1 egg white",
            "1 1/2 pounds ground pork",
            "4 scallions, minced",
            "3 cloves garlic, minced",
            "1 2-inch piece ginger, peeled and finely grated (about 1 tablespoon)",
            "3 tablespoons low-sodium soy sauce",
            "1 tablespoon toasted sesame oil",
            "2 teaspoons sugar",
            "2 teaspoons cornstarch",
            "For the sauce:",
            "1/2 cup hoisin sauce",
            "2 teaspoons Sriracha chile sauce",
            "1 teaspoon rice vinegar",
            "1 tablespoon sugar",
            "3 tablespoons sesame seeds",
            "1 head Boston lettuce, leaves separated"
        ],
        "title": "Asian Pork Meatballs",
        "picture_link": "pjHFdxjE3pN//WfllKQhTfI1gb85YG6"
    },
    "nYdwCiFJ5ngy9Pl6mZ9EC/PI2l8BT2G": {
        "instructions": "Watch how to make this recipe.\nSpecial equipment: a smoker or grill\nSift the brown sugar, granulated sugar, salt, chili powder, paprika, black pepper, cumin, garlic powder, onion powder and cayenne pepper into a medium bowl and mix well. Set aside.\nTrim all the hard fat from the brisket. Trim all the soft fat to 1/4 inch. Prepare a smoker or a grill, following the manufacturer's directions. Stabilize the temperature at 220 degrees F. Use a mild wood such as hickory or cherry for the smoke flavor. Generously cover all sides of the brisket with the rub and gently massage it in. Reserve the leftover rub. Smoke the meat until an instant-read thermometer registers 170 to 185 degrees F when inserted into the flat part of the brisket, about 1 hour per pound. For example, a 10-pound brisket may need to smoke for about 10 or more hours. Monitor the internal temperature.\nSeparate the point of the meat from the flat. At this time you can slice the flat part off the brisket and eat. Trim the visible fat from the brisket point and coat it with the reserved rub. Return the meat to the smoker and continue cooking until the internal temperature of the brisket point reaches 200 degrees F. Remove the brisket from the smoker to a cutting board and let it sit for 10 to 20 minutes. Cut into chunks and transfer them to a serving platter. Serve it hot with your favorite sauce on the side.",
        "ingredients": [
            "1 cup brown sugar",
            "1 cup granulated sugar",
            "1/2 cup salt",
            "1/3 cup chili powder",
            "1/4 cup paprika",
            "6 tablespoons black pepper",
            "3 tablespoons ground cumin",
            "3 tablespoons garlic powder",
            "3 tablespoons onion powder",
            "1 tablespoon cayenne pepper",
            "One 10- to 12-pound whole, packer trim beef brisket"
        ],
        "title": "Kansas City-Style Burnt Ends",
        "picture_link": "BOzwniAWDVUqb1bLv0hVtRh2.CaSkuO"
    },
    "GkEUuk3kV7Q/J7o/jDqago0wy9Fcpqm": {
        "ingredients": [
            "12 ounces asparagus, trimmed, cut into 3/4-inch pieces",
            "2 cups pearl barley",
            "3 tablespoons butter",
            "1 cup finely chopped onion",
            "3 large garlic cloves, finely chopped",
            "8 1/2 cups (about) canned vegetable broth",
            "2 cups drained canned diced tomatoes in juice",
            "1/2 cup freshly grated Parmesan cheese",
            "1/2 cup chopped arugula or 3 tablespoons chopped fresh parsley",
            "2 teaspoons grated lemon peel"
        ],
        "picture_link": "qQt.7QOV4Q/H6y1r5R8.XZhMjccDE92",
        "instructions": "Cook asparagus in pot of boiling salted water until crisp-tender, about 3 minutes. Drain. Transfer to bowl of ice water and cool. Drain. (Can be made 1 day ahead. Cover and refrigerate.) Stir barley in heavy large saucepan over medium heat until lightly toasted, about 5 minutes. Transfer barley to bowl. Melt butter in same saucepan over medium heat. Add onion and garlic; sauté until tender, about 5 minutes. Add barley and stir to coat. Add 2 cups broth; reduce heat to medium-low and simmer until liquid is absorbed, stirring frequently, about 7 minutes. Mix in 2 1/2 cups broth and simmer until absorbed, stirring frequently. Add 3 cups broth and simmer until barley is tender and creamy but still slightly firm to bite, stirring frequently and adding more broth if mixture is dry, about 45 minutes. Add tomatoes and asparagus; stir until heated through, about 3 minutes. Mix in cheese, arugula and lemon peel. Season with salt and pepper.\nCook asparagus in pot of boiling salted water until crisp-tender, about 3 minutes. Drain. Transfer to bowl of ice water and cool. Drain. (Can be made 1 day ahead. Cover and refrigerate.)\nStir barley in heavy large saucepan over medium heat until lightly toasted, about 5 minutes. Transfer barley to bowl. Melt butter in same saucepan over medium heat. Add onion and garlic; sauté until tender, about 5 minutes. Add barley and stir to coat. Add 2 cups broth; reduce heat to medium-low and simmer until liquid is absorbed, stirring frequently, about 7 minutes. Mix in 2 1/2 cups broth and simmer until absorbed, stirring frequently. Add 3 cups broth and simmer until barley is tender and creamy but still slightly firm to bite, stirring frequently and adding more broth if mixture is dry, about 45 minutes. Add tomatoes and asparagus; stir until heated through, about 3 minutes. Mix in cheese, arugula and lemon peel. Season with salt and pepper.",
        "title": "Toasted Barley and Asparagus \"risotto\" "
    },
    "GF2JWbv.vw0hkdFfeK4kTh1CJqQNrwK": {
        "instructions": "Watch how to make this recipe.\nSpecial equipment: 10 foil cupcake liners\nFor the panna cotta: Place ten foil cupcake liners in a muffin pan. Coat the interior of each with nonstick cooking spray.\nPour the milk in a small bowl and sprinkle with the gelatin; let stand until the mixture has the consistency of granulated sugar, about 1 minute.\nCombine the cream and sugar in a medium saucepan set over medium-high heat. Bring to a boil, stirring to dissolve the sugar. Whisk in the milk mixture, then reduce the heat to medium-low and simmer for 5 minutes. Remove the saucepan from the heat, then add in the chocolate chips and vanilla. Whisk until smooth. Pour the liquid through a fine mesh sieve into a large measuring cup. Divide the mixture evenly among the foil liners (they should be filled to the brim). Place the pan on a level surface in the refrigerator until the panna cotta is set and springs back when touched, 2 hours 30 minutes.\nFor the blueberry sauce: Puree 1/2 cup of the blueberries and 1 tablespoon water in a blender for 1 minute. Scrape out the blueberry puree into a small saucepan. Place the pan over medium heat and add the sugar, stirring until the sugar dissolves and the sauce begins to bubble slightly, 3 to 4 minutes. Remove from the heat, stir in the lemon juice and cool until no longer warm to the touch, 5 to 10 minutes.\nRemove the panna cotta from the muffin pan, then gently pull away the sides of the cupcake liners from the panna cotta and invert each onto a plate or shallow bowl. Drizzle each serving with 1 teaspoon of the cooled blueberry sauce and sprinkle 4 to 5 blueberries on top to serve.",
        "ingredients": [
            "Nonstick cooking spray",
            "3 tablespoons whole milk",
            "2 1/2 teaspoons unflavored powdered gelatin",
            "2 cups heavy cream",
            "1/4 cup granulated sugar",
            "1 cup dark chocolate chips",
            "1 teaspoon vanilla extract",
            "1 1/2 cups blueberries",
            "1 tablespoon granulated sugar",
            "1/2 teaspoon lemon juice"
        ],
        "title": "Gluten-Free Dark Chocolate and Blueberry Panna Cotta",
        "picture_link": "NdLebx4HACHFFah920REz6k4ZygZjgO"
    },
    "t.F3LeOjWOe5HwbZ68pLBtxx0xqy2tK": {
        "ingredients": [
            "2 1/2 pounds boneless pork shoulder, cut into 1 1/2-inch pieces",
            "3/4 teaspoon salt",
            "1 to 3 tablespoons vegetable oil",
            "1 onion, chopped",
            "1 green bell pepper, chopped",
            "1 celery rib, chopped",
            "1 large garlic clove, minced",
            "1 tablespoon ground cumin",
            "2 teaspoons ground coriander",
            "1 teaspoon ground turmeric",
            "1/8 teaspoon cayenne",
            "2 cups water",
            "4 plum tomatoes (3/4 pounds total), peeled (see cooks' note, below) and chopped, or 1 (14- to 16-oz) can whole tomatoes, drained and chopped",
            "1 1/2 pounds firm-ripe Fuyu persimmons, peeled, seeded if necessary, and cut into 1/4-inch-thick wedges",
            "1/2 cup chopped scallion greens",
            "Accompaniment: cooked white rice"
        ],
        "picture_link": "EkxRgn0uqCbjbeJGuot67rKUwjGjU.u",
        "instructions": "Put oven rack in lower third of oven and preheat oven to 350°F. Pat pork dry with paper towels, then sprinkle with salt. Heat 1 tablespoon oil in a wide 6-quart heavy pot over moderately high heat until hot but not smoking, then brown pork in 3 batches, turning, about 5 minutes per batch, transferring to a bowl as browned. (Add more oil to pot as needed between batches.) Pour off all but 1 tablespoon fat from pot. Add onion, bell pepper, and celery and cook over moderate heat, stirring, until softened, 3 to 5 minutes. Stir in garlic, cumin, coriander, turmeric, and cayenne and cook, stirring, 1 minute. Add pork with any juices accumulated in bowl, water, and tomatoes and bring to a simmer. Cover pot, then transfer to oven and braise pork until very tender, about 1 3/4 hours. Scatter persimmons over pork and braise in oven, partially covered, 10 minutes more. Stir in scallion greens and salt and pepper to taste.\nPut oven rack in lower third of oven and preheat oven to 350°F.\nPat pork dry with paper towels, then sprinkle with salt. Heat 1 tablespoon oil in a wide 6-quart heavy pot over moderately high heat until hot but not smoking, then brown pork in 3 batches, turning, about 5 minutes per batch, transferring to a bowl as browned. (Add more oil to pot as needed between batches.)\nPour off all but 1 tablespoon fat from pot. Add onion, bell pepper, and celery and cook over moderate heat, stirring, until softened, 3 to 5 minutes. Stir in garlic, cumin, coriander, turmeric, and cayenne and cook, stirring, 1 minute. Add pork with any juices accumulated in bowl, water, and tomatoes and bring to a simmer.\nCover pot, then transfer to oven and braise pork until very tender, about 1 3/4 hours.\nScatter persimmons over pork and braise in oven, partially covered, 10 minutes more. Stir in scallion greens and salt and pepper to taste.",
        "title": "Braised Pork with Fuyu Persimmon "
    },
    "CZAIVoMk1Vis8p9yajkBMAywyfNyQSi": {
        "ingredients": [
            "2 medium firm-ripe bananas",
            "2 teaspoons fresh lemon juice",
            "2 tablespoons granulated sugar",
            "2 large egg yolks",
            "1/2 cup heavy cream",
            "about 1 tablespoon turbinado sugar such as Sugar in the Raw brand"
        ],
        "picture_link": null,
        "instructions": "Preheat oven to 350°F. Break 1 banana into pieces and purée in a blender with lemon juice, granulated sugar, and yolks until smooth. In a very small saucepan heat cream over moderate heat until hot and add banana mixture, stirring until combined well. Divide mixture between two 2/3-cup ramekins. Put ramekins in a metal baking pan and fill pan with enough boiling-hot water to reach halfway up sides of ramekins. Put pan in middle of oven and lay a sheet of foil over each ramekin. Bake custards until set, about 30 minutes. Set broiler rack so that custard tops will be 1 1/2 to 2 inches from heat and change oven setting to broil. Alternatively, have ready a blowtorch. Just before serving, very thinly slice remaining banana and arrange slices, overlapping them, over each custard. Sprinkle turbinado sugar evenly over bananas and heat under broiler (or with blowtorch, moving flame evenly back and forth just over sugar) until sugar is melted and caramelized.\nPreheat oven to 350°F.\nBreak 1 banana into pieces and purée in a blender with lemon juice, granulated sugar, and yolks until smooth. In a very small saucepan heat cream over moderate heat until hot and add banana mixture, stirring until combined well. Divide mixture between two 2/3-cup ramekins. Put ramekins in a metal baking pan and fill pan with enough boiling-hot water to reach halfway up sides of ramekins. Put pan in middle of oven and lay a sheet of foil over each ramekin. Bake custards until set, about 30 minutes.\nSet broiler rack so that custard tops will be 1 1/2 to 2 inches from heat and change oven setting to broil. Alternatively, have ready a blowtorch.\nJust before serving, very thinly slice remaining banana and arrange slices, overlapping them, over each custard. Sprinkle turbinado sugar evenly over bananas and heat under broiler (or with blowtorch, moving flame evenly back and forth just over sugar) until sugar is melted and caramelized.",
        "title": "Hot Banana Crème Brûlée "
    },
    "Ok.FW3yxRBGWvOrcEpcAkd5CBxn3fGi": {
        "instructions": "Heat 1 tablespoon vegetable oil in a large nonstick skillet over medium-high heat. Add the dumplings in a single layer. Cook until browned, 2 to 3 minutes per side. Add 1/4 cup water to the skillet. Cook, stirring occasionally, until evaporated, about 1 minute; transfer the dumplings to a bowl.\nHeat 1 tablespoon vegetable oil in the skillet. Add the vegetables and cook, stirring occasionally, until crisp-tender and lightly browned, 8 to 10 minutes; transfer to the bowl with the dumplings.\nHeat the remaining 1 tablespoon vegetable oil in the skillet. Add the shrimp, ginger and garlic. Cook, stirring occasionally, until the shrimp are just cooked through, about 2 minutes. Return the dumplings and vegetables to the skillet and stir to combine. Add the chili sauce and soy sauce; cook, stirring gently, until glazed, about 1 minute. Remove from the heat and stir in the rice vinegar and half of the scallions. Top with the remaining scallions.",
        "ingredients": [
            "3 tablespoons vegetable oil",
            "1 13-ounce package frozen vegetable dumplings",
            "1 18-ounce bag mixed fresh stir-fry vegetables, large pieces halved (about 6 cups)",
            "1 pound medium shrimp, peeled and deveined",
            "1 tablespoon finely chopped peeled ginger",
            "2 cloves garlic, thinly sliced",
            "1/3 cup sweet Thai chili sauce",
            "2 tablespoons low-sodium soy sauce",
            "1 tablespoon rice vinegar",
            "2 scallions, sliced"
        ],
        "title": "Shrimp and Dumpling Stir-Fry",
        "picture_link": "ISHXGHpsO2JoLWcuD2EN4iO9PNshPCi"
    },
    "N1V3HvVAQawYsewbKBrn7ENQodDhGeO": {
        "instructions": "Watch how to make this recipe.\nPreheat the oven to 375F.\nMelt the butter in a medium pot over medium heat. Sprinkle the flour over the melted butter, whisk to combine, and cook for about 1 minute. Slowly whisk the milk into the butter-flour mixture, season with salt, pepper, and nutmeg, and cook for a couple of minutes to thicken. Stir in half the Parmigiano (about 3/4 cup). Set the sauce aside.\nHeat the EVOO in a large cast-iron skillet over medium-high heat. Toss in the cracked clove of garlic and cook for a minute or two to release its aroma and flavor. Add the chard and cook, turning occasionally to wilt down, 2 minutes. Add the spinach a few handfuls at a time, wilting each batch before adding more. Season the greens with salt and pepper.\nBreak the pasta sheets into large pieces. Toss them into the pan with the greens and give them a good stir to incorporate them. Pour the sauce into the skillet, stirring again to incorporate everything evenly. Smooth the top down and sprinkle the remaining 3/4 cup Parmigiano into the skillet. Cover the skillet with foil, transfer to the oven, and bake the lasagna for 30 minutes. Remove the foil from the pan and let it finish cooking uncovered for about 15 more minutes to brown the cheese.",
        "ingredients": [
            "4 tablespoons (1/2 stick) butter",
            "4 tablespoons all-purpose flour",
            "3 cups milk",
            "Salt and pepper",
            "Freshly grated nutmeg",
            "11/2 cups grated Parmigiano-Reggiano",
            "2 tablespoons EVOO (extra-virgin olive oil)",
            "1 garlic clove, cracked away from its skin",
            "1 bunch of green chard, stems removed, leaves coarsely chopped",
            "2 pounds spinach, stems removed, leaves coarsely chopped",
            "1 box no-boil lasagna noodles"
        ],
        "title": "Broken Florentine Lasagna Bake",
        "picture_link": "AkvV56GGLL2vxeNO05sMyLzsMMnL6Pa"
    },
    "0gxpNalF4UC/BCAXvEG3z6Luvc2ur.u": {
        "ingredients": [
            "1 1-pound loaf rustic whole wheat bread, cut (with crust) into 1/2- to 3/4-inch cubes (about 10 cups)",
            "2 tablespoons (or more) extra-virgin olive oil",
            "4 ounces 1/4-inch-thick slices pancetta (Italian bacon), cut into 1/4-inch cubes",
            "1 7.25-to 7.41-ounce jar whole steamed chestnuts or vacuum-packed roasted chestnuts,* broken into 1/2-inch pieces",
            "1 cup chopped shallots (about 4 large)",
            "1 teaspoon minced fresh thyme",
            "1/2 teaspoon minced fresh rosemary",
            "3 cups low-salt chicken broth",
            "2 large eggs",
            "1 cup finely grated Parmesan cheese"
        ],
        "picture_link": "1QRADB4znUBQL6At2atZG1KKBQOLD/G",
        "instructions": "Position rack in center of oven and preheat to 375°F. Toss bread cubes and 2 tablespoons oil in large bowl. Spread in single layer on large rimmed baking sheet. Sprinkle with salt and freshly ground black pepper. Bake until bread cubes are golden and slightly crunchy, stirring occasionally, about 15 minutes. Cool slightly, then return bread cubes to same large bowl. Sauté pancetta in heavy large skillet over medium heat until crisp, adding oil if dry, about 6 minutes. Tilting skillet to allow pan drippings to accumulate at 1 end and using slotted spoon, transfer pancetta to bowl with bread cubes. Add chestnuts and shallots to drippings in skillet; sauté until beginning to brown, about 6 minutes. Add thyme and rosemary; stir 1 minute. Transfer mixture to bowl with bread. DO AHEAD: Can be made 1 day ahead. Cover; chill. Preheat oven to 375°F. Generously butter 13x9x2-inch glass baking dish. Boil 3 cups broth in medium saucepan until reduced to 1 1/2 cups, 6 to 8 minutes. Whisk eggs in another large bowl. Mix in cheese. Gradually whisk in broth. Pour broth mixture over chestnut-bread mixture. Sprinkle with black pepper and stir well. Transfer stuffing to prepared baking dish. Cover dish with foil and bake 25 minutes. Remove foil and bake uncovered until top is golden brown and slightly crisp around edges, about 20 minutes longer.\nPosition rack in center of oven and preheat to 375°F. Toss bread cubes and 2 tablespoons oil in large bowl. Spread in single layer on large rimmed baking sheet. Sprinkle with salt and freshly ground black pepper. Bake until bread cubes are golden and slightly crunchy, stirring occasionally, about 15 minutes. Cool slightly, then return bread cubes to same large bowl.\nSauté pancetta in heavy large skillet over medium heat until crisp, adding oil if dry, about 6 minutes. Tilting skillet to allow pan drippings to accumulate at 1 end and using slotted spoon, transfer pancetta to bowl with bread cubes. Add chestnuts and shallots to drippings in skillet; sauté until beginning to brown, about 6 minutes. Add thyme and rosemary; stir 1 minute. Transfer mixture to bowl with bread. DO AHEAD: Can be made 1 day ahead. Cover; chill.\nPreheat oven to 375°F. Generously butter 13x9x2-inch glass baking dish. Boil 3 cups broth in medium saucepan until reduced to 1 1/2 cups, 6 to 8 minutes. Whisk eggs in another large bowl. Mix in cheese. Gradually whisk in broth. Pour broth mixture over chestnut-bread mixture. Sprinkle with black pepper and stir well.\nTransfer stuffing to prepared baking dish. Cover dish with foil and bake 25 minutes. Remove foil and bake uncovered until top is golden brown and slightly crisp around edges, about 20 minutes longer.\nPeeled cooked chestnuts; sold at some supermarkets and at specialty foods stores.\nPeeled cooked chestnuts; sold at some supermarkets and at specialty foods stores.\nPeeled cooked chestnuts; sold at some supermarkets and at specialty foods stores.",
        "title": "Whole Wheat Stuffing with Pancetta, Chestnuts, and Parmesan "
    },
    "UvOVYx37CKayXUXtwkrGoOOa2/5/nWm": {
        "instructions": "Cut the top 1/4 off 4 pumpkins, reserving the lids. Cut the remaining 4 pumpkins in half. Reserve seeds from 2 pumpkins.\nBake the pumkins, cut side down, on lightly oiled baking sheets in a preheated 350 degree oven for 40 minutes or until they are tender. When they are cool enough to handle, scrape all the pulp out of the halved pumpkins. Scrape most of the pulp out of the remaining pumpkins, leaving just enough in each pumpkin so that it retains its shape.\nIn a skillet cook the onion in butter over low heat, stirring, until the onion is softened. Add the pumpkin pulp, the chicken stock and the water and simmer the mixture for 20 minutes.\nPuree the mixture in batches in a blender and transfer it to a saucepan. Stir in salt and pepper to taste and water to thin the soup if necessary.\nReduce the oven heat to 250 degrees. In a bowl, toss the reserved seeds with the oil and salt to taste and spread them out on an ungreased baking sheet. Bake the seeds in the middle of the oven, stirring occasionally, for 1 hour to 1 1/2 hours or until they are golden and crisp.\nHeat the soup and warm the hollowed out pumpkin shells in the oven. Arrange the shells in 4 soup plates, fill each shell with some of the soup and ladle some additional soup around each shell. Sprinkle some crumbled blue cheese and toasted pumpkin seeds on top of each soup and serve with the lid on top",
        "ingredients": [
            "8 mini pumpkins",
            "1 cup thinly sliced onion",
            "1 1/2 tablespoons unsalted butter",
            "1 1/2 cups chicken stock",
            "1 1/2 cups water",
            "2 teaspoons vegetable oil",
            "4 tablespoon blue cheese"
        ],
        "title": "Mini Pumpkin Soup with Blue Cheese and Toasted Pumpkin Seeds",
        "picture_link": null
    },
    "zL9SWXjPwLrsKAJnAfcGXXV7m5UnayC": {
        "instructions": "For the crust: Grease a 9-by-13-inch glass or stoneware casserole dish. Combine the graham cracker crumbs, melted butter and confectioners' sugar, and press into the prepared dish.\nFor the filling: Preheat the oven to 350 degrees F. In the bowl of a stand mixer fitted with a paddle attachment combine the granulated sugar and cream cheese, and beat on medium-high speed until combined. Add the eggs, one at a time, and mix until combined. Pour the mixture over the prepared crust and bake until slightly wobbly in the center but set, 20 minutes. Cool the cheesecake until just warm, about 1 hour.\nFor the topping: Combine the blueberries, granulated sugar, flour, salt and 1/3 cup water in a small saucepan set over medium heat and simmer until just thickened, about 15 minutes. Remove from the heat and cool until just warm, 30 to 45 minutes.\nPour the blueberries over the top of the cheesecake. Refrigerate to chill and set, at least 1 hour.\nSlice and serve.",
        "ingredients": [
            "Nonstick cooking spray or butter, for greasing",
            "2 1/3 cups graham cracker crumbs",
            "1/2 cup butter, melted",
            "1/4 cup confectioners' sugar",
            "1/2 cup granulated sugar",
            "Two 8-ounce packages cream cheese",
            "2 eggs",
            "2 1/2 cups fresh blueberries",
            "3/4 cup granulated sugar",
            "1/3 cup all-purpose flour",
            "1/4 teaspoon salt"
        ],
        "title": "Rustic Blueberry Cheesecake",
        "picture_link": "kA2Ojr7PLRL8HPzJNovsSqGlPvHBGDy"
    },
    "zPULHSHm/yUII5fu/TCx.tnFwdJYH8O": {
        "ingredients": [
            "3 cups fresh white breadcrumbs",
            "1 cup freshly grated Parmesan cheese (about 3 ounces)",
            "6 tablespoons chopped fresh parsley",
            "4 teaspoons onion powder",
            "1 tablespoon Hungarian sweet paprika",
            "1 tablespoon dried oregano",
            "2 teaspoons salt",
            "1 1/2 teaspoons pepper",
            "1 1/2 cups (3 sticks) butter",
            "9 tablespoons Dijon mustard",
            "24 chicken drumsticks"
        ],
        "picture_link": "zh3/BtyuRaK95RMiP5Be8IeyMiZNeou",
        "instructions": "Preheat oven to 350°F. Butter 2 large baking sheets. Combine breadcrumbs, Parmesan cheese, parsley, onion powder, paprika, oregano, salt and pepper in large bowl and stir to blend. Melt butter in small saucepan over medium-low-heat. Remove saucepan from heat. Add mustard and whisk to blend. Brush drumsticks generously with butter mixture, then roll in breadcrumb mixture coating completely. Arrange drumsticks on prepared baking sheets. Bake drumsticks until golden brown and cooked through, about 1 hour. Serve warm or at room temperature.\nPreheat oven to 350°F. Butter 2 large baking sheets. Combine breadcrumbs, Parmesan cheese, parsley, onion powder, paprika, oregano, salt and pepper in large bowl and stir to blend. Melt butter in small saucepan over medium-low-heat. Remove saucepan from heat. Add mustard and whisk to blend. Brush drumsticks generously with butter mixture, then roll in breadcrumb mixture coating completely. Arrange drumsticks on prepared baking sheets.\nBake drumsticks until golden brown and cooked through, about 1 hour. Serve warm or at room temperature.",
        "title": "Oven-Baked Drumsticks "
    },
    "Ghhcs9F2tWWEVApGT.CdMD2M/koznLu": {
        "ingredients": [
            "1 1/4 cups warm water (105°F.)",
            "3/4 stick (6 tablespoons) unsalted butter, melted and cooled slightly",
            "6 tablespoons granulated sugar",
            "two 1/4-ounce packages active dry yeast (about 4 1/2 teaspoons total)",
            "3 large eggs beaten lightly",
            "1 1/2 teaspoons salt",
            "1/4 cup powdered nonfat dry milk",
            "5 to 6 cups all-purpose flour",
            "1/2 stick (1/4 cup) unsalted butter, softened",
            "1/2 cup granulated sugar",
            "2 tablespoons ground cinnamon",
            "3 tablespoons cardamom seeds, ground in a mortar with a pestle, or in an electric spice/coffee grinder",
            "an egg wash made by beating 1 large egg with 2 tablespoons water",
            "2 tablespoons water"
        ],
        "picture_link": "HgWcoi8bpJ9lMXAq14xalhbHSziJcy2",
        "instructions": "Make dough: In a large bowl combine water, butter, and sugar. Sprinkle yeast over mixture and let stand 5 minutes, or until foamy. Stir in eggs, salt and dry milk until combined. With a wooden spoon stir in 5 sups flour, 1 cup at a time, and stir mixture until a dough is formed. On a floured surface, knead dough about 10 minutes, adding enough of the remaining 1 cup flour to make dough smooth and elastic. Put dough in a lightly oiled bowl, turning to coat, and let rise, covered with plastic wrap, in a warm place until doubled in bulk, about 1 hour.\nIn a large bowl combine water, butter, and sugar. Sprinkle yeast over mixture and let stand 5 minutes, or until foamy. Stir in eggs, salt and dry milk until combined. With a wooden spoon stir in 5 sups flour, 1 cup at a time, and stir mixture until a dough is formed.\nOn a floured surface, knead dough about 10 minutes, adding enough of the remaining 1 cup flour to make dough smooth and elastic. Put dough in a lightly oiled bowl, turning to coat, and let rise, covered with plastic wrap, in a warm place until doubled in bulk, about 1 hour.\nPunch down dough and on floured surface with a floured rolling pin roll into a 15- by 20-inch rectangle. Spread butter over dough and sprinkle with granulated sugar, cinnamon and cardamom. With a long side facing you, roll up dough jelly-roll fashion and cut crosswise into approximately 1 1/2-inch-thick slices with a cut side down. Working with 1 slice at a time gently twist opposite ends of slice around twice to form a figure eight. Crimp ends together. Arrange rolls, a swirled side up, on a buttered baking sheet about 2 inches apart and let rise in a warm place until increased 1 1/2 times in bulk, about 1 hour. While rolls are rising, preheat oven to 350F. Brush tops of rolls with egg wash and sprinkle with sugar. Bake rolls in middle of oven until tops are pale golden, about 25 minutes.\nPunch down dough and on floured surface with a floured rolling pin roll into a 15- by 20-inch rectangle. Spread butter over dough and sprinkle with granulated sugar, cinnamon and cardamom.\nWith a long side facing you, roll up dough jelly-roll fashion and cut crosswise into approximately 1 1/2-inch-thick slices with a cut side down. Working with 1 slice at a time gently twist opposite ends of slice around twice to form a figure eight. Crimp ends together. Arrange rolls, a swirled side up, on a buttered baking sheet about 2 inches apart and let rise in a warm place until increased 1 1/2 times in bulk, about 1 hour.\nWhile rolls are rising, preheat oven to 350F.\nBrush tops of rolls with egg wash and sprinkle with sugar. Bake rolls in middle of oven until tops are pale golden, about 25 minutes.",
        "title": "Swedish Cardamom Rolls "
    },
    "1HF5jb1hFpSt94vQS9cSNC10k6yziey": {
        "ingredients": [
            "1 cup finely chopped onion",
            "2 cups thinly sliced celery",
            "2 tablespoons olive oil",
            "2 teaspoons sugar",
            "1 1/2 pounds beets, peeled and cut into 1-inch pieces",
            "1 tablespoon red-wine vinegar plus additional to taste",
            "3 cups low-salt chicken broth",
            "ice water for thinning soup",
            "sour cream, seasoned with bottled horseradish, and minced fresh chives for garnish"
        ],
        "picture_link": null,
        "instructions": "In a heavy saucepan cook onion and celery in oil with sugar and salt and pepper to taste over moderately low heat, stirring, until softened and add beets, 1 tablespoon vinegar, and broth. Simmer mixture, covered, 35 to 40 minutes, or until beets are very tender. In a blender purée mixture in batches until very smooth, transferring as puréed to a bowl. Chill soup, covered, at least 6 hours or overnight. Thin soup with ice water and season with additional vinegar and salt and pepper.\nIn a heavy saucepan cook onion and celery in oil with sugar and salt and pepper to taste over moderately low heat, stirring, until softened and add beets, 1 tablespoon vinegar, and broth. Simmer mixture, covered, 35 to 40 minutes, or until beets are very tender.\nIn a blender purée mixture in batches until very smooth, transferring as puréed to a bowl. Chill soup, covered, at least 6 hours or overnight.\nThin soup with ice water and season with additional vinegar and salt and pepper.\nGarnish soup with sour cream and chives.\nGarnish soup with sour cream and chives.",
        "title": "Cold Beet and Celery Soup "
    },
    "Y9CYsBoZlksUJoxVrF3Xkqi1u6rhkFy": {
        "instructions": "Preheat the oven to 400 degrees F. In a large mixing bowl, combine the flour, baking powder and salt. Mix well. Add 1 tablespoon of the cold butter and the cold shortening and work it into the dry ingredients, using your hands, until the mixture resembles coarse crumbs. Stir in the milk. The dough will be sticky. Dust your work surface with some flour. Turn the dough onto the floured surface. Gently fold each side toward the center. Pick up the dough and dust the work surface with additional flour. Return the dough to the floured surface and fold each side towards the center again. Turn the dough over and press it out to 1-inch thickness. Cut the biscuits, straight down, do not twist the cutter, with a 2 1/4-inch round cookie cutter. Melt the remaining tablespoon of butter and add to a 10-inch round cake pan. Place the biscuits in the pan, turning once (to coat both sides with butter), about 1/4-inch apart. Let the biscuits rest for 15 minutes before baking. Bake until golden brown, about 15 minutes.",
        "ingredients": [
            "2 cups all-purpose flour",
            "1 1/2 teaspoons baking powder",
            "1 1/2 teaspoons salt",
            "2 tablespoons butter, cold",
            "1/2 cup solid vegetable shortening, cold",
            "1 cup milk"
        ],
        "title": "Traditional Southern Biscuits",
        "picture_link": "Olz4j8WEGI8h2VkCLfmVoFqjDFkLhcu"
    }
}